{
    "url": "https://www.db.com/news/detail/20240731-deutsche-bank-launches-basf-s-first-sustainability-linked-payables-finance-program-in-asia?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 31, 2024",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank launches BASF’s first sustainability-linked payables finance program in Asia",
    "body": "Deutsche Bank has launched BASF’s first sustainability-linked payables finance program in Asia, with a focus on its operations in China. The solution meets global standards and has been tailored to suit local business requirements.\nThe program will support BASF’s activities in China. The solution provided by Deutsche Bank converts BASF’s existing payables finance program to a sustainability-linked financing for some of its subsidiaries in China, allowing BASF to incentivise its suppliers to adopt sustainable practices.\nThe sustainability-related performance of suppliers will be measured by EcoVadis, a globally recognised supplier sustainability rating platform. The rated suppliers are incentivised to progressively improve their performance to qualify for preferential interest rates. Unrated suppliers are motivated to get rated, encouraging them to transition to sustainable practices. The program will enhance the performance of BASF’s payables finance program through shared value and common goals.\nOle Matthiessen, Head of Corporate Bank for Asia Pacific, Middle East and Africa and Global Head of Cash Management said: “We are delighted to partner with BASF on its first sustainability-linked payables finance program in Asia. We are strongly committed to our sustainability strategy and helping our clients find innovative new solutions that not only improve resilience of their supply chains, but also advance their sustainability footprint to future proof their operations. We look forward to continuing to help BASF with its sustainable growth ambitions globally.”\nBirka Benecke, Senior Vice President Corporate Treasury at BASF, said: “With this program, we can deepen our collaboration with our suppliers and strengthen the partnership in the area of sustainability transformation. This also gives us the opportunity to further optimise our supply chains.”\nThis sustainability-linked payables finance program was recently recognised by The Asset’s Triple A Treasurise Awards for ‘Best ESG Solution in China’. In addition, Deutsche Bank was named by Euromoney’s Awards for Excellence as ‘World’s Best Bank for Corporates’.\nDeutsche Bank AG                                       \nMedia Relations                                           \nKate Fields\nPhone: +852 2203 5094\nEmail: kate.fields@db.com\nDoris Yu\nPhone: +86(10)59698619\nEmail: doris.yu@db.com ",
    "number_of_ratings": 3,
    "rating": 3.7,
    "likes": 3
}