{
    "url": "https://www.db.com/news/detail/20240724-deutsche-bank-reports-on-the-second-quarter-of-2024?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 24, 2024",
    "tags": [
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank reports first-half 2024 profit before tax of € 2.4 billion; € 3.8 billion excluding Postbank takeover litigation provision",
    "body": "Strong operating performance in first six months of 2024 despite previously-announced € 1.3 billion litigation provision related to the takeover of Postbank AG (‘Postbank litigation provision’)\nNet revenues up 2% to € 15.4 billion\nAdjusted costs down 2% to € 10.1 billion\nProfit before tax of € 2.4 billion, or € 3.8 billion ex-Postbank litigation provision, compared to profit before tax of € 3.3 billion in the 1st half 2023\nPost-tax return on average tangible shareholders’ equity (RoTE¹) of 3.9%, or 7.8% ex-Postbank litigation provision, compared to post-tax RoTE1 of 6.8% in the prior year period\nCost/income ratio of 78%, or 69% ex-Postbank litigation provision, compared to a cost/income ratio of 73% in the prior year period\nSecond quarter 2024 profit before tax of € 411 million\nProfit before tax of € 1.7 billion ex-Postbank litigation provision, compared to profit before tax of € 1.4 billion in the second quarter of 2023\nSecond quarter net revenues rise 2% year on year to € 7.6 billion\nGroup commissions & fee income up 12%\nNet interest income stable in key banking book segments²\nOrigination & Advisory revenues doubled year on year with resilient revenues in Fixed Income & Currencies (FIC)\nSecond quarter adjusted costs in line with 2024 guidance at € 5.0 billion\nNoninterest expenses of € 6.7 billion, or € 5.4 billion excluding Postbank litigation provision, down 4% on noninterest expenses in prior year quarter\nSolid capital and risk management during the second quarter\nCommon Equity Tier 1 (CET1) capital ratio rises to 13.5%\nCompletion of € 675 million share repurchase programme brings cumulative capital distributions from 2022-2024 to € 3.3 billion\nProvision for credit losses of € 476 million\nProgress on accelerated execution of Deutsche Bank’s Global Hausbank strategy\nRevenue growth of 5.7% compound since 2021, within target range\nOperational efficiency: savings realized or expected from measures completed rise to 60% of end-2025 goal of € 2.5 billion\nCapital efficiency: risk weighted asset (RWA) reductions rise to € 19 billion, towards raised end-2025 goal of € 25-30 billion\nThese results reflect Deutsche Bank’s operating strength. In the first half year our underlying profitability was the highest since 2011, which demonstrates the success of our strategic execution. We have built powerful momentum in our client franchise across all our businesses – and this, together with our very solid capital ratio and continued cost and risk discipline, keeps us well on track towards meeting our 2025 goals and our distribution commitments to shareholders.\nChristian Sewing, Chief Executive Officer\nDeutsche Bank (XETRA: DBGn.DB / NYSE: DB) today announced profit before tax of € 411 million for the second quarter of 2024, or € 1.7 billion excluding a previously-announced provision of € 1.3 billion for litigation related to the Postbank takeover. This compares to profit before tax of € 1.4 billion in the second quarter of 2023. Post-tax profit was € 52 million, down from € 940 million in the prior year quarter.\nDeutsche Bank’s target ratios were also impacted by the Postbank litigation provision but improved year on year excluding this effect. Post-tax RoTE¹ was a negative 1.0%, or 6.9% if adjusted for the Postbank litigation provision, compared to RoTE¹ of 5.4% in the prior year quarter, while post-tax return on average shareholders’ equity (RoE¹) was negative 0.9%, compared to 4.9% in the prior year quarter. The cost/income ratio was 88%, or 71% excluding the Postbank litigation provision, compared to a cost/income ratio of 76% in the prior year quarter.\nFor the first six months of 2024, profit before tax was € 2.4 billion, or € 3.8 billion excluding the Postbank litigation provision, compared to profit before tax of € 3.3 billion in the first half of 2023. Post-tax profit was € 1.5 billion, compared to € 2.3 billion in the prior year period. Post-tax RoTE¹ was 3.9%, or 7.8% excluding the Postbank litigation provision, compared to RoTE¹ of 6.8% in the prior year period. Post-tax RoE¹ was 3.5%, compared to 6.1% in the prior year period. The cost/income ratio was 78%, or 69% excluding the Postbank litigation provision, compared to a cost/income ratio of 73% in the prior year period.\n“Our second quarter and first half 2024 results position us well to deliver in 2025,” added James von Moltke, Chief Finance Officer. “Looking ahead, we anticipate continued revenue momentum as our strategic growth investments bear fruit. We also see further scope for adjusted cost savings as our Operational Efficiency program progresses, and as we continue to put restructuring costs behind us and resolve legacy litigation matters. Furthermore, we expect credit provisions to normalize as interest rate pressures ease.”    \nContinued delivery of the Global Hausbank strategy\nDeutsche Bank made progress on all dimensions of its accelerated Global Hausbank strategy in the quarter:\nRevenue growth: Revenues grew by 2% year on year to € 7.6 billion in the second quarter of 2024, with double-digit growth in commissions and fee income and stable net interest income in the key segments of the banking book². The bank’s compound annual revenue growth rate over the last 12 months since 2021 was 5.7% at the end of the quarter, within the bank’s raised target range of between 5.5% and 6.5%. Revenues for the first six months of 2024 were € 15.4 billion, up 2% year on year, more than halfway toward the bank’s 2024 full-year guidance of around € 30 billion.\nOperational efficiency: Adjusted costs were € 5.0 billion in the second quarter, up 2% compared to the second quarter of 2023 and in line with the bank’s guidance for adjusted costs of € 5.0 billion per quarter in 2024. The bank made further progress on its € 2.5 billion Operational Efficiency program, which includes optimization of the platform in Germany and workforce reductions, notably in non-client-facing roles. Total savings either realized or expected from measures completed reached € 1.5 billion, including € 1.2 billion in realized savings. Workforce reductions related to the Operational Efficiency program reached a cumulative total of 2,700 full-time equivalents (FTEs), including 700 during the second quarter, nearly 80% of the planned total though end-2024. In addition, contract external staff have been reduced by approximately 1,100 in 2024 to date.\nCapital efficiency: Deutsche Bank delivered RWA equivalent benefits of a further € 4 billion during the second quarter through data and process improvements. As a result, cumulative RWA reductions from capital efficiency measures reached € 19 billion, marking further progress towards the bank’s raised goal of € 25-30 billion by the end of 2025. As anticipated, on July 11, 2024 the bank completed the share repurchase program launched on March 4, 2024. Under this program, 46.4 million shares were repurchased for € 675 million, bringing cumulative shareholder distributions through dividends and share repurchases to € 3.3 billion since 2022.            \nRevenues: on track towards 2024 guidance\nNet revenues were € 7.6 billion in the second quarter, up 2% over the second quarter of 2023. Commissions and fee income grew 12% year on year to € 2.6 billion, the second consecutive quarter of double-digit growth. Net interest income in the key segments of the banking book2 was stable year on year; Group reported net interest income was lower, driven by asymmetries in the recognition of revenues arising from certain hedging positions which are recorded in noninterest income. These asymmetries do not impact the Group’s total revenues. For the first six months, revenues also rose 2% to € 15.4 billion, more than halfway towards the bank’s full-year 2024 guidance for revenues of around € 30 billion, and commissions and fee income grew 12% to € 5.2 billion.\nRevenue development in the bank’s core businesses was as follows:\nCorporate Bank net revenues were € 1.9 billion, essentially flat compared to the second quarter of 2023. Net interest income was € 1.3 billion, down 2% year on year, reflecting the expected normalization of deposit revenues and the discontinuation of remuneration for minimum reserves by the ECB. This development was offset by 9% growth in commissions and fee income to € 624 million, driven partly by growth in Trade Finance and Lending. Corporate Treasury Services revenues were € 1.1 billion, down 2% year on year, while Institutional Client Services revenues rose 8% to € 532 million and Business Banking revenues declined 9% year on year to € 332 million. For the first six months, net revenues declined 3% to € 3.8 billion. Corporate Treasury Services revenues were down 6% to € 2.1 billion, while Institutional Client Services revenues grew 6% to € 995 million and Business Banking revenues declined 4% to € 678 million. In the Euromoney Awards for Excellence 2024, Deutsche Bank was named World’s Best Bank for Corporates and Best Bank for Corporates in Germany. In the 2024 survey by FINANCE magazine, Deutsche Bank was named Best Corporate Bank in Germany, Best Hausbank, #1 in Cash Management/Payment Transactions and #1 in Trade and Export Finance.\nInvestment Bank net revenues were € 2.6 billion, up 10% over the second quarter of 2023. Growth was primarily driven by a doubling of Origination & Advisory revenues to € 585 million, with Advisory revenues up nearly threefold and Debt Origination growing 88% year on year, as Deutsche Bank made share gains in a growing fee pool (source: Dealogic). Revenues in Fixed Income & Currencies (FIC) declined 3% to € 2.1 billion. Financing revenues were essentially stable year on year, as were Credit Trading revenues, as strength in the Flow business, reflecting investments in prior periods, offset the impact of the non-recurrence of a strong prior year quarter in Distressed. Emerging Markets revenues were in line with a strong prior year quarter. Rates revenues were slightly lower year on year, reflecting an uncertain interest rate environment, while Foreign Exchange revenues were lower as lower market volatility more than offset strength in the Spot business following investments in technology. For the first six months, Investment Bank revenues grew 12% to € 5.6 billion, driven primarily by growth of 76% in Origination & Advisory revenues to € 1.1 billion. Deutsche Bank’s share of a growing global Origination & Advisory fee pool rose by more than 70 basis points to 2.6%, and the bank’s global ranking rose from 11th to 7th compared to the full year 2023 (source: Dealogic). These gains reflected strength across Debt Origination and growth in M&A. FIC revenues rose 3% to € 4.6 billion, driven by 7% growth in Financing revenues to € 1.6 billion. In the Euromoney Awards for Excellence 2024, Deutsche Bank was named Best Investment Bank in Germany, while in the 2024 survey by FINANCE magazine, Deutsche Bank was awarded Best Advice on DCM business, Best Advice on ECM business/IPOs and Best M&A Advice.\nPrivate Bank net revenues were € 2.3 billion, down 3% year on year. Net interest income declined by 7% in an environment of stabilizing interest rates; this was partly offset by growth in investment products, reflecting the Private Bank’s strategy of growing noninterest income. Revenues in Personal Banking were down 7% year on year; the impact of higher hedging costs, and higher funding costs including the impact of the discontinuation of remuneration for minimum reserves by the ECB, was partly offset by double-digit growth in deposit revenues and growth in lending revenues. Revenues in Wealth Management & Private Banking grew by 3% year on year, as double-digit growth in lending and higher revenues in investment products more than offset a decline in deposit revenues. Assets under management grew by a further € 7 billion during the quarter to € 613 billion, driven by net inflows of € 7 billion. For the first six months, Private Bank net revenues were € 4.7 billion, down 3% year on year. A 6% year-on-year decline in Personal Banking revenues, to € 2.6 billion, was partly offset by 2% growth in Wealth Management & Private Banking revenues to € 2.1 billion. Net inflows for the first six months of 2024 were € 19 billion, up from € 10 billion in the prior year period. Assets under management, at € 613 billion, were € 48 billion higher than at the end of the first half of 2023.\nAsset Management net revenues were € 663 million in the second quarter, up 7% on the second quarter of 2023. Management fees were € 613 million, up 6%, predominantly in liquid products, driven by growth in average assets under management. Performance and transaction fees were € 10 million, down from € 57 million in the prior year quarter, driven by a non-recurrence of the prior year period performance fees in Alternatives. Assets under management were € 933 billion at the end of the quarter, compared to € 941 billion at the end of the previous quarter. The negative impact of net outflows of € 19 billion, driven by lower-margin mandates in Fixed Income and Advisory Services and partly offset by continued inflows in Passive, was partly counterbalanced by the positive impact of rising market levels. For the first six months, net revenues were € 1.3 billion, up 6% year on year, driven by 5% growth in management fees to € 1.2 billion; this more than offset a decline in performance and transaction fees to € 27 million, from € 68 million in the prior year period. Assets under management, at € 933 billion, were € 74 billion higher than at the end of the first half of 2023.\nExpenses: adjusted costs remain in line with quarterly guidance for 2024\nNoninterest expenses were € 6.7 billion in the second quarter, up from € 5.6 billion in the second quarter of 2023, or € 5.4 billion excluding the Postbank litigation provision, 4% lower than noninterest expenses in the prior year quarter. Nonoperating costs were € 1.7 billion, up from € 655 million in the second quarter of 2023, predominantly driven by this provision; restructuring and severance charges related to strategy implementation were € 106 million, down from € 260 million in the prior year quarter.\nAdjusted costs were € 5.0 billion in the second quarter, in line with the bank’s quarterly adjusted cost guidance for 2024 and up 2% compared to the second quarter of 2023. As anticipated, compensation and benefits expenses were higher, reflecting wage growth, higher accruals for variable compensation and strategic growth initiatives including hiring and the acquisition of Numis; this was largely offset by lower technology costs, reflecting the bank’s efforts to streamline its technology platform, and reductions in professional services expenses.\nThe workforce was 89,470 internal full-time equivalents (FTEs) at the end of the second quarter, a reduction of 854 during the quarter. Strategic hiring, which has added around 900 roles in business growth, technology and controls year to date, and continued internalizations, were more than offset by leavers during the period, reflecting operational efficiency measures. \nFor the first six months, noninterest expenses were € 12.0 billion, up 9% from € 11.1 billion in the prior year period. Excluding the Postbank litigation provision, noninterest expenses were € 10.7 billion, 4% lower than noninterest expenses in the prior year period. Adjusted costs were down 2% year on year to € 10.1 billion.  \nProvision for credit losses remains contained\nProvision for credit losses was € 476 million in the quarter, up from € 401 million in the prior year quarter and from € 439 million in the first quarter of 2024. In the second quarter of 2024, provisions for performing (Stage 1 and 2) loans were € 35 million, driven by portfolio movements and the net effect of overlays. Provision for non-performing (Stage 3) loans were € 441 million in the quarter, down from € 471 million in the previous quarter. This reduction was driven by the Private Bank and partly offset by an increase in the Corporate Bank, primarily driven by a small number of individual defaults; provisions in the Investment Bank were stable quarter on quarter and remain largely related to Commercial Real Estate.\nFor the first six months, provision for credit losses was € 915 million, compared to € 772 million in the prior year period. Corporate Bank provisions were up 9% year on year at € 198 million, while Private Bank provisions were down 11% to € 367 million, benefitting from the sale of non-performing loans and the non-recurrence of provisions relating to a small number of idiosyncratic events in the prior year period. Investment Bank provisions were € 313 million, materially higher than the prior year period, and largely affected by the commercial real estate sector. The bank now expects the full-year 2024 provision for credit losses to be slightly above 30 basis points, above prior guidance. This reflects commercial real estate provisions which are moderately lower, although improving at a slower-than-expected pace, as well as improvements in the Corporate Bank.\nSolid capital, liquidity and funding metrics\nThe Common Equity Tier 1 (CET1) capital ratio improved to 13.5% in the quarter, due to higher common equity tier 1 capital reflecting lower regulatory capital deduction items, while strong underlying earnings were offset by the negative impact of the Postbank litigation provision. RWA growth due to higher operational risk and market risk RWA was largely offset by progress on the Capital Efficiency program during the quarter. On July 11, 2024, the bank completed its € 675 million share repurchase program, taking total capital distributions, including the bank’s € 0.45 per share dividend paid in May 2024, to € 1.6 billion in 2024 to date.\nThe Leverage ratio rose slightly from 4.5% to 4.6% during the second quarter. This increase was mostly due to the bank’s € 1.5 billion issuance of Additional Tier 1 (AT1) bonds during the quarter. Leverage exposure was materially unchanged at € 1,262 billion at the end of the quarter.\nThe Liquidity Coverage Ratio was 136% at the end of the quarter, stable compared to the end of the previous quarter, above the regulatory requirement of 100% and representing a surplus of € 58 billion. The Net Stable Funding Ratio was 122%, above the bank’s guidance range of 115-120% and representing a surplus over requirements of € 110 billion. Deposits rose by € 6 billion to € 641 billion during the quarter.\nSustainable Finance: cumulative volumes since 2020 reach € 322 billion\nSustainable Financing and ESG investment volumes ex-DWS³ were € 21 billion in the quarter, bringing the cumulative total since January 1, 2020 to € 322 billion. In the second quarter of 2024, Deutsche Bank’s businesses contributed as follows:\nCorporate Bank: € 4 billion in sustainable financing, raising the business’s cumulative total since January 1, 2020 to € 62 billion\nInvestment Bank: € 16 billion, comprising € 5 billion in sustainable financing and € 11 billion in capital market issuance, raising the division’s cumulative total since January 1, 2020 to € 196 billion\nPrivate Bank: € 2 billion growth in ESG assets under management and new client lending, raising the Private Bank’s cumulative total since January 1, 2020 to € 64 billion\nNotable transactions included:\nInvolvement as Senior Mandated Lead Arranger and Hedging Bank on H2 Green Steel’s € 4.2 billion project financing for the world’s first large scale green steel plant, with an integrated green hydrogen and green iron production in Northern Sweden.\nActing as Joint Bookrunner, Sole Ratings Advisor, and Sole Green Structuring Agent for Continuum's US$ 650 million Senior Secured Green Notes. This was the fourth consecutive capital market transaction for Continuum, a leading renewable energy provider in India which was left led by Deutsche Bank\nActing as Lender to HES International, a leading European multi-purpose bulk terminal operator, for its € 1 billion refinancing. The transaction is structured as a sustainability-linked loan with KPIs closely aligned to the company’s transition plan to phase out thermal coal over time and diversify its portfolio towards other commodities.\nThe bank issued its inaugural Social Bond on July 3, 2024, raising € 500 million to support the financing of affordable housing and access to essential services for low-income families and elderly and vulnerable people in the US. The issue saw strong demand from investors and was 13 times oversubscribed.\nIn its own operations, Deutsche Bank amended its Code of Conduct and rolled out a mandatory group-wide awareness training in early July on how to handle sustainability-related risks in line with European Banking Authority's Final Report on Greenwashing. The bank also launched two new Corporate Social Responsibility programs providing financial education to low-income women in India and migrant children in China.\nDeutsche Bank’s progress was recognized by a number of awards, including:\nBest ESG Advice in the FINANCE Magazine’s 2024 bank survey\nThe Times Top 50 Employers for Gender Equality 2024\nFinancial Services Employer of the Year at the InsideOut Mental Health Awards\n“Best ESG Solution” awards in China, Indonesia and India and “Best Trade Finance Solution” for three ESG transactions at the 2024 The Asset awards\nGroup results at a glance\n  ¹ For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ on pp 15-21 of the second quarter 2024 Financial Data Supplement and “Non-GAAP financial measures” on pp. 101 - 107 of the Interim Report of June 30, 2024, respectively\n² Business segments for which net interest income from banking book activities represent a material part of the overall revenue\n³ Cumulative ESG volumes include sustainable financing (flow) and investments (stock) in the Corporate Bank, Investment Bank and Private Bank from January 1, 2020, to date, as set forth in Deutsche Bank’s Sustainability Deep Dive of May 20, 2021. Products in scope include capital market issuance (bookrunner share only), sustainable financing and period-end assets under management. Cumulative volumes and targets do not include ESG assets under management within DWS, which are reported separately by DWS.\nESG Classification\nWe defined our sustainable financing and ESG investment activities in the “Sustainable Finance Framework – Deutsche Bank Group” which is available at investor-relations.db.com. Given the cumulative definition of our target, in cases where validation against the Framework cannot be completed before the end of the reporting quarter, volumes are disclosed upon completion of the validation in subsequent quarters.\nThe DWS ESG Framework (formerly DWS ESG Product Classification Framework) (“ESG Framework”) was introduced in 2021, taking into account relevant legislation (including SFDR), market standards and internal developments and was further described in our Annual Report 2021. Based on the further evolution of the regulatory environment, DWS incorporated some refinements into the ESG Framework in the fourth quarter of 2022. Besides liquid passively managed funds (ETFs) which apply a screen comparable to the “DWS ESG Investment Standard” filter or have a “sustainable investment objective”, as well as other liquid passively managed funds which have been labelled as ESG and/or seek to adhere to an ESG investment strategy, now also liquid passively managed funds (ETFs) which track indices that comply with the EU Benchmark Regulation on EU Climate Transition Benchmark and EU Paris-Aligned Benchmark are considered as ESG. Further details can be found in DWS Annual Report 2023. DWS will continue to develop and refine its ESG Framework in accordance with evolving regulation and market practice.\nFurther details on second quarter performance in Deutsche Bank’s businesses are available in the Interim Report of June 30, 2024.\nAnalyst call\nAn analyst call to discuss second quarter 2024 financial results will take place at 11:00 CEST today. An Interim Report, Financial Data Supplement (FDS), presentation and audio webcast for the analyst conference call are available at www.db.com/quarterly-results\nA fixed income investor call will take place on July 25, 2024, at 15:00 CEST. This conference call will be transmitted via internet.",
    "number_of_ratings": 9,
    "rating": 5.0,
    "likes": 11
}