{
    "url": "https://www.db.com/news/detail/20240703-democracy-and-tolerance-a-shared-path?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 3, 2024",
    "tags": [
        "Corporate Citizenship",
        "Diversity",
        "Education"
    ],
    "title": "Democracy and tolerance: a shared path",
    "body": "At a time when racism, populism, extremism and social inequality are pervading society more and more, it is all the more important that we create spaces for dialogue and personal encounters, both of which can help us learn about democratic values and offer the opportunity to discuss different perspectives in respectful cooperation.\nTo send a strong signal about the importance of democracy, Deutsche Bank is collaborating with German non-profit organisations Teach First Deutschland and GermanDream and have developed a project that will be rolled out in schools in less privileged areas this coming school year. \"Dialog Leben\" is the name of the project – essentially “dialogue in action” in English – and it aims to teach students about the importance of tolerance, freedom, equal opportunities and pluralism in our society, and encourage them to stand up for these values.\nAt the heart of \"Dialog Leben\" are what we call “dialogues on values”. In these workshops, young people learn to exchange ideas openly, and to discuss and share their own experiences. With a clear focus on political education through personal experience, everyone taking part in the workshops is equal.\nTeach First “fellows” are the people that will bring the project to life. They have a university degree and commit to working in schools for two years to foster equal opportunities, quality education and social participation for children and young people regardless of their background. The charity GermanDream gives around 80 fellows training for the project. The fellows’ two-year commitment ensures that the workshops are a regular feature of everyday school life.\nBy holding these workshops in selected schools, “Dialog Leben” aims to reach 750 young people by the end of this year, with another 1,000 students expected to benefit from the project by the end of 2025.",
    "number_of_ratings": 8,
    "rating": 4.5,
    "likes": 11
}