{
    "url": "https://www.db.com/news/detail/20211217-a-man-of-principle-christian-sewing-on-the-outgoing-bundesbank-president-jens-weidmann?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "December 17, 2021",
    "tags": [
        "Company"
    ],
    "title": "“A man of principle” – Christian Sewing on the outgoing Bundes­bank President Jens Weidmann",
    "body": "Many may have underestimated Jens Weidmann when he became the youngest president ever to head the Bundesbank at the height of the euro crisis in May 2011. After years at the International Monetary Fund and the German Council of Economic Experts, his economic expertise was certainly beyond question. And as economic adviser to the German Chancellor, he undoubtedly knew how to solve the most difficult situations, be it in the financial crisis of 2008 or the Opel rescue.\nBut would that be enough in an environment where experienced central bankers like Axel Weber or Jürgen Stark resigned after fundamental debates on monetary policy?\nWould his always calm voice for a stability-oriented central bank policy be heard? Would he be able to exert influence on a clear majority that also wanted to make full use of the central bank's resources in the sovereign debt crisis? Or would he find a seat far down the table with 17 other central bank presidents under ECB President Mario Draghi, who was soon to announce that they would do \"whatever it takes\" to save the euro?  \nThere is no simple answer to these questions, even today. The role of the German representative on the Governing Council of the European Central Bank is probably one of the most difficult economic policy tasks that the government assigns. That person represents a long tradition with a clear stance. This is a stance, however, that other central bankers do not always share. Political reality has led to a new monetary policy reality that was not foreseen in the Maastricht Treaty of 1992. The Greek crisis, national debt, a global pandemic – the challenges were and are enormous.\nIn such an environment, it takes strong diplomatic skills to defend one's position with force and effect. And it takes stamina. Jens Weidmann has all that, as he has proven time and again. Even if the media in half of Europe sometimes portrayed him as a block to progress, even if criticism sometimes came from politicians in Berlin, and even if the then ECB President accused him of saying \"no to everything\" – Jens Weidmann remained steadfast without getting carried away.\nThe Bundesbank President always presented his arguments factually, he remained polite but firm. Delicate in argument, but tough on matter. When he says something or gives advice, it is precise, well thought out and encourages you to reflect. That is how I always experienced Jens Weidmann in personal conversations. He embodied something like a monetary conscience of the Bundesbank in Europe for the last decade.\nA conscience whose admonitions seem more justified than ever, especially now, as he prepares to stand down.\nThere were many tests for Weidmann. A major one came in late summer 2012, when he opposed the ECB's emergency programme, which was designed to allow the large-scale purchase of government bonds from crisis countries. He stood his ground even when pressure was put on him from all sides and he was the only one in the then 23-member ECB Governing Council to vote against the programme. Even the German government defended the ECB decision which the Bundesbank President had opposed.\nWeidmann continued to fight, not with a broadsword, but with a foil. It says a lot about his style that one of his most famous speeches is less political than literary. At an event shortly after the controversial decision, he did not speak about Greece, Italy or current monetary policy. He spoke about Goethe's \"Faust II\", about how Mephisto persuaded the emperor to print money. How at first everything looked shiny and comfortable – but soon after ended in rapid inflation. The message was sent. \nThat his critics accused him of an attitude of refusal does not do justice to the upright Bundesbank President. Weidmann did not say \"no to everything\". Rather, he persistently said \"yes\" to monetary policy principles, \"yes\" to a narrow interpretation of the rules in the Maastricht Treaty. Weidmann is not fundamentally opposed to a loose monetary policy – he proved this once again at the end of his term in office when he explicitly supported the ECB's quick action in the coronavirus crisis.\nHe was influenced by the experience of the 2008 financial crisis, when the determination of central banks and governments also prevented a catastrophe. And he also supported the new monetary policy strategy adopted by the ECB this year. What distinguishes him from many other central bankers is not a particular preference for higher interest rates – but that he considers the central bank's mandate neither malleable nor negotiable, even in times of crisis.\nHe is a strict advocate of the primacy of monetary stability that has so characterised the Bundesbank in its history.\nFirst and foremost, the central bank has the mandate to keep money stable. He sits in the tradition of Otmar Issing, the first chief economist of the European Central Bank. If there is to be a redistribution between states motivated by fiscal policy, then the politicians must agree it – and they must not pass this problem on to the central bank. While all members of the ECB Governing Council would agree with this principle, then as now, it is on the question of where exactly the boundary between monetary and fiscal policy lies that Weidmann was stricter than most.\nSceptics accuse him of achieving little in the end with this adherence to principle, because he neither prevented the ECB's crisis programmes nor stopped the ultra-loose monetary policy. There is no denying that in the end he could not convince a majority on the ECB Governing Council of his position. But it would be too short-sighted to judge him on that alone.\nFor the ECB, his role can perhaps be compared to that of an opposition in parliament: The criticism of the parliamentary minority forces the majority to better justify its policy – and to refrain from extreme steps because it would then provide the opposition with a target.\nWe should therefore be grateful to Jens Weidmann for often being the spokesman for this opposition and for sometimes accepting the bogeyman role. This included not only voting against controversial decisions in ECB Governing Council meetings, but also publicly representing his point of view. That may not always be welcome in a central bank tradition that likes to demonstrate consensus to the outside world. However, given the considerable influence the European Central Bank has on the economy and thus on the lives of around 340 million people in the Eurozone, it is a public debate that the ECB must surely face up to.\nAt the same time, Weidmann never left any doubt that a common policy in a monetary union must always juggle different requirements – and he actively worked on such solutions. \"While Jens had clear views on monetary policy,\" ECB President Christine Lagarde said on his departure, “I was always impressed by his search for common ground in the Governing Council, by his empathy for his Eurosystem colleagues, and his willingness to find a compromise.”\nThis also says a lot about Weidmann's style.\nHe has secured the legacy of an institution that has enjoyed the highest reputation in Germany for decades. The Bundesbank can no longer set the course alone in a monetary union with 19 members. But at least it can continue to act as an anchor for a stability-oriented monetary policy – without ever calling the euro itself into question. Jens Weidmann has shaped this role over the past 10 years. It was and remains important for Germans' confidence in the euro.\nThe past months have shown that the ultra-loose monetary policy is coming to an end and that consumer prices are also rising again. And that Weidmann was right with his key warning: that it would become difficult for the ECB to change course when rising inflation made it necessary.\nThat is also because debtors in Europe – many of them, governments – are de facto dependent on permanently low interest rates. These are the ghosts we have summoned, to paraphrase Weidmann in the words of Goethe. Weidmann himself will no longer participate in the decisions that are now pending. He has decided for himself that 10 years at the helm of the Bundesbank is enough.\nJens Weidmann and I have always agreed that we can only secure prosperity and competitiveness in the EU if we work closely together. More Europe must be the goal – even if we sometimes must struggle to find the right way to get there.",
    "number_of_ratings": 1,
    "rating": 4.0,
    "likes": 5
}