{
    "url": "https://www.db.com/news/detail/20211202-lu-yang-is-deutsche-bank-s-artist-of-the-year-2022?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "December 2, 2021",
    "tags": [
        "Art"
    ],
    "title": "LuYang is Deutsche Bank’s “Artist of the Year” 2022",
    "body": "The Chinese artist LuYang is Deutsche Bank's “Artist of the Year” 2022. The artist was born in Shanghai, where he lives and works today. LuYang is one of the most internationally influential Chinese multimedia artists. As the “Artist of the Year,” LuYang will be showing his first major solo exhibition in Germany at Deutsche Bank’s PalaisPopulaire in Berlin in the fall of 2022.\n“LuYang represents a young generation in Asian art for whom it is not a contradiction to combine myths, ancient traditions, and spiritual thinking with the latest technology and science. We are particularly pleased to honor LuYang in 2022, coinciding with Deutsche Bank's 150th anniversary in Asia,” said Anna Herrhausen, Head of Deutsche Bank’s Art and Culture department.    \nLuYang’s artistic production includes 3D animated films, video game installations, holograms, virtual reality projects, and graphic works. His immersive installations merge the worlds of anime, manga, and science fiction with neuroscience, biotechnology, and Buddhist thought. Dance is a central element in his work. The artist, who does not wish to be assigned to any particular gender, creates gender-neutral avatars that experience different worlds and states. In doing so, he interrogates the concept of reality, which is radically changed by virtualization, since in his view the digital world represents a separate, equal reality.\nThe “Artist of the Year” award is being presented for the eleventh time on the recommendation of the Deutsche Bank Global Art Advisory Council, consisting of the renowned curators Hou Hanru, Udo Kittelmann, and Victoria Noorthoorn. The award goes to promising talents who have created an oeuvre that is artistically and socially relevant oeuvre integrating the two focal points of the Deutsche Bank Collection, works on paper and photography.\nWangechi Mutu, Yto Barrada, Roman Ondak, Imran Qureshi, Victor Man, Koki Tanaka, Basim Magdy, Kemang Wa Lehulere, Caline Aoun, Maxwell Alexandre, Conny Maier, and Zhang Xu Zhan have received the prize thus far.\nAs of December 4, 2021, works by Yu Lang will be on view in a solo show at AroS, Aarhus. In 2019, he was represented in “Micro Era,” a group exhibition on Chinese media art, shown at the Berlin Kulturforum.",
    "number_of_ratings": 4,
    "rating": 3.0,
    "likes": 14
}