{
    "url": "https://www.db.com/news/detail/20211202-deutsche-bank-delivers-intelligence-and-automation-for-merck-india-s-cross-border-cash-flows?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "December 2, 2021",
    "tags": [
        "Corporate products"
    ],
    "title": "Deutsche Bank delivers intelligence & automation for Merck India’s cross-border cash flows",
    "body": "Deutsche Bank has delivered a first-of-its-kind treasury workflow solution for Merck India, integrating cross-border payment flows along with regulatory validations, FX execution & risk management as well as liquidity management including automated reconciliation into a single, streamlined process to support Merck’s cross-border business. \nThe new workflow generates savings of low single digit million EUR a year for– completely automating its data flow, eliminating FX risk and removing the need for manual intervention from treasury or shared service centres.\n“We are proud that we’ve been able to put together such an innovative treasury solution for the world's oldest operating chemical and pharmaceutical company,\" says Rajesh Thakur,\nDeutsche Bank’s Co- Head Global Transaction banking in India. \"To meet Merck’s key objectives, we deployed innovation and automation into workflows tailored to Merck’s specific business & treasury requirements, ensuring that the solutions work with minimal human involvement.\"\nPart of the automation includes an innovative Receivables Matching and Analytics solution powered by artificial intelligence (AI) which seamlessly integrates with Merck’s ERP systems, providing automation rates of up to 95% when reconciling accounts receivable across all possible modes of incoming payments.\nThe project involved close partnership between Merck and Deutsche Bank teams across India, Singapore, the Philippines and Germany, with implementation taking place even amidst the challenges presented by the Covid-19 pandemic.\n“The journey has accomplished substantial financial savings, the automation of processes and the prevention of fraud. Through cross-functional collaboration and harnessing of new technology, the project transformed our India treasury processes into a state-of-the-art organisation,” says Jörg Bermüller, Head of Cash and Risk Management in Group Treasury, Merck.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 7
}