{
    "url": "https://www.db.com/news/detail/20200430-deutsche-bank-leads-the-way-in-esg-investments-solutions-in-italy?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 30, 2020",
    "tags": [
        "Corporate products",
        "Wealth"
    ],
    "title": "Deutsche Bank leads the way in ESG investments solutions in Italy",
    "body": "Deutsche Bank’s Italian Investment Advisory team has won the first prize for financial innovation with their Environmental, Social, Governance (ESG) investment solutions at the “Financial Innovation – Italian Awards”.\nPart of PCB Italy, the team won the “Wealth Management Products and Services” category in the annual awards arranged by AIFIn, a Financial Innovation Think Tank, and MarketLab, a financial marketing and research institute.\nThe judges recognised the Italian Investment Advisory team for its innovative approach to providing ESG investment solutions to sophisticated private clients in of a flexible advisory framework.\nAlthough the focus on sustainable investments has grown in recent years, it has remained a challenge to bring effective and comprehensive ESG solutions to private clients. The team is leading the way in Italy by providing a model portfolio that takes advantage of Deutsche Bank Wealth Management’s Chief Information Office’s strategic allocation approach - and matching it with a selection of active and passive ESG-focused investment strategies. By complementing the model portfolio with strategies and products from Deutsche Bank and external asset managers, the team can offer a more flexible and personalised approach which makes the solution better suited to private clients.\nLaunched in 2006, the “Financial Innovation – Italian Awards” acknowledge leading strategies and innovations in the banking, insurance and finance. The judges consider multiple angles including: the perceived risks and opportunities the product or innovation presents; approach to financial technology and digital transformation.\nEugenio Periti, Head of Private Banking, Investment Solutions & Advisory, Italy said: “The award acknowledges a very innovative approach in advisory mandates, where the key is to leverage our internal knowhow, in particular from the Global Chief Investment Office, and partnerships with best-in-class asset managers. The approach is pragmatic and more importantly, flexible enough to be able to capture the inevitable evolution to come in the ESG space. Thanks to all the business lines involved for their constant support and congratulations to the team on delivering this important result.”\nThe Investment Advisory team provides guidance on asset allocation, market strategy and portfolio construction to advisors and clients in PCB Italy. It covers a wide range of investment services and solutions.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}