{
    "url": "https://www.db.com/news/detail/20200428-qundas-on-key-first-quarter-results-and-deutsche-bank-s-updated-outlook?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 28, 2020",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Q&As on key first-quarter results and Deutsche Bank's updated outlook",
    "body": "Why did Deutsche Bank send out an ad-hoc release only three days before the publication of our Q1 results?\nManagement is seeking to address uncertainties around market expectations on the bank’s earnings and media reports on a loss in the quarter. Furthermore, it is possible that the bank will fall modestly and temporarily below its previous CET 1 target of at least 12.5% and the fully-loaded leverage ratio target of 4.5 percent by the end of 2020. As we are obliged to inform the market immediately about changes to communicated targets, we published an ad hoc release on Sunday night.\nWhy has the bank changed its capital target?\nDeutsche Bank is firmly committed to standing by its clients in this very difficult situation without compromising our capital strength. Many of our clients are facing great challenges from COVID-19 and they need our support now. We aim to support them with our strong balance sheet, while always remaining within regulatory requirements. We have not changed our targets, but we now allow for the possibility that we may modestly and temporarily dip below our target CET 1 ratio. Effectively, we have just taken out the “at all times” after our CET1-ratio-target of at least 12.5 percent. As the regulators lowered capital requirements on banks already before the crisis and now also reacted to the pandemic, we have gained additional headroom. At 12.8 percent, the bank’s CET 1 ratio was approximately 240 basis points above the ECB’s current requirement of 10.42 percent at the end of Q1.\nWill Deutsche Bank have permanently lower capital ratios, given the reduced regulatory requirements?\nWe can’t comment on what regulatory requirements will look like in future, but we expect the implications of the COVID-19-pandemic to be temporary. The Management Board will continue to work towards its 2022 targets of a 12.5% CET1 ratio target and a 5% leverage ratio. In the meantime we remain committed to maintaining a significant buffer above regulatory minimum at all times.\nHas the Management Board changed further financial targets?\nNo, the bank reaffirmed its other financial targets, which are:\nAdjusted costs excluding transformation charges, and impact of the transfer of our Prime Finance platform to BNP Paribus of €19.5 billion at the end of 2020 and €17 billion at the end of 2022\nA post-tax return on tangible equity of 8 percent at the end of 2022\nWhy did the bank beat market expectations in the first quarter?\nOur profit before tax in the first quarter is a result of growth in revenues in our core businesses, together with continued progress on reducing adjusted costs. We made a pre-tax profit of 206 million euros and net income of 66 million euros.\nAre higher loan loss provisions an indicator that the coming quarters will turn out worse?\nThis extraordinary economic environment suggests that we will see a higher level of credit defaults. Nevertheless, Deutsche Bank’s loan book is of high quality and well diversified. 90 per cent of our exposures are investment grade, and nearly a third are solid retail mortgages in Germany. What we can say is that we see continued high demand for support from our clients in this challenging situation.\nHow have the bank’s individual businesses performed in the first quarters?\nWe will publish details on segmental performance as part of our full results for the first quarter on Wednesday morning.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}