{
    "url": "https://www.db.com/news/detail/20200428-deutsche-bank-and-its-employees-support-food-und-shelter-community-partners-with-2-5m-euros?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 28, 2020",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Supporting food & shelter community partners with 2.5m euros",
    "body": "Deutsche Bank has been supporting local communities since the early 1900s. Today, its Corporate Responsibility mission is to enable economies and communities to prosper, creating a positive impact for people and society at large. Its strategy focuses on education, enterprise and community development and targets the most pressing local concerns in each region.\nThe global spread of coronavirus has put many of the bank’s local community and non-profit partners under severe pressure and at risk of closure as they try to help those who are most vulnerable during these unprecedented times. Employees all across the world have come together to volunteer their time and donate much-needed funds to these causes through a relief campaign for selected Food & Shelter charities.\nChief Executive Officer Christian Sewing launched the initiative in early April. Since then, some 7,000 colleagues across divisions and in more than 30 countries have donated about 820,000 euros, each one matched by the bank. And now that the savings from the virtual Annual General Meeting as well as other divisional and regional donations have been added, Deutsche Bank’s overall support for the community partners stands at a grand total of 2.5 million euros.\nThe charities will use the money to support the most vulnerable members of our community, offering direct aid to the homeless, street children, low-income families, vulnerable elderly people and refugees, amongst others.\n“Our CSR COVID-19 community relief campaign truly is a one-bank effort,” says Lareena Hilton, Global Head of Brand & CSR. “Colleagues across regions and countries have made a huge positive impact for our long-standing Food & Shelter partner charities and the most vulnerable members of our communities. A huge thanks to all donors for being an active part of our PlusYou giving community in this very challenging time.”\nAround the globe, employees have been getting involved in a variety of ways.\nIn Germany, many colleagues have been donating money to selected regional charities that provide food and shelter to those most affected by the pandemic: the homeless, marginalised members of our communities or children from disadvantaged backgrounds. One of these charities was BUDNIANER HILFE in Hamburg that has launched a relief fund to support food banks, soup kitchens and other initiatives that help the homeless.\nOther colleagues have taken an active role in their neighborhoods by shopping or cooking for the vulnerable, sewing masks, helping out other colleagues who have small children to look after or older children who need help with their schoolwork, or by signing up for local business networks that support small entrepreneurs at risk of going out of business.\nIn Asia, the bank’s Corporate Social Responsibility team is working with a number of charity partners to provide food, shelter and supplies.\nIn Malaysia, employee donations are helping charity partner Global Peace Foundation provide food for 900 families.\nIn India, many daily wage earners have lost their income as a result of the country’s lockdown. Returning to their villages, they now face the challenge of survival. In partnership with Goonj, Deutsche Bank is providing 3,300 family kits of essentials in remote villages of Maharashtra, Karnataka and Rajasthan. These kits will include dry food, basic toiletries and cleaning agents among other essential items for a family of five.\nIn the UK, Deutsche Bank is supporting Fareshare, to redistribute surplus food to those most at risk across the country, and charity of the year Hospice UK to provide shelter for the most vulnerable patients.\nEmployees are also joining in with the army of home-sewers joining in the NHS ‘For the Love of Scrubs’ campaign. Employee Nichola said, “I have dusted off my sewing machine and am teaching my 8 year old daughter a new skill in the process.\nI started with scrub bags using bedlinen that I have never used before progressing to scrubs. I wanted to do my bit and I know that staying at home is helping, but I wanted to do something that was active as well.”\nIn Italy, the bank is supporting the Red Cross in helping the vulnerable with free food vouchers. And in Spain, where they have built more than temporary shelters for more than 3,200 homeless people, they have so far also distributed more than 80,000 food packages.\nAnd in the US, employee donations are supporting multiple charities, one of which is long-term partner, Henry Street Settlement which is now operating 24/7 to deliver food and essential services to their existing homeless shelters, supportive housing residents and senior centres. They are also providing Wi-Fi-enabled iPads for children in shelters to access educational and mental health services.\nIn addition,  grants from Deutsche Bank Americas Foundation are addressing the needs of those most vulnerable, including the elderly, students and families experiencing homelessness, those without access to regular meals and small businesses run by women and immigrants.\nMany long-standing CSR initiatives such as the bank’s Born to Be youth engagement programme and Made for Good enterprise programme for social good, have been adapted to meet the current environmental and social distancing restrictions. Mentoring and coaching have moved online and e-learning modules are replacing traditional meeting and classroom environments.\nCEO Christian Sewing said: “Our employees have come together to help those who particularly need support now and to make a huge difference at this time.”\nLareena Hilton, Global Head of Brand Communications & CSR added, “I am so proud of how our global colleagues have come together to help provide relief for those communities so badly affected at this time. Whether donating to our community relief campaign or taking an active role in their neighbourhood, together we are helping make a positive impact to our long-standing charity partners who continue to support those in need.”\nThe banks’ employees will be able to continue donating to this global relief effort until the middle of May. In addition, employees are encouraged to make a difference within their local communities all year round by joining the bank’s global Plus You volunteering and giving programme.\nFind out more about Deutsche Bank’s Corporate Social Responsibility programmes.\nFollow Deutsche Bank’s CSR activities on Facebook and Twitter.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}