{
    "url": "https://www.db.com/news/detail/20200426-deutsche-bank-announces-results-for-the-first-quarter-2020-above-market-expectations-outlook-for-full-year-2020-updated?language_id=1",
    "language": "EN",
    "article_type": "Ad-hoc Release",
    "publish_date": "April 26, 2020",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank announces results for the first quarter 2020 above market expectations. Outlook for full year 2020 updated",
    "body": "Frankfurt am Main, April 26, 2020 – 23:35 CEST – Deutsche Bank expects to report group profit before tax of 206 million euros and net income of 66 million euros, above market expectations.\nRevenues are expected to be 6.4 billion euros with noninterest expenses of 5.6 billion euros, including contributions to the Single Resolution Fund of 0.5 billion euros. Provisions for credit losses are expected to be 0.5 billion euros, or 44 basis points of loans. Consensus estimates showed a wide range around each of these results.\nDeutsche Bank’s Common Equity Tier 1 (CET1) ratio was 12.8% at quarter-end, down from 13.6% at year-end. The decline in the CET1 ratio in the quarter included approximately a 30 basis points negative impact from the revised securitization framework and approximately 40 basis points of items precipitated by the COVID-19 pandemic.\nFull details of Deutsche Bank’s first quarter results will be disclosed as planned on April 29, 2020. Results are prepared in accordance with IFRS as adopted by the EU.\n\nUpdates to 2020 financial targets\nIn anticipation of business opportunities and elevated client demand and in light of the current macroeconomic environment, Deutsche Bank is reviewing its 2020 CET1 and leverage ratio targets.\nThe bank’s CET1 ratio of 12.8% at quarter end was approximately 240 basis points above its current pillar 2 regulatory requirement. This has been lowered from 11.6% at 1 January 2020 to 10.4% following the ECB’s early implementation of CRD V Article 104(a) and the reduction of the Counter-Cyclical Capital Buffer. A reduction in capital requirements reduces the level below which the bank would be required to calculate a Maximum Distributable Amount (MDA). The MDA is used to determine restrictions on distributions on CET 1 capital and Additional Tier 1 instruments.\nThe short-term implications of the COVID-19 pandemic make it difficult for the bank to accurately reflect the timing and the magnitude of changes to its original capital plan. Deutsche Bank’s priority is to stand by its clients without compromising on capital strength. It is therefore possible that the bank will fall modestly and temporarily below its previous CET1 target of at least 12.5%. Deutsche Bank remains committed to maintaining a significant buffer above its regulatory requirements at all times.\nThis revised outlook acknowledges that credit extension to support clients at this time could increase risk weighted assets for several quarters. In addition, there are a series of pending and proposed regulatory adjustments which could improve the bank’s reported CET1 ratio.\nThis potential additional balance sheet growth also means that the bank is unlikely to reach its 2020 fully-loaded leverage ratio target of 4.5%, absent regulatory adjustments to the leverage ratio calculation which may increase the banks reported ratio.\nGiven the temporary nature of the aforementioned capital items, the bank will continue to work towards its 2022 targets of a 12.5% CET1 ratio target and 5% leverage ratio.\nDeutsche Bank reaffirms its other financial targets, including for 2020 adjusted costs excluding transformation charges and reimbursable expenses associated with the transfer of the Prime Finance platform to BNP Paribas of 19.5 billion euros.\n  Contact:\nSebastian Krämer-Bach\nGlobal Head of External Communications\nPhone: +49 69 910 43330\nEmail: sebastian.kraemer-bach@db.com\n_________________________________________________________________\nDeutsche Bank AG\nTaunusanlage 12\n60325 Frankfurt am Main\nGermany\nISIN: DE0005140008\nWKN: 514000\n\nListed: Regulated market in Berlin-Bremen, Duesseldorf, Frankfurt (Prime Standard), Hamburg, Hanover, Munich und Stuttgart; EUREX; NYSE\nThe International Securities Identification Numbers (ISINs) of further financial instruments issued by Deutsche Bank AG, and admitted to trading on a domestic organized market or for which such admission has been applied for, are listed in the attached PDFs.",
    "number_of_ratings": 7,
    "rating": 2.4,
    "likes": 2
}