{
    "url": "https://www.db.com/news/detail/20200309-150-000-trees-to-celebrate-150-years?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 9, 2020",
    "tags": [
        "Company",
        "History",
        "Sustainability"
    ],
    "title": "150,000 trees to celebrate 150 years",
    "body": "Deutsche Bank is planning to celebrate its 150th anniversary by planting tens of thousands of trees, bringing the total number of trees the bank has planted up to 150,000. The tree-planting campaign is the bank’s way of demonstrating its commitment to sustainability and fulfilling its corporate social responsibility. The bank’s partners in this project are the German charity Trinkwasserwald e.V. and local forest rangers.\nOver the past ten years, bank staff have joined clients, family members, friends and business partners in already planting 90,000 trees in cooperation with Trinkwasserwald. Numerous sessions are planned throughout Germany to plant the additional 60,000 saplings: in March and April, and again in September and October. The idea behind it is to revitalise large land areas, each with deciduous trees suited to the area.\n“For ten years now we have been helping replant distressed forests in Germany and in the UK – with our very own hands”, said Jörg Eigendorf, Global Head of Communications & Corporate Social Responsibility. “Not only is this a very personal and measurable positive impact on the society we operate in; it’s also a nice way of celebrating the 150th anniversary of our bank with our colleagues in Germany. I’m really confident we will exceed our overall target of 150,000 trees.”\nWhen it comes to planting the saplings, Trinkwasserwald and Deutsche Bank always work hand in hand with experienced partners and local experts. More than 4,000 colleagues and their families have participated in the tree-planting sessions since 2010. The Germany-wide anniversary sessions are part of a campaign launched by our Private Bank to encourage the bank’s clients to use a digital mailbox instead of choosing paper printouts.\nFor further information please contact:\nDeutsche Bank AG\nCommunications\nTim Oliver Ambrosius\nTel.: +49 69 910 42648\nEmail: tim-oliver.ambrosius@db.com\n\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking, asset and wealth management products and services as well as dedicated capital markets products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is the leading bank in Germany with strong European roots and a global network.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}