{
    "url": "https://www.db.com/news/detail/20200306-deutsche-bank-wealth-management-to-cooperate-with-fintech-qplix?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 6, 2020",
    "tags": [
        "Company",
        "Entrepreneurship",
        "Research"
    ],
    "title": "Deutsche Bank Wealth Management to cooperate with fintech QPLIX",
    "body": "The QPLIX platform provides family offices and asset managers of Deutsche Private Port with an overview of all asset classes for the first time\nDeutsche Bank supports the further development and internationalisation of the QPLIX platform by acquiring a minority stake\n\nDeutsche Bank’s Wealth Management business and the Munich-based financial technology company QPLIX have agreed to cooperate on the growing business with asset managers, family offices and other financial institutions such as pension funds.\nWealth Management will use the QPLIX platform to provide its clients with access to a digital platform for the holistic management and control of large assets. In turn, QPLIX clients will gain access to around 100 data interfaces. The agreement will create one of the largest banking networks in Europe.\n“We are pleased that in Deutsche Bank our product has won over another prestigious institution,” said Kai Linde, co-founder and managing director of QPLIX GmbH. “With this cooperation, we are combining the innovative power and digital expertise of QPLIX with Deutsche Bank’s large client base and many years of experience in serving ultra-high net-worth clients.”\nWith the help of the QPLIX platform, Deutsche Private Port can for the first time map, analyse and manage all asset classes including illiquid investments such as real estate and private equity. “With comprehensive asset mapping, we are meeting a need of our top clients and strengthening our market leadership in Germany,” said Frank Schriever, Head of Wealth Management Germany.\nStarting in Germany, the QPLIX software will serve as the basis for Deutsche Private Port, the digital investment office of Deutsche Bank Wealth Management. Asset managers, family offices and other financial institutions can use it to create simple cross-bank transparency:\nEvaluation tools that provide cross-bank asset overviews of total assets with performance and risk analyses as well as warning systems for compliance with investment guidelines;\nAccess to modern evaluation views anytime, anywhere and from different devices;\nFunctions for creating report packages for information to asset holders and committees; and\nDigital account opening for asset managers.\nDeutsche Bank is supporting the further development and internationalisation of the QPLIX platform by acquiring a minority stake. The remaining shares remain in the hands of the three QPLIX founders Kai Linde, Mathias Lindermeir and Philipp Pötzl.\n  Contact for media:\nDeutsche Bank\nJulia Yesil\nPhone: +49 69 910 39548\ne-mail: julia.yesil@db.com\nQPLIX\nKai Linde\nPhone: +49 89 998 2716 00\ne-mail: kai.linde@qplix.com",
    "number_of_ratings": 8,
    "rating": 4.3,
    "likes": 11
}