{
    "url": "https://www.db.com/news/detail/20200304-deutsche-bank-invests-to-support-vietnam-cross-border-trade?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 4, 2020",
    "tags": [
        "Corporate products",
        "Private products"
    ],
    "title": "Deutsche Bank invests to support Vietnam cross-border trade",
    "body": "Deutsche Bank announced it is investing further into Vietnam to support higher trade flows from Europe, which are expected to increase following the recently ratified EU-Vietnam Free Trade Agreement (FTA).\nAlready Vietnam is a significant trade partner for Germany, with annual trade of around 14 billion Euros, and the second largest trade partner in ASEAN.\nDeutsche Bank research shows that foreign direct investment (FDI) into Vietnam has doubled in the past five years.\nDeutsche Bank Vietnam Chief Country Officer Hans-Dieter Holtzmann said: “The rise in FDI can be attributed to more foreign companies investing in supply chains in Vietnam to support intra-Asian trade. With supply chains facilitating more trade, we are clearly seeing more demand for both inbound and outbound Vietnamese Dong (VND) currency payments.”\nAs a result, the bank is investing to enhance the digital capabilities of its award winning FX platforms to cater for the higher demand for local currency settlement. Late last year, Deutsche Bank added the restricted Vietnamese Dong to its FX4Cash platform, which offers more than 130 currency pairs globally.\nMore corporate clients are choosing to settle payments in local VND rather than USD to better manage the costs of currency conversion, but this also requires local currency risk management.\nHans-Dieter Holtzmann\nAs more clients trade and settle in local currency, there is also a greater demand for hedging currency exposure. The development of Vietnam’s Non-Deliverables Forward (NDF) market is providing clients with an avenue to hedge their Vietnamese Dong exposure.\n“This year we are seeing more liquidity in the NDF market, so we are expanding our VND Deliverable & Non Deliverable Forward capabilities on our Autobahn platform. This will allow our onshore and offshore clients to hedge their local currency exposure,” Holtzmann added.\nIn addition to introducing its enhanced FX platform, the bank is also extending FX API technology to local clients who will be able to connect their own direct sales eCommerce infrastructure to the bank’s platform, while being supported with pre and post-trade activities.\nGlobally, Deutsche Bank most often sees API used by clients to expand their own B2B and B2C sales offering by introducing a wider range of currencies for online transactions. This solution gives end customers more choice around payment currencies to hedge against currency movements.\nDeutsche Bank has operated in Vietnam since 1992, providing banking and financing solutions to multinationals, large local corporates and financial institutions, ranging from cash management, FX, custody and trade finance.\nFor further information, please contact:\nDeutsche Bank AG\nSarah Stabler\nPhone: +65 6432 8413\nE-mail: sarah.stabler@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}