{
    "url": "https://www.db.com/news/detail/20200304-deutsche-bank-goes-live-as-one-of-the-first-truly-global-agile-wealth-managers-with-three-key-ambitions-greatplacetowork-valuetoclients-morewithless?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 4, 2020",
    "tags": [
        "Company",
        "Corporate products",
        "Wealth"
    ],
    "title": "#GreatPlaceToWork, #ValueToClients, #MoreWithLess",
    "body": "“We have completely redefined the way people work and collaborate through our Agile transformation, bringing IT and the business together in small multidisciplinary and autonomous teams”, says Jan Wohlschiess, Chief Operating Officer and Head of IT and Operations at Deutsche Bank Wealth Management.\nFlatter organisational structure for effective change\nA lot of energy has gone into establishing the fundamentals for Agile over the past five months. After hundreds of interviews and dozens of training sessions and change events around the world, 800 people are now brought together in a flattened organisational structure of Tribes and Squads, working on projects to change our bank.\nThe teams are going to deploy improvements for the benefit of our clients, for our employees, for efficiency’s sake. We achieved noteworthy results during the preliminary phase and in pilots while our organisation was transformed to Agile-ready:\nMore than ambition\n#GreatPlaceToWork: We have created an Agile working environment in most of our locations – with more to come. We are seeing encouraging levels of excitement among our colleagues as infrastructure prerequisites are getting in place, and feedback on our gamified and interactive training sessions has been very positive.\n#ValueToClients is of utmost importance, and first achievements coming through benefit our clients in many ways, from being on-boarded faster to having assets transferred more swiftly, to obtaining higher transparency on the ESG credentials of their investments. To this end, an education curriculum was set up, teaching over 700 staff about MSCI ESG ratings methodology and interpretation.\n#MoreWithLess is about increasing efficiency and effectiveness. New Agile collaboration tools and content sharing platforms are already resulting in less cumbersome reporting and red tape, leaner alignment processes and fewer meetings. Furthermore, we have built the foundation for substantially reducing technology-related costs for change in 2020.\nAs we embrace the Agile mind-set and values, we expect to soon see more positive effects on Deutsche Bank both in Wealth Management and beyond. We thank everyone involved in this huge achievement.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 4
}