{
    "url": "https://www.db.com/news/detail/20200303-inspiring-innovators-how-we-re-jumpstarting-women-social-entrepreneurs-in-asia?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 3, 2020",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "Jumpstarting women social entrepreneurs in Asia",
    "body": "As part of our CSR Made for Good initiative, Deutsche Bank is partnering with global social enterprise enabler Ashoka to help three women social entrepreneurs in Asia Pacific to grow their business.\nThe nine-month ‘boot-camp’ programme, Made for Good Accelerator for Women, will support the entrepreneurs to refine their business models and expand their operations.\nWomen, particularly women social entrepreneurs, are important agents of change, says Ashoka, who have built a network of the world’s most impactful social entrepreneurs who are changing lives at national and international levels.\n“Supporting social entrepreneurship is a key element of our CSR strategy globally so we’re excited to partner with Ashoka on this first accelerator programme in Asia,” says Annie Yeo, Head of Corporate Social Responsibility for Asia.\nMentoring for good\nAs well as benefiting financially from the programme, the entrepreneurs also get the opportunity to being mentored by two of our own women leaders; Caroline Liow, APAC Head of Corporate and Investment Bank Operations and Sunila Shivpuri, APAC Head of Information Security.\nOn the issue of gender disparity across the entrepreneur community, Liow says: “Women entrepreneurs are an important source of innovation and job creation, but too often they do not have equal access to capital and business networks they need to sustain and expand their businesses.” Programmes like this aim to change that.\nWe can all draw lessons from this initiative, says Shivpuri: “Although as mentors we play an important role in supporting the participants, it’s also important to remember that we can all approach our roles with an entrepreneurial mindset and not lose sight of opportunities where we are push the boundaries to innovate.”\nMeet the entrepreneurs\nWith 88 percent of Korean children aged between 3 and 9 years regularly using the internet, Yuhyun Park has built an interactive learning programme to equip children with the skills they need to become responsible digital citizens.\nLevana Sani is creating a low-cost molecular diagnostics tool to address public health issues that arise from adverse drug reactions in low resource communities in Indonesia.\nAmanda Kiessel, based in Sri Lanka, is building a global online platform connecting social enterprises and responsible businesses to increase the visibility of economic initiatives that prioritises people and planet.\nAbout Made for Good\nDeutsche Bank's corporate social responsibility mission is to enable communities and economies to prosper. Supporting entrepreneurial ventures that create wider social good is a natural extension of what Deutsche Bank does for businesses of every size and purpose, every day, all over the world. Our global enterprise programme Made for Good draws on this experience to help start-ups and early-stage enterprises — microenterprises, non-profits and commercial businesses — build momentum and capacity.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}