{
    "url": "https://www.db.com/news/detail/20200302-proposed-transfer-of-ex-deutsche-bank-employees-jersey-custody-accounts-to-jersey-s-receiver-general-what-to-do-if-you-are-affected?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 2, 2020",
    "tags": [
        "Company"
    ],
    "title": "Proposed transfer of ex-Deutsche Bank employees' Jersey custody accounts to Jersey's Receiver General: What to do if you are affected",
    "body": "Deutsche Bank is in the process of winding down its operations in the Channel Islands. This forms part of a wider corporate strategy aimed at making Deutsche Bank's global operations simpler and more efficient.\nAs part of that process, we have approached all clients holding custody accounts with Deutsche Bank International Ltd (\"DBIL\") seeking their instruction to transfer their account to an alternative provider. However, we have been unable to obtain instructions from a proportion of those clients, for whom we no longer have current contact details or as they have not responded to our request. These custody accounts belong to former employees of the global Deutsche Bank group, and contain shares awarded to them during the course of their employment with us.\nGiven that DBIL is winding down its operations, DBIL has applied to the Royal Court in Jersey (the \"Court\") for its blessing of our proposal to transfer these custody accounts to Her Majesty's Receiver General in Jersey (the \"Receiver General\"). Under our proposal, the Receiver General will hold the assets currently in those accounts for a period of 15 years, in which time the account holder will be able to obtain their assets from the Receiver General (subject to payment of the Receiver General's fee of at least £500). Once that 15 year period has passed, ownership of the assets will pass to the Receiver General and the client will no longer have any claim to them.\nDBIL's application to the Court will be considered at a hearing on 18 March 2020 at 10am (the \"Hearing\") (the Court reference for those proceedings is 2020/032). If the Court grants its blessing of our proposal at the Hearing, we will then arrange promptly for the custody accounts to be transferred to the Receiver General. Clients affected by our proposal have the right to (i) receive a copy of the Representation and first affidavit of Jacqueline Foot (without exhibit) and (ii) make submissions to the Court in relation to our proposal, by request sent by email at db.sharescheme@db.com.\nIf a client wishes to make submissions to the Court on our proposal, they may do so in two ways. First, they may attend the Hearing (either in person or by instructing a Jersey Advocate). Second, they may send their submissions in writing – we will ensure that any written submissions that we receive from affected clients by or before 4pm on 16 March 2020 are placed before the Court (provided they are sent to us by email at db.sharescheme@db.com).\nIf you believe that you have a Deutsche Bank account in the Channel Islands and have not been contacted about the future of your account, we encourage you to contact us as a matter of urgency by email to db.sharescheme@db.com.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}