{
    "url": "https://www.db.com/news/detail/20200909-the-age-of-disorder-the-new-era-for-economics-politics-and-our-way-of-life?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 9, 2020",
    "tags": [
        "Research"
    ],
    "title": "The Age of Disorder",
    "body": "The world is on the cusp of a new era that will be characterised initially by disorder with a likely loosening of the globalisation that created the rapid economic and asset price growth of the last 40 years, according to Deutsche Bank’s Long-Term Asset Return Study 2020.\nThe flagship annual publication argues that 2020 marks the beginning of a new “structural super-cycle” of the kind that “shapes everything from economies to asset prices, politics, and our general way of life.”\nThe team, led by Strategist Jim Reid, predict an “Age of Disorder” – which is hastened, but not caused by, the corona virus – threatens the current high global asset valuations and will see governments and corporates take on even more debt.\nIn terms of geopolitics, tension between the US and China should “characterise the era of disorder” as China continues its path to restoring its historic role as a global economic powerhouse while preferring its own values to Western liberalism.\n“A clash of cultures and interests therefore beckons, especially as China grows closer to being the largest economy in the world,” the report says.\nThe Age of Disorder – specifically the next 10 years - could also be “a make-or-break decade for Europe”, the report says, arguing that the chances of muddling through for Europe have decreased and while the potential for further integration has increased with the recent Recovery Fund, the economic divergences will likely increase further and cause more stress points post-Covid.\nThe eight themes that will define the Age of Disorder are:\n1. Deteriorating US/China relations and the reversal of unfettered globalisation.\n2. A make-or-break decade for Europe.\n3. Even higher debt and MMT/helicopter money becoming mainstream.\n4. Inflation or deflation?\n5. Inequality worsening before a backlash and reversal takes place.\n6. The intergenerational divide widening.\n7. The climate debate will build.\n8. Technology revolution or bubble?\nThe report examines the current situation - The second era of globalisation (1980-2020?) – describing it as “the best combined asset price growth of any era in history, with equity and bond returns very strong across the board. It’s unlikely that the Age of Disorder can see such performance maintained, especially in real terms.”\nBut the report concludes: “In the years ahead, simply extrapolating past trends could be the biggest mistake you make”.\nTo read the full report click here. If you don’t have access please contact a Deutsche Bank sales representative.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}