{
    "url": "https://www.db.com/news/detail/20200908-deutsche-bank-s-education-programmes-go-digital?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 8, 2020",
    "tags": [
        "Corporate Citizenship",
        "Education"
    ],
    "title": "Deutsche Bank's education programmes go digital",
    "body": "Since the outbreak of the COVID-19 pandemic the education system has been constantly changing. More than 90 percent of all students were not allowed to attend school, according to the UNESCO World Education Report 2020. And even now, many students still have to study online. These restrictions have impacted equal opportunities and high-quality education, especially for children from financially weaker and disadvantaged backgrounds. This year’s International Literacy Day 2020 on September 8 therefore focuses on “Literacy teaching and learning in the COVID-19 crisis and beyond”, especially on the role of educators and changing pedagogies.\n“The pandemic further increases inequalities in the education system. We embrace the current dynamics and have developed digital enhancements to our programmes that will reach students, even if studying at home”, says Lareena Hilton, Global Head of Brand & Corporate Social Responsibility, Deutsche Bank.\nTogether with our partner organisations, we have adapted many of our Born to Be youth engagement programmes to meet the current restrictions. New online platforms now complement traditional classroom settings to reach everyone everywhere, like our Baut Eure Zukuft (Build your Future) project, which encourages students in grades 8 to 10 to work against social challenges like bullying, violence and racism. The programme is starting with online classes and workshops to allow anyone who wants to participate – Germany-wide.\n“After the long time at home, the children are very motivated to take part in the project as a team. The digital aspects make this even more interesting”, says a teacher.\nThe financial literacy initiative So geht Geld is also offering a new module, the eduStories. These are similar to the popular social media platforms Instagram and TikTok and use multimedia content to explain financial and economic facts for students from 5th to 13th grade. The social media look and feel guarantees a fun and interactive way of learning and helps students to improve their knowledge on their own and at their own pace, at home or in a classroom.\nAnother success this year was the video competition FinanzTuber in which students share their knowledge about financial and economic topics with their peers. Despite COVID-19, the teams created almost 50 videos from which the jury will choose the winners in October. After the summer break the project kicks off again and new teams can join.\n“The video shoot was a lot of fun and the advice of the experts was a real help. I really would like to join the project again”, student, 11 years old.\nOther regions around the world are also expanding their educational programmes. In the UK, since lockdown started, the Born to Be project Support My Future, delivered by Volunteering Matters, has gone digital. Where volunteers used to go to the school in east London once a week, they now meet the students over a virtual platform to support them as numeracy and learning and employability mentors during a period of uncertainty and isolation.\n“The current restrictions may have shut down schools but this reality has not gone away. When the opportunity to continue support as an ‘e-Mentor’ arose, I jumped at it”, says Sally Emerson, from the Chief Information Office, Deutsche Bank.\nThe projects Student to STEMette and Pathways to Banking and Finance aim at helping young people achieve their full potential. Both also offer virtual coaching to students to provide them with role models and access to the industry. This year Student to STEMette started the first fully-virtual cohort since the beginning of the programme.\nIn India and Singapore, Deutsche Bank volunteers are running online one-to-one and group coaching sessions with young people from less privileged backgrounds, as movement restrictions are in place. Conducted in partnership with charity partners Akaraka and Mentor Together, participants benefit from personal and tailored counselling to discuss the challenges they face with online learning and to tackle feelings of demotivation around future job prospects. Mentor Together in India use an app-based teaching model to reach large numbers of participants.\nWorking with Plan India, Deutsche Bank employees are holding large online sessions with up to 70 young people at a time, covering topics such as financial literacy, leadership skills development, communication skills, CV writing and interviewing skills. The bank expects to help up to 1,200 young people improve their job readiness through these sessions in the coming months.\nWhen New York City public schools closed, iMentor quickly adapted its programme model to operate without the structure of school-based classes and meetings. Volunteers and students moved all work to a completely virtual environment. The organisation also created additional online spaces to engage and support three distinct groups – mentor-mentee pairs, students and mentors – as they navigated the college process amidst new and uncertain challenges. Deutsche Bank is actively seeking volunteers to help iMentor recruit 1,000 mentors for the new school year.\nAcross Egypt, Deutsche Bank’s Middle East Foundation is helping 1,240 deaf and mute children improve their literacy and numeracy skills by providing the necessary training for 190 teachers and caregivers. Videos and apps empower these first graders to learn Arabic in a more engaging and meaningful manner. To ensure the health and safety of the beneficiaries, the training will take place virtually, with orientation materials for online learning provided to participants with limited digital literacy.\nIn less developed countries COVID-19 continues to restrict access to education programmes for students, which curtails their career prospects. Together with Volunteer Vision, Deutsche Bank launched a new global mentoring initiative that connects corporate volunteers with young jobseekers across geographical and cultural borders. Launched at the end of June, more than 195 Deutsche Bank employees from more than 11 countries have registered so far and the first tandems have already been matched. 26 of the mentees matched come from Sparrow Schools, a Born to Be partner organisation in South Africa, and TSIBA, a local non-profit Business School.\nDeutsche Bank employees also support each other. In Germany, almost 11 million children were forced to stay at home and the challenges for families were huge. Therefore, shortly after the outbreak of the pandemic, Deutsche Bank successfully started a programme for children of all colleagues. Marktplatz Schule is a place where employees can offer their service as a tutor – and it has been very popular.\nBorn to Be Deutsche Bank’s youth engagement programme\n\nDeutsche Bank’s Born to Be youth engagement programme, one of the strategic CSR pillars, is made up of over 180 education-led projects, all of which demonstrate the bank’s commitment to addressing the social issues in the context of the UN Sustainable Development Goals 2030. Since 2014, Born to Be has provided more than 4.5 million young people with education opportunities in 29 countries.\n\nFind out more about Born to Be’s global impact, read other personal life-changing stories and watch our film here: www.db.com/lifechanger",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 3
}