{
    "url": "https://www.db.com/news/detail/20200908-new-report-from-deutsche-bank-technology-strategist-apjit-walia-reveals-america-s-racial-gap-in-big-tech?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 8, 2020",
    "tags": [
        "Company",
        "Digitalisation",
        "Diversity",
        "Research"
    ],
    "title": "New report reveals America's racial gap in big tech",
    "body": "A new Deutsche Bank Research report, America’s Racial Gap & Big Tech’s Closing Window, uncovers a host of stark statistics on the digital racial gap and possible long-term employment implications for minorities.\nDeutsche Bank’s Global Head of Technology Investment Strategy Apjit Walia conducted the bottom-up societal study and concluded that if this “digital racial gap is not addressed, in one generation alone, digitisation could render the country’s minorities into an unemployment abyss.”\nWalia found the data to be more glaring than expected, as indicated in some of the key findings:\nGiven the exponential growth of the digital economy, 76 percent of Blacks and 62 percent of Hispanics could get shut out from or be under-prepared for 86 percent of jobs in the US by 2045\nBlacks and Hispanics are 10 years behind Whites in levels of broadband access and almost 4 times more Blacks have poorer tech connectivity than Whites\nWhile 83 percent of Whites own a personal computer, that rate drops to 60 percent for Blacks and 51 percent for Hispanics\nJust over 1 out of 20 Blacks feel privacy is a primary concern as it relates to tech\nOnly 1 in 3 Americans now hold a positive view of Big Tech\nCan Big Tech close the gap?\nBig Tech can play a critical role in finding a solution. Walia argues that if large companies commit USD 15 billion dollars over the next five years– which equates to less than 1 percent of the USD 2 trillion dollar increase in Big Tech 5’s market cap during Covid – there would be a meaningful shift in the racial digital divide.\n“There are no guarantees in life or investing, but for Big Tech to come together and find a solution or a small step in the direction of the solution to one of the most egregious divides in our society could change the national discourse on these companies,” Walia said in the note. “And that would only boost their long term prospects and returns.”\nAmerica’s Racial Gap & Big Tech’s Closing Window can be downloaded from the\nPDF\npublic Research site.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 3
}