{
    "url": "https://www.db.com/news/detail/20200903-we-re-here-to-help-position-deutsche-bank-as-an-expert-on-esg?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 3, 2020",
    "tags": [
        "Company",
        "Sustainability"
    ],
    "title": "We're here to help position Deutsche Bank as an expert on ESG",
    "body": "Trisha Taneja always wanted a career that contributed to building a more sustainable world. Her first stint in sustainability was in the non-profit sector, where she spent several years managing large programs in areas like global health and microfinance. When she decided to make the leap to the private sector because of her “firm belief that private capital can make a significant difference in accelerating the shift to a sustainable economy”, she first completed a Finance degree before joining Sustainalytics, an ESG rating agency.\nAs global head of green and sustainable bonds, Taneja was responsible for growing the issuer side of the business, new product development and commercializing ESG products for issuers.\nThen Deutsche Bank came calling\n“I’m quite entrepreneurial, and ESG is a fast-moving market, so the opportunity to grow the bank’s Sustainable Finance business further really appealed to me. It’s an exciting new venture,” said Taneja, whose experience helping more than 200 issuers with their green and sustainable bonds directly translates to her new role at Deutsche Bank. As the Green, Social, Sustainable bonds (GSS) market is only about five or six years old, it can be a challenge to find someone with experience working with different types of issuers, whether that’s corporates, banks or sovereigns, in different countries and regions.\n“Our mandate is two-fold: first, we want to act as ESG advisors to the bank’s clients, helping position Deutsche Bank as an expert on ESG,” she explained. “This means increasing the frequency of client interactions and dialogue on ESG in collaboration with the relationship teams, coverage bankers, and ESG champions whether in Debt Capital Markets, Origination, Capital Markets product teams, or Corporate Finance. Collectively, as an institution, we should be able to have a highly engaged level of dialogue on ESG.”\nOnce the bank further establishes itself as an expert in this space, Taneja believes clients will trust the bank more with their sustainable finance business, which leads to the second part of the team’s mandate: to increase origination of ESG-related sustainable transactions and thereby contribute to the ‘200 billion by 2025’ target. This means advising clients on types of assets that are eligible for green bonds, investor expectations for credible ESG issuances and credible transition strategies, and generally how investors are incorporating ESG considerations in their investment decision making.\n“We’re also keen on innovating into new areas, for example taking a leadership role in areas or products where ESG hasn’t been integrated so far in financing, like equity capital markets for example, or figuring out how ESG can contribute more meaningfully to strategic M&A discussions. And we want to do this collaboratively with product and coverage teams,” she said.\nSo who is the new team and how does it all work?\nThe core team is made up of Taneja, plus two colleagues in Europe and two in the US, all internal transfers. In addition, there are a network of ‘ESG Champions’ who assist the core team in broadening ESG dialogue with clients in their respective business and product lines.\n“If we want to be successful in this space, we need to have more than just five ESG experts,”\nTaneja said. “The core team will hold regular market update and knowledge sessions for the ESG Champions to feed back to their teams and encourage the integration of ESG into their client pitches and conversations. When they need more in-depth expertise or content, they can pull us in.”\nDeutsche Bank strategists expect that in 10 years, potentially 95 percent of investments will incorporate ESG factors, so issuers and corporates need to start considering how ESG will impact their business models. There’s a lot of regulatory pressure, Taneja adds, and the EU is creating a sustainable finance action plan and regulation. Add to that the wealth transfer to a younger generation that sees the private sector and capital as a key component to creating a more sustainable world.”\n“There are a lot of stakeholders incentivizing companies to start thinking about how their business models are going to shift to a more sustainable economy,” explained Taneja. “It’s crucial for Deutsche Bank’s business overall to be able to advise its clients on ESG as the market changes because we’re not going to be able to effectively service our clients without answering the ESG component. We don’t want to be in a position where the world is shifting and we’re not shifting with it. Our team is helping ensure we are part of this shift.”\n“I see a lot of energy and commitment around this, not only in Capital Markets but other areas like the Corporate Bank or Fixed Income & Currencies,” she said.\nShort term goals, long term view\nThe team, at four months old, is still in its infancy. Taneja’s goal for the first six to 12 months is simple: increase the client dialogue on ESG and spread ESG knowledge within the bank as much as possible.\n“It takes a while to understand how to best position this in front of clients and internally. And we need to settle into a groove with our relationship managers and teams. It’s exciting to establish something new and to figure out how to make it work.”\nTaneja also has a personal goal to “become fluent in investment banking” within the next six months, and she is keen to get to know her Deutsche Bank colleagues.\n“I moved to the London office during the pandemic, so I haven’t met a lot of people, so come talk to me! Show me the good coffee places and tell me about what you do.”\nIn July 2019, we made sustainability a central component of our new corporate strategy, “Compete to win”. To embed sustainability holistically throughout the bank, we are focusing on four dimensions, one of which is sustainable finance. This means making sustainability an integral part of our client offering, as well as providing products and services that help our clients to transform their business models towards a low-carbon future. In May 2020, we set ourselves the target to increase the volume of sustainable financing and our portfolio of sustainable investments under management to at least 200 billion euros by 2025.\nAs Head of the new inter-disciplinary ESG Advisory & sustainable finance team in capital markets, Trisha Taneja and her team will play a vital role in this effort, advising colleagues and clients across the bank on integrating ESG into their capital raising activities.\nIt doesn't take a crystal ball to predict that Taneja and her team will be very busy in the coming months and years – as will be the Group Sustainability team and the Sustainability Council chaired by Christian Sewing. Both support and coordinate the bank’s irreversible shift towards climate protection and sustainability, laying the groundwork for the bank-wide transformation to pick up pace.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 3
}