{
    "url": "https://www.db.com/news/detail/20201029-deutsche-bank-draws-up-the-world-s-first-esg-fx-derivative-framework-agreement-for-primetals-technologies?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 29, 2020",
    "tags": [
        "Capital markets",
        "Investment Banking"
    ],
    "title": "Deutsche Bank draws up the world's first ESG FX derivative framework agreement for Primetals Technologies",
    "body": "Initial term of the framework agreement is four years\nTransaction complies with the terms of Deutsche Bank’s new Sustainable Finance Framework\nSustainability criteria devised and monitored by independent consultants\nDeutsche Bank and Primetals Technologies have reached agreement on the world’s first hedging concept that links currency options to sustainability goals. The framework agreement signed today enables Primetals Technologies to hedge its currency risk with FX options with the bank over a period of four years. Should Primetals Technologies fail to meet the agreed sustainability targets, the company must pay a predefined sum to a contractually defined non-governmental organisation. Any currency hedges the company executes comply with the criteria of the new Sustainable Finance Framework that Deutsche Bank published at the end of July. In doing so the bank has devised criteria for the classification of ESG financing which are aligned on a best-effort basis to the new EU Taxonomy Regulation.\n“Our bank seeks to play an active role in achieving the targets of the Paris Climate Agreement. That is why we plan to develop more and more financial products that are linked to sustainability targets. In so doing we will assist our clients in implementing their sustainability strategies and monitor their achievements over the longer term as well”, explained Gerald Podobnik, Chief Financial Officer of Deutsche Bank’s Corporate Bank and member of the German government’s Sustainable Finance Advisory Council. Marc Müller, Head of Corporate Coverage in Germany, Austria and Switzerland, said: “This worldwide completely new structure helps us link Primetals’ sustainability efforts with the need for currency hedging – and it’s something many of our internationally active clients will be interested in.”\nYoshiharu Ikeda, Chief Financial Officer of Primetals Technologies, adds: “As a global pioneer in the metal industry sector we are proud of constantly developing trend-setting innovations and assisting our clients in implementing green steelmaking. Also measuring the success of our sustainability targets by our financial products illustrates the high regard for sustainable value creation at Primetals Technologies.”\nThe currency hedge is linked to several sustainability targets. This includes, for example, the proportion of total sales of projects sold that aim to reduce greenhouse gas emissions for customers. One ratio measured is revenues relative to research and development expenditure that result in improved resource efficiency. Another metric is the promotion of a safe and healthy work environment for all staff at Primetals Technologies. Deutsche Bank and Primetals Technologies have taken advice on selecting their targets from Environmental Resources Management (ERM). The independent consultancy appraises and certifies whether the targets are adhered to for the entire life of the option.",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 2
}