{
    "url": "https://www.db.com/news/detail/20201027-deutsche-bank-expands-asia-pacific-esg-team-with-hire-of-kalpana-seethepalli?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 27, 2020",
    "tags": [
        "Sustainability"
    ],
    "title": "Deutsche Bank expands Asia Pacific ESG team with hire of Kalpana Seethepalli",
    "body": "Deutsche Bank has appointed Kalpana Seethepalli to its Asia Pacific ESG team. This hire follows the appointment of Kamran Khan as Head of ESG for Asia Pacific in May of this year. In a newly created role, Kalpana will lead the team’s work on results frameworks, measurement, monitoring, and sustainable finance taxonomies for ESG transactions.\nKalpana joins Deutsche Bank from Infra-Tech Capital, an impact fund investing in companies utilizing technology to provide infrastructure services and achieve UN Sustainable Development Goals (SDGs), where she was Managing Director, Sustainability & Impact. Previously she worked at the World Bank Group where she focused on sustainable development and investment policy, blended finance, and Public Private Partnerships (PPPs). She is a global expert in design, measurement, and reporting frameworks to achieve positive ESG impact through commercially viable investments.\n“It is abundantly clear that in Asia Pacific ESG impact is becoming increasingly central to business and investment decisions, and rightly so”, said Deutsche Bank Asia Pacific CEO Alexander von zur Muehlen. “Client demand for proven ESG expertise from their banking partners is rapidly rising. At Deutsche Bank we are intensely focused on building out our ESG competence and embedding it throughout all of our businesses and service offerings as a key element of our growth strategy for the region.”\nKamran Khan added: “Over the last months we have seen tremendous interest from clients in ESG-related engagements and increasing momentum in the development of our transaction pipeline. Kalpana’s arrival adds best-in-class sustainability operational expertise to complement our strong coverage, structuring, and transaction services capabilities. This is a powerful combination of content and platform that will further accelerate our rise as a leader in the ESG market in Asia Pacific.”\nDeutsche Bank has had a longstanding commitment to sustainability. The bank has been a member of the UN Environment Programme Finance Initiative and signatory of its Declaration of Sustainable Development since 1992, achieved climate neutrality in operations since 2012, and has been a supporter of the Paris Climate Agreement since 2015.\nIn 2019, the bank was a founding signatory of the UN Principles for Responsible Banking. In 2020, the bank tightened its Fossil Fuels Policy, pledging to end global business activities in coal mining by 2025. The bank has also committed that by 2025 its total volume of sustainable financing and investments will exceed EUR 200bn, and that its operations will be powered entirely by renewable energy sources.\n  This release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 20 March 2020 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}