{
    "url": "https://www.db.com/news/detail/20201015-deutsche-bizbanking-all-deutsche-bank-business-clients-under-a-single-umbrella?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 15, 2020",
    "tags": [
        "Company"
    ],
    "title": "“Deutsche BizBanking”",
    "body": "A single management, one platform, three brands – Stefan Bender: “We provide a home for all business clients.”\nThe Deutsche Bank, Postbank and FYRST brands will remain present in the market\nMarket shares will be redistributed going forward: the bank considers itself well placed to compete\nDeutsche Bank is revamping its operation for business clients – from self-employed small businessperson to medium-sized businesses: the products and services of its Deutsche Bank, Postbank and FYRST brands will be managed by a single unit called “Deutsche BizBanking”. The bank regards business clients as a strategic growth segment within the group.\nThe bank aims to dynamically develop new solutions for its clients and has strengthened the management team with internals and an external new hire. The bank’s Deutsche Bank, Postbank and FYRST brands currently serve more than 800,000 business clients in Germany. “Deutsche BizBanking” is part of the Corporate Bank Germany.\n“One year ago, we have already established the Corporate Bank combining all commercial and corporate clients across all brands in one business unit. With the three brands – Deutsche Bank, Postbank and FYRST, a shared technology platform in future and our 150 years of experience we provide our business clients with a dedicated and focused service model,” said Stefan Bender, Head of Corporate Bank Germany and Head of Deutsche BizBanking at Deutsche Bank.\n“Our approach will give us more room for joint investments and at the same time all clients will benefit from Deutsche Bank’s product expertise and extensive network,” Bender added.\nA shake-up of market shares in the segment is imminent. Fintechs and so-called neobanks are rushing into the market with specialised offerings, technical interfaces or systems that enable new financial solutions to be devised. Last but not least, business models are changing and thus also the needs of many business clients. “The business models of many small and medium-sized businesses are about to change. This has largely to do with the increasing role of technology – even more accelerated by the coronavirus pandemic. A redistribution of market shares is now underway and we believe we’re in pole position,” Bender said.\nCoronavirus pandemic highlights the importance of a so-called “Hausbank”, a local, go-to bank that a client can rely on for all their banking needs.\n“We are a strategically important partner and risk manager for our clients especially during challenging times. This has been highlighted by the coronavirus pandemic. Over recent months we have reacted promptly and provided our clients with swift, straightforward assistance on a vast range of topics. This extraordinary situation has shown the importance of a client having an established relationship with their local bank or “Hausbank”. Clients of us can easily apply online for support loans from the KfW German state development bank and secure liquidity,” said Bender.\nBusiness and private advice from a single source – digital and regional\nThe bank considers itself already well equipped to compete. Clients can interact with the bank online and via advisory centres by phone or video call until at least 8 p.m. every day; service-related questions are answered around the clock. The bank has some 1,000 advisors in over 100 branches as well as advisory centres to service its business clients throughout Germany; they support clients in shaping their business growth and identifying and mitigating risks.\nClose ties with the experts from the private clients’ side enable the bank to provide excellent service to entrepreneurs, not only on business matters, but also with private financial matters. As clients of a global bank they can also benefit from Deutsche Bank’s international network. They also have access to a broad digital offering: Deutsche Bank already provides its business clients with facilities for mobile payments (using iPhone and Android devices), instant payments, opening accounts online (for natural persons and first legal entities), multi-banking and applying for loans online (including KfW support loans).\nIT, products and investments from a single source – reinforced management team\nThe product offering and the technological platform of BizBanking will be constantly developed and made available uniformly to all clients regardless of their brand affiliation. This is why the bank recently complemented the management team by welcoming Volker Broer from the technology consultancy Senacor, where he was a partner. He will be responsible for further expanding the business clients platform and devising new products and services.\nAdvanced technology is bringing the value chains of business clients closer and closer together. The interplay between various partners in the business-to-business and business-to-business-to-consumer (B2B2C) space is constantly gaining importance. As a provider of such B2B2C offerings the bank aims to integrate its network within the entire business clients segment even more closely. Deutsche Bank already cooperates with several partners to offer services that extend beyond traditional banking.\nThese include for example an advanced accounting software package, solutions to manage receivables or offers for talent acquisition and retention. “With more advanced technology and a comprehensive product portfolio we offer our clients a combined offering from a single source. In addition, economies of scale can be leveraged even more effectively. No other financial service provider in Germany can do this to the same extent,” explained Bender.",
    "number_of_ratings": 5,
    "rating": 3.4,
    "likes": 13
}