{
    "url": "https://www.db.com/news/detail/20201015-rose-zhu-a-female-leader-s-journey?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 15, 2020",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "Rose Zhu – a female leader's journey",
    "body": "When Rose Zhu joined Deutsche Bank in 2003 as the SARS outbreak was disrupting lives and businesses across Asia, she did not foresee that one day she would be in the driver’s seat, leading Deutsche Bank’s overall business offerings in China, including helping clients and staff manage the fallout of the COVID-19 pandemic, and helping them recover from it.\nSpeaking about her career at the bank to Asiamoney, she said. “I certainly never set out to be the China chief country officer. I just exerted my utmost every day, focused on what I do, and tried to do it to the best of my ability.”\nAfter a promotion to China chief operating officer, Zhu set out to build Deutsche Bank’s footprint in China. “I upgraded the representative office in Beijing to a full branch, set up two securities representative offices in Beijing and Shanghai, and oversaw our investments in Harvest Fund Management and Huaxia Bank,” she said.\nDiscussing gender inclusion in China’s financial services industry, Zhu said that she sees an increase in female talent entering the board level at the state-owned banks and at the main Chinese policy banks over the coming years. “The talent is there, it’s rising – it’s just a matter of time before it reaches the top,” she said. More than 70% of Deutsche Bank China’s employees and half of the local management team are women.\nRead the full article\nTop ten ranking for supporting women in Asia’s financial markets\nDeutsche Bank’s commitment to build a more inclusive workplace in Asia was recognised in Asiamoney’s 2020 Leaders for Women Survey. The bank was ranked among the top ten international banks for encouraging women in the workplace in Asia’s financial markets, in three out of the four categories.\nDeutsche Bank scored best in the category that focused on the percentage of women in senior management in the region, with women making up 28% of these roles. The bank also placed in the top ten for the overall ‘Women in the workplace’ ranking and for gender diversity at the graduate ranking.\nKate Grant, Head of Human Resources for Asia Pacific said: “This recognition underscores our commitment to improve gender inclusion in the bank at all levels. We have some way to go to increase the representation of women in our workplace, but this survey and the encouraging results show that we are making positive progress.”",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 4
}