{
    "url": "https://www.db.com/news/detail/20201013-danske-investigation-into-deutsche-bank-employees-closed-13-5-million-euro-fine-for-administrative-offence?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 13, 2020",
    "tags": [
        "Company"
    ],
    "title": "Danske investigation into Deutsche Bank employees closed – 13.5 million euro fine for administrative offence",
    "body": "The Frankfurt Public Prosecutor's Office has closed its criminal investigation into employees of Deutsche Bank in connection with Danske Bank Estonia due to lack of sufficient suspicion in accordance with section 170 (2) of the German Code of Criminal Procedure. This step means that the allegations of aiding and abetting money laundering that were made against the bank have been dropped.\n“’The investigations by the Frankfurt Public Prosecutor's Office are now closed. With the closure of these proceedings it is clear that there was no evidence of criminal misconduct either on the part of Deutsche Bank or its employees. We had fully cooperated with the Public Prosecutor's Office from the onset of the investigation,” said Stefan Simon, member of the Management Board of Deutsche Bank.\nDeutsche Bank terminated its relationship as correspondent bank for Danske Bank Estonia back in October 2015.\nFor an administrative offence the bank has now accepted a fine of 13.5 million euros on account of failing to submit Suspicious Activity Reports (SAR) in a timely fashion. These SARs relate to transactions from 2010 to 2015. These were also settled via Danske Bank but were the subject of an independent investigation in connection with a separate incident. As part of this investigation, no allegations were made against the bank in terms of it having breached its supervision obligations or organisational duties or certain persons violating their responsibility, nor were any breaches ascertained.\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nSebastian Krämer-Bach\nTel. +49 69 910 43330\nEmail: sebastian.kraemer-bach@db.com\nChristine Peters\nTel.: +49 69 910 62303\nEmail: christine.peters@db.com\n\nAbout Deutsche Bank\nDeutsche Bank provides retail and private banking, corporate and transaction banking, lending, asset and wealth management products and services as well as focused investment banking to private individuals, small and medium-sized companies, corporations, governments and institutional investors. Deutsche Bank is the leading bank in Germany with strong European roots and a global network.\n\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 20 March 2020 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}