{
    "url": "https://www.db.com/news/detail/20220928-we-need-to-take-action-every-single-day?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 28, 2022",
    "tags": [
        "Europe",
        "Entrepreneurship",
        "Sustainability",
        "Wealth"
    ],
    "title": "“We need to take action every single day“",
    "body": "The United Nations Patron of the Oceans and endurance swimmer, Lewis Pugh, OIG, and champion Olympic sailor Sir Ben Ainslie, CBE have called for global leaders, including private investors, to help accelerate ocean protection to achieve the United Nations goal of protecting 30 percent of global marine environments by 2030.\nDelivering the keynote address at a private event on the Spanish island of Mallorca, Lewis Pugh said: “We need to redouble our efforts to protect the Ocean and take action every single day. As the planet’s biggest carbon sink, the Ocean’s health is vital to limiting the impact of climate change, especially for vulnerable habitats like coral reefs.”\nCoral reefs sustain 25 percent of all marine life yet make up less than 1 percent of the Ocean. The Intergovernmental Panel on Climate Change warned that if global warming hits the 1.5°C target, 75-90 percent of the world's coral reefs could die off[1]. A 2°C warming could make all tropical corals extinct.\nAt the ocean conference, hosted by Deutsche Bank and the Ocean Risk and Resilience Action Alliance (ORRAA), Pugh and Ainslie told a group of influential investors, entrepreneurs and philanthropists that the future of the Ocean lay in their hands, as holders of significant private capital.\nThe inaugural Deutsche Bank x ORRAA Ocean Conference aims to build an investment community to support the sustainable blue economy, starting with Deutsche Bank’s clients.\nGlobal Head of Deutsche Bank’s International Private Bank (IPB) and Chief Executive Officer of EMEA, Claudio de Sanctis said: “Deutsche Bank is committed to accelerating sustainable solutions for the ocean by enabling private capital into ocean finance to create lasting impact for future generations.”\nORRAA Executive Director Karen Sack said: “This conference is a really important stepping stone in terms of further developing the investment community for the Ocean. It is more important than ever that we bring together the smart thinking of investors, entrepreneurs and scientists and use this to catalyse action and investment into ocean resilience.” \nIn June, Deutsche Bank pledged its support to the development of ORRAA’s Sea Change Impact Financing Facility (SCIFF), which aims to drive at least 1 billion US dollars of investment into coastal and ocean ecosystems by 2030, and mobilise 2.5 billion US dollars into the space.\nThe conference brought together ocean experts, academics, NGOs, investors and ocean impact startups to accelerate investment into a sustainable blue economy and nature-based solutions that benefit the ocean ecosystem.  Ocean impact startups attending the conference included EcoSubsea, Ocean Bottle, Matter, Avant Meats, Biofeyn, Coral Vita, ECOncrete, and Bound4Blue.\n\n\n[1] https://www.ipcc.ch/site/assets/uploads/sites/2/2019/06/SR15_Full_Report_Low_Res.pdf",
    "number_of_ratings": 3,
    "rating": 3.7,
    "likes": 6
}