{
    "url": "https://www.db.com/news/detail/20220922-deutsche-bank-partners-with-visa-to-prevent-fraud-in-online-retail?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, September 22, 2022",
    "tags": [
        "Germany",
        "Corporate products",
        "Digital banking & services"
    ],
    "title": "Deutsche Bank partners with Visa to prevent fraud in online retail",
    "body": "Deutsche Bank and Visa are entering into a new collaboration to help prevent online retail fraud. Merchants who process their e-commerce payments via Deutsche Bank can now use “Decision Manager”, an automated fraud detection system from Visa-owned company Cybersource. The solution works like a risk management system and calculates a risk value for each individual transaction using artificial intelligence and specified rules. The application uses advanced risk models and global data intelligence from billions of data points of the Visa network, allowing good transactions to be accelerated and suspected fraudulent transactions to be blocked. The offer is aimed at small, medium-sized and large companies.\n\"With the solution from Visa and Cybersource, we are offering merchants a whole new form of risk management. In this way, our clients receive even more service from a single source which ensures less complexity,\" said Kilian Thalhammer, Head of Merchant Solutions at Deutsche Bank.\n“As we continue to see more digitalization across the retail industry, small and large businesses are inevitably exposed to new fraud and cyber-risks. With the increasing volumes and associated costs of cyber-related attacks, the Visa solution Cybersource helps Deutsche Bank to resolve the tension between making payments easy and keeping their client’s business safe. By pairing key insights from experienced managed risk analysts with a battle-tested decision engine, we are able to build safety and convenience into the fabric of every payment experience,” said Denise Burkett-Stus, Head of Cybersource Europe. In 2021, Decision Manager prevented the equivalent of more than $22 billion in potential fraud worldwide¹.\n“We are proud Deutsche Bank decided to trust in Visa’s fraud-detection technology to advance their offering of merchant solutions. When it comes to fighting fraud, data is the most precious resource. Our worldwide network and the use of machine learning techniques allow us to deploy a global data set to reduce fraud. The partnership is an excellent example of how Visa is providing value-added services to leading financial institutions and shows we, as a global technology company, have much more to offer than just the credit or debit card”, said Jürgen Schübel, Head of Merchant Solutions & Acceptance, Central Europe at Visa.\n\n¹ Represents the value of transactions rejected as fraudulent using Decision Manager in 2021. Normalised for USD.",
    "number_of_ratings": 13,
    "rating": 4.1,
    "likes": 54
}