{
    "url": "https://www.db.com/news/detail/20220920-deutsche-bank-appoints-neil-brady-as-chief-country-officer-for-ireland?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 20, 2022",
    "tags": [
        "Management & Leadership"
    ],
    "title": "Deutsche Bank appoints Neil Brady as Chief Country Officer for Ireland",
    "body": "Deutsche Bank today announced the appointment of Neil Brady as Chief Country Officer (CCO) for Ireland, effective October 1, 2022.\nIn his new capacity as CCO for Ireland, Neil will report to Tiina Lee, Chief Executive Officer, UK & Ireland (UKI).  Neil will oversee the bank’s local operations in Ireland across all divisions and be responsible for further developing the franchise in the country.  Neil will fulfil this role in addition to his existing role as Global Head of Surveillance, Messaging & ASL Operations, within the Corporate Bank.\nCommenting on the appointment, Tiina Lee, Chief Executive Officer, UK & Ireland (UKI), said: “We are extremely pleased that Neil will be joining our regional team to lead our operations in Ireland. His extensive experience and strong track record will play a key role in developing the bank’s franchise both locally and in the region. He has an extensive network across the bank and is well established in the Ireland Financial Services community”\nNeil joined Deutsche Bank in 1995 as a graduate, and during his 27 years with the bank he has held various positions in Corporate Bank Operations, including Head of USD & UK Cash Operations.  Neil started his career in the Dublin office, spending some time in New York, before returning to Dublin in 2019. \nDeutsche Bank has had a presence in Ireland since 1991 and today employs approximately 200 people in its new offices in 2 Grand Canal Square. Dublin will continue to be a major location for our Corporate Bank business, and an important centre for our specialist Data & Innovation Lab.",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 10
}