{
    "url": "https://www.db.com/news/detail/20220915-meet-our-esg-experts-viktoriya-brand?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 15, 2022",
    "tags": [
        "Sustainability"
    ],
    "title": "Meet our ESG experts: Viktoriya Brand",
    "body": "Viktoriya, what’s keeping you busy these days?\nFirstly: ever evolving ESG regulation. New and diverse regulations are increasingly emerging all over the world. These are multi-faceted and challenging to implement. Also, a common understanding on ESG definitions is missing; there is no common agreement on which metrics to use and what is considered ‘sustainable’. When common frameworks for the industry are missing, we need to develop our own standards according to best practice.\nSecondly: data. We need data to continuously improve our sustainability processes, to innovate and to respond to regulatory requirements, but this is still a very new concept to many stakeholders. This means that the type of data we need is not always available, or simply does not exist.\nThirdly: growing complexity. There’s climate, biodiversity, human rights, social protection and all the sub-topics underneath such as deforestation, ocean protection, plastics – just to name a few. Each topic is crucial, but each adds its own level of complexity.\nHow do we move forward without common definitions?\nInternally, we created rules and principles to evaluate what is sustainable. These principles are designed to consistently assess, for example, what a positive contribution to climate protection is, or which actions align with the Sustainable Development Goals. This is what our \nPDF\nSustainable Finance Framework is for: to determine how to apply sustainability evaluation consistently across all the countries in which we operate while also considering international definitions available as well as local standards.\nTell us more about data: what data do we need and how will we use it?\nAs a financial services provider, the biggest impact we can make is while working with our clients and enabling them to realise their projects and investments. So far, we’ve been able to facilitate more than 190 billion euros in financial flows towards sustainable economic activities. Our job is not only to set the standards but to ensure that this financing and investment is in line with our framework.\nSo far, we’ve been able to facilitate more than 190 billion euros in financial flows towards sustainable economic activities\nMore than 190 billion euros in ESG financing and investment – that’s a huge amount of transactions How do you make sure that all these deals support sustainable projects and activities?\nIt is true that the number of deals has been growing quickly. In 2021 we validated more than 1,000 transactions across our Investment Bank and our Corporate Bank; the general tendency is for transactions not just growing in number but also in complexity. Over the last couple of years, we have established a robust governance process, so every function – be it business, us in Group Sustainability or in Finance – has procedures in place to stay compliant with our Sustainable Finance Framework. We review every single deal that counts towards our sustainable finance target. \nWe review every single deal that counts towards our sustainable finance target\nHow often do you decline transactions for not being “E”, “S” or “G”?\nWe now have established rules and have also gained experience since we first launched the framework in 2020 so our coverage people know what works and what doesn’t. Every now and then, however, we have to decline granting the classification, especially in cases where we are entering new territory. For these kind of cases, we have established a special forum to evaluate them, and to make a final conclusion. These discussions may then be reflected in our framework as this space is, of course, developing continuously.\nWe call our ESG strategy “From ambition to impact”. Where are we in measuring the real impact of these transactions on the environment?\nFor individual financings it is often possible to assess the impact, though it is not always quantifiable. All of us in the financial sector need to become much more sophisticated in measuring the whole range of effects on the environment and on society – including biodiversity, land usage and so on. We mustn’t limit it to carbon.\nIt sounds like there’s still much to do. What has Deutsche Bank achieved in the past two years of which you are most proud?\nWe have created a common understanding in our bank of what sustainability is and how important it is to embed sustainability in all our client conversations and operations. Sustainability is not a nice-to-have add-on for us. Sustainability has been rapidly becoming part of our business decisions. It is an innovation engine for new product ideas and for new ways to encourage environmental and social protection. \nSustainability is an innovation engine for new product ideas (...)\nHow do we make sure we’re at the forefront in the ESG space?\nFirst of all, we listen. Ongoing stakeholder feedback and dialogue are both key in understanding what is important for our clients and other stakeholder groups and what this means for our bank. And we benchmark ourselves continuously against competitors; we have been increasing our efforts significantly here.\nWhat are your priorities for the rest of 2022?\nDeveloping our Sustainable Finance Framework and advancing our in-house sustainability training, to name just two. It is crucial for us to refresh our Sustainable Finance Framework continuously to reflect updates in international standards, like the EU taxonomy, advancements in local taxonomies and international principles, and of course our own experience in this space. For our dialogue with our clients, we need to make sure our colleagues are familiar with important ESG topics. Therefore, we will be launching new training modules by the end of the year.",
    "number_of_ratings": 7,
    "rating": 4.4,
    "likes": 11
}