{
    "url": "https://www.db.com/news/detail/20200727-media-release?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "July 27, 2020",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank to end global business activities in coal mining by 2025",
    "body": "The bank has tightened its Fossil Fuels Policy, giving it a new \nPDF\nframework for business activities involving oil, gas and coal worldwide\nCoal power: by the end of 2020, the bank will review all its existing business activities in Europe and the US with regard to clients’ diversification plans; review in Asia to begin in 2022\nOil and gas: effective immediately, the bank will no longer finance any new projects in the Arctic region or oil sand projects. By the end of 2020, the bank will review all its existing business activities in the oil and gas sector\nThe bank has signed the Equator Principles for assessing environmental and social risk\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) has adopted a new Fossil Fuels Policy which provides its business divisions with a strict framework for their business activities involving coal, oil and gas. This means that Deutsche Bank will end its global business activities in coal mining by 2025 at the latest in order to help drive the transformation to a sustainable economy.\nThis Policy covers financing as well as capital market transactions. Previously, the bank had set itself a three-year objective of reducing its loan exposures to coal-fired power plants by 20 percent. It achieved this goal at the end of 2019.\nIn addition, Deutsche Bank has signed the so-called Equator Principles – a risk management framework for assessing the environmental and social risk of financing projects. The principles ensure that strict environmental and social standards are applied during the project development and construction process, including follow-up monitoring. Having already adopted the World Bank Group’s International Finance Cooperation’s (IFC) performance standards, Deutsche Bank’s due diligence process is already indirectly in line with the Equator Principles in the majority of cases.\nThe revised Fossil Fuels Policy and signing the Equator Principles are both components of Deutsche Bank’s sustainability strategy. In May this year, the bank announced its sustainability targets, and it issued its first own green bond in June.\n“Our new Fossil Fuels Policy sets us a strict framework for our business activities in the oil, gas and coal sector,” said Chief Executive Officer Christian Sewing, who also chairs Deutsche Bank’s Sustainability Council. He added: “In its current form, the Policy sets us ambitious targets and enables us to help our long-standing clients with their own transformation. It will allow us to play our part in protecting the climate and helping the EU to achieve its goal of being climate neutral by 2050.”\nThe Policy will help to fulfil the German financial sector’s collective commitment to climate action which the bank signed in June this year, pledging to align its credit portfolios with the goals of Paris Agreement. This includes a commitment to introduce methods of measuring climate impact by the end of 2022 and then regulate them in accordance with national and international climate targets.\nIn addition to new rules covering coal mining activities Deutsche Bank has also set itself a strict framework for coal-fired power, oil and gas and adopted more demanding targets:\nEnergy companies highly dependent on coal to come under review\nDeutsche Bank is also reinforcing its commitment to not finance any new coal-fired power plants. The Policy contains new guidelines for coal power that prescribe how the bank must treat business activities with energy companies that are more than 50 percent dependent on coal, measured either in terms of their energy generating capacity or the amount of energy they actually generate.\nThe bank will only offer financing to these companies in future if they present credible diversification plans. The bank will review its client relationships in this context in Europe and the US by the end of 2020. In Asia, the review will start in 2022. By starting later in Asia, the bank is allowing for the fact that the transformation in Asia will take longer owing to the region’s high dependency on coal power.\nNew limits on financial services for the oil and gas sector\nDeutsche Bank will no longer finance the following projects in the oil and gas sector:\nOil and gas projects that use hydraulic fracturing in countries with scarce water supplies\nNew oil and gas projects in the Arctic region and\nNew oil sand projects (involving exploration, production, transport or processing)\nFurthermore, the bank will perform a systematic review of all its global business activities in the oil and gas sector by the end of 2020 with the aim of subsequently setting limits for its overall business activities in the coming years.\nFor further information, please contact:\nDeutsche Bank AG, Media Relations\nTim-Oliver Ambrosius\n+49 69 910 42648\ntim-oliver.ambrosius@db.com ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 3
}