{
    "url": "https://www.db.com/news/detail/20200723-deutsche-bank-to-plant-40-000-trees-to-support-rural-livelihood-in-maharashtra-india?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "July 23, 2020",
    "tags": [
        "Company",
        "Sustainability"
    ],
    "title": "Deutsche Bank to plant 40,000 trees to support rural livelihood in Maharashtra, India",
    "body": "Deutsche Bank and Swades Foundation announced a partnership to plant 40,000 fruit-bearing trees in the Raigad district of Maharashtra, impacting the lives of over 4,000 people living there.\nThe initiative marks 40 years since Deutsche Bank opened its first branch in the country in Mumbai and also four years of a successful partnership with Swades Foundation in helping transform the lives of tribal and other indigent families in Raigad district. The trees, which will begin bearing fruit in 3-4 years, are expected to generate an annual income of INR6 crore for the beneficiaries.\n“Supporting small-scale agriculture has a significant impact on reducing rural poverty as it offers the most direct route for people in rural areas to benefit from land and labour – their principal assets,” said Kaushik Shaparia, Chief Country Officer, Deutsche Bank India. “We’re confident that our partnership with Swades Foundation will meaningfully transform the lives of people in Raigad district.”\n“Deutsche Bank’s relentless efforts towards rural upliftment in India are noteworthy and we are happy to be part of the shared vision to transform and empower India at a grassroots level. Deutsche Bank has been one of our biggest supporters in rural transformation in the last four years and we look forward to celebrating many more exciting milestones together,” said Ronnie Screwvala, Founder, Swades Foundation.\nDeutsche Bank’s partnership with Swades Foundation, now in its fourth year, has impacted the lives of 43,500 people in the Raigad district of Maharashtra so far and has involved the bank’s employees volunteering over 2,500 hours since April 2018. Through it’s ‘In the Community’ programme, Deutsche Bank has worked with Swades Foundation to touch the lives of over 10,000 rural families, providing sustainable access to clean water in homes as well as in the fields to promote agri-based livelihoods. Greater access to potable water alone has improved the standard of living of over 1,000 families in the district and the more judicious use of the resource has brought over 1,200 acres of additional farmland under irrigation, allowing for greater crop rotation.\nFollowing the outbreak of the Covid-19 pandemic, Deutsche Bank and Swades Foundation have together distributed over 11,000 grocery and daily essentials kits in rural homes in Raigad since April. In Mumbai, the bank has also supported Swades Foundation in providing nine ventilators and 14 oxygen concentrators to Dr R N Cooper Municipal General Hospital and HBT Trauma Care Hospital.\nAbout Deutsche Bank India\nDeutsche Bank has been operating in India since 1980 with a strong presence in the businesses of corporate banking, investment banking, retail banking, private wealth management and global business services. With close to 13,000 staff and operations across various locations in India, the group is recognized as one of the leading foreign financial services providers in the country.\nwww.db.com/india\nAbout Swades Foundation\nSwades Foundation, started by Ronnie & Zarina Screwvala, works in 7 blocks of Raigad district in Maharashtra, India covering 388 Gram Panchayats and approx 2300 village hamlets with a mission to empower 1 million rural Indians every 5-6 years, creating a permanent, irreversible change to rural communities.\nSwades Foundation is also a partner in the Chief Minister’s Village Social Transformation Foundation & has MoUs with the Department of School Education & Sports and the Department of Public Health, Govt. of Maharashtra.\nThe holistic approach covers all aspects of individual and community development through 4 key verticals - Health & Nutrition, Education, Water & Sanitation and Economic Development (https://swadesfoundation.org/impact/).\n\nFor further information contact:\nMedia Contact:\nGeorge Cherian\ngeorge.cherian@db.com\n+91(22)7180-3324",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}