{
    "url": "https://www.db.com/news/detail/20200715-dbsustainability-a-new-deutsche-bank-research-offering-for-esg-investors?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 15, 2020",
    "tags": [
        "Research",
        "Sustainability"
    ],
    "title": "dbSustainability: a new Deutsche Bank Research offering for ESG investors",
    "body": "Deutsche Bank Research is launching dbSustainability, a new offering for clients with research reports designed to help clients identify sustainable investment opportunities and pinpoint the financial implications of broad ESG (Environmental, Social and Governance) themes on the economy, industries and individual companies. This new effort coincides with the increasing efforts by our clients to integrate sustainability frameworks into their investment strategies along with the many policy and regulatory changes driving ESG adoption.\nRecent publications include:\n‘ESG through the pandemic’ by Luke Templeman, Thematic Research, which looks at how ESG investors have seen many mixed signals during the covid-19 crisis and analyses how ESG has performed and changed during the pandemic. Investor intentions, regional flows, and the performance of ESG investments are examined.\n‘Can Mining & Steel sustain in a low carbon world’ by Liam Fitzpatrick, assesses the key decarbonisation challenges facing the Global Mining & Steel sector. The risks for the sector are building. European Steel is facing significant policy uncertainty and higher carbon costs, while Mining is threatened by longer-term substitution trends. It is not all bad news however; the global energy transition will require materials intensive technologies that will boost demand for some metals.\n‘Households' ESG action’ a report from Juliana Lee, Chief Economist, APAC. The Covid-19 pandemic has not weakened households’ commitment to the environment and our surveys suggest that households are increasingly environmentally conscious – spending more on sustainable products, investing in ‘green’ funds, and penalising corporate polluters.\n‘Paper and Packaging ESG Primer: volume 1’, by Debbie Jones, Paper and Packaging analyst provides an overview of the material sustainability themes for the paper and packaging sector, including the frameworks, standards and key third party providers that are important for a company’s ESG scorecard.\nAll the reports mentioned are available to read on https://research.db.com/Research . If you do not have access, please contact a Deutsche Bank sales representative.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}