{
    "url": "https://www.db.com/news/detail/20170228-deutsche-bank-to-launch-new-digital-human-resources-system?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "February 28, 2017",
    "tags": [
        "Company",
        "Digitalisation",
        "Research"
    ],
    "title": "Deutsche Bank to launch new digital Human Resources system",
    "body": "Deutsche Bank today announced that it has signed a contract for the cloud-based human capital management (HCM) system Workday. It will provide real-time information and analytics on topics such as recruitment and talent management and integrate data sources from across the bank.\n\nKarl von Rohr, Chief Administrative Officer of Deutsche Bank and Member of the Management Board, said: “This new people management platform will form an important part of our digital strategy. It will give our leaders the tools and information they need to ensure we have the right people in the right roles while enabling all employees to access career development opportunities anytime, anywhere.”\n\nThe new system will form an important part of the bank’s broader technology strategy of modernizing and simplifying its systems and processes to reduce cost and further strengthen controls.\n\nAs well as reducing Human Resources technology costs, it will lead to four legacy HR systems being retired and eliminate the need to reconcile and produce numerous different sets of data.\n\nEmployees will benefit from a single and easy-to-use system that they can also access on mobile devices.\n\nChano Fernandez, President EMEA and Asia Pacific Japan (APJ), Workday said: “We look forward to supporting Deutsche Bank’s digital strategy with a cutting-edge HR system built to optimise people management and propel business growth.”\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Contact\nChristine Peters\nPhone: +49 (0) 69 / 910 62303\nE-mail: christine.peters@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}