{
    "url": "https://www.db.com/news/detail/20170220-deutsche-bank-appoints-thomas-piquemal-as-chief-country-officer-for-france?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "February 20, 2017",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank appoints Thomas Piquemal as Chief Country Officer for France",
    "body": "Deutsche Bank has appointed Thomas Piquemal as Chief Country Officer for France, in addition to his role as Global Head of Mergers & Acquisitions, effective March 1, 2017. Piquemal succeeds Bruno Hallak, who has decided to leave the bank to pursue other interests. Hallak will stay for a transition period to ensure a smooth handover in the best interests of clients.\nAs France Chief Country Officer, Piquemal will oversee all of the Group’s activities in Paris, which include Corporate & Investment Banking, Global Markets, Deutsche Asset Management and Deutsche Bank Wealth Management. Piquemal will form jointly with Laure Lemonnier (Chief Operating Officer), Julien Fabre and Emmanuel Hasbanian (Co-Heads of Corporate & Investment Banking), Emmanuel Duclos (Head of Global Markets and Financing & Solutions Group), Jérôme Delahaye (Head of Equities), and Joseline Hobson (Head of Deutsche Asset Management), the Deutsche Bank senior management team in France and ensure sound corporate governance and business development.\nFrance is a key component of Deutsche Bank’s strategy and success in Europe. Along with a very committed senior management team, Thomas’ skills and experience gained as a top corporate finance banker over many years and later as CFO of two leading multinational corporations, will be crucial in delivering the best services and results for our clients.\nWe thank Bruno Hallak for his valuable contributions over the last eight years, including almost four years as Chief Country Officer. He has been a trusted advisor to clients while successfully implementing the bank’s global strategy in France.\nAshok Aram, Deutsche Bank CEO for Europe, Middle East and Africa (excluding Germany and the United Kingdom),\nPiquemal joined Deutsche Bank in May 2016 as Global Head of Mergers & Acquisitions and Chairman of CIB France from EDF Group, where he was Group Senior Executive Vice President for Finance. He will continue to report directly to Jeff Urwin, Head of CIB and Member of the Management Board, and will have an additional reporting line for his country responsibilities to Aram.\nWith over 220 employees, Deutsche Bank in France is a leading player in markets, corporate finance and commercial banking, with a growing franchise in asset management and wealth management. As one of the top international banks in France, Deutsche Bank possesses significant strengths such as its leadership in French initial public offerings where it is the only bank to have led 15 of the top 17 French IPOs since 2013. Deutsche Bank was named best international investment bank in France in 2012, 2014 and 2015 by Leaders League, the media and rating agency",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}