{
    "url": "https://www.db.com/news/detail/20170217-munich-security-conference-managing-threats-in-an-urban-age?language_id=1",
    "language": "EN",
    "article_type": "Event",
    "publish_date": "February 17, 2017",
    "tags": [
        "Corporate Citizenship",
        "Sustainability"
    ],
    "title": "Munich Security Conference",
    "body": "Cities – usually engines of growth, progress, and personal freedom – and their citizens have become vulnerable targets of terrorism. How do security threats affect communities and social cohesion in cities? Are there common approaches to respond to such threats, be it in Paris, London, Berlin, or any other city?\nIn the context of this year’s Munich Security Conference (MSC), Alfred Herrhausen Gesellschaft (AHG), LSE Cities and MSC jointly organised a side event on urban security issues on Friday evening, February 17, 2017. In an informal and intimate atmosphere, participants of the Munich Security Conference, leading security experts, political decision-makers and experts from academia and civil society discussed a shift in politics in increasingly complex urban settings.\nModerator Ricky Burdett, Professor of Urban Studies at London School of Economics and Political Science (LSE) and Director of LSE Cities, hosted the panel with Professor Mary Kaldor, Director of the Centre for Global Governance at the LSE, Alaa Murabit, Founder and President, “The Voice of Libyan Women”, Arndt Freiherr Freytag von Loringhoven, Assistant Secretary General for Intelligence and Security, NATO, and Arvind Gupta, Indian Deputy National Security Adviser.\nThe guiding questions at the outset of the discussion were: What makes cities resilient? How can authorities work together to respond to the broad risk spectrum of terrorism? What is the role of technology in all this?\nOpinion\nIn her welcoming remarks, AHG’s Executive Director Anna Herrhausen referred to the notion of the cities as “places of intellectual emancipation, of cultural diversity, of economic opportunity”, but she also pointed to the flipside of cities’ success story: “More often they are also places of extreme inequality, of poverty, of war even. Cities – or better, the civilians that live in them – are easy targets for those groups who disagree with the mostly liberal values that are championed in them.”\nProfessor Kaldor explained that “new wars” are increasingly fought in cities as opposed to on battlefields. Accordingly, civilians, not soldiers become targets; their forced displacement becomes a means to achieve political wins.\nThe panellists tentatively agreed that in conflict zones, a possible path towards more security could be to build on urban capabilities and the civic tradition that is rooted in urban life. Interventions such as zones and checkpoints, on the other hand, proved to be less effective – if not counterproductive. Strengthening civic traditions was also seen as most promising in preventing cities from becoming breeding grounds for radicalization and terrorism.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}