{
    "url": "https://www.db.com/news/detail/20170202-a-message-from-john-cryan-on-deutsche-bank-s-financial-results-2016?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 2, 2017",
    "tags": [
        "Company",
        "Financial Results",
        "Management & Leadership"
    ],
    "title": "A message from John Cryan on Deutsche Bank's financial results 2016",
    "body": "Dear Colleagues,\nIn many of my e-mails over the past year, I wrote about how tough our environment was: low interest rates, difficult markets and, on top of that, the US Department of Justice’s initial settlement proposal of 14 billion dollars, which triggered substantial concerns. All of these factors left their mark on our results, as indeed did the actual settlement.\nFor the fourth quarter of 2016, we therefore had to post a pre-tax loss of 2.4 billion euros. This stems from the fact that we are resolving legacy matters and systematically cleaning up the bank: litigation charges, impairments, restructuring and severance charges as well as de-risking costs of the Non-Core Operation Unit (NCOU) added up to 2.9 billion euros.\nThese were offset by a one-time gain of 0.8 billion euros from the sale of our stake in Hua Xia Bank.\nFor the full year, our pre-tax loss came to 0.8 billion euros. All in all, the negative one-off impacts I just mentioned came to 5.8 billion euros, and were offset by positive one-time gains from disposals of around 1 billion euros. So you can see that our operating business is actually doing distinctly better than our bottom line results indicate.\nDespite this loss, the year 2016 was not a bad one for Deutsche Bank. For my Management Board colleagues and me, it was actually very encouraging for two reasons. First, the bank emphatically demonstrated its resilience. After the turbulent weeks in September and October, we managed to change sentiment in some areas in our favour.\nThat’s evident in the deposits of our private and commercial clients in Germany. In October we saw outflows, but in November and December these reversed. By year end, deposits were higher than at the beginning of the year. Most critically, since we announced the settlement in principle with the Department of Justice in December, we have seen meaningful reengagement by those clients who had pulled back in the autumn.\nAnd that is evident in the promising start we have seen to the year. In important areas of our bank, business is distinctly better than in January of last year, for example, in our capital markets business.\nThis resilience is essentially thanks to you. I’d like to take this opportunity, on behalf of the Management Board, to express our heartfelt thanks for your exceptional efforts and performance.\nThere is a second reason why 2016 was encouraging to me: we made great progress in putting our legacy matters behind us and in rebuilding the bank. In other words, we didn’t just promise an ambitious programme – we delivered on it too. Let me give you a few examples:\n— The work of our NCOU is materially completed. Since mid-2012 it has reduced risk weighted assets by over 90 percent from their original level of 128 billion euros. As a result, we were able to close this unit, on schedule, at the end of 2016. This enables us to remove a source of uncertainty which was a negative burden of 3.2 billion euros on our 2016 pre-tax result, including litigation costs.\nAt the same time, and even more importantly, despite its losses, the NCOU freed up about 8.5 billion euros in core capital over the years. This was a huge effort, and success was by no means assured, so I would like to congratulate the NCOU team on this success.\n— We made good progress in restructuring our private and commercial banking operations in Europe. Following intensive preparations, we have already merged some branches in Germany and will be closing a further 181 branches in 2017. On the other hand, we opened the first of eight new Advisory Centres which customers can use in the evenings and at weekends. Finally, we are offering an expanded and improved advisory service through our digital channels. As part of this, it is now possible to open an account with us online in less than ten minutes.\n— Deutsche Bank’s financial strength is greater than at any time in recent history. We raised our Common Equity Tier 1 capital ratio (fully loaded) to 11.9 percent, its best level in the past three years. We exceed current regulatory minimum requirements, with a buffer of more than 11 billion euros.\nOur liquidity reserves also grew by around 10 percent in the fourth quarter, from 200 billion euros to 218 billion euros. Market risk and credit risk both remain low by historical standards.\n— The bank has also become more secure because we strengthened our internal controls. In 2016, we hired more than 350 additional staff members in our Compliance and Anti-Financial Crime departments, and over 600 more will follow this year.\n— Our IT infrastructure is more stable and modern than ever. We have already decommissioned seven of our 45 core operating systems and are ahead of schedule in this. Our ultimate aim is to have only four core operating systems.\n— We have also built up our global innovation network. This includes our Digital Factory in Frankfurt-Sossenheim, our Data Lab in Dublin and Innovation Labs in Berlin, London and Palo Alto. We are working with the Massachusetts Institute of Technology (MIT) in Boston and the startup incubator Axel Springer Plug & Play in Berlin.\n— Last but not least, we made a lot of progress resolving litigation matters. Last year and over the past few weeks in particular, we have resolved important legal matters including civil cases related to US residential mortgage-backed securities and precious metals, a long-running legal case with the Icelandic bank Kaupthing and parts of the Russia-related proceedings about our anti-money laundering controls.\nThe last point, in particular, comes as a great relief to us. All of the legal matters have heavily impacted the reputation of our bank and made our work more difficult. We, the Management Board members, and the bank’s senior management as a whole, are absolutely determined to do everything we can to prevent a repetition of such incidents.\nWe also recognise that our bank bears a particular responsibility for the incidents that occurred in past years – and I will say more about this at our Annual Media Conference today.\nLet’s restore Deutsche Bank, this institution so rich in tradition, to its former strength. We want to be a bank that contributes to economic growth and to the good of the community. A bank that can generate a positive impact – for its clients, employees, investors and society.\nWith best wishes,\nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}