{
    "url": "https://www.db.com/news/detail/20230731-deutsche-bank-expands-investment-banking-capabilities-and-re-enters-debt-capital-market-in-south-korea?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 31, 2023",
    "tags": [
        "Asia-Pacific",
        "Investment Banking"
    ],
    "title": "Deutsche Bank expands investment banking capabilities and re-enters debt capital market in South Korea",
    "body": "Deutsche Bank has today announced its expansion of investment banking capabilities in South Korea and re-entry of the local debt capital market by making strategic appointments to the business.\nThe bank has hired Adele Moon as Head of DCM for South Korea, signifying its re-entry to the space after five years. Based in Seoul, she will focus on expanding Deutsche Bank’s client footprint, complementing its strong advisory business. Adele will report regionally to Ed Tsui, Head of North Asia, DCM.\nAdele was previously Head of Korea DCM for Mizuho Securities Asia in Hong Kong. During her time there, she worked on a range of transactions for clients including KEXIM, KDB, Hana Bank, Hyundai Motors and Posco. Prior to Mizuho, she worked at Royal Bank of Scotland, Daiwa Securities and Salomon Investments & Securities in Seoul.\nDeutsche Bank also recently hired Shinna Oh for its investment banking coverage team in Seoul, to further develop relationships with corporates and global sponsors. Shinna joined from Credit Suisse and has worked with Samsung Group, Hyundai Motor Group and Lotte Group.\nThe bank has also appointed Samuel Kim as chairman of M&A for Asia Pacific, who will join from Morgan Stanley in Hong Kong. Samuel has extensive experience with South Korean financial sponsors and conglomerates and will bring deep relationships to the bank. He has worked with MBK Partners on a number of transactions and advised on the sale of Woowa Brothers and the acquisition of Hugel. He has also advised Carlyle on the sale of ADT Caps.\nDeutsche Bank has a 45-year history in South Korea, after launching its local presence in 1978. The bank offers a range of investment banking solutions including financing, advisory, fixed income and currencies, as well as a focused equity capital markets business, in addition to debt capital markets. It also provides corporate banking (global transaction banking) as well as asset management through Deutsche Bank’s subsidiary, DWS.\nDeutsche Bank Chief Country Officer for South Korea, Sungeun Ahn said: “We are confident in the opportunity that South Korea holds and have expanded our investment capabilities accordingly. Our commitment to the country and growing our M&A franchise is reflected by the senior appointment of Samuel Kim, who brings deep knowledge of the South Korean market to his regional role.\"\nOur first priority is our clients, and we are pleased that we can offer them broad market access and expertise to help with their growth strategies. \nSungeun Ahn\nDeutsche Bank Head of Capital Markets for Asia Pacific, Haitham Ghattas said: “We are pleased to re-enter the South Korean debt capital market. This is an important step that will extend our regional DCM presence to eight geographic locations and enable us to support a wide range of South Korean clients in accessing global debt capital markets. I am confident that Adele’s leadership and expertise coupled with our strong local coverage will drive our business in South Korea forward.”",
    "number_of_ratings": 3,
    "rating": 5.0,
    "likes": 2
}