{
    "url": "https://www.db.com/news/detail/20230728-deutsche-bank-demonstrates-improved-resilience-in-2023-eba-stress-test?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 28, 2023",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank demonstrates improved resilience in 2023 EBA stress test",
    "body": "In the 2023 EU-wide stress test conducted by the European Banking Authority (EBA), Deutsche Bank met the minimum supervisory requirements in both the baseline and adverse scenarios. Deutsche Bank’s capital ratios proved stronger than in the previous EBA stress test in 2021, despite a more severe ‘adverse’ scenario than in any previous stress test by the EBA.\nDeutsche Bank's Common Equity Tier 1 (CET1) capital ratio of 8.1% in the ‘adverse’ scenario remained more than 200 basis points above the minimum supervisory requirement of 6.0% at the end of the three-year stress period of 2023-5. In the ‘baseline’ scenario, the bank achieved a 2025 CET1 capital ratio of 15.0%, around 390 basis points above supervisory requirements of 11.1%.\nDeutsche Bank’s 2023 results represent an improvement over the bank’s 2021 stress test results on several dimensions:\nThe positive contribution of earnings before stress impacts is higher than in 2021, reflecting the bank’s significantly improved profitability\nThe overall impact of the adverse scenario on the CET1 capital ratio is a 5.3% decline, down from 6.1% in the 2021 stress test, indicating greater resilience in hypothetical stress conditions\nThe CET1 capital ratio in the third year of the adverse scenario, of 8.1%, is stronger by some 50 basis points compared to 7.6% in the 2021 exercise.\n“The 2023 stress test underlines how Deutsche Bank has improved its resilience in potential conditions of stress. We emerge stronger, despite a more rigorous stress test than ever, with our capital ratios higher than in the last exercise,” said Chief Financial Officer James von Moltke. “Successful transformation has given us greater earnings power and organic capital accretion which contribute positively to this outcome.”\nThe stress test is based on a common scenario definition and methodology for all participating banks. The balance sheet as of December 31, 2022, and the profits for the 2022 financial year were used as a basis. The stress test does not take account of potential management measures to mitigate adverse shocks.\nThe macro-economic specifications for the adverse scenario were significantly more rigorous in 2023 than in previous EBA stress tests. Assumptions include a three-year recession from year-end 2022 with a delayed recovery in the third year (2025); a 4.1 percentage point increase in unemployment; a 6.4% cumulative three-year decline in German Gross Domestic Product; and declines in German real estate prices by 26% (residential) and 33% (commercial) over the three-year stress period.\nDeutsche Bank’s results in detail (all ratios in %, fully loaded):\nBaseline scenario\nSupervisory\nrequirement\n2023 2024 2025\nCET1 Ratio 11.13 14.39 14.86 15.01\nTier 1 Ratio 13.14 16.73 17.19 17.31\nTotal Capital Ratio 15.81 19.74 20.17 20.27\nLeverage Ratio transitional 3.75 4.90 5.07 5.16\nAdverse scenario\nRegulatory minimum\nrequirement\n2023 2024 2025\nCET1 Ratio 6.02 8.01 8.19 8.08\nTier 1 Ratio 8.03 9.96 10.13 9.90\nTotal Capital Ratio 10.70 12.54 12.68 12.28\nLeverage Ratio transitional 3.00 3.51 3.58 3.73\nDetails of Deutsche Bank's results are available on the EBA's website.",
    "number_of_ratings": 3,
    "rating": 4.0,
    "likes": 5
}