{
    "url": "https://www.db.com/news/detail/20230726-a-message-from-christian-sewing-on-q2-results-2023?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 26, 2023",
    "tags": [
        "Financial Results"
    ],
    "title": "A message from Christian Sewing on Q2 results 2023",
    "body": "Dear Colleagues,\n\nThe second quarter financial results we published today require a closer look to see the main developments. The central message, though, is that we have once again delivered a strong operating performance from April to June, continuing our upward trend of recent years. This is reflected in revenues, which increased by 11 percent year on year to 7.4 billion euros – the highest for a second quarter since 2016.\nBy contrast, our pre-tax profit fell 9 percent to 1.4 billion euros compared to a year ago. That however was due to extraordinary costs that are not directly related to our ongoing business operations. If you strip those out, our pre-tax profit in the second quarter was 25 percent higher than in the previous year.\nThese non-operating expenses are mainly costs for legal cases and restructuring – a total of 655 million euros and over half a billion euros more than in the same period last year. Despite this burden, for the first six months in 2023, we were able to slightly increase our pre-tax profit over the prior year period to 3.3 billion euros – the best result in 12 years.\nThis proves once again how strong our bank is – in all areas:\nThe Corporate Bank increased revenues by 25 percent in the second quarter – with double-digit growth rates in all business areas. The business banking segment, which focuses on smaller corporate clients, increased revenues by a remarkable 78 percent. At the same time, the Corporate Bank significantly improved its profitability: the post-tax return on tangible equity was a very solid 14.8 percent. This is impressive. Congratulations!\nIn the Investment Bank, revenues fell by 11 percent – but this compares to a prior-year quarter which saw extreme market activity in the wake of uncertainty surrounding the war in Ukraine. Among our peers, we can absolutely hold our own with these results and we have further increased our market share in some core areas. Our financing business once again proved to be very stable, and revenues in Origination & Advisory, which plays a key role in our growth strategy, increased by 25 percent.\nThe Private Bank generated 11 percent higher revenues compared to the same quarter last year, with particularly strong growth in our German home market at 16 percent. Well done here, too! The foundation for further growth is now laid, with net inflows of almost 7 billion euros and what we expect to be continued interest rate tailwinds for the coming quarters. At the same time, we reached the last major milestone in the IT merger of Deutsche Bank and Postbank at the end of the second quarter, having migrated 12 million Postbank clients to the joint IT platform. It was a great team effort involving business and infrastructure units and one that cannot be overstated.\nAsset Management continues to benefit from a high level of client demand. From April to June, DWS saw more than 9 billion euros in net inflows – primarily in passive and alternative investment products. This was significantly more than in the first quarter, which was already very good. We are now in a good position to grow again as the financial markets improve, following a 6 percent revenue decrease in the second quarter.\nAll of this underlines the advantages of our balanced business model, with four divisions that complement each other excellently. This gives us strength and it gives us stability, both of which are particularly in demand in current times. The results for the second quarter impressively underpin our resilience: we were able to increase our Common Equity Tier 1 capital ratio to 13.8 percent, we have ample liquidity reserves and our deposits rose slightly again in the second quarter.\nThis, as well as growing business volumes, is a clear sign of how much our clients trust us. And we have also recently received important votes of confidence from other stakeholders: the rating agencies Fitch and DBRS both upgraded us once again in June. And yesterday the European Central Bank approved our plans to buy back up to 450 million euros of our own shares, which will allow us to distribute further capital to our shareholders as promised. This shows that our regulators also recognise the strength and stability of our bank.\nFrom this position of strength, we can now continue to work on the tasks we have set ourselves to accelerate our growth trajectory. We have already made good progress along this path in the past quarter: our revenue growth is well above the 3.5 to 4.5 percent that we set ourselves as a target for compound annual growth by 2025. And we have laid the foundation for further growth, for example through selective hiring, the acquisition of the British corporate broker Numis and through our cooperation with Miles & More. At the same time and as planned, we are using our capital more efficiently. In the second quarter we accelerated securitisation transactions which helped to release risk weighted assets (RWA) of around 3 billion euros. By 2025, we are aiming for structural RWA reductions of 15 to 20 billion euros.\nFinally, we are also making good progress in reducing costs. Of the additional 2.5 billion euros that we want to save, we have either already realised or implemented numerous necessary measures to enable over 1 billion euros of cost reductions. In addition, we have identified further concrete steps to improve operational efficiency at all levels. I am aware that this also means making some tough decisions, but we are operating in an environment with significantly rising prices, which is another reason why we must maintain rigid discipline when it comes to our costs. It is the only way we can create the financial leeway to continue investing in our business and future growth.\nBefore that I would like to take this opportunity to thank you on behalf of the Management Board for another strong quarter, a really successful first half-year and especially for your undiminished commitment. The momentum is on our side: we have a strong business model and a strategy that works. Quarter for quarter, we have proven how much earnings power there is in our bank, and we are making good progress in terms of profitability. We can also be very proud of our employees. It is in our hands to move our bank forward. Together, let us do all we can to seize this opportunity.\nBest wishes,\nChristian Sewing",
    "number_of_ratings": 10,
    "rating": 4.6,
    "likes": 19
}