{
    "url": "https://www.db.com/news/detail/20230726-deutsche-bank-reports-on-the-second-quarter-results-of-2023?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 26, 2023",
    "tags": [
        "Financial Results"
    ],
    "title": "Deutsche Bank reports profit before tax of € 3.3 billion in the first half year of 2023, highest since 2011",
    "body": "Profit before tax of € 3.3 billion in the first half year, up 2% year on year, despite higher nonoperating costs¹\nProfit before tax excluding nonoperating costs up 21% to € 4.0 billion\nNet revenues up 8% year on year to € 15.1 billion\nNoninterest expenses up 8% to € 11.1 billion including nonoperating costs of € 744 million; adjusted costs1 up 2% to € 10.3 billion\nPost-tax profit of € 2.3 billion, down 7%, reflecting a higher tax rate\nPost-tax return on tangible equity (RoTE)1 of 6.8%, cost/income ratio of 73%\nAssuming equal apportionment of 2023 bank levies and excluding nonoperating costs, post-tax RoTE1 of 9.3% and cost/income ratio of 67%\nNet inflows of € 28 billion across the Private Bank and Asset Management\nSecond-quarter profit before tax of € 1.4 billion, down 9% year on year after nonoperating costs of € 655 million\nExcluding non-operating costs, profit before tax of € 2.1 billion, up 25%\nPost-tax profit of € 940 million\nPost-tax RoTE1 of 5.4%, cost/income ratio of 76%\nAssuming equal apportionment of 2023 bank levies and excluding nonoperating costs, post-tax RoTE¹ of 8.1% and cost/income ratio of 68%\nDouble-digit revenue growth and business growth in the second quarter\nNet revenues up 11% year on year to € 7.4 billion\nNet inflows of € 16 billion across the Private Bank and Asset Management\nSecond-quarter noninterest expenses of € 5.6 billion, up 15% year on year\nAdjusted costs up 4% to € 4.9 billion\nNonoperating costs include € 395 million in litigation charges and € 260 million in restructuring & severance related to execution of strategy\n2023 share buybacks approved and capital distribution goals reaffirmed\n€ 450 million repurchase programme through year-end 2023\nTotal anticipated capital distributions of € 1.75 billion over 2022-23 \nResilient capital and balance sheet in the second quarter\nCommon Equity Tier 1 (CET1) ratio of 13.8%\nDeposits rise by € 1 billion to € 593 billion\nLiquidity coverage ratio of 137%, a surplus of € 55 billion\nIn the first half of 2023 we again demonstrated good growth momentum across a diversified business portfolio, underlying earnings power and balance sheet resilience. This puts us on a good track towards our 2025 financial targets. Our planned share repurchases enable us to deliver on our goals to distribute capital to our shareholders. We are determined to continue on this path while accelerating the execution of our Global Hausbank strategy as we promised. \nChristian Sewing, Chief Executive Officer\nDeutsche Bank (XETRA: DBGn.DB / NYSE: DB) today announced profit before tax of € 1.4 billion for the second quarter of 2023, down 9% compared to the second quarter of 2022. Results in the quarter include € 655 million of nonoperating costs, comprising € 395 million of litigation charges relating mainly to longstanding matters and € 260 million in restructuring and severance relating to the accelerated execution of the bank’s strategy. In the prior year quarter, nonoperating costs were € 102 million. Excluding nonoperating costs in both periods, profit before tax would have been € 2.1 billion, up 25% year on year.\nSecond quarter post-tax profit was € 940 million, compared to € 1.2 billion in the prior year quarter, partly reflecting an effective tax rate of 33%, compared to 22% in the prior year quarter. Certain litigation charges in the second quarter of 2023 were non-tax deductible, while the tax rate in the prior year quarter benefited from the geographical mix of income. \nThe bank’s key ratios also reflected nonoperating costs in the quarter. Post-tax return on average tangible shareholders’ equity (RoTE)¹ was 5.4%, compared to 7.9% in the second quarter of 2022, and post-tax return on average shareholders’ equity (RoE) was 4.9%, down from 7.1% in the prior year quarter. The cost/income ratio was 76%, up from 73% in the prior year quarter. Assuming an equal apportionment of 2023 bank levies and excluding nonoperating costs, post-tax RoTE1 would have been 8.1% and the cost/income ratio would have been 68%.\nFor the first six months, profit before tax was € 3.3 billion, up 2% year on year and the highest first-half figure since 2011, despite absorbing nonoperating costs of € 744 million, up from € 95 million in the first six months of 2022. Excluding these nonoperating costs in both periods, profit before tax would have been € 4.0 billon in the first half of 2023, up 21% from € 3.3 billion in the prior year period.    \nKey ratios: a clear path toward 2025 targets\nPost-tax profit in the first half year was € 2.3 billion, down 7% year on year. This development reflected an effective tax rate of 31%, which included the impact of the aforementioned non-deductible litigation charges, compared to 24% in the first six months of 2022.  Post-tax RoTE¹ was 6.8%, compared to 8.0% in the prior year period, and post-tax RoE was 6.1%, down from 7.2% in the prior year period. The cost/income ratio was 73%, essentially unchanged from the prior year period.\nDeutsche Bank’s results for the first six months of 2023 include bank levies of € 475 million, predominantly recognised in the first quarter. Assuming an equal distribution of the annual bank levy across the four quarters of 2023, and a six-month pro rata (six-twelfths) share in the first half year, post-tax RoTE¹ would have been 7.4% and the cost/income ratio would have been 72%.\nAssuming an equal distribution of the annual bank levy across the four quarters of 2023 and excluding nonoperating costs, post-tax RoTE¹ would have been 9.3%, close to the bank’s 2025 target for a post-tax RoTE¹ of above 10%. The cost/income ratio would have been 67%, on the path towards the bank’s 2025 target of below 62.5%. Deutsche Bank reaffirmed its 2025 targets for post-tax RoTE¹ and cost/income ratio.\nJames von Moltke, Chief Financial Officer, said: “These results clearly demonstrate the benefits of Deutsche Bank’s successful transformation. We have built a focused and well-balanced franchise, we have proven our resilience, and we are delivering strong organic capital generation. This enables us both to invest in further business growth and deliver returns to our shareholders.”\nShare buybacks approved and capital distribution plans reaffirmed\nAs announced on July 25, 2023, Deutsche Bank has received supervisory approvals for further share repurchases of up to € 450 million by year-end 2023. The bank plans to commence these repurchases in August. Anticipated 2023 share repurchases are 50% higher than in 2022, consistent with the 50% dividend growth already delivered in respect of the financial year 2022. The bank aims for total share repurchases and dividends of over € 1 billion in 2023, bringing total distributions to shareholders over 2022 and 2023 to approximately € 1.75 billion.\nDeutsche Bank reaffirmed its capital objectives of € 8 billion in capital distributions for the financial years 2021-2025; 50% dividend growth per year in respect of the financial years 2022-2024, and a 50% payout ratio from 2025.\nProgress on accelerated execution of the Global Hausbank strategy\nDeutsche Bank made progress in accelerating execution of its Global Hausbank strategy on all dimensions during the quarter:\nOperational efficiency: Deutsche Bank aims for incremental operational efficiencies of € 2.5 billion annually predominantly by 2025. By the end of the first half of 2023, efficiencies totalling approximately € 1 billion were either already achieved or expected from measures completed. This includes over € 600 million in efficiencies already delivered through measures including branch closures in the Private Bank, standardising loan processing and other measures in the Corporate Bank and Investment Bank, and simplifying technology infrastructure; a further € 300 million in annual savings are expected, from 2025 onwards, from the migration of some 12 million Postbank clients onto the Deutsche Bank technology platform which is now complete; and over € 100 million per year in savings are expected from reductions in non-client facing staff, where approximately 80% of impacted staff have either been informed or have departed. A significant portfolio of additional initiatives is underway and the bank reaffirms its € 2.5 billion target for annual incremental operational efficiencies.\nCapital efficiency: Deutsche Bank aims for capital efficiencies of € 15-20 billion in risk weighted assets (RWAs) by 2025, with modest revenue impact, by 2025. In the second quarter, the bank accelerated securitisations and delivered RWA relief of around € 3 billion in the Corporate Bank. In addition, credit risk RWAs were reduced as part of the Trade Finance and Lending optimization efforts during the quarter, while the business continued to deliver revenue growth. Further optimization measures in preparation for the second half of 2023 include securitisations and reductions in sub-hurdle lending.\nRevenue growth: Deutsche Bank delivered year-on-year revenue growth of 11% in the second quarter and 8% in the first half of 2023, substantially outperforming its original target of 3.5 – 4.5% in compound annual growth from 2021. The bank made strategic hires in capital-efficient businesses, announced the acquisition of Numis, the UK corporate broker, and was selected as issuing partner for Miles & More, Europe’s leading loyalty programme. The Private Bank and Asset Management together attracted € 28 billion in net inflows in the first half of 2023 including € 16 billion in the second quarter.\nRevenues: outperforming strategic targets\nNet revenues were € 7.4 billion, up 11% year on year, in the second quarter and € 15.1 billion, up 8%, in the first six months of 2023. Revenue development by business was as follows:\nCorporate Bank net revenues were € 1.9 billion in the second quarter, up 25% year on year. All segments delivered double-digit growth, driven by strong net interest income and continued pricing discipline. Revenues in Corporate Treasury Services were up 14% to € 1.1 billion, Institutional Client Services revenues rose 25% to € 492 million, and Business Banking revenues grew 78% to € 376 million. Deposits increased by € 2 billion during the quarter to € 271 billion. For the first six months, net revenues were up 30% to € 3.9 billion. Corporate Treasury Services revenues were up 23% to € 2.3 billion, Institutional Client Services revenues rose 26% to € 939 million, and Business Banking revenues rose 68% to € 713 million.\nInvestment Bank net revenues were € 2.4 billion in the quarter, down 11% year on year. FIC Sales & Trading (FIC) revenues declined by 10% to € 2.1 billion. Strong growth in Credit Trading and growth in Financing revenues was more than offset by lower revenues in Rates, Foreign Exchange and Emerging Markets compared to a very strong prior year quarter. Origination & Advisory revenues were 25% higher year on year at € 291 million, as Debt Origination benefited from the non-recurrence of leveraged lending markdowns in the prior year quarter which more than offset year-on-year declines in Equity Origination and Advisory revenues. For the first six months, net revenues were € 5.1 billion, down 15%. Revenues in FIC were € 4.5 billion, down 14%, while revenues in Origination & Advisory declined 13% to € 618 million. \nPrivate Bank net revenues in the second quarter were € 2.4 billion, up 11% year on year. Growth was driven by higher revenues from deposit products, driven by higher net interest margins, partly offset by lower fee income and lower loan revenues in an environment of higher interest rates. Revenues in the Private Bank Germany grew 16% to € 1.5 billion, while revenues in the International Private Bank rose 4% to € 865 million, or 6% if adjusted for the non-recurrence of revenues of approximately € 15 million following the sale of Deutsche Bank Financial Advisors in Italy in the fourth quarter of 2022. Assets under Management rose by € 10 billion to € 541 billion during the quarter, driven largely by net inflows of € 7 billion which included inflows into investment products of € 4 billion and deposits of € 3 billion. For the first six months, net revenues were up 10% to € 4.8 billion. Revenues in the Private Bank Germany rose 15% to € 3.1 billion, while revenues in the International Private Bank were € 1.8 billion, up 3%, or up 5% if adjusted for the non-recurrence of around € 30 million in revenues from the aforementioned prior year business disposal in Italy. Assets under Management were € 541 billion, up by € 23 billion in the first six months, driven in part by net inflows of € 13 billion.\nAsset Management net revenues were € 620 million in the second quarter, down 6% year on year. This development principally reflected a 6% decline in management fees to €580 million, reflecting lower average assets under management compared to the prior year period, and higher allocated funding charges, partly offset by a 82% rise in performance and transaction fees to € 57 million, driven largely by Alternatives. Assets under management rose by € 19 billion to € 859 billion during the quarter. This growth included net inflows of € 9 billion, or € 10 billion ex-Cash, driven predominantly by Passive and Alternatives, compared to net outflows of € 25 billion in the second quarter of 2022. For the first six months, net revenues were € 1.2 billion, a decline of 10% compared to the first six months of 2022, partly reflecting a 7% decline in management fees and the aforementioned rise in allocated funding charges, which more than offset a rise of 18% in performance and transaction fees. Assets under management grew by € 38 billion, compared to a decline of € 94 billion in the first six months of 2022; net inflows were € 15 billion, or € 19 billion ex-Cash, compared to net outflows of € 26 billion in the prior year period.\nNoninterest expenses impacted by nonoperating costs, while adjusted costs remain within guidance range\nNoninterest expenses were € 5.6 billion in the second quarter, up 15% year on year. This development primarily reflected nonoperating costs of € 655 million, up from € 102 million in the prior year quarter, and comprising € 395 million in litigation charges relating mainly to longstanding matters and € 260 million in restructuring & severance relating to accelerated execution of the bank’s Global Hausbank strategy. Adjusted costs, which exclude these items, were € 4.9 billion, reflecting a monthly run-rate within the bank’s guidance range, and up 4%, below the rate of inflation despite the cumulative impact of investments in technology and controls in recent periods.\nFor the first six months, noninterest expenses were € 11.1 billion, up 8%. The year-on-year increase was driven by nonoperating costs of € 744 million, up from € 95 million in the first half of 2022. Adjusted costs for the first six months were € 10.3 billion, up 2% from the prior year period despite continued investments and inflationary headwinds.\nThe workforce rose by 343 internal full-time equivalents (FTEs) to 87,055 during the quarter, including the internalisation of 276 external FTEs. Hires into business growth and control functions were largely offset by leavers during the quarter, which included around 500 FTEs from the technology centre in Russia and departures related to the aforementioned reduction in non-client facing staff as part of the bank’s operational efficiency initiatives.\nCredit provisions: growth reflects a more challenging environment\nProvision for credit losses was € 401 million in the second quarter, up from € 372 million in the first quarter. Stage 1 and 2 provisions were € 63 million, compared to releases of € 26 million in the previous quarter, reflecting portfolio and rating movements, notably in the Investment Bank. Provision for non-performing (stage 3) loans was € 338 million, down from € 397 million in the previous quarter, partly reflecting a non-recurrence of provisions relating to a small number of idiosyncratic events in the International Private Bank in the previous quarter.\nFor the first six months, provision for credit losses was € 772 million, or 32 basis points of average loans (bps). For the full year 2023, Deutsche Bank expects provisions for credit losses to be at the higher end of its communicated range of 25-30 bps, reflecting an uncertain macro-economic environment. \nCapital and liquidity in line with goals\nThe Common Equity Tier 1 (CET1) capital ratio was 13.8% at the end of the second quarter, up from 13.6% at the end of the first quarter, above the bank’s 2025 capital objective of around 13%. The quarter-on-quarter development largely reflected the positive impact on capital of strong earnings, together with a slight decline in risk weighted assets during the quarter. These positive factors more than offset deductions for dividends and AT1 coupons.\nThe Leverage ratio was 4.7% in the quarter, up from 4.6% in the previous quarter. Leverage exposure was € 1,236 billion at the end of the second quarter, essentially unchanged from the first quarter.\nLiquidity reserves were € 244 billion at the end of the second quarter, up from € 241 billion at the end of the first quarter, including High Quality Liquid Assets of € 204 billion. The Liquidity Coverage Ratio was 137%, above the regulatory requirement of 100%, representing a surplus of € 55 billion. The Net Stable Funding Ratio was 119%, within the bank’s target range of 115-120%, representing a surplus of € 97 billion above required levels.    \nSustainable Finance: further progress toward accelerated targets\nEnvironment, Social and Governance (ESG)-related financing and investment volumes² were € 17 billion ex-DWS in the quarter, bringing the cumulative total since January 1, 2020 to € 254 billion, including € 39 billion in the first half of 2023. Deutsche Bank is now more than halfway towards its target for a cumulative total of over € 500 billion ex-DWS by the end of 2025.\nIn the second quarter, Deutsche Bank’s businesses contributed as follows:\nCorporate Bank: € 4 billion in sustainable financing, raising the Corporate Bank’s cumulative total since January 1, 2020 to € 47 billion. In May, Deutsche Bank was named “Best Bank for ESG 2023” for its ESG-related trade and supply chain finance programmes at the Global Trade Review Leaders in Trade awards\nInvestment Bank: € 10 billion in sustainable financing and capital market issuance, for a cumulative total of € 152 billion since January 1, 2020. Deutsche Bank acted as joint ESG coordinator on the State of Hesse’s € 1 billion 10-year green benchmark, the largest green bond issuance by a German State to date, and as Coordinating Lead Arranger and Joint Bookrunner in the closure of a new revolving credit facility of up to $ 800 million to support the expansion of Intersect Power LLC clean energy platform\nPrivate Bank: € 2 billion growth in ESG assets under management and a further € 1 billion in ESG new client lending, raising the Private Bank’s cumulative total to € 56 billion since January 1, 2020\nDuring the second quarter, Deutsche Bank published a white paper, Residential Real Estate – Leading to Net Zero, which outlines the bank’s strategy for reducing emissions in its European residential real estate portfolio and helping homeowners increase the energy efficiency of their residences. Chief Executive Officer Christian Sewing joined the Principals Group of the Glasgow Financial Alliance for Net Zero (GFANZ).\nGroup results at a glance\n¹For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ on pp 15-20 of the second quarter 2023 Financial Data Supplement and “Non-GAAP financial measures” on pp. 95-101 of the second quarter 2023 Interim Report, respectively\n²Cumulative ESG volumes include sustainable financing (flow) and investments (stock) in the Corporate Bank, Investment Bank and Private Bank from January 1, 2020 to date, as set forth in Deutsche Bank’s Sustainability Deep Dive of May 20, 2021. Products in scope include capital market issuance (bookrunner share only), sustainable financing and period-end assets under management. Cumulative volumes and targets do not include ESG assets under management within DWS, which are reported separately by DWS.\nAnalyst call\nAn analyst call to discuss second quarter 2023 financial results will take place at 11:00 CEST today. The Interim Report, Financial Data Supplement (FDS), presentation and audio webcast for the analyst conference call are available at: www.db.com/quarterly-results\nA fixed income investor call will take place on July 28, 2023, at 15:00 CEST. This conference call will be transmitted via internet: www.db.com/quarterly-results\nRead the \nPDF\nfull media release as PDF document.",
    "number_of_ratings": 15,
    "rating": 4.0,
    "likes": 25
}