{
    "url": "https://www.db.com/news/detail/20230714-educating-and-empowering-india-s-youth?language_id=1",
    "language": "DE",
    "article_type": "India News",
    "publish_date": "India, July 14, 2023",
    "tags": [
        "Social Responsibility",
        "Asia-Pacific"
    ],
    "title": "Educating and empowering India’s youth",
    "body": "India’s youth comprise more than a quarter of the country’s population. They play a pivotal role in shaping India’s future and are a catalyst for the country’s growth and development. However, government reports estimate that one in three Indian youth are not employed or undergoing any education or training. This disparity is due to several reasons including societal pressures and inequal access to resources.\nOn World Youth Skills Day, we look at how Deutsche Bank’s CSR Born to Be programme is skilling young people from marginalised communities in India to reach their full potential.\nSkilling for employability\nOver the last seven years, Deutsche Bank has been supporting Plan India’s Saksham programme which provides vocational training to youth in Bengaluru, Jaipur, Mumbai, and Pune. The Saksham trainers also impart soft skills to the students to boost their confidence and improve their communication. Often, employees from the bank volunteer their time and conduct mock interviews and corporate grooming sessions to prepare these students for employment.\nTogether with Plan India, the bank has trained over 16,500 youth till date. 60% of these young individuals have received employment opportunities, a significant proportion of which are women.\nEngineering career paths for meritorious young girls\nTo level the playing field and provide equal access to educational resources, Deutsche Bank partnered with Smile Foundation to provide engineering scholarships for young women. This scholarship supports 300 young girls from low-income families in Bengaluru, Jaipur, Mumbai, and Pune through their four-year engineering degree.\nThe initiative includes college fees, half-yearly training programmes to continually upskill these girls with a focus on soft skills, financial literacy, communication and leadership development skills to improve their employability. Upon completion of the course, the bank and Smile Foundation will help students gain industry experience and guidance for job placements.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}