{
    "url": "https://www.db.com/news/detail/20230710-lufthansa-group-and-miles-und-more-enter-into-new-partnership-with-deutsche-bank-and-mastercard?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, July 10, 2023",
    "tags": [
        "Europe",
        "Germany",
        "Corporate products"
    ],
    "title": "Lufthansa Group and Miles & More enter into new partnership with Deutsche Bank and Mastercard",
    "body": "Europe's leading loyalty programme for people with mobile lifestyles remains on a growth track with new partnership\nDeutsche Bank AG and Mastercard successfully won the tender for the credit card portfolio in Germany\nChangeover to take place in mid-2025\nDeutsche Bank will become the new issuing partner for the Lufthansa Miles & More Credit Card. Mastercard will remain the network partner. In a global tender, both companies prevailed in the bidding process. The switch will take place in mid-2025.\nChristina Foerster, Member of the Executive Board of Deutsche Lufthansa AG, said: \"I am looking forward to working with strong partners to offer our customers even better and more innovative services. Within the Lufthansa Group, we are continuously expanding our premium offering - far beyond the flight itself. Long-term and trusting customer relationships are fundamental to this. Together, we will continue to develop Europe's leading loyalty program for our customers around the world.\"\nChristian Sewing, CEO Deutsche Bank said: “Miles & More has one of the leading credit card portfolios in Germany and Europe. We highly appreciate that Lufthansa is building on the payments know-how and reach of Deutsche Bank for this important growth product. We have a very strong position in the credit card issuing business in Germany. With Miles & More we will continue to advance our important cash management business, consistent with our growth strategy as the Global Hausbank.”\nMastercard CEO Michael Miebach said: “Mastercard has long-standing, meaningful partnerships with Deutsche Bank, Lufthansa Group and Miles & More. Together, we will create a more sustainable, more technology-driven future of travel. And we will keep building on our momentum to do even more for Miles & More participants.\"\nCustomers benefit from attractive offers and service\nThe common goal is to redefine loyalty. Customers will benefit from even more personalized offers and innovative digital applications. In addition, existing card services will be expanded, with additional insurance and features that support sustainable consumption decisions.\nJohann-Philipp Bruns, Managing Director of Miles & More GmbH, added: \"Miles & More has over 30 years of experience in the field of loyalty, which we want to bring to bear in the interests of our customers. With Deutsche Bank and Mastercard, we have two partners at our side who will enable us to tap into new growth potential.\"\nStrong development of a successful product\nThe switch to Deutsche Bank as the issuing institution will take place in the summer of 2025. Those who already have a Lufthansa Miles & More Credit Card do not need to take any action at this time, as all existing cards will remain valid until the switch. Cardholders will be informed in good time about the transition date. Existing benefits will also remain in place with Deutsche Bank as the new partner. These include, for example, earning award miles on credit card spending, unlimited validity of award miles and the premium insurance package.\nThe Miles & More Credit Card is seen as the ideal everyday companion, as bonus miles are collected for every transaction, which can then be redeemed for award flights or upgrades. With the card’s MilesPay feature, people can also use their miles to make purchases at more than 100 million Mastercard acceptance points worldwide.\nMiles & More Credit Cards were introduced in Germany in February 1999 and are now used in 20 other countries.\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nHeinrich Frömsdorf\nTel. +49 172 5424016\nEmail: heinrich.froemsdorf@db.com \n\nMastercard\nJuliane Schmitz-Engels\nTel. +49 172 1880720\nEmail: juliane.schmitz-engels@mastercard.com \n\nMiles & More Press Office\nTel.: +49 69 719168-159\nEmail: presse@miles-and-more.com ",
    "number_of_ratings": 58,
    "rating": 3.1,
    "likes": 38
}