{
    "url": "https://www.db.com/news/detail/20230707-fun-with-finance?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 7, 2023",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Fun with finance",
    "body": "Ten school classes from the Rhine-Main area visited our Frankfurt head offices this Friday, where they got a taste of banking and took part in workshops on financial literacy. The event marked the end of this year's “So geht Geld” (How Money works) school tour. Between June 12 and July 7, almost 100 Deutsche Bank employees shared their financial knowledge with more than 6,000 young people in grades five and above at schools across Germany.\nLars Stoy, Head of Private Bank Germany, who welcomed the pupils, is enthusiastic about the initiative:\nThrough this project, we give young people the tools to assume responsibility for their present and future financial challenges. Learning about finance when you’re young can have a huge positive impact on your later life and there is often little room for it in the school curriculum. Many thanks to everyone who contributed their time and knowledge and gave a face to the bank's commitment in this area.\nFinancial knowledge for career starters was on the programme – realistic, easy to digest and anything but dry and boring. Four colleagues from Deutsche Bank offered the schoolchildren 90-minute workshops and provided comprehensive insights into personal finance.\nCharlie, student from Frankfurt, summarizes the day at the bank as follows:\nToday was really great! I loved what was said about capitalism and sustainability and the environment. That really fascinated me.\nWhat does a job in the bank actually look like? What about entry routes and school leaver opportunities?\nKatja Hain, Head of Dual Vocational Training & Dual Studies, provided the answers in her keynote speech on training, study and career opportunities at Deutsche Bank. She emphasised the importance of informing young people directly and getting into conversation with them at events like these:\nJunior staff also attended the event and gave authentic insights into the day-to-day life of a bank trainee in a question-and-answer session. We always strive to make Deutsche Bank as tangible as possible when talking to school pupils.\nBeyond the school tour and this special event, employees can get involved and bring financial literacy to schools across Germany all year round. Since 2021, they have reached more than 40,000 young people in some 1,700 classes, sharing information about accounts, savings and investments. Deutsche Bank’s Born to Be youth engagement programme utilises employees’ expertise and commitment in supporting over ten initiatives worldwide that improve financial literacy and inclusion.",
    "number_of_ratings": 29,
    "rating": 2.4,
    "likes": 16
}