{
    "url": "https://www.db.com/news/detail/20230608-supporting-ocean-conservation-across-asia-pacific?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 8, 2023",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Supporting ocean conservation across Asia Pacific",
    "body": "From empowering local islanders to protect endangered turtles, to restoring coastal reefs, Deutsche Bank’s CSR environmental impact programme, How We Live, is helping to conserve marine biodiversity in the Asia Pacific region. Partnering with The Nature Conservancy (TNC), Deutsche Bank has been funding community conservation projects in Indonesia, Hong Kong SAR, Mainland China, and Australia. Here is what the partnership has achieved since its launch last year.\nProtecting critically endangered turtles and improving rural livelihoods in Indonesia\nDeutsche Bank’s funding has helped train and employ 18 Indigenous community members at Wakatobi National Park in Indonesia as turtle rangers to monitor and protect the critically endangered sea turtles. Wakatobi National Park is one of only two marine parks in Indonesia and is home to unparalleled marine biodiversity. Its tapestry of habitats attracts a diverse range of creatures, but the ongoing population decline of endangered green turtles and hawksbill turtles is alarming and caused by human activity at nesting beaches. The odds of a hawksbill turtle hatchling reaching adulthood are just 1 in 1,000.\nBy training and employing locals in science-based conservation, the bank has helped create alternative and sustainable livelihoods that incentivize them to protect turtles instead of hunting them. The locals are also trained and equipped to help monitor turtle nesting behaviour, providing valuable data for ongoing conservation efforts.\nFirst-ever comprehensive research on the conservation and restoration of oyster reef habitats in China\nIn China, vast swathes of oyster reefs have been lost due to coastal development and environmental issues. The distribution and status of remaining oyster reef habitats is largely unknown. With Deutsche Bank’s support, the first ever research report on oyster reef habitat conservation and restoration in China was completed and presented to various academic institutions, government departments and NGOs.\nThe report provides a comprehensive overview of oyster reefs in China, including their distribution, conservation, and restoration practices and gaps in existing efforts. The report also presents solutions to support technical frameworks and relevant policies and is expected to significantly contribute to China’s oyster reef conservation and restoration efforts.\nRecycling discarded shells to create new living shellfish reefs in Hong Kong\nDiscarded seashells can significantly enhance the restoration of coral reefs. Artificial reefs created by placing materials, such as discarded seashells, on the ocean floor provide a foundation for new coral to grow on, and a habitat for fish and other marine life. With Deutsche Bank’s support, more than 22 tons of discarded shells from the aquaculture and restaurant industry was collected, which were then used to create the foundation for new living shellfish reefs at Tolo Harbor and Yung Shue O.\nThrough multiple deployment and monitoring cycles, shellfish reefs can be restored in various parts of Hong Kong with this unique strategy. The bank’s employees in Hong Kong have also volunteered their time to collect discarded oyster shells for this initiative.\nLarge-scale reef restoration efforts in Australia\nBy seeding oyster reefs with 6 million baby oysters, TNC  is helping restore 4 hectares of critically rare shellfish reef habitat in New South Wales.  By rebuilding and regenerating shellfish reefs, this initiative is creating employment opportunities for coastal communities, supporting coastal industries that depend on healthy reef ecosystems.",
    "number_of_ratings": 7,
    "rating": 5.0,
    "likes": 5
}