{
    "url": "https://www.db.com/news/detail/20230607-deutsche-bank-funds-economic-study-for-the-ocean?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 7, 2023",
    "tags": [
        "Sustainability",
        "Wealth"
    ],
    "title": "Deutsche Bank funds economic study for the ocean",
    "body": "Deutsche Bank today announced it would fund a new study into the economic benefits of Nature-based Solutions for the ocean. The research represents phase two funding from the Deutsche Bank Ocean Resilience Philanthropy Fund (DBORPF), which was first launched in 2022 at COP26. \nConceived in collaboration with the Marine Institute at Plymouth University and UK-based artist Shezad Dawood’s foundation Leviathan, which promotes unique collaborations between art and science as a way to both highlight and support frontline research into marine ecologies, the new research project is a significant cost-benefit economic analysis of NbS for the ocean at a time when nature’s solutions are gaining greater attention in fighting climate change.\nThe ground-breaking meta-data analysis project, conducted by the University of Plymouth, under the supervision of Associate Professor Dr. Louise Firth, aims to create a gold standard in the field of NbS, spanning the efficacy, delivery and impact of a number of remedial and adaptive ocean strategies for global application.\nDeutsche Bank’s Private Bank ESG Chief Investment Officer, Markus Müller, said: “Nature-based Solutions is the critical new lexicon of economists, but what is urgently needed is data to back the economic theory. If this new study successfully quantifies the economic benefits of ocean NbS, it could enable more capital flows for ocean solutions and toward the goal of a net-zero transition.”\nWith the meta-analysis, Dr Louise Firth and doctoral students from the School of Biological and Marine Sciences aim to deliver a game-changing peer-reviewed paper and build an open-access database. Creating a large-scale database has the potential to deepen the impact of the research by making it available to a much broader constituency, including governmental, non-governmental and commercial sectors, as well as individual researchers.\nThe project also supports international collaboration, working with two PhD students from the global south to conduct research alongside Dr. Firth and her research team, as well as inviting a reciprocal relationship with a UK-based PhD student to work internationally. \nGlobal Head of Philanthropy, Jacqueline Valouch said: “This is an excellent project for the DBORPF, which aims to make a tangible impact in advancing Nature-based Solutions (NbS) for ocean and marine ecosystems’ conservation, restoration and adaptation to climate change, in collaboration with philanthropists and the scientific community.”\nLaunched in October 2022, the DBORPF aims to quickly deploy unrestricted funds in response to the great challenge of ocean degradation. The Donor Advised Fund is administered in the UK by the Charities Aid Foundation. For more information on the fund, visit Deutsche Wealth.\nIn 2019, Deutsche Bank’s CIO identified the Ocean as a strategic macroeconomic risk and enabler, and in 2021 became the first bank to partner with the Ocean Risk and Resilience Action Alliance (ORRAA) as a full member to build its knowledge and network, including those in ocean research and conservation.",
    "number_of_ratings": 7,
    "rating": 5.0,
    "likes": 8
}