{
    "url": "https://www.db.com/news/detail/20230602-seventy-million-mid-day-meals-to-help-children-in-india-stay-in-schools?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "India, June 2, 2023",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Seventy million mid-day meals to help children in India stay in schools",
    "body": "On June 2, Deutsche Bank, in partnership with The Akshaya Patra Foundation, served the seventy millionth mid-day meal to school children, at an event in GHPS Ejipura School, Bengaluru.\nOver the past nine years, Deutsche Bank, through its Corporate Social Responsibility Born to Be programme, worked with Akshaya Patra to help children from low-income households stay in school through its mid-day meal programme. During this period the partnership has helped alleviate hunger and countered malnutrition for over 300,000 children from marginalised backgrounds. The bank also supports the operation of the foundation’s kitchens in Bengaluru and Jaipur, ensuring the preparation of hygienic and nutritious school lunches for students.\nHelping children unlock their potential\nHunger and malnutrition are some of the major causes of low enrolment in schools, increased absenteeism, and early dropouts, amongst the estimated ninety million poor children in India. Through Deutsche Bank’s partnership with The Akshaya Patra Foundation, the mid-day meals programme is helping to change that. The meals improve the students’ academic performance and concentration in the classroom. They also incentivise attendance. The meals come as a relief for many families who can send their children to school knowing that they will be properly fed. Sometimes this is the only substantial meal that the child eats in a day. They also help break down social barriers, which helps children feel more equal to each other.\nThe event organised to commemorate this milestone, included a felicitation ceremony for meritorious students and students with the best attendance. Earlier in the day, Deutsche Bank volunteers helped prepare the food that was served to the children. Kaushik Shaparia, CEO, Deutsche Bank Group, India said, \" Empowering children to realise their full potential is one of the core components of our CSR strategy. Combating hunger and malnutrition amongst children from marginalised communities is crucial to achieving this objective. Through our long-standing partnership with Akshaya Patra, we are delighted to witness the tangible impact we are making on education and the overall development of children.”\nShridhar Venkat, Chief Executive Officer of The Akshaya Patra Foundation, said, \"We are immensely grateful to Deutsche Bank for their unwavering support and commitment in our journey to alleviate hunger among school children. The successful collaboration between Akshaya Patra and Deutsche Bank showcases the power of public-private partnerships in creating lasting social impact. The 70 million meals served to reflect the power of our shared vision and the profound impact we can create when we work together. Together with Deutsche Bank, we are making a tangible difference in the lives of millions of children, empowering them with education and nourishment.\"\nLatest data from the Government of India reveals that the PM POSHAN scheme covers about 118 million children studying in 1.120 million government and government-aided schools across the country.",
    "number_of_ratings": 3,
    "rating": 4.7,
    "likes": 9
}