{
    "url": "https://www.db.com/news/detail/20230601-deutsche-bank-uses-recycled-plastic-for-cards?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am main, June 1, 2023",
    "tags": [
        "Germany",
        "Private products",
        "Sustainability"
    ],
    "title": "Deutsche Bank uses recycled plastic for cards",
    "body": "In the future, Deutsche Bank will only use payment cards made from recycled plastic. From mid-2023, it will gradually switch the production of the cards to recycled material. By the end of 2024, 99 percent of all new cards issued by the bank will be produced using so-called rPVC (recycled PVC), by which time old, non-recyclable stock will be used up. Around 19 million Deutsche Bank, Postbank and norisbank customers in Germany will have their cards replaced with cards made from recycled plastic. These include credit, debit, savings or giro cards. The cards will be replaced as needed, i.e. when the card expires or when a replacement card is issued. Customers do not have to take action.\n\"By converting our entire card portfolio to recycled materials, we are implementing another measure to improve our ecological footprint,\" says Achim Kuhn, Head of Customer and Product Management at Deutsche Bank.\nFrom October 2023, it will also be possible to return expired cards in branches of Deutsche Bank and Postbank. The bank sends returned cards to the \"gdw - cooperative of workshops for disabled people eG\". Their employees shred the cards in a data protection-compliant process, the first step in recycling. A disposal company then processes the cards into rPVC raw material and returns them to the production cycle.\nOn its way to more sustainable cards, Deutsche Bank is working closely with Giesecke + Devrient (G+D) and Mastercard. As the bank's most important card producer and recycling service partner, G+D estimates that cards made from recycled plastic will reduce CO2 emissions by around 65 percent. The reference value is the CO2 consumption from the extraction of the raw materials to the final completion of the card. “Today, consumers are making increasingly conscious decisions and also expect truly sustainable solutions from their banks. Recyclable cards are a strong sign of this change. They remind consumers every day of their own and their bank's commitment to protecting our planet. We are pleased that Deutsche Bank is taking this step and is converting its entire portfolio to cards made from rPVC, as well as actively participating in the circular economy through card recycling. Sustainability is also part of our DNA, and with G+D, Deutsche Bank has a reliable partner at its side who protects its ecological credibility,” says Mikko Kähkönen, Head of Payment Cards Portfolio at Giesecke+Devrient.\nAlso supporting the bank in the transition to eco-certified cards, Mastercard checks the material and the manufacturer's information with regard to sustainability and has both validated by an independent third-party auditor. Only then can the card bear the \"Card Eco\" certification mark that Mastercard introduced in 2021. From 2028, all newly produced Mastercard cards worldwide must be eco-certified – Deutsche Bank is already taking this step.\n“Mastercard is the first payment network to take this consistent step towards more sustainability in payment cards. We are pleased that Deutsche Bank, Postbank and norisbank are among the first partners in Germany to completely convert their portfolio to eco-certified cards,\" explains Dr. Peter Robejsek, Country Manager for Germany at Mastercard. “With this commitment, we not only follow our own values, but also the wishes of card issuers and consumers. A reduced ecological footprint and improved ecological balance benefits all of us – people and our planet.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 51
}