{
    "url": "https://www.db.com/news/detail/20160624-the-uk-s-eu-referendum-result-a-message-to-employees-from-john-cryan?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 24, 2016",
    "tags": [
        "Company",
        "Investment Banking",
        "Research"
    ],
    "title": "The UK's EU referendum result: a message to employees from John Cryan",
    "body": "Dear Colleagues,\n\nYou will have seen the results from yesterday’s referendum on the United Kingdom’s membership of the European Union. We respect the decision of the British voters. Having said that, we cannot help but feel disappointed at the outcome of the UK referendum on membership of the EU.\n\nAs we have said previously, Deutsche Bank has always been supportive of European integration and regards Europe as its home market – a home market which is stronger with the UK than without.\n\nThe UK’s future relationship with the EU will be negotiated over a period of at least two years. During the transition period, the UK will remain a member state of the EU with all of its existing rights and obligations including access to the Single Market. There are a wide range of possible scenarios for the UK’s future relationship with the EU.\n\nWe currently do not believe significant changes will be required to our current UK structure or business model in the short term as a result of the referendum. Along with the rest of the industry, we will monitor the UK’s negotiations with the EU closely. If any changes are required, they will be carried out in a way that minimises any impact on clients and employees.\n\nAs a bank headquartered in Germany and with a strong presence in the UK, we are well prepared to mitigate the consequences of the UK leaving the EU. However, the uncertainty created by the referendum’s results will be a challenge.\n\nWe will continue to ensure we are present where our clients are active, whatever the outcome of the negotiations.\n\nYours sincerely,\nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}