{
    "url": "https://www.db.com/news/detail/20160623-strategy-2020-a-message-from-john-cryan?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 23, 2016",
    "tags": [
        "Company",
        "Management & Leadership",
        "Strategy"
    ],
    "title": "Strategy 2020: a message from John Cryan",
    "body": "Dear Colleagues,\nToday, we have taken a significant step forward in the transformation of our bank. We have concluded the first round of negotiations with employee representatives in Germany, reaching agreement on a range of organisational topics across several areas. This is an important step in the delivery of Strategy 2020 and in making our bank successful again.\nNevertheless, it is a day that brings mixed feelings. This agreement means that the process of staff reduction will now begin in many parts of our bank in Germany, as it has been under way in other regions for several months already. This reduction has been and will be distressing given the impact on individuals, and is something my Management Board colleagues and I regret very much. We know that many of you have not only performed outstanding work for years, but also are loyal and have close ties to our bank.\nThis has not been an easy decision for us. However, we have to bring down costs while also reorganising how we work. If we do not, Deutsche Bank will be unable to operate profitably or sustainably in an environment of low interest rates and increasingly strict regulation.\nIn focus\nThe first areas impacted by this agreement are Private & Commercial Clients and PBC Operations (PBC Ops, without DB Direkt GmbH and DB Investment Services GmbH); Wealth Management; Global Transaction Banking; Risk; Finance; and the Chief Operating Office-Service Center Corporates (COO-SCC) within the COO organisation.\nIn these areas, a total of almost 3,000 jobs will be cut in Germany. The biggest portion will be in Private & Commercial Clients. Wherever possible, we will strive to offer other jobs in the bank to those employees impacted. Where we must reduce staff levels, we will do everything we can to ensure that we do so in a responsible and fair manner. I would also like to thank the Works Council members for their critical and constructive approach in our discussions with them.\nWe will now enter into a second round of negotiations with the employee representatives regarding those business divisions and infrastructure functions not included in this first group. A third round will follow in the autumn. A process that is intended to be fair for everyone takes time. However, we are working diligently to ensure that all members of staff know as soon as possible what will happen next.\nNo one benefits from a long period of uncertainty – not the impacted employees, the bank or our clients. Undoubtedly, the bank’s restructuring will require significant staff reductions. However, my Management Board colleagues and I are convinced that taking these steps is the only way and the right way to operate sustainably in an environment of great change.\nBuilding a better bank\nI thank all of you for the hard work and the commitment you have brought to the restructuring process while continuing to focus on our clients. We are working on building a better Deutsche Bank. I am certain that thanks to your support we will be successful in this.\nYours sincerely,\nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}