{
    "url": "https://www.db.com/news/detail/20160623-economy-views-blockchain-transforming-financial-services?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 23, 2016",
    "tags": [
        "Company",
        "Corporate products",
        "Investment Banking",
        "Research"
    ],
    "title": "Blockchain – transforming financial services",
    "body": "Find out what GTB Chief Digital Officer Edward Budd has to say about blockchain, distributed ledger technology and the potential transformation of financial services.\n“In this whole transformation, collaboration between market participants, competitors as they are today, will be key in order to solve the challenges around the legal, regulatory and data aspects that need to work together” – Edward Budd\nBlockchain – transforming financial Services\nWe believe that blockchain has great potential and could transform the business model of many segments of the financial services industry and other industries. It could also change the role of service providers by requiring them to review how products are delivered today. However, the adoption of blockchain will vary according to geographies, regulatory frameworks and the complexity of assets and their implementation, including the cost implications when new and existing technology co-exist for a period of time.\nDeutsche Bank is running a portfolio of activities for blockchain / distributed ledger technology across the Bank. Some of these innovative activities are driven internally and facilitated by the Deutsche Bank Innovation Labs. In other areas where we cannot - or would not - look to test on our own we collaborate with industry partners such as the market consortium DLG R3.\nWe also collaborate with peers in driving market infrastructure projects. We are in constant dialogue with clients, central banks and regulators to make sure their requirements are addressed when defining industry standards with other market participants. This forms a crucial part of our strategy and is key for addressing questions around a broad range of issues, including standards and interoperability of different ledgers.\nAdoption will be a step-by-step process, not an overnight revolution, with some commercially-viable implementations by the end of 2017 and into 2018. To become mainstream there are still challenges to overcome and the market needs to focus on areas such as product quality assurance, security, legal requirements and governance before applying distributed ledger technology to regulated financial markets, particularly transaction banking.\nIt may take another five-10 years before distributed ledger technology becomes truly mainstream. That will take us to 2027, the year the World Economic Forum predicted that 10% of global GDP will be stored on blockchains.\nOther videos on the topic:\nDigital, Blockchain and Beyond\nVideo Seminar Blockchain: Overview. Relevance. Outlook.\n“Moving Blockchain from the lab to the real world” (Finextra Interview at EBAday with GTB Chief Digital Officer Edward Budd)\n  Contact:\nClaudia Coppenolle\n+44 2075416448\nclaudia.coppenolle@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}