{
    "url": "https://www.db.com/news/detail/20160623-deutsche-bank-to-reorganise-its-private-and-commercial-banking-business-in-germany?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 23, 2016",
    "tags": [
        "Company",
        "Digitalisation",
        "Strategy"
    ],
    "title": "Deutsche Bank to reorganise its private and commercial banking business in Germany",
    "body": "Deutsche Bank announced today that it is reorganising its private and commercial business that serves 8 million customers in Germany. As part of this restructuring, the bank plans to consolidate 723 branches into 535 larger sites in 2017 that will deliver high-quality service while expanding new forms of digital services.\n\nBetween now and 2020, it intends to invest around 750 million euros in digital products and advisory services. It also plans to further intensify its business with mid-size commercial clients and with private banking clients.\n\n“Our customers want a modern, customer-friendly Deutsche Bank. In addition, we are responding the challenges created by the low interest rate environment, increased regulations and, above all, a change in customer behaviour. If we are to continue to meet the needs of our customers in future, we will have to apply the right business measures,” said Christian Sewing, the member of Deutsche Bank’s Management Board who oversees Private, Wealth and Commercial Clients.\nIn detail\nThe restructuring of the commercial and private banking business is part of Strategy 2020 that Deutsche Bank introduced last year. The strategy is entering the implementation phase after the bank’s management and representatives of its employees reached a reconciliation of interests. In the first step, nearly 3,000 roles (full-time equivalents) will be eliminated in Germany.\nOf this total, around 2,500 positions will be cut in the bank’s Private and Commercial Clients division. In doing so, the bank will reach more than 90 percent of its planned job-reduction goal. The bank is also negotiating with employee representatives regarding job reductions in other divisions and infrastructure units in Germany.\n\n“It is a painful decision to reduce jobs. Unfortunately, this step cannot be avoided if Deutsche Bank is to remain competitive in the long term,” Sewing said. “We will implement the reductions fairly and with respect for our employees, but also as quickly as possible. Every employee is entitled to know in a timely manner about what lies ahead.”\n\nThe bank will do as much as possible to minimise the social impact of the staff reduction. It will run training programmes and redeploy employees to vacant positions within the Group. The bank will also help affected employees to find a new job outside the company. The bank’s objective is to avoid compulsory redundancies.\nFull service banking\nWith its restructuring programme, Deutsche Bank is responding to the changing behaviour and needs of its customers. Sewing said: “Clients will decide how they want to use their Deutsche Bank in future. This is why we will provide service and advice in new formats. However, our branches will also play a key role in the banking business in the future. All of our customers are important to us, and we will do everything possible to meet the expectations of every Deutsche Bank customer.”\n\nFor a clear majority of people under 30, digital services have become the most important factor in choosing a bank. Sixty percent of customers today want their access to Deutsche Bank to be flexible. Only around half of its customers come to a branch even just once a year. “Nonetheless, the branch remains the place for confidential discussions and intensive consulting assistance – regarding everything from mortgage loan financing and retirement planning to asset formation and business succession,” Sewing said. Accordingly, customers have high expectations for the quality offered by the branches and their advisors.\nA detailed overview of the reorganisation programme:\nIn 2017, Deutsche Bank will consolidate 188 of its smaller branches with their neighbours to create larger offices delivering high-quality service. Customers’ account numbers, IBAN and BIC will remain the same. Customers affected by a change in branch will be notified by the bank well in advance and given comprehensive support.\nUnder the new branch structure with 535 locations, the bank will continue to be fully accessible to customers throughout Germany and in future will offer private banking advisory services at all its branches. In addition, the bank will continue to invest in a modern, digital infrastructure for its branch network, adding formats such as advice via a video link and co-browsing, a process in which a bank advisor provides virtual assistance to his or her customers on the bank’s website.\nMore than 120 branches have undergone this far-reaching modernisation process in recent years. Between 500,000 and 2 million euros have been invested per branch. The bank will continue steadily along this path.\nThe bank will open seven major advisory centres during the course of 2017. The advisers who work there will be available outside daily banking hours. A total of 360 qualified banking professionals – 200 for private clients and 160 for business and commercial clients – will advise private and business clients on all bank products and services using a modern technology platform that includes chat, video and telephone. They will also have the ability to conclude contracts through this platform.\nBranch optimisation\nIn future, private banking clients will be able to obtain advice at any branch. The bank will add 100 private banking advisor positions to achieve this. It will also expand its services as a leading investment company. It will increase its portfolio advisory services and, as it does today, also provide asset management administered by the bank for smaller investment amounts. The foundation for investment advice will be a structured advisory process.\nMid-sized corporate clients will benefit in future from significant improvements in the service support ratio. Each advisor can concentrate on a smaller number of mid-sized companies, freeing up time for assisting individual clients. The bank will create about 140 new positions in this area. For small and mid-sized enterprises, the bank will create a commercial customer service that customers can use at any time to address everyday banking needs such as accounts, payment transactions or service in general.\nThis will release advisors to spend more time in dialogue with their customers.\nDigitalisation\nThe digital services of the branches will be further expanded in online and mobile environments. The bank will invest around 750 million euros in these areas by 2020, including 200 million euros this year alone. The bank launched 70 new digital services and products in 2015. After the launch of its new “Deutsche Bank mobile” banking app this spring, further digital innovations will follow by the end of 2016.\nWith the multi-bank/portfolio aggregation app, customers can see an overview of all their banking and custodial accounts; with a new “e-safe”, they can securely store electronic documents, invoices and passwords; and through the new time-deposit marketplace, they can find the best fixed-term offers among leading European banks.\nIn future, the bank will perform simple customer services and internal procedures entirely electronically. Electronic account opening and video verification will even start in 2016. Later on, mortgage loans will be handled digitally, from application to processing and conclusion as well as redemptions and regular client information regarding the status of interest and principal payments.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}