{
    "url": "https://www.db.com/news/detail/20160607-the-bigger-picture-first-global-edition-of-3d-corporate-citizenship-newsletter?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 7, 2016",
    "tags": [
        "Art",
        "Corporate Citizenship",
        "Education",
        "Employee engagement",
        "Sustainability"
    ],
    "title": "First global edition of 3D Corporate Citizenship newsletter",
    "body": "The first global issue of Deutsche Bank’s 3D Corporate Citizenship (CC) newsletter was launched at the recent Annual General Meeting (AGM). 3D provides insight into the strategic outlook and the global ambition of the Bank’s CC commitment, underpinned with flagships from the main regions. The global 12-pager is complemented with regional inserts on local project highlights from Germany, the UK, the US, APAC, MENA and South Africa. Click here to\nPDF\nread the latest online version in English.\nThe Bank’s CC commitment has a key role to play in the achievement of Strategy 2020 objectives – for only as a strong and well-run organisation can the bank serve the best interest of clients, shareholders and society. John Cryan, CEO, highlighted at the recent AGM that one essential part of building a better Deutsche Bank is to make a positive impact on society.\nDeutsche Bank has a long-standing track record of being an active member in the communities it serves. “We aspire to be a socially-minded enabler and a reliable partner – a catalyst for change that empowers the next generation, assists start-ups that help to drive positive change in society, and enhances the economic and social inclusion of disadvantaged groups to help build stronger communities,” said Lareena Hilton, Global Head of Brand Communications & Corporate Social Responsibility.\nMore than 17,000 employees are engaged as Corporate Volunteers and have spent more than 185,000 hours in support of community projects in 2015. The Bank’s global multi-faceted CC initiatives reached 4.7 million people around the world last year.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}