{
    "url": "https://www.db.com/news/detail/20181114-deutsche-bank-launches-its-asia-pacific-innovation-lab-in-singapore?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 14, 2018",
    "tags": [
        "Company",
        "Digitalisation",
        "Entrepreneurship",
        "Research",
        "Strategy"
    ],
    "title": "Deutsche Bank launches its Asia Pacific Innovation Lab in Singapore",
    "body": "Deutsche Bank announces the launch of its newest Innovation Lab, which opened today in Singapore. The Lab is Deutsche Bank’s first in Asia Pacific and completes the bank’s global network, which spans from Berlin to London, New York, Palo Alto, and now Singapore.\nThe bank’s Innovation Labs are part of its drive to digitalise and embrace emerging technologies for the benefit of clients. Finding the best startup opportunities across Asia Pacific, through Singapore, to scale globally across the bank’s platform will be a key objective for Deutsche Bank’s Asia Pacific Innovation Lab. Similarly, Singapore’s addition to the platform will ensure that the innovation needs of the bank’s Asia Pacific businesses are plugged into its global innovation platform.\nOpening the Lab, Deutsche Bank Asia Pacific Chief Executive Officer, Werner Steinmueller, said: “Asia, particularly Singapore, is proving to be fertile ground for talented startups and we are very excited about the potential for partnerships here. The establishment of our newest Innovation Lab in Singapore is just the latest expression of our continued commitment and investment in our Asia Pacific platform, where we see abundant opportunity.”\nMs Jacqueline Loh, Deputy Managing Director of the Monetary Authority of Singapore (MAS), who officiated at the launch said:\nMAS is committed to fostering a thriving innovation ecosystem. We are pleased to welcome Deutsche Bank to the growing community of innovation labs in Singapore. Global financial institutions are crucial partners for start-ups in the development of deployable, scalable FinTech solutions. We look forward to fruitful collaborations and successful FinTech solutions that transform the financial services industry.\nDeutsche Bank’s Group Chief Data Officer & Group Head of Innovation René W. Keller said: “We aim to be the first place startups want to do business. By connecting with startups, we enable internal teams to adopt solutions that enhance, improve and reimagine the way we serve clients. For startups, we provide client access, industry expertise and ready-made infrastructure.”\nDeutsche Bank’s Head of Innovation Luc Mériochaud said: “The APAC Innovation Lab in Singapore completes our global network, and will allow us to source the best startups globally to address business needs wherever they may arise. Our APAC Innovation Lab will work closely with our Wealth Management business. It will also support our Corporate & Investment Bank in the region helping to play an important role in connecting stakeholders to our Innovation Labs in London, New York and Palo Alto which lead innovation efforts for CIB globally.”\nIn 2017, USD 48 billion[1] was invested in Asia Pacific startups, with USD 1.2 billion[2] going into Singapore startups. This support indicates the level of investor appetite for innovative business solutions from the region’s entrepreneurs.\nDeutsche Bank’s APAC Innovation Lab welcomes ideas from startup entrepreneurs who can propose solutions and possible collaborations using the bank’s global startup portal.\n\nAbout Deutsche Bank Innovation Labs\nThe bank’s Innovation Labs collaborate with startups to apply emerging technologies across its business. To date the Labs have interacted globally with over 3,000 startups and delivered solutions in areas as diverse as trading, wealth management, retail, compliance, and operations.\nDeutsche Bank Innovation Labs use a systematic Venture Capitalist engagement programme which enables the Labs to pursue the best solutions globally to match the bank’s demand. Startups are invited to pitch their solutions via a dedicated global startup portal which Labs oversee to assess the best startup solutions against global priorities.\nThe bank selectively invests in the most promising fintechs. Recent examples include Modo (digital payments), dwins (creators of Finanzguru), and Quantiguous Solutions (open banking).\n\nFor further information, please contact:\nDeutsche Bank AG\nMedia Relations\nSarah Stabler\nPhone: +65 6423 8413\nEmail: sarah.stabler@db.com\n  [1] KPMG Venture Pulse, January 18 2018\n[2] As above\n\nThis media release has been approved and/or communicated by Deutsche Bank AG or by its subsidiaries and/or affiliates (“DB”). Deutsche Bank AG is authorised under German Banking Law (competent authority: BaFin – Federal Financial Supervisory Authority) and by the Prudential Regulation Authority and subject to limited regulation by the Financial Conduct Authority and Prudential Regulation Authority. Details about the extent of our authorisation and regulation by the Prudential Regulation Authority, and regulation by the Financial Conduct Authority are available from us on request. Securities and investment banking activities in the United States are performed by Deutsche Bank Securities Inc., member NYSE, NASD and SIPC, and its broker-dealer affiliates. Lending and other commercial banking activities in the United States are performed by Deutsche Bank AG, and its banking affiliates. Copyright © Deutsche Bank AG.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}