{
    "url": "https://www.db.com/news/detail/20181113-helping-overseas-indian-students-make-tuition-payments-on-time?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 13, 2018",
    "tags": [
        "Corporate Citizenship",
        "Digitalisation",
        "Research"
    ],
    "title": "Helping overseas Indian students make tuition payments on time",
    "body": "Deutsche Bank has partnered with Boston-based cross-border payment services provider Flywire to streamline tuition fee payments for India’s overseas students, providing a seamless experience to them and their guardians, and reducing complexity while ensuring regulatory requirements are met.\nAn estimated 300,000 students from India are enrolled for higher studies in the US, Australia, Canada, the UK and across the world. India has a highly regulated payments environment with extensive document requirements for sending funds abroad. Students are required to physically visit counters and submit relevant documents.\nOver 18 months, Deutsche Bank worked with the Reserve Bank of India (RBI) to build the regulator’s confidence in Flywire’s operating model, and the due diligence, audit and compliance measures taken by Deutsche Bank. Flywire had to seek approval from the RBI to facilitate remittances by students through Flywire’s Special Non-Resident Rupee (SNRR) account. They succeeded, becoming the first company to be granted an approval for opening an SNRR account in India.\nWith this in place, Deutsche Bank streamlined the Liberalised Remittance Scheme (LRS) declaration process that allows parents and guardians of students to pay tuition fees by moving from a manual process to an online one.\nDeutsche Bank also introduced Flywire to a local technology company to conduct additional due diligence on their payers using an application programming interface (API) since validation of credentials of the resident in India is a crucial requirement. This helped reduce payment processing time and eliminate potential for later issues, saving time for both Flywire and students looking to make their tuition payments.\nFinally, Deutsche Bank set up a virtual account for Flywire to ease their reconciliation process and match payments faster. This set-up has ensures that credits are posted against each student’s internal account, ensuring that all reconciliation and reporting is automated, further facilitating Flywire’s reporting to its university partners.\n“We’re very pleased to be able to work with Deutsche Bank to offer this option to make cross-border transactions easier for Indian students and their families,” said Ryan Frere, vice president of global payments for Flywire. “India is one of the fastest-growing source countries for international students in the world and we strive to offer the most convenient and efficient local payment methods – no matter where they originate. Over time, we expect the maximum payment amount qualifying for this program to increase, further streamlining the experience.”\n“By ensuring that the process we developed met all Indian regulatory requirements, we were able to create a significantly superior user experience for the student population that Flywire targets,” said Anjali Mohanty, MD & Head of Global Transaction Banking, Deutsche Bank India.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}