{
    "url": "https://www.db.com/news/detail/20181109-deutsche-bank-completes-demerger-of-its-polish-private-and-commercial-banking-business-to-santander-bank-polska?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 9, 2018",
    "tags": [
        "Company",
        "Corporate products",
        "Investment Banking",
        "Private products",
        "Research",
        "Strategy"
    ],
    "title": "Deutsche Bank completes demerger of its Polish private and commercial banking business to Santander Bank Polska",
    "body": "Deutsche Bank AG (XETRA: DBKGn.DE / NYSE:) announced today that it has completed the legal demerger of its local private and commercial banking business in Poland and closed the sale of the business to Santander Bank Polska S.A. (formerly Bank Zachodni WBK). As announced in December 2017, the transaction includes DB Securities S.A., but excludes the retail mortgage portfolio denominated in foreign currency. The migration of the divested customer and product data from DB Polska’s systems to the Santander Bank Polska’s systems will be conducted over the coming weekend.\nWith the demerger, Deutsche Bank reaches an important milestone in executing its strategy, in particular with respect to reducing complexity, costs and its workforce.\nDeutsche Bank Polska remains committed to the existing businesses outside of the Private & Commercial Bank in Poland, namely its Corporate & Investment Bank business, including Global Transaction Banking, and will continue to provide banking services to Polish and international corporate clients, financial institutions and government agencies. The bank will also continue to serve its foreign currency mortgage retail borrowers.\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nAnke Veil\nPhone: +49 69 910 42846\nEmail: anke.veil@db.com \nChristian Streckert\nPhone: +49 69 910 38079\nEmail: christian.streckert@db.com \nInvestor Relations\n+49 800 910 8000 (Frankfurt)\n+44 207 541 4100 (London)\ndb.ir@db.com ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}