{
    "url": "https://www.db.com/news/detail/20181107-us-midterm-elections-bank-thought-leaders-weigh-in-on-what-the-results-mean-for-the-economy-and-markets?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 7, 2018",
    "tags": [
        "Investment Banking"
    ],
    "title": "US midterm elections: Bank thought leaders weigh in on what the results mean for the economy and markets",
    "body": "In one of the most contested midterm elections in history, the US woke up this morning to the House of Representatives flipping to Democratic control and the Senate majority remaining Republican. The outcome is in line with the expectations of pundits and forecasts.\nDeutsche Bank thought leaders weigh-in on how the results may impact the economy and markets.\nTorsten Slok, Chief International Economist\n“With the Democrats taking over the House we will now have to see what gridlock in Congress means for policy. As for the market impact a split Congress has historically been bullish for equities and we expect to see the same pattern again.\nIt is too early to predict where policy will go but we are watching closely for any changes in policies that matter for markets. What matters for markets is what will happen to trade policy, health care policy, immigration policy, and fiscal policy.\nTrade policy will be important for inflation, GDP, and for many individual stocks. Likewise, health care policy will matter for medical inflation and for many individual companies. Immigration policy will be important for labor supply, labor market tightness, and the ongoing upward pressure on wages. And fiscal policy will matter for issuance of Treasuries and it could also matter for the level of long-term interest rates.”\nFrank Kelly, Head of Government & Public Affairs, Americas\n“As expected, the Democrats took the House and Republicans held the Senate. The surprises are that the Republicans picked up more seats in the Senate than expected and the Democrat’s wave was not as big as it was expected to be. However, as of this morning, there are still 14 seats open in the House, which could result in the Democrats gaining a total of 35 to 40 seats.\nBut the big question is what can get done in the next two years? Look for the House to work with the President on infrastructure. It’s something both parties want to tackle, and this is a project that will require financing.”\nBinky Chadha, Chief US Equity & Global Strategist, Head of Asset Allocation\n“By historical standards this was a perfectly typical mid-term election outcome where the incumbent President’s party has lost a significant number of seats. Indeed while the final results are not in, the number of seats the Republicans lost in the House is only slightly above the historical average of 26 seats. Republican gains in the Senate are easily explained by the extremely lop-sided distribution of Democrat vs. Republican seats that were up for circumstantial reasons. So the bottom line as we have sometimes noted is “the same thing happens in every mid-term election” and it did.\nPost-election, there are two sources of upside for US and global equity markets. 1. Close elections followed by rallies as uncertainty risk premium dissipates. 2. Check and balance and pricing out of downside risks to US and global growth. Looking at sectors, while the results of the elections have implications for regulatory and fiscal policy changes, and therefore on various sectors, we think that the re-pricing of cyclical growth will be by far the biggest driver with cyclical sectors outperforming defensive ones as the market sees downside growth risks reducing.”\nTom Joyce, Capital Markets Strategist, Corporate & Investment Bank\n“After the unexpected election outcomes with President Trump and Brexit in 2016, last night was a much closer to consensus outcome. Republicans added a few seats in the Senate; Democrats added close to 30 seats to take control in the House and out-performed in the 36 gubernatorial elections. With this outcome largely priced into markets, any downward pressure on equities, US Treasury yields and the USD are likely to retrace pretty quickly, with the certainty of the election being behind us being a positive tailwind. Markets should quickly go back to trading on non-election related global drivers, including a slowing global economy; corporate earnings; US-China trade policy; and Fed tightening.\nTwo questions remain:\n1. Will Republicans and Democrats work together and the President on a “small” infrastructure bill in 2019, adding further fuel and stimulus to an already highly indebted US economy?\n2. Was President Trump’s recent comments to soften US-China trade escalation just a pre-election political maneuver to support equity markets, and is he therefore likely to renew strong escalation of US-China “trade wars” pre and post the highly anticipated meetings between President Trump and President Xi at the G20 meetings in Buenos Aires in late November?”\nDeepak Puri, CIO and Head of Discretionary Portfolio Management, Wealth Management, Americas\n“In the current gridlock scenario there is a high likelihood that there will be cooperation between the Democrats and President Trump to implement new fiscal policy in the form of increased infrastructure spending, which is something both the sides agree on. Exactly how the government will fund these projects will need to be addressed. With the recent tax cuts, the U.S. long term budget outlook looks increasingly bleak. The Trump administration may encourage public-private partnerships as a possible solution, opening the door for new investments. Additionally, increased Democratic seats in the House of Representatives could create a check on President’s trade war.\nWhile these are some of the positive policy implications, there are possible negative ones. Next year Congress need to approve the revised NAFTA agreement and raise the debt ceiling, and a Democrat-controlled House may make it more difficult to reach a consensus. Other aspects of the President’s legislative agenda could also be blocked and delayed. But, overall, this is probably not a market-unfriendly outcome.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}