{
    "url": "https://www.db.com/news/detail/20250313-deutsche-bank-launches-research-institute-to-deepen-analysis-of-major-long-term-global-themes?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, March 13, 2025",
    "tags": [
        "Company",
        "Research",
        "Strategy"
    ],
    "title": "Deutsche Bank launches Research Institute to deepen analysis of major long-term global themes",
    "body": "Deutsche Bank has launched a new Research Institute to answer the growing demand for a European perspective on the long-term themes driving the global economy.\nThe Deutsche Bank Research Institute (DBRI) will offer valuable insights from Deutsche Bank Research on geopolitics, macroeconomics, technology and the corporate landscape.\nIt aims to help corporate executives, global investors and policymakers navigate a shifting environment by sharing insights in original and engaging ways, including events, videos, webinars, podcasts and reports available on a new public website. Readers can sign up today to receive new content in real time.\n\n“The world around us is changing rapidly and our clients and stakeholders are increasingly turning to us for our expertise to help them understand the long-term themes driving global economies,” said Christian Sewing, Chief Executive Officer of Deutsche Bank.\n“The Institute will enable us to share our insights with a wider audience that can benefit from our special perspective, rooted in the heart of Europe and with an international network,” he added.\n“Deutsche Bank Research has had an exceptional reputation among investors for many years for its robust and incisive analysis,” said Fabrizio Campelli, Member of the Management Board of Deutsche Bank and Head of the Corporate Bank and the Investment Bank. “That ability to make sense of a complex world has never been so much in demand, so this is the perfect time to make an even greater contribution to the public debate about the long-term themes driving change in Europe and beyond.”\nFollowing the recent German federal election, the Institute’s inaugural report, “\nPDF\nWhat Germany’s economy needs now”, provides a timely analysis of Germany's path to future prosperity, examining the structural reforms needed for the economy to thrive in the coming decades.\n“The Deutsche Bank Research Institute will offer a bold, independent and deeply researched perspective on the most important issues of our times,” said David Folkerts-Landau, who will head the Institute alongside his current roles as Chief Economist and Global Head of Deutsche Bank Research. “This is an exciting addition to our world-class Research offering.”\nFurther details\nThe Institute harnesses the expertise of Deutsche Bank’s world-class research team and draws on a wealth of data covering over 1,500 global companies, as well as key markets and sectors, spanning rates, foreign exchange, equities, emerging markets, credit, and securitisation. Its content will complement the bank’s existing research, which will continue to be available exclusively to clients.",
    "number_of_ratings": 10,
    "rating": 4.8,
    "likes": 9
}