{
    "url": "https://www.db.com/news/detail/20250313-deutsche-bank-publishes-2024-annual-report-and-confirms-outlook-for-2025?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 13, 2025",
    "tags": [
        "Financial Results"
    ],
    "title": "Deutsche Bank publishes 2024 Annual Report and confirms outlook for 2025",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) today published its 2024 Annual Report containing its audited results for the year. There were no divergences from the bank’s 2024 preliminary unaudited results published on January 30, 2025. The Annual Report includes the bank’s Consolidated Financial Statements, the 2024 Compensation Report and management’s outlook for 2025.\nDeutsche Bank’s 2024 Annual Report also contains the bank’s 2024 Sustainability Statement. This provides details of the progress on Deutsche Bank’s sustainability strategy and goals, together with an overview of the bank’s environmental, social and governance (ESG) frameworks and activities during 2024. \n“2024 was a highly important year for us,” said Christian Sewing, Chief Executive Officer. “We demonstrated Deutsche Bank’s operating strength, grew our business with clients, and acted decisively to reduce our risk profile by putting significant nonoperating costs behind us. Our operating resilience enabled us to keep our promise of increasing capital distributions to shareholders.”\nHe added: “Our outlook for 2025 is positive. We expect continued growth momentum across our businesses in line with our ambition for revenues of around € 32 billion, boosting profitability as costs and risks normalize, and enabling us to hit our 2025 target for a Return on Tangible Equity above 10%. We also aim to exceed our goal of € 8 billion in capital distributions to shareholders in respect of the years 2021-2025.”  \n2024: strong underlying performance on the path to achieving 2025 targets\nThe bank’s 2024 audited results confirm its resilient operating performance, characterized by growth in revenues and business volumes, discipline in respect of operating costs, a solid capital ratio and continued growth in distributions to shareholders. The 2024 audited financial results included:\nNet revenues of € 30.1 billion, growth of 4% over 2023 and 5.8% compound annual growth since 2021, within the bank’s target range of 5.5% to 6.5%\n\nNoninterest expenses of € 23.0 billion including € 2.6 billion in nonoperating costs, consisting primarily of € 1.7 billion in litigation charges for specific matters including the bank’s takeover of Postbank AG. Adjusted costs were down 1% year on year at € 20.4 billion\n\nProfit before tax of € 5.3 billion, down 7% year on year, after absorbing higher nonoperating costs driven by specific litigation charges. Profit before tax before nonoperating costs was € 7.9 billion, up 16% year on year\n\nNet profit of € 3.5 billion, down 28%, reflecting the aforementioned specific litigation items and the non-recurrence in 2024 of € 1.0 billion in positive deferred tax asset (DTA) valuation adjustments in 2023\n\nPost-tax return on average tangible shareholders’ equity (RoTE)1 of 4.7%, or 7.1% excluding the aforementioned specific litigation items, with a cost/income ratio of 76%, or 71% excluding specific litigation items\n\nA Common Equity Tier 1 (CET1) capital ratio of 13.8% at year-end 2024, up from 13.7% at year-end 2023, and a leverage ratio of 4.6% compared to 4.5% at year-end 2023\n\nCapital distributions to shareholders raised to € 2.1 billion proposed or authorized for 2025 so far. Proposed dividends of € 1.3 billion, or € 0.68 per share for the year 2024, up 50% over 2023, and authorization for share repurchases of € 750 million in 2025 so far after repurchases of € 675 million in 2024\n\nCumulative capital distributions since 2022, including those proposed or authorized so far in 2025, rose to € 5.4 billion; management reaffirmed its aim of cumulative capital distributions in excess of € 8 billion for the years 2021-2025, to be paid in 2022-2026\n2025 Outlook: financial targets and capital objectives reaffirmed\nDeutsche Bank’s outlook for 2025 reaffirms management’s guidance provided with the publication of the unaudited fourth-quarter 2024 results on January 30, 2025 and includes the following expectations:\nNet revenues are expected to be higher, at around € 32 billion, in line with the bank’s revenue goal and not including further upside potential from foreign exchange movements1. Within the bank’s businesses:\n\nCorporate Bank revenues are expected to be higher, driven by higher net commissions and fee income and resilient net interest income\n\nInvestment Bank revenues are expected to be higher, driven by slightly higher Fixed Income & Currency (FIC) revenues and significantly higher Origination & Advisory revenues\n\nPrivate Bank revenues are expected to be slightly higher, with growth in investment product revenues, slightly higher deposit revenues and lending revenues essentially flat\n\nAsset Management revenues are expected to be higher, with growth in both management fees and performance and transaction fees\n\nNoninterest expenses are expected to be lower, driven by a significant reduction in nonoperating costs as litigation and restructuring and severance charges are expected to normalize and adjusted costs1 to be essentially flat, with a cost/income ratio which has been reset to below 65% as communicated on January 30, 2025\n\nProvision for credit losses is expected to be lower, at around € 350 to € 400 million per quarter on average, as the transitory headwinds experienced in 2024 subside\n\nPost-tax return on tangible equity (RoTE)1 is expected to be above 10%, in line with the bank’s published target, driven primarily by revenue growth and the normalization of nonoperating costs and provision for credit losses\n\nThe CET1 ratio is expected to remain essentially flat compared to 2024\n\nThe bank plans to sustainably grow cash dividends and return capital to shareholders through share buybacks, targeting a payout ratio of 50% of net income attributable to Deutsche Bank shareholders\nCompensation Report: 2024 compensation reflects strong operating performance\nTotal compensation awarded to Deutsche Bank employees was € 11.1 billion in respect of 2024, up from € 10.3 billion in 2023. Within this total:\nFixed pay was € 8.1 billion, up from € 7.9 billion in 2023. This development reflected investments in business growth and controls, the internalization of external contract staff, the hiring of 1,160 graduates and the impact of inflation during 2024, partly offset by operational efficiency savings\n\nYear-end performance-based variable compensation in respect of 2024 was € 2.5 billion, up from € 2.0 billion in 2023. This development reflected Deutsche Bank’s strong operating performance including revenue growth, a 16% year on year increase in pre-tax profit before nonoperating costs, and continued growth in proposed or authorized distributions to shareholders\nManagement Board compensation reflected changes introduced in 2024 to reduce complexity, increase transparency and further align Management Board compensation with the long-term interests of shareholders. The Long-Term Incentive component is now determined using a three-year, forward-looking assessment period instead of using past performance as in previous years. Accordingly, the Long-Term Incentive for 2024 will be determined at the end of the performance period 2024-2026.\nCompensation of current Management Board members, on a pro forma basis and assuming 100% achievement of the 2024 Long-Term incentive target over the period 2024-2026, would be € 68.1 million in 2024. In 2023, compensation for current Management Board members was € 58.3 million, on an actual basis and reflecting a 77.53% achievement level of the Long-Term Incentive component, calculated on past performance over the period 2021-2023. As such, pro forma figures for 2024 are not directly comparable to the actual compensation levels in previous reports. Management Board compensation reflects performance against the targets set individually for each Management Board member which are set out in detail in the Compensation Report.\nThe Compensation Report, published today on pages 560-611 of the Annual Report, provides further information on Deutsche Bank’s compensation frameworks, policies and governance, together with further details on compensation of Management Board and Supervisory Board members.\nSustainability Statement: progress on multiple fronts in 2024\nDeutsche Bank’s 2024 Sustainability Statement, published on pages 190-367 of the 2024 Annual Report, was prepared according to the European Sustainability Reporting Standards (ESRS) as permitted by the German Commercial Code (HGB). This provides information on the bank’s Environmental, Social and Governance (ESG) policies, frameworks, activities and progress during 2024. In previous years, large parts of this information were covered by the bank’s Non-Financial Report.\nIn 2024, Deutsche Bank’s progress on its sustainability strategy included:\nGrowth in sustainable Financing and ESG investment volumes2 to € 373 billion cumulatively since January 1, 2020 (excluding DWS). During 2024, volumes were € 93 billion, up by 46% from 2023. Progress within the bank’s businesses during 2024 was as follows:\nCorporate Bank: cumulative sustainable financing volumes rose from € 53 billion to € 70 billion\n\nInvestment Bank: cumulative sustainable financing and issuance volumes rose from € 167 billion to € 224 billion\n\nPrivate Bank: cumulative sustainable financing and ESG investment volumes rose from € 59 billion to € 68 billion\nAdditionally, ESG assets under management in DWS rose from € 133 billion to € 163 billion during 2024.\nStrengthening frameworks in key areas during 2024. In January, the Sustainable Finance framework was updated and deepened to ensure that the classification of lending and bonds issuance meets best-in-class standards. The bank also published its Sustainable Finance Instrument Framework, which expanded the bank’s Green Financing Framework to include categories of social assets for refinancing. In July, Deutsche Bank issued its inaugural social bond, raising €500 million, which was 13 times oversubscribed. In November, Deutsche Bank published an ESG Investment Framework which provides transparency on the classification methodology for assets under management.\nDecarbonizing Deutsche Bank’s portfolio. Financed Scope 1 and 2 emissions of clients in the seven key carbon-intensive sectors in Deutsche Bank’s corporate loan portfolio covered by net-zero targets fell by 5 percentage points, and Scope 3 emissions by 4 percentage points, compared to year end 2023. This was driven by further reductions from the respective baseline year in several carbon intensive sectors including Power Generation and Steel.\nFrom 2025, aviation will be added as an eighth sector with a carbon pathway target for 2030 (interim) and a net zero target for 2050.\nRating improvements: Deutsche Bank’s progress was recognized in rating improvements from five leading independent agencies during 2024. The bank’s MSCI ESG rating was upgraded from A to AA; the S&P Global Sustainable Corporate Sustainability Assessment (CSA) score improved from 54 to 67 out of 100, placing Deutsche Bank in the top 10% of the agency’s Diversified Financials and Capital Markets sector; the bank’s ISS ESG rating improved to C+ (Prime status) for the first time; the Sustainalytics ESG Risk Rating improved from 27.9 to 24.8, and the CDP (formerly Carbon Disclosure Project) Management rating was stable at B, with a score of A or A- in 13 out of 17 categories.\nEmployees: progress on equal opportunities, talent development and governance\nThe bank made further progress on its equal opportunity ambitions. These follow the requirements of Germany’s Stock Corporation Act (Aktiengesetz) and Second Equal Participation of Men and Women in Management Positions Act (Zweites Führungspositionengesetz) for female representation at senior levels. In 2024:\n33.0% of Managing Director, Director and Vice President roles were held by women, up from 32.3% in 2023, representing further progress toward the bank’s ’35 by 25’ program, which aims for 35% of these roles to be held by women by the end of 2025\n\n28.9% of roles reporting directly to Management Board members (Management Board -1), and 28.3% of roles two levels below Management Board (Management Board -2) roles were held by women, representing progress toward the bank’s goal of 30% at both levels\nThe bank’s talent acceleration programs for both Directors and Vice Presidents were expanded in 2024; 526 employees were included in talent acceleration programs, up from 458 in 2023. 42.8% of Director acceleration program participants and 45.5% of Vice President acceleration program participants were women.\nInvestment in talent and development continued during 2024. Employees completed 1.76 million hours of training, of which approximately half were mandatory; The bank hired 1,160 graduates globally in 2024.\nGovernance remained a key area of focus in 2024. Deutsche Bank strengthened its control environment in several key areas in 2024, adding further Anti-Financial Crime specialists and significantly widening staff training. Progress included:\nAppointing a dedicated Chief Compliance and Anti-Financial Crime Officer at Management Board level\n\nHiring further anti-financial crime specialists. During 2023 and 2024, the bank has added around 600 anti-financial crime specialists, bringing the total number to 2,492 by year end 2024\nDeutsche Bank’s Sustainability Data Compendium 2024, published today for the first time, provides statistical information on the topics included in the Sustainability Statement together with further sustainability topics including In-house Ecology and Corporate Social Responsibility.\nOther financial and regulatory reports\nToday, Deutsche Bank also published its 2024 Pillar 3 Report and 2024 Annual Financial Statements of Deutsche Bank AG under German accounting rules (HGB). In addition, the Annual Report on Form 20-F 2024 will be made available.\n1 For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ below, and on pp 15-22 of the fourth quarter 2024 Financial Data Supplement. As reported on January 30, 2025, Deutsche Bank’s 2025 net revenue outlook is around € 32.0 billion at August 2024 foreign exchange rates and around € 32.8 billion at December 2024 foreign exchange rates.\n2 Cumulative ESG volumes include sustainable financing (flow) and ESG investments (stock) in the Corporate Bank, Investment Bank, Private Bank and Corporate & Other from January 1, 2020 to date. Products in scope include capital market issuance (bookrunner share only), market making activities (annual average volume of eligible bond inventory), sustainable financing, period-end assets under management and period-end pension plan assets (gross assets). Cumulative volumes and targets do not include ESG assets under management within DWS, which are reported separately by DWS.\nFinal and audited results at a glance",
    "number_of_ratings": 8,
    "rating": 5.0,
    "likes": 7
}