{
    "url": "https://www.db.com/news/detail/20250306-deutsche-bank-and-k-sure-partner-to-support-korean-companies-expanding-overseas?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 6, 2025",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank and K-Sure partner to support Korean companies expanding overseas",
    "body": "In a move signifying strong support for Korean companies expanding globally, Deutsche Bank South Korea, in collaboration with The Korea Trade Insurance Corporation (K-Sure), has successfully provided a USD 20 million invoice discounting facility to Posco International Singapore. This strategic partnership marks a significant milestone as part of K-Sure's inaugural program designed to bolster the overseas growth of Korean subsidiaries.\nReducing risk and enhancing liquidity\nUnder this program, K-Sure provides Posco International Singapore with insurance, effectively mitigating risks associated with international trade transactions. Simultaneously, Deutsche Bank's invoice discounting facility enables Posco International Singapore to receive payment for raised invoices before customer settlement. This solution significantly enhances the company's liquidity, optimizes cash flow, and streamlines invoicing processes.\nA commitment to global competitiveness\n\"We are delighted to support the growth of homegrown companies overseas,\" said Hyun-Nam Park, Seoul Branch Manager, Deutsche Bank.\nThrough this collaboration, we aim to bolster the competitiveness of Korean companies on the global stage, fostering their growth in a secure and financially stable environment. \nHyun-Nam Park\nThe official launch of this groundbreaking financial offering was commemorated at a signing ceremony held in Seoul. The event was attended by key figures including Hyun-Nam Park, Seoul Branch Manager, Deutsche Bank; Gye-In Lee, President of Posco International; and Young-Jin Jang, President of K-Sure.\nAbout Posco International\nPosco International is South Korea’s largest trading company and exports and imports various industrial grade steel, metals, chemicals, auto parts, machinery, special materials and grain.\nFrom left, Gye-In Lee, President of POSCO International, Hyun-Nam Park, Seoul Branch Manager, Deutsche Bank and Young-Jin Jang, President of Korea Trade Insurance Corporation.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}