{
    "url": "https://www.db.com/news/detail/20151228-picc-property-and-casualty-company-limited-to-acquire-deutsche-bank-s-entire-stake-in-hua-xia-bank?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "December 28, 2015",
    "tags": [
        "Company",
        "Investment Banking",
        "Strategy"
    ],
    "title": "PICC Property and Casualty Company Limited to acquire Deutsche Bank's entire stake in Hua Xia Bank",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) announced today that it has agreed to sell its entire 19.99% stake in Hua Xia Bank to PICC Property and Casualty Company Limited for a consideration of RMB 23.0 to 25.7bn subject to final price adjustment at closing (approximately EUR 3.2 to 3.7 billion, based on current exchange rates).\nThe completion of the transaction is subject to customary closing conditions and regulatory approvals including that of the China Banking Regulatory Commission. The sale will have a positive financial impact and, on a pro-forma basis, would have improved Deutsche Bank’s Common Equity Tier 1 capital ratio (CRR/CRD 4 fully loaded) as of 30 September 2015 by approximately 30 to 40 basis points.\nJohn Cryan, Co-Chief Executive Officer of Deutsche Bank, said:\n“We made our first equity investment in Hua Xia Bank in 2006. Since then, we have been pleased with Hua Xia Bank’s development and performance. As we execute on Deutsche Bank’s strategic agenda, now is the right time for us to sell this investment.\n\"China remains a key growth market for us where, since opening our first local office in 1872, we have helped our clients to achieve their goals. We look forward to working with Hua Xia Bank and PICC Property and Casualty Company Limited on the transition of our investment.”\nMarcus Schenck, Chief Financial Officer of Deutsche Bank, said: “We will now work with the regulatory authorities to close this transaction. Upon closing, Deutsche Bank’s capital position will be strengthened, and we will have made further progress on the execution of our strategy.”\n\nFor further information please contact:\nDeutsche Bank AG\n\nPress & Media Relations\nAmy Chang\n+852 2203-8434\namy.chang@db.com\n\nNicolas Nonnenmacher\n+49(69) 910-41749\nNicolas.nonnenmacher@db.com\n\nInvestor Relations\nNikolaus Poehlmann\n+44(20) 754-51903\nnikolaus.poehlmann@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}