{
    "url": "https://www.db.com/news/detail/20151210-deutsche-bank-closes-landmark-trade-finance-securitisation?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "December 10, 2015",
    "tags": [
        "Company",
        "Corporate products",
        "Digitalisation",
        "Investment Banking"
    ],
    "title": "Deutsche Bank closes landmark trade finance securitisation",
    "body": "Deutsche Bank’s Global Transaction Banking division today announced the closing of a 3.5 billion US dollars synthetic Collateralised Loan Obligation (CLO) – TRAFIN 2015-1 – a transaction that represents the largest-ever securitisation of trade finance assets in the market.\nTRAFIN 2015-1 is the third synthetic CLO launched by Deutsche Bank based on an innovative structure that enables the Bank to hedge a globally diverse short-term trade finance portfolio of corporate and financial institutions via the sale of a first loss tranche. In this context, Deutsche Bank structured, arranged and placed the first loss notes, building a syndicate of seven key investors from Europe and the Americas.\nGiven the underlying portfolio’s short-term nature, the portfolio will be regularly replenished. The transaction’s structure enables a broad range of assets to be included, thereby giving Deutsche Bank’s Global Transaction Banking division maximum flexibility in further developing de-risking activities.\nMichael Spiegel, Head of Trade Finance and Cash Management Corporates of Global Transaction Banking at Deutsche Bank, said: “The TRAFIN programme is playing an important role in our ongoing risk and balance sheet management efforts at a competitive cost. Furthermore, as the programme evolves, we expect it to further industrialise our distribution and hedging of trade finance risk.”\nGuy Brooks, Head of Distribution and Credit Solutions in Deutsche Bank’s Global Transaction Banking, added: “The successful placement of this transaction reflects the growing appetite for trade finance assets among institutional investors and also underlines investors’ confidence in Deutsche Bank’s trade finance business and risk management capabilities. With this model, we can tap investors that would usually not consider trade finance as asset class.”\nThe Bank’s TRAFIN platform will allow it to seamlessly scale and industrialize its hedging leading to a more efficient balance sheet management of its trade finance business. The transaction is also aligned to the Bank’s strategic aims of reducing risk weighted assets.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}