{
    "url": "https://www.db.com/news/detail/20151209-deutsche-bank-world-outlook-2016-managing-with-less-liquidity?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "December 9, 2015",
    "tags": [
        "Capital markets",
        "Investment Banking",
        "Research"
    ],
    "title": "Deutsche Bank World Outlook 2016: Managing with less liquidity",
    "body": "Deutsche Bank Research today published its World Outlook 2016. Deutsche Bank expects that global economic developments in 2016 will be significantly impacted by a gradual reduction of liquidity.\n“In a world that has been awash with central bank liquidity for most of the past decade, the central question for the year ahead is how the global economy and financial markets will react as the tap on that liquidity begins to tighten”, David Folkerts-Landau, chief economist and head of research summarized. “While the pivot away from this great monetary experiment is unprecedented and will not be without risks, we expect the world economy and financial markets to weather this turn in policy reasonably well”, Folkerts-Landau added.\nDeutsche Bank Research expects growth in advanced economies to remain stable at just below two per cent in 2016, as growth more than doubles in Japan while euro area growth picks up slightly due to a gradual improvement in the labour market combined with wage increases of around 1.5 per cent. Japan and the euro area should offset a modest deceleration in the US.\nLooking at emerging markets Folkerts-Landau said: “The coming year should see growth in emerging market economies recover somewhat, as the severe contractions in Russia and Brazil moderate and recent declines in export growth are expected to reverse, albeit weakly. Nonetheless, 2016 will be challenging for emerging markets as falling commodity prices and weak global trade growth extend the recent experience of budgetary and balance of payments pressures. China is expected to continue its gradual deceleration, offering little respite to commodity producers.”\n“A further acceleration in global economic activity in 2017 is due to additional improvement in Russia and Brazil, while a pickup in India and stability in China imply a modest acceleration in emerging Asia”, Folkerts-Landau explained.\nThe 25 basis point Fed funds rate hike now widely anticipated at the Federal Reserve’s December meeting would be the first such move since June 2006. This should be followed by three more 25 basis point rate hikes during 2016. Towards the end of next year, Deutsche Bank expects signals that the monetary taps in Europe will begin to close as well. While similar moves are probably more than a year away in Japan, Deutsche Bank Research does not expect the Bank of Japan to add to its asset purchases.\nWhile Deutsche Bank’s baseline scenario sees the global economy continuing to grow at a moderate pace over the next two years, there are substantial risks on either side. On the down side, global financial markets could respond much more negatively to Fed normalization than expected, with adverse repercussions for household and business spending around the globe. The gap between the market’s and the Fed’s forecast for interest rates suggests that a negative response could result from an upward adjustment in market expectations towards the Fed, even without more aggressive tightening than the Fed currently envisions.\n“A signal that the Fed will begin to wind down its reinvestment of securities could add to this turbulence. This downside risk would be exacerbated if there was a surprising resurgence of inflation pressures in the US as the unemployment rate moves below full employment”, Folkerts-Landau explained. “Such a development would force the Fed to adopt a significantly more rapid pace of normalization.”\nA more aggressive Fed would, in turn, be negative for risk assets with potentially strong depressing effects on aggregate demand. A sharper than expected slowdown in China next year would have obvious knock-on effects on commodities, global trade and emerging markets.\n“But on the positive side, it is possible that the recent poor performance of productivity growth globally especially in the US has been an aberration, and that recent technological advances could spur a surprising recovery”, Folkerts-Landau added.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}