{
    "url": "https://www.db.com/news/detail/20151204-deutsche-bank-streamlines-secure-online-authentication-for-corporate-clients?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "December 4, 2015",
    "tags": [
        "Company",
        "Corporate products",
        "Digitalisation",
        "Investment Banking"
    ],
    "title": "Deutsche Bank streamlines secure online authentication for corporate clients",
    "body": "Deutsche Bank’s Global Transaction Banking (GTB) division is extending the use of SWIFT’s 3SKey service to provide a complete single token service for secure customer authentication on its Autobahn App Market, Deutsche Bank’s electronic product offering providing direct online access to Bank-wide services in a single location. SWIFT’s 3SKey is a multi-bank personal identity token using digital signatures and strong authentication. It can be used on any banking channel and allows corporates to securely log in to online banking applications and sign financial transactions sent to their banks using a single device.\nIndividual identification for corporates using online banking is a necessity, and this has traditionally been achieved through the use of multiple proprietary signature tools for each different bank. The access control can differ greatly among banks, each using their own tools with varying levels of authentication and workflows. As treasurers often work with a large number of banks, they need to deal with many different authentication methods and passwords to login and authorise orders for online banking transactions. A response to these challenges is SWIFT 3SKey.\nMichael Spiegel, Global Head of Trade Finance and Cash Management Corporates at Deutsche Bank said: “We are increasingly seeing new entrants – including non-banks – at different stages of the wholesale banking value chain. Offering market leading solutions and improving the corporate client experience is therefore key in maintaining our leading edge. At the same time, through SWIFT 3SKey, we continue to meet the highest security standards.”\nDavid Watson, Global Head of GTB Cross-Product Components and Regional Head of Product Management Americas at Deutsche Bank added: “3SKey is an excellent example of SWIFT providing collaborative market solutions supporting robust security standards for confirming a person’s identity with a one bank-agnostic high-security device. Supporting 3SKey allows us to leverage current industry trends and brings tangible benefits to our online clients. It is therefore a logical next step to extend 3SKey beyond SWIFT and EBICS France to our global Autobahn App Market, providing access to more than 180 applications across Deutsche Bank’s electronic products and services.”\nAndré Casterman, Global Head of Corporate and Trade Markets at SWIFT concluded: “3SKey brings multi-banking to identity management. Rather than having to carry a bag of bank-specific tokens, corporate treasurers can now greatly benefit from SWIFT’s multi-bank 3SKey technology by having one single token. After a successful launch of 3SKey for personal signing of files in 2013, Deutsche Bank proves again its leadership in embracing SWIFT’s multi-banking solutions at a global level by extending their use of 3SKey to user authentication on their Autobahn App Market.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}