{
    "url": "https://www.db.com/news/detail/20151203-narratives-of-inclusion-can-cities-help-us-live-together?language_id=1",
    "language": "DE",
    "article_type": "Event",
    "publish_date": "December 3, 2015",
    "tags": [
        "Corporate Citizenship",
        "Sustainability"
    ],
    "title": "Narratives of Inclusion: can cities help us live together?",
    "body": "December 3, 2015 \n18:30 – 20:00 GMT\nVenue: London School of Economics, Sheikh Zayed Lecture Theatre\nThe event will be live-streamed and presentations will be available on the website lsecities.net\n\nSão Paulo, Brazil. © by Tuca Viera\nCities like New York, Rio de Janeiro and Mumbai are booming. Things seem to be going well for these cities. But who exactly is it going well for? Eminent urban sociologist Richard Sennett and author Suketu Mehta raise questions of identity, grounding and belonging in the contemporary city.\nBy exploring the urban experiences and narratives of migrant communities and their inextricably linked connections with both their new and their home environment, this debate will consider one of the greatest challenges for any city builder today: how do we form a community within these enormous, historically unprecedented, and continuously mobile agglomerations of people?\nCan we create cities and neighbourhoods which perhaps are not fully inclusive but at least are not exclusive to particular groups? How can we live better together in the 21st century city, these 10…20…60 million people living side-by-side, and on top of each other?\nWelcome:\nThomas Matussek, Director, Alfred Herrhausen Society\nSpeakers:\nRichard Sennett, Professor of Sociology, London School of Economics and Political Science and New York Universtiy, Chairman, Advisory Board, LSE Cities\nSuketu Mehta, author The Maximum City, Associate Professor of Journalism, New York University\nChair:\nTessa Jowell, former MP and UK Government Secretary of State, Professor in Practice, London School of Economics and Political Science\nGlobal Debates series to celebrate ten years of the Urban Age programme\nLSE Cities and Deutsche Bank’s Alfred Herrhausen Society, in association with Guardian Cities, is holding a series of public Global Debates to celebrate ten years of the Urban Age programme. The debates will discuss five core themes that have been the focus of research and debate at the Urban Age since 2005. \nAbout Urban Age\nNot unlike urbanisation itself, the Urban Age project is about the flows of ideas, people, information and resources. At its centre lies the intellectual question of how the physical and social are interconnected in cities.\nBy investigating the urban dynamics in different regions of the world – with vastly diverse patterns, scale and speed of urbanisation – the Urban Age attempts to both chronicle and reflect on what it means to live in the contemporary city. Since 2005, the project has held conferences in 13 different cities in four continents and developed an interdisciplinary methodology that forms the core of its research and outreach activities.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}