{
    "url": "https://www.db.com/news/detail/20151202-deutsche-bank-gives-usd-1-million-to-address-homelessness-in-new-york-city?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "December 2, 2015",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank gives USD 1 million to address homelessness in New York City",
    "body": "The Deutsche Bank Americas Foundation today announced it has selected four New York City organizations that support four distinct homeless populations – veterans, domestic violence survivors, LGBTQ youth, and formerly incarcerated individuals and their families – as grantees for its initiative to address homelessness in the five boroughs.\nMore than 57,000 people were sleeping in New York City shelters nightly in October 2015, with more than 40% of them children, according to the Department of Homeless Services. The combined USD 1 million in resources will allow the four organizations to provide immediate relief through new or expanded services and to develop a longer-term strategy to end homelessness for these target populations.\nThe four grantees are:\nA team that comprises Enterprise Community Partners, a national not-for-profit that has created or preserved more than 49,000 affordable homes in New York City since 1987, and works to connect homeless households to high quality affordable housing, and the Mayor’s Office of Veterans’ Affairs, which facilitates innovative private-public partnerships to offer services to local veterans, their dependents and survivors.\nSanctuary for Families, New York City’s largest provider of integrated direct services, community outreach, training, and policy advocacy on behalf of domestic violence survivors and their children.\nThe Ali Forney Center, which aims to protect and advocate for homeless LGBTQ youth by providing shelter, housing, and the wraparound services they need to reclaim their lives and become independent.\nThe Fortune Society, which serves over 5,000 incarcerated or formerly incarcerated men and women annually through holistic, one-stop service provision.\n“Deutsche Bank is committed to finding innovative solutions to urban problems, and funding affordable and supportive housing has been a longtime focus for us,” said Jacques Brand, Chief Executive Officer of Deutsche Bank North America. “These new grants will make a difference by providing immediate relief to homeless individuals while helping organizations develop strategies to end homelessness.”\nSince 1990, Deutsche Bank has financed more than USD 2.5 billion in affordable housing, community development initiatives and economic development projects benefitting disadvantaged communities. The Deutsche Bank Americas Foundation’s Supporting Housing Acquisition and Rehabilitation Effort and Working Capital programs have provided over USD 20 million in philanthropic resources to support the pre-development of affordable and supportive housing. These funds leveraged more than USD 2.5 billion in other sources of project finance and have led to the creation of affordable homes for over 10,000 New York City households, many of whom were formerly homeless.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}