{
    "url": "https://www.db.com/news/detail/20191219-deutsche-bank-provides-first-green-financing-of-commercial-aircraft?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "December 19, 2019",
    "tags": [
        "Corporate products",
        "Sustainability"
    ],
    "title": "Deutsche Bank provides first green financing of commercial aircraft",
    "body": "Deutsche Bank is playing a part in lowering carbon emissions in air travel by providing the first ever green financing for a commercial aircraft.\nThe bank is financing the lease of three low-carbon emission 72-600s planes built by France’s ATR, a leading regional aircraft manufacturer, to Swedish regional airline Braathens Regional Airlines (BRA). The planes are being leased to BRA by Singapore-based leasing company Avation. The first plane was delivered to BRA today.\n72-600s aircraft create significantly less environmental impact than other jets and turboprops, emitting 40% less CO2. For shorter distances, they also accelerate air using less power and therefore burn less fuel.\nOnce BRA receives all of its ordered ATR aircraft early next year, it will operate an entire fleet of ATR 72-600s, helping the airline meet its commitment to reducing its environmental impact. BRA expect to emit 7,500 fewer tonnes of CO2 per aircraft per year as a result.\nReplacing old jets with modern alternatives in an arrangement like this is aligned to the\nPDF\nLoan Market Association’s Green Loan Principles (GLP), according to Vigeo Eiris, the Environmental, Social and Governance (ESG) ratings agency.\n“We are hopeful that this leads the way for more sustainable financing activity in aviation, and increased adoption of lower carbon emission aircraft across the industry, to help make flying more eco-responsible,” said Richard Finlayson, Deutsche Bank’s Head of Global Transportation Finance, Asia.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}