{
    "url": "https://www.db.com/news/detail/20191218-2020-outlook-the-end-of-monetary-magic?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "December 18, 2019",
    "tags": [
        "Corporate products",
        "Private products"
    ],
    "title": "2020 outlook: the end of monetary magic?",
    "body": "At the end of a tumultuous decade for the global economy and markets, central banks’ monetary policies are still firmly centre-stage.\nHowever, with global economic growth set to slow in 2020, Deutsche Bank Wealth Management asks whether we are close to seeing the end of monetary policy dominance.\n“Whether we like it or not, central bank “magic” will continue to play an enormous role in both economic policy – and markets,” says Christian Nolting, Global Chief Investment Officer for Deutsche Bank Wealth Management, identifying six themes for the coming year in the CIO’s annual outlook, published this week.\nThe evolving investment environment will remind us of the importance of strategic asset allocation for portfolio robustness\nChristian Nolting, Global Chief Investment Officer for Deutsche Bank Wealth Management\nThe six themes for 2020 highlight the key implications of likely economic and policy developments for investment:\nPolicy pressures need prudent response. As global economic growth slows there will be a growing realisation that monetary policy can’t do it all alone, but policy change will take time and a sustainable investment process will be key.\nLiving with a low-yield world. With monetary policy still centre stage for now and yields unlikely to rise appreciably, investors should reassess holdings of non-yielding bonds and investigate how to capture returns from illiquidity premia in private markets.\nFind new income harbours. Looking beyond U.S. Treasuries, some other developed market fixed income areas are still appealing. But keep an open mind about other possible sources of yield – for example in corporate as well as sovereign emerging market bonds.\nBalance your style. Equities could register further albeit more limited gains in 2020, but market dynamics will be shifting. At an equity style level, “growth” stocks’ premiums over “value” could be reaching their peak and high-quality value stocks could offer opportunities.\nPolitics tops policy. For foreign exchange, 2020 could be a year when political developments often prove more important than fundamentals: look for currencies to act as portfolio diversifiers. Geopolitics alone won’t drive oil prices higher but gold maintains its allure.\nTech meets ESG. Two new long-term investment themes are launched. 5G Fast Forward looks at the broader implications of faster communications for industry and “big data”. The Environmental, Social and Governance (ESG) theme of Resource Stewardship focuses on waste management and recycling.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}