{
    "url": "https://www.db.com/news/detail/20191212-innovation-labs-in-the-us-recognised-at-american-financial-technology-awards?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "December 12, 2019",
    "tags": [
        "Awards",
        "Company",
        "Digitalisation",
        "Research"
    ],
    "title": "Innovation Labs in the US recognised at American Financial Technology Awards",
    "body": "At the prestigious American Financial Technology Awards, the bank’s innovation labs in New York and Palo Alto have been honoured as best IT team. The award, presented by Waters Technology magazine, recognises the team's achievements in using a holistic strategy to bring innovative technology into the bank.\n\"This award is a testament to our strong presence in America and highlights the importance of innovation, one of the core values of our firm\", said Christiana Riley, who is responsible for the bank's operations in the Americas. \"Congratulation to the team on this great success.\"\nIt is not without reason that the innovation labs have a presence in two locations in the US. In Palo Alto the team is virtually at the heart of perhaps the world's most important innovation centre, Silicon Valley. Here, the colleagues have quick and easy access to start-ups, venture capital companies and think tanks - and of course the opportunity to work with some of the leading technology companies. And as the world's largest financial centre, New York is the most relevant location for identifying innovations for the Investment Bank and Corporate Bank business.\nGlobally, the bank’s innovation labs have already discovered more than 3,600 start-ups since their foundation, and the US labs on the West and East side are both a very important ecosystem for this.\nFinding solutions for real world problems\nWith their worldwide network, the bank’s innovation labs are at the pulse of the international start-up scene to identify digital solutions for the individual challenges of the bank's business and infrastructure areas. \"Our approach is not to identify innovative solutions and then see if there is an application for them within the bank,\" explains Rich Shannon, who leads Technology and Operations for the Americas.\nThe bank goes about it in exactly the opposite way, Shannon adds: “It always starts with a specific question from a business or infrastructure area of the bank for which the innovation labs find suitable innovative solutions from start-ups.”\nThe questions the labs approach jointly with their business and infrastructure colleagues are manifold. They range from optimising or automating processes, improving data analysis and usage, or identifying solutions to help individual business units, to drive revenues and to create new business opportunities.\nFor example, the innovation team helped colleagues at DWS and the Corporate Bank use artificial intelligence technology from a New York based startup to automate processes that were previously done manually.\nIn order to test innovations in the Investment Bank's business, a test bed was set up in the New York Innovation Lab. This is a kind of small-format trading system that can be used to test new technologies separately from the bank's production systems – the aim being, for example, to make foreign exchange and fixed-income securities trading both simpler and quicker.\nJoerg Landsch, who leads the innovation teams in America, was also delighted with the award. “This award recognises the great collaboration between business, technology, operations and infrastructure teams here in the US and globally – innovation is a team sport!”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 48
}