{
    "url": "https://www.db.com/news/detail/20191210-deutsche-bank-reports-solid-progress-on-transformation-strategy-and-reaffirms-financial-targets?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "December 10, 2019",
    "tags": [
        "Company",
        "Corporate products",
        "Financial Results",
        "Investment Banking",
        "Strategy"
    ],
    "title": "Deutsche Bank reports solid progress on transformation strategy and reaffirms financial targets",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) today reported progress on its transformation strategy, in line with or ahead of its objectives.\nThe bank reaffirmed its 2019, 2020 and 2022 cost targets. Adjusted costs before transformation-related charges and the impact of the Global Prime Finance transfer to BNP Paribas are expected to be 21.5 billion euros in the full year 2019, with a target of 19.5 billion euros in 2020 and of 17 billion euros in 2022, a reduction of nearly 6 billion euros relative to 2018.\nIn addition, Deutsche Bank reaffirmed its commitment to delivering on its transformation strategy within existing capital resources and to maintaining a Common Equity Tier 1 (CET 1) ratio of at least 12.5% at all times throughout its transformation. Asset reduction in the Capital Release Unit is running ahead of plan. For the end of 2019, the bank currently anticipates it will report a CET 1 ratio of above 13%.\nChristian Sewing, Chief Executive Officer, said: “In the past few months we have made significant progress on every dimension of our strategic transformation. We are in line with our plan and even ahead in several areas.”\nDeutsche Bank reaffirms its target of an 8% post-tax return on tangible equity (RoTE) in 2022. Management recognises that this has become more ambitious given external headwinds, particularly interest rate developments in the euro area. Deutsche Bank has implemented a series of measures intended to substantially offset the impact of lower interest rates. These include loan growth, selectively passing through negative interest rates, balance sheet measures to further optimise liquidity reserves, and taking advantage of deposit tiering arrangements introduced by the European Central Bank. For the Core Bank, which excludes the Capital Release Unit, Deutsche Bank today announced a post-tax RoTE target of above 9% in 2022.\nManagement anticipates that the interest rate environment will primarily impact the outlook for returns in the Private Bank and Corporate Bank in the mid-term. However, revenue growth in the Investment Bank is currently expected to partially offset this impact together with improvements in Corporate & Other.\nDeutsche Bank is pleased with Investment Bank revenues in the fourth quarter to date, especially in the Fixed Income and Currencies Sales & Trading business where revenues are above the prior year period.\nChristian Sewing, Chief Executive Officer, added: “Making a strong start to our unprecedented transformation was all important. Clients, regulators and our own people have all voiced their firm support for the path we have embarked upon. This support will help us progress our transformation in a disciplined manner.”\n  For further information please contact:\nDeutsche Bank AG\nMedia Relations   \nSebastian Kraemer-Bach \nPhone: +49 69 910 43330\nEmail: sebastian.kraemer-bach@db.com\nChristian Streckert\nEmail: christian.streckert@db.com\nPhone: +49 69 910 38079\nCharlie Olivier\nPhone: +44 20 7545 7866\nE-mail: charlie.olivier@db.com\nInvestor Relations\n+49 800 910-8000 (Frankfurt)\n+44 20 7541-4100 (London)\n+1 212 250-0604 (New York)\ndb.ir@db.com\nAn Investor Deep Dive will take place today, Tuesday, 10 December 2019, at 13.00 CET. This conference will be broadcast via internet: www.db.com/ir\n  Cautionary Statements\nNon-IFRS Financial Measures\nThis document contains non-IFRS financial measures. For a reconciliation to directly comparable figures under IFRS please refer to the Financial Data Supplement Q3 2019 and to the Earnings Report as of September 30, 2019. These documents are available at: www.db.com/quarterly-results",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}