{
    "url": "https://www.db.com/news/detail/20191202-deutsche-bank-announces-two-senior-hires-in-technology-data-and-innovation?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "December 2, 2019",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank announces two senior hires in Technology, Data and Innovation",
    "body": "Dilip Khandelwal will join as Managing Director and Head of Technology Centres, based in Pune. Khandelwal will oversee the development of the bank‘s Technology Centres globally to create one, consistent strategy while continuing to work with our businesses on developing technology to improve the client experience. He will also become Head of Technology, Data and Innovation for Asia Pacific and Chief Information Officer for Human Resources, Legal and Communications. Khandelwal joins from SAP where he led large scale transformation to accelerate customers to the cloud. Under his guidance, SAP Labs India became one of the top contributing Technology Centres at the company, with highest employee engagement.\nGil Perez will join the bank as Managing Director and Head of Strategy & Innovation. Perez will oversee innovation strategy, thought leadership, and technology innovation partnerships, ensuring that the bank continues to evaluate and match business demand with appropriate third-party technology solutions. Perez joins from SAP, where he spent 8 years working with enterprise companies guiding them through their respective digital transformation journey.\nBernd Leukert, Head of Technology, Data and Innovation at Deutsche Bank, said: “The opportunity to transform technology at a global company like Deutsche Bank is a unique challenge for talented and ambitious technologists. With Dilip and Gil we are gaining two outstanding technology leaders who will help bring our IT strategy to life. They have built proven track-records within the technology industry for being innovative, transformative and focused on clients’ needs. I know they will complement the expertise we are fortunate to have at Deutsche Bank and help position technology at the centre of the bank’s activities.”\n\nFor further information please contact:\n\nDeutsche Bank AG\nMedia Relations\nSenthuran Shanmugasivam, London\nPhone: +44 (20)154-72838\nEmail: senthuran.shanmugasivam@db.com\nSebastian Kraemer-Bach, Frankfurt\nPhone: +49 (69)910-433\nEmail: sebastian.kraemer-bach@db.com\nInvestor Relations\n+49 800 910-8000 (Frankfurt)\n+44 20 7541-4100 (London)\ndb.ir@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}