{
    "url": "https://www.db.com/news/detail/20191201-the-trade-offs-a-price-worth-paying?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "December 1, 2019",
    "tags": [
        "Research"
    ],
    "title": "The trade-offs: a price worth paying?",
    "body": "There is no question that climate change is one of the biggest and most tangible challenges the world has ever faced. And there is no question that coordinated global action is urgently needed. But when the discussions about this action are taking place, policymakers must have an understanding of the trade-offs involved so they can act to mitigate any negative consequences. That is what this section aims to present.\nThe last few years have seen a significant tipping point in the awareness of the human impact on the environment. Even in the US where there has been more scepticism, Figure 19 shows that in the last two years alone, the proportion of Americans who think that global warming is caused by natural changes in the environment has fallen sharply from 33 per cent to 23 per cent after a near decade of being static at the former figure.\nMeanwhile in the EU, over the last 18 months, the share that suggests that environment-related issues are among the two most important issues in their country has doubled to 20 per cent.\nIt’s not unreasonable to suggest that this awareness and concern will continue to spread. However, the difficulty might come when we all become aware of the hard choices that need to be made on a personal level and how many noble lifestyle changes might in reality make limited difference.\nDo we have the luxury of time?\nAccording to the United Nations Climate Change group, to avoid the worst effects of climate change, science tells us we need to limit global temperatures to a rise of 1.5 °C, or a maximum of 2 °C above pre-industrial levels. This is also the central goal of the Paris Agreement. According to the UN, the warming is now at 1.1 °C and could easily reach 1.5 °C by 2030.\nWhile it is difficult to precisely predict how much time the world has before climate change results in irreversible damage, it seems certain that governments around the world will take more assertive action on the issue. The extent to which governments take action is a matter of public policy and something that voters will effectively approve or reject. As policymakers are considering their action, it is important that they understand the trade-offs involved.\nThe trade-offs and the risks of international disagreement\nIt is clear that we have reached a tipping point for public awareness around the need to act on climate change. However, we think there is much less understanding of the economic and lifestyle trade-offs that are needed to meet current climate targets.\nWhile there are certainly environmental benefits to making individual lifestyle changes, such as moving to a plant-based diet, it remains that about three-quarters of carbon emissions come from three sources: transport, industry, and electricity generation.\nSo while the small changes that people make to their lifestyle should be applauded, even in aggregate, some of these may not make a material dent in the globe’s emission profile if aggressive short-term climate action is required.\nThe big-picture items that matter\nTo really have an impact in the short term, there must be action on the big-picture items that matter – and that involves hard decisions and trade-offs. For a small taste of the difficult big-picture decisions that need to be made, consider a controversial study by Wynes & Nicholas in 2017. This showed that having one fewer child is 24 times as effective at reducing personal annual carbon emissions as the next-best alternative of living car-free.\nAccording to this research, while other lifestyle choices have a positive impact on a person’s emissions, they do not begin to compare to the impact of reducing family sizes. While this work has been debated since its publication, the point is that as the environment becomes more and more important an issue across the globe, to really make a difference, populations will increasingly be confronted with incredibly difficult choices. These are not just related to family sizes but other big macro issues.\nNotwithstanding the moral and ethical landmine within this part of the study, population growth has historically been a big component of economic growth. And with a heavy debt burden and an ageing population, without continuous population growth, the current economic model will become unsustainable.\nAnother example of why a big-picture holistic solution is needed comes from research by Levine in 2019 (Global Warming: What Sort of Mess Have We Made?). In this study, he argues the resources being used to combat climate change can be inefficiently allocated as most countries focus only on their own use of carbon. For example, some rich cities spent large amounts of money electrifying buses. Yet, if that money were used to subsidise green energy in a developing country, it could offer a much greater environmental benefit. Many of the hurdles here are, of course, political.\nIf humans do nothing\nEven if humans do nothing to mitigate climate change, the economic impact is likely to be minimal. To illustrate, the oft-cited Stern Review points out that warming of 8.6 °C will reduce per capita global GDP by 13.8 per cent by 2200 and only 2.9% by 2100 (4.3 °C). In addition, a recent NBER report estimated that world real per capita GDP could fall 7.2 per cent by 2100 if nothing is done about climate change.\nEven the IPCC’s most severe scenario, RCP 8.5, would entail a mean warming of the global temperatures of 3.7 °C by 2081-2100 relative to the 1986-2005 average. And the upper end of the 90% confidence interval (for what is already the most extreme scenario published) is 4.8 °C warming.\nOf course, this is not to say that the effects of a warming planet are purely economic and therefore should be ignored. Many of the effects of climate change, such as the effect on air quality or the heightened risks of natural disasters and loss of life, cannot be measured simply in terms of national accounting.\nNeither can the wide regional distribution of the likely damage. But it would be unsurprising if some countries chose to prioritise the economics over environmental concerns. Indeed, given the global nature of climate change, at an individual level it may well be advantageous to free-ride off the efforts of others.\nOutlook\nLooking forward to the coming century, even if the global economy were to grow by just 1% every year (and bear in mind that since 1983 there has been only one year when the global economy grew by less than 2%), the global economy would still expand by 170% over the next 100 years.\nAnd if the global economy sustained growth of 2% a year for the next 100 years, then we would see a 624% expansion over the next century. So from an economic standpoint, losing just a fraction of that future growth would still leave a country vastly richer than it is today.\nGiven the potential for free-riding, multilateral solutions are therefore mandatory. The worry here is that disagreement between some countries makes it possible that the next trade war could be an environmental one. Consider that proposals in both the US and Europe could see the implementation of country or region-specific 'carbon border adjustment taxes'. These could levy a tariff on imports based on the carbon used in creating the product.\nFrom one point of view, this could be a good way to discourage countries from \"exporting\" their emissions. The tax would ensure that carbon is taxed where it is consumed rather than where it is generated. From another point of view, the policies could be used to protect local businesses. Consequently, it seems likely that while internal political pressure may see some countries implement such a tax, it may ignite a disagreement with a trade partner that could turn into a trade war.\nAside from potential taxes on imported products, countries need to accept that if they wish to pursue a path of aggressive, short-term emission reduction, it will necessarily involve targeting transport, industry, and electricity generation. This could involve policies that restrict factory production at certain times, that restrict transport, in particular people’s ability to drive their cars, and that cut peak load power generation at certain times.\nPolicies to reduce emissions\nThere is evidence from both developed and developing countries that have implemented these types of schemes for various reasons. But while it can have positive environmental effects, there are tangible economic consequences that may make those environmental policies unsustainable.\nFirst, consider how these policies to reduce emissions may affect the workforce. It has been observed that mandated hours for factories can lead to unemployment or underemployment. Given how it has recently become very visible that the loss of manufacturing jobs over the last few decades has contributed to a fractured society and politics, this is a topic that needs to be included in the conversation.\nFor transport, a blanket restriction on the proportion of cars that can be driven on a certain day means people have fewer employment options, while businesses may have to offer longer delivery times. Furthermore, policies to force people into more efficient or electric cars could have the flow-on effect of making existing cars unsellable. For lower-income owners, that could present a very serious problem, especially if their car is financed with debt.\nStaying with autos, hitting emission targets will be hard for carmakers.\nReaching the goal of halving vehicle emissions by 2030 implies engine efficiency improvements of five per cent each year, well above the three per cent seen over the last decade. Assuming carmakers strive to hit their targets, there are three key things they can do – but there are costs associated with each.\nThe first is further improving the combustion engine. If the halving of emissions is to be achieved this way, then they need to fall from 119 grams of carbon per kilometre to 60. As a rule of thumb, every gram per kilometre of carbon reduction costs €65 for mass market vehicles and €120 for premium cars.\nSo, if carmakers pass on the entire cost, the price of the average regular petrol car will rise by nearly €4,000, and a premium car by €7,000. At the same time they may have to accept lighter, less powerful cars. How will consumers react to more basic cars and a higher cost? Will it impact their willingness to urgently tackle climate change?\nElectricity\nRegarding electricity generation, shortages because of load restrictions on high pollution power plants will inevitably cause or exacerbate economic problems. Relatively quick alternatives risk political argument. Already, there have been protests in Germany about ending coal-fired electricity.\nThis may be a perfectly good policy, but unless renewable power plants can be brought up to the same level of capacity as existing high-pollution plants, the only alternative may be widespread nuclear power – a policy for which there is fractured support. The cold truth is that there are still no powerful, reliable, cost-efficient and low-carbon technologies that can satisfy the world’s growing appetite for energy.\nOn the demand side, the global population is growing at a rate of about 80 million people each year with a constantly growing economy.\nThis means energy consumption will also increase further in absolute terms. Sadly, efficiency gains are being more than offset by the rebound effect of more users and more intensive usage.\nOn the supply side, despite the considerable investments, renewable energies, such as wind power and photovoltaics, are still not capable of satisfying the growing global energy demand. Moreover, inexpensive and efficient industrialized storage technologies are still lacking, making it impossible to store enough surplus power from renewable sources.\nThe IEA baseline scenario forecasts that the share of all renewable sources of energy (including hydro and bioenergy) in global electricity generation will rise from 26 per cent currently to 44 per cent by 2040. More than half of this total is to be provided by wind and solar power in 2040.\nAt the same time, the IEA expects the share of wind and solar power in primary energy demand to rise from two per cent currently to seven per cent by 2040.\nMeanwhile, the share of fossil fuels in global primary energy demand should only decline from 81 per cent currently to 74 per cent by 2040.\nThe good news is that investments in renewables look set to rise further in the coming decades; the bad news is that this is already factored into forecasts that suggest fossil fuels will still be overwhelmingly dominant over this period.\nAccording to the baseline scenario presented in the latest World Energy Outlook by the IEA, aggregate investments in renewables are likely to amount to about 8 trillion US dollars by 2040. This means that they will exceed the sum of all investments in all other sources of energy (oil, coal, natural gas, nuclear energy) taken together. Despite these huge sums, the IEA expects energy-related carbon emissions to rise by 0.3 per cent each year until 2040 on average.\nA price worth paying?\nSome will argue that the side effects to the wider economy are a price worth paying to more quickly reduce emissions. But while there is certainly a debate to be had over the extent of the economic price worth paying, those involved in the debate should also understand how these policies can contribute to widening inequality.\nThe reason why the sweeping policies that have the effect of restricting growth can hurt the poorest in society is that they are the people that can least afford to mitigate the effects of those policies on their lives. Take, for example, the policy implemented several times in Paris that has banned cars from driving into the capital on alternating days based on whether the number plate is odd or even.\nFor those who could afford two cars, with alternating number plates, there was relatively little impact on their lives. In contrast, those who could afford only one car were severely impacted. Compounding the problem for one-car families is the fact that workers in lower-income groups tend to have less ability to negotiate their work hours. Indeed, anger of this type was exactly the type of motivation that contributed to the Gilets Jaunes protests in France.\nProtest movements of this type should be eye-opening for policymakers as they show that aggressive environmental action, without due respect to the economic consequences, can change the mood of the public which, in turn, may eventually seek new leadership. Consider that one of the key catalysts for the Gilets Jaunes protests was a fuel tax that was intended to disincentivise the use of fossil fuels. Given the power of protest movement, President Macron has responded to some of their demands.\nThe alternative to blanket restrictions on carbon emissions is to raise prices to disincentivise their use. This can come in the form of higher power prices, higher taxes for old cars, mandatory charges on goods that are made in polluting factories, or many other such initiatives. Again, these widen inequality as those who can’t afford to pay are either worse off or miss out.\nHow to mitigate these pain points\nOne way around the pain points associated with environmental policies that restrict growth is enormous government spending, particularly on renewable energy projects. This includes subsidies to help refit factories and industrial plants. In the absence of a sharp uptick in inflation, it seems likely that ‘Green Quantitative Easing’ is inevitable despite the merits of this type of policy not yet being fully discussed.\nThe problem is that this inevitably means governments taking on more debt right when they already have a debt problem. Of course, the current low level of bond yields means the large debt pile is manageable. However, the picture becomes scary if and when yields rise. That is why increasing amounts of debt will be bought by central banks, either to finance green initiatives or to ensure that legacy debt built up in the years of excess does not default en masse and topple economies.\nThe other option is placing the onus on the private sector. This would involve enacting policies that make it the obligation of an individual company to refashion itself to reduce carbon within a fixed timeframe. On the face of it, this may seem like a sensible plan. After all, companies are generally in great shape.\nYet there are significant issues to consider.\nGiven the costs involved in aggressively reducing carbon, companies would have to raise large amounts of capital, putting pressure on their ability to create jobs and on equity and debt markets and potentially reducing the value of pension pots.\nFinally, there is a tough choice to be made by democratic governments. Should they press ahead with policies to aggressively reduce carbon emissions, then it is almost certain that at least some of the side effects noted above will eventuate. As most governments have a poor record of being re-elected during an economic downturn, those governments will have to implement their policies knowing that there is a risk they will lose their jobs.\nFurthermore, as the last decade has shown, economic malaise fuels populism. So if governments with well-meaning environmental policies are subsequently voted out, there seems to be a material chance that a replacement, populist government will reverse those policies and, if current trends are a guide, become less willing to partake in the multilateral action that is necessary to combat the environmental issues faced by the world.\nThe good news\nWhile there are trade-offs and hard decisions to be made, there is good news. Specifically, the evidence shows that economic growth does not depend on emissions and can indeed disconnect from them.\nIf this evidence holds more broadly, it means that growth does not have to come at the expense of the environment – and the reason why it has, particularly over the last half century, is that it has been easy to do so and there has been no penalty. Given that environmental externalities have been well known for some time, this essentially means there has been an inefficiency in the market system.\nThe UK is a good example of what can be done when an economy moves from being an industry-based economy to being one based on services. The following charts show how economic growth and carbon emissions were tightly tied during the UK’s period of industrialisation. However, since the UK finished its industrialisation process, emissions have disconnected from growth, particularly over the last 50 years.\nA similar trend of disconnection can be seen when emissions are compared with wages and productivity. In summary, the trajectory of the UK’s economic growth has continued in a relatively stable direction whilst carbon emissions have fallen.\nOf course, some of the drop in carbon emissions can be accounted for by the \"exporting\" of emissions to other countries for manufacturing, but the phenomenon of this decoupling of emissions from growth has persisted nonetheless.\nAgainst the backdrop of the largest developed countries having seen much economic and technological progress since their emissions peaked, it seems unlikely that rapidly developing emerging nations will reach the same emission peaks. But if developed countries are serious about reducing global emissions, and not just embarking on virtue-signaling domestic policies, they need to help the developing world transition.\nTherefore, multilateral agreements are critical.\nIf they can be made, it is not unreasonable to suggest that we are not too far away from a world in which emissions fall everywhere. That said, it is worrying that at the very time that multilateral organisations are needed the most to combat climate change and help deal with inequality and debt, the world faces a backlash against globalisation in some quarters and these organisations are under fire.\nWe can draw some optimism from the evidence that global growth potential is higher than at many times in the past. That is because globalisation has eroded some of the roadblocks that previously held back some countries. ‘Technology skips’ have already been witnessed in telecommunications, particularly in Africa and India where the uptake of smartphones and data usage is exponential. This has helped millions of people engage in the local and global economy and boost their incomes, without the country needing a build-up of heavy industry.\nThe investment world is changing fast too, so there is now a financial incentive to ‘do the right thing’. Almost half of the world’s assets under management fall under an ESG banner in some way, and this will likely increase to 95 per cent over the coming decade.\nThe greater awareness of how ESG issues affect companies is already having an impact on share prices. The following chart shows that positive climate change news and actions lead to higher company share prices; the move towards more assets coming under an ESG umbrella should only amplify this trend.\nThis gives weight to the evidence that environmental degradation is not an inherent part of economic growth and that the relationship between growth and carbon emissions cannot only be severed, but it can actually be reversed so that companies have financial incentives to maintain a sustainable business model.\nWe need new sources of growth\nEven if there is evidence that growth can coincide with falling emissions, the need to accelerate progress is fairly urgent if you accept the climate emergency. Given that the economic growth and financial performance we are familiar with have been tied to environmental damage, it is necessary to find new sources of growth to take advantage of the fact that growth and pollution do not have to be linked.\nOne avenue for growth is to take advantage of new technologies. Indeed, there is reason to hope that if the world is on the cusp of a fourth Industrial Revolution – one of artificial intelligence – then technological advancements could reach a point over the coming decade where they begin to be implemented at a rapid pace. This could also help reverse the hard-to-explain dip in productivity growth over the last few decades.\nCutting-edge advancements bear much promise for growth. Just one example comes from the industrials sector, where the Internet of Things is just beginning to shake up manufacturing and logistics.\nIndeed, ABB, the engineering group, estimates that digitalisation technologies could be a $20bn revenue opportunity and result in $1tn of annual savings in operating expenditures for its customers.\nFurthermore, new technologies are beginning to help combat climate change and other environmental issues. For example, Australia is developing a blockchain tool to help make its complex water rights and trading systems more efficient. Water is also critical to India, where the country has developed an IoT cloud-based system to help clean up the Ganges, while another IoT system in Kanpur is helping improve air quality. Across the world, countries are implementing new technologies that allow real-time monitoring of environmental infrastructure to maximise efficiency and minimise downtime.\nWhile there is real and legitimate excitement in the promise of technologies such as artificial intelligence and 5G communications, it is necessary to be pragmatic as well as hopeful. After all, AI and associated technologies – such as the Industrial Internet of Things – are currently nowhere near as widespread as they need to be to have a material impact on any of the mainstream measures of growth.\nTogether, they contribute to around one per cent or less of global production. And consider that robotics, now a decades-old technology, contributes to less than ten per cent of global production. These figures need to push up to 20 per cent or more in order to meaningfully add to GDP growth.\nDue to the slow contribution to growth of cutting-edge technology, some of the ‘big picture’ gains may be found elsewhere. We discussed earlier that it is the developing world where some of the best uses of funds to mitigate climate change can be applied. Similarly, we should look to the developing world to find the most reliable sources of growth. This is because if developing countries can be assisted to implement technologies that are already established and proven in advanced countries, they can provide an outsized contribution to global growth compared with advanced countries trying to implement as-yet-unproven new technologies.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}