{
    "url": "https://www.db.com/news/detail/20230918-deutsche-bank-boosts-investment-in-south-korea?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 18, 2023",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank boosts investment in South Korea",
    "body": "Deutsche Bank will increase its capital allocation for its Seoul branch by 150 million Euros, a 36.7% increase in our investment, to grow the business and undertake more activity for its clients. \n“We see great opportunities in South Korea and are investing accordingly,” said Alexander von zur Muehlen, CEO of Asia Pacific, Europe, Middle East & Africa (EMEA) and Germany and Member of the Management Board.\nDeutsche Bank has a 45-year history in South Korea, Asia’s fourth largest market. Korea is the thirteenth largest economy in the world, having successfully transformed itself from a low-income to high-income economy over the past few decades.\n“South Korea is one of the leading economies in Asia and a cornerstone for the tech sector globally. Its focus on innovation and technology industries combined with its world-class infrastructure, highly skilled workforce, and dynamic private sector, position it strongly for long-term growth,” said von zur Muehlen.\nThis additional capital, along with our recent re-entry of the local debt capital market, will enable us to better support our clients’ expansion plans in the country and reinforce the successful platform that we have built over past decades.\nAlexander von zur Muehlen\nThis investment points to the continued importance of South Korea and Asia Pacific to Deutsche Bank, following a near doubling of the bank’s investment in Vietnam earlier this year.\nThe capital injection was agreed with the governor of the Korean Financial Supervisory Service (FSS) in Frankfurt last week; another example of strong Korean-German economic ties as both markets mark 140 years of diplomatic relations this year.\n“By strengthening and broadening our capabilities, we are well positioned to take our business to the next level and be the leading foreign bank in South Korea,” said Branch Manager for Seoul, Hyun-Nam Park.\nPDF\nYou can read the full press release here.\nAbout Deutsche Bank in South Korea\nDeutsche Bank provides a full range of solutions to clients in South Korea; from multinational companies to large local corporates and financial institutions.\nDeutsche Bank’s investment banking business in South Korea continues to outperform peers; with its recent re-entry to the South Korean debt capital markets in July complimenting its successful advisory business.\nFor corporate banking, Deutsche Bank Korea won Best Trade Finance Provider for the third year and Best Service Cash Management Provider for the fourth year in Euromoney’s 2022 survey.\nThis capital allocation supports the bank’s aspiration to be the “leading foreign bank in South Korea,” said Seoul Branch Manager, Hyun-Nam Park.",
    "number_of_ratings": 2,
    "rating": 4.5,
    "likes": 5
}