{
    "url": "https://www.db.com/news/detail/20230913-deutsche-bank-and-eib-cooperate-to-give-mid-caps-easier-access-to-sustainable-finance?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, September 13, 2023",
    "tags": [
        "Germany",
        "Corporate products",
        "Sustainability"
    ],
    "title": "Deutsche Bank and EIB cooperate to give mid-caps easier access to sustainable finance",
    "body": "A new 400 million euro loan portfolio will fund medium-sized companies’ investments in renewable energy and energy efficiency, along with other projects that meet the sustainability criteria of the EU taxonomy\nCompanies with between 250 and 3,000 employees in Germany and the European Union will be eligible to apply for loans\nDeutsche Bank and the European Investment Bank (EIB) are entering a new cooperation to support mid-sized companies with their sustainable transformation ambitions. Firms with between 250 and 3,000 employees will be able to apply for long-term loans through Deutsche Bank to finance their transition to more sustainable business models. The EIB will provide guarantees covering up to 50 percent of the loan sum. The EIB guarantees will benefit the borrowers in full.   \nThe cooperation will make a total of 400 million euros available to such companies, with at least half of the loans earmarked for financing projects that boost renewable energy production.\nThese guarantees are part of an EU-wide linked risk-sharing (LRS) programme, which uses risk-sharing to reduce some of the access barriers to finance caused by current economic uncertainties, such as supply chain bottlenecks, inflation, rising interest rates and insecure energy supply.\nHauke Burkhardt, Global Head of Corporate Bank Lending at Deutsche Bank, said, “The energy transition in particular entails a high need for transformational financing for many companies. Sustaining this significant financing volume requires strong partnerships – especially between promotional and commercial banks. The LRS programme serves just this purpose. The new partnership between the EIB and Deutsche Bank provides corporate clients with reliable support for their transformation projects.”\nEIB Vice-President Ambroise Fayolle, who oversees bank financing in Germany, said, “We are pleased to be working with Deutsche Bank to support Germany’s real economy in its sustainable transformation, by providing medium-sized companies with long-term loans. Together, we are promoting the expansion of renewable energy and greater energy efficiency. This will accelerate the shift away from fossil energy in Germany.”\n\nFor further information please contact:\nDeutsche Bank AG                                   \nMedia Relations                                         \nHeinrich Frömsdorf\nTel. +49 172 6513461\nEmail: heinrich.froemsdorf@db.com \n\nEuropäische Investitionsbank (EIB)\nCommunication Department\nDonata Riedel\nTel. +49 30 590047 912\nEmail: d.riedel@eib.org ",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 13
}