{
    "url": "https://www.db.com/news/detail/20220525-how-is-the-panda-bond-market-opening-up-to-global-investors?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 25, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "How is the Panda Bond market opening up to global investors?",
    "body": "Panda Bonds, renminbi-denominated bonds by foreign issuers, are an attractive option for overseas investors in China's bond market. How is the market opening up to investors? Watch our “150 seconds on APAC” video with Deutsche Bank’s Samuel Fischer to learn more.\nYou can also read the full transcript of the video here: \nQ: How are Panda Bonds opening up to European investors?\nA: Panda Bonds allow European issuers to access the huge Chinese capital market. What we find issuers most concerned about usually is the timeline it takes to register a domestic program in China. But Chinese authorities have made huge strides in simplifying market access. In 2020 NAFMII has introduced a simplified bond registration and issuance mechanism and we have seen several Panda Bond issuers come to the market under new shelf programmes.\nQ: Which client sectors want to tap into Panda Bonds?\nA: Sector wise, we may see more diversified industrials in addition to auto makers which have played a leading role and are expected to continue doing so in the future. ESG will be a major driver as the EU-China common ground taxonomy which was announced last year will allow European issuers to access the onshore market based on their global frameworks. So, this should definitely be an important new and additional driver for market growth.\nQ: What opportunities lie ahead for investors?\nA: We are very optimistic about the Panda Bond market and we expect more European issuers to come to this market in public issuance format to make use of the attractive funding levels, the depth of the market and importantly to match their huge assets inside China. Panda Bonds don't just happen. They involve a consistent effort with our clients to educate them and help them on understanding the requirements for coming into the market. But once clients have set up their programs and set up their documentation, the benefits can be huge in terms of the size of the market and in terms of arbitrage opportunities, which are open to those who have done the work and are ready to tap the market.\nFind out more about Deutsche Bank in Asia Pacific.",
    "number_of_ratings": 7,
    "rating": 1.6,
    "likes": 69
}