{
    "url": "https://www.db.com/news/detail/20220517-deutsche-bank-links-henkel-supply-chain-financing-to-esg-ratings?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 19, 2022",
    "tags": [
        "Corporate products",
        "Sustainability"
    ],
    "title": "Deutsche Bank links Henkel supply chain financing to ESG ratings",
    "body": "First ever conversion of an existing supply chain finance program in Europe to a sustainability linked program\nIt creates an incentive for suppliers to be more sustainable\nHenkel suppliers in Europe which already participate in supply chain financing with Deutsche Bank can benefit immediately\nDeutsche Bank is linking the Henkel AG & Co. KGaA (Henkel) supply chain finance program to the ESG ratings of Henkel's suppliers. Deutsche Bank is the first bank in Europe to convert an existing supply chain finance program for its client. Through this program, Henkel creates incentives for its suppliers to be more sustainable.\nA Henkel supplier can receive payment immediately after an invoice has been approved by Henkel. The financing costs for the suppliers are based on Henkel's creditworthiness, which means that the suppliers can usually lower their typical financing costs. By improving their ESG rating, suppliers can further reduce financing costs in the supply chain. The prerequisite for this is that they have a corresponding ESG rating.\nInitially, Henkel suppliers in Europe which are integrated into the existing supply chain finance program with Deutsche Bank can benefit from the new structure. Henkel's supply chain finance program for Europe is among the largest in the industry. In a further step, the program will be expanded to include suppliers outside of Europe.\n“The idea of incorporating sustainability criteria into a supply chain finance program has been around for a long time. For the first time, we can now put this into practice with Henkel,” said Michael Dietz, Head of Trade Finance Flow, Deutsche Bank. “Reducing CO2 emissions in the supply chain has a major impact on a company's carbon footprint, because that's where the majority of emissions occur in most industries,” Dietz said. In addition to the environmental component (“E”), the program also takes into account social aspects (“S”) and good corporate governance (“G”). Deutsche Bank has set itself the goal of increasing the total volume of sustainable supply chain financing to 1 billion euros by the end of 2022.\n“Sustainability is an integral part of Henkel's strategic growth agenda. We are convinced that sustainability-linked supply chain financing can help improve sustainability along our value chain,” said Ulrich Borgstädt, Head of Group Treasury Henkel . “This program is further evidence of Henkel's holistic approach to sustainability.”",
    "number_of_ratings": 16,
    "rating": 3.2,
    "likes": 25
}