{
    "url": "https://www.db.com/news/detail/20220519-a-message-from-christian-sewing-bidding-farewell-to-paul-achleitner-and-stuart-lewis?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 19, 2022",
    "tags": [
        "Company"
    ],
    "title": "A message from Christian Sewing, bidding farewell to Paul Achleitner and Stuart Lewis",
    "body": "Dear Colleagues,\nToday's Annual General Meeting marks the beginning of a new chapter for our bank. Not only are we presenting the best results in a decade; we are also proposing a meaningful dividend for the first time in years. This return to attractive shareholder distributions comes after years of being unable to reward our shareholders for their loyalty in the way that we aspire to.\nMore than just opening a new chapter, today also marks the end of an era as we bid farewell to two highly esteemed colleagues after the AGM. As announced some time ago, our Supervisory Board Chairman Paul Achleitner will not be standing for re-election. In addition, our Chief Risk Officer Stuart Lewis decided last year that the 2022 general meeting would mark the end of what has been a long and successful career at Deutsche Bank.\nOur bank owes a great deal to both of them. In fact, without them we would not be the bank we are today: strong, stable, sustainably profitable and with excellent prospects.\nWhen Paul Achleitner took over as Chairman of our Supervisory Board in 2012, our bank was only strong and stable on the surface. It has taken many years of profound changes to get Deutsche Bank back on track.\nPaul Achleitner took on this task and, despite some setbacks, fought wholeheartedly to achieve this goal. He created the conditions that enabled us to consistently resolve legacy issues and to gradually restore confidence in our bank. Paul Achleitner played a key role in setting the pace for our bank’s transformation, which he has helped to drive forward with great foresight. When things got difficult, he was a rock.\nAll that came at a price. Time and again, our outgoing Supervisory Board Chairman put the bank’s interests above his own. On various occasions, he became a scapegoat for the bank, taking criticism for things that had happened long before he took office.\nI am saying goodbye today to a man to whom I owe a lot – a man who has been a valued companion, mentor, advisor and sparring partner. That man is Paul Achleitner. Without him, our transformation efforts over the past years would not have been possible. Without him, we on the Management Board might never have made what were very difficult decisions.\nI have also enjoyed a very long partnership with Stuart Lewis, as have many colleagues. Stuart worked for our bank for 26 years, the last ten of which as a member of the Management Board. Throughout his outstanding career, Stuart made a decisive contribution at many crucial points, enabling our bank to navigate major challenges safely and successfully. The great financial crisis after the Lehman bankruptcy, the sovereign debt crisis in Europe, the Covid pandemic and, most recently, the effects of the Russian invasion of Ukraine, are the most prominent, but far from the only examples.\nStuart played a decisive role in helping us develop a strong risk culture in our bank, with sharper risk awareness in all business areas. This has been one of the key foundations for our successful transformation in recent years. Stuart has shaped the bank's culture in other ways too, with a passionate commitment to diversity and inclusion, notably as Executive Sponsor for dbPride in the UK & Ireland. His commitment to diversity in our bank has been recognised repeatedly.\nStuart's success is also reflected in facts and figures. For many years, our exposure to credit and market risks has been consistently lower than most of our peers. It is also expressed in awards and accolades: in the past ten years, specialist publication risk.net named Deutsche Bank \"Risk Manager of the Year\" four times and, most recently, for a remarkable two consecutive years. \nWe will miss Paul Achleitner and Stuart Lewis. At the same time, we count ourselves fortunate to have two new colleagues, both with decades of experience in leading positions in the global financial industry: Alex Wynaendts, Chairman designate of our Supervisory Board; and Olivier Vigneron, our new Chief Risk Officer. They will give our bank fresh impetus – something that is crucial even in a healthy bank. I am very much looking forward to it.\nLet me close by saying thank you once again to Paul Achleitner and Stuart Lewis. We will remember them both with warm thoughts and memories. I am sure they will both remain closely connected to our company. In fact, it is exceedingly important to us that they do.\nKind regards,\nChristian Sewing",
    "number_of_ratings": 10,
    "rating": 3.5,
    "likes": 15
}