{
    "url": "https://www.db.com/news/detail/20220518-meet-our-esg-experts-lavinia-bauerochse?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 18, 2022",
    "tags": [
        "Sustainability"
    ],
    "title": "Meet our ESG experts: Lavinia Bauerochse",
    "body": "ESG in the Corporate Bank: what does that look like?\nIt’s very much about client dialogue. We continuously seek to understand our clients’ ESG needs, strategies and timelines, and we use our industry-specific expertise and our focus on transition finance to support them on their transformation journey to net zero.\nWhat’s on your radar right now?\nThe current geopolitical climate is of particular relevance to our clients, especially corporates. For example, how to become more self-sufficient with regards to energy-supplies in light of spiking energy prices. Through our in-house expertise and our comprehensive suite of sustainable financing products, we’re able to support these efforts.\nFor example, we recently assisted BASF Group in the acquisition and construction of the world's largest offshore wind farm off the Dutch coast and structured the financing of the complex project. This transaction was groundbreaking in many respects. At a time when energy security is being discussed everywhere, this is the first time that a company has invested significantly in a wind farm itself in order to reduce its dependence on third parties. At the same time, it is an important step for BASF to become climate-neutral by 2050. But also smaller companies are looking into ways of becoming more energy self-sufficient.\nWhat is one of the biggest challenges here?\nClients would prefer a checklist: one set of rules they can adhere to in implementing ESG, but that doesn’t exist. ESG is still an evolving field, so we don’t yet have standardised regulation, frameworks or even definitions. For example, we all talk about “transition finance”, but different stakeholders interpret and use the term in different ways.\nClients would prefer a checklist: one set of rules they can adhere to in implementing ESG, but that doesn’t exist\nOn top of that, regulatory frameworks differ by jurisdiction, but our clients are global; what we really need is a level playing field internationally with clear, standardised ESG parameters.\nHow do you work around that?\nStandardisation will take time. However, we cannot wait for everything to be sorted before we begin. Yes, there are risks involved with getting started before things have been set in stone, but there are also risks to playing catch up if things move too far ahead without you. ESG is moving fast and there are tremendous opportunities for innovation within this field.\nWe cannot wait for everything to be sorted before we begin\nIn fact, ESG and sustainability offer many opportunities even beyond innovation. Through ESG, clients can engage in new markets, strengthen connections with current customers, attract new ones, and deepen their relationships with employees. We’ve seen clients come up with very creative ideas and new business opportunities solely from their focus on transforming to a more sustainable business model. Not to mention the technological innovation that is coming out of this space.\nHow receptive are Deutsche Bank’s clients to these ESG conversations?\nThere is huge interest from clients who want a better understanding of how sustainability impacts their business activities, and how banks and capital markets are looking at ESG criteria. Many clients in high carbon emitting industries are already well aware of the need to define their transition strategies, and are developing plans to adapt their business models.\nFor many others, navigating the pandemic was their primary focus over the last two years, and they are just beginning to assess relevant sustainability drivers. Clients are looking for our view to help them understand the regulatory environment, investor perspectives and how ESG is impacting their industry. Part of our role as coverage teams is to accompany our clients on implementing their ESG strategy, and to understand on which pathways they are looking to transition. We help to finance their specific needs.\nWhat about Deutsche Bank’s own ESG efforts?\nOur ambition is to be a leader in sustainability and ESG. We were the first bank to join H2Global, a German initiative facilitating hydrogen imports into Europe, as a founding member, and are also a founding member of the German-Australian hydrogen alliance. Deutsche Bank was also the first bank to join the Ocean Risk and Resilience Action Alliance (ORRAA) as a full member.\nWe have integrated sustainable finance in an already comprehensive product suite, making it ESG compliant. In the Corporate Bank, we have a full range of our treasury toolkit available in an ESG compliant way to provide access to sustainable financing solutions including capital markets. And we are keen to provide solutions for clients with regards to capital expenditure (CapEx) investments – funds used by a company to acquire, upgrade, and maintain physical assets such as property, buildings, technology, or equipment – which are required in financing ESG transition.\nEvery client with financing needs will have ESG questions come up at some point\nEvery client with financing needs will have ESG questions come up at some point, so all client-facing employees must understand ESG and its drivers and be competent in this space. This means that employee training in ESG is paramount, not only in coverage but also the product development and processing space.\nLooking inwards, Deutsche Bank recently disclosed the financed emissions of our overall corporate loan portfolio for the first time, showcasing our current status and the financed emissions that we are currently supporting. This is a significant first step in providing transparency. It also highlights why it is important to understand the targets our clients have set themselves, because they impact our own ESG targets. We have also re-affirmed our commitment to publish 2050 net zero targets for our key carbon intensive portfolios, together with intermediate targets for 2030, by the end of this year.\nAnd looking forward, we have just announced that we are arranging the first sustainability-linked supply chain finance programme for one of our clients.\nWhat’s next for ESG financing and regulation?\nA transition to net zero will require significant investments in CapEx, and in transforming and decarbonising business models. Some of these will be new investments, while others will be reallocations that go towards sustainable process developments or less GHG intensive processes. This will create a lot of innovation across the industries, with new technological advances and collaboration across the field, which is particularly exciting. Having so many stakeholders from different disciplines working collaboratively on ESG solutions is something outstanding in the field of sustainable financing and ESG.\nA transition to net zero will require significant investments in (...) decarbonising business models\nWe’ll also see more dialogue around responsible ownership and wind downs with regards to carbon intensive assets. In the past, some actors sought to improve their emissions by selling carbon intensive assets. However, the question is whether a sell-off and continued operation by other operators really leads to responsible decarbonization, as gray or private markets are less transparent or supervised – so this will not necessarily help us achieve net zero. \nIn terms of regulation, we expect more clarity and detail from the European Union this year with regards to their social taxonomy and, later on, transition taxonomy. So, we’ll have more standardised guidelines on what is considered Social criteria, for example. We’ll also see green bond standardisation introduced, which will be a gold standard for green bonds moving forward.\nThere’s a heavy emphasis on the ‘E’ of ESG – how are we delivering on the ‘S’ and the ‘G’?\nEurope has traditionally focused on decarbonisation, which is only one aspect of the ‘E’. Our focus is now broadening to include more environmental aspects, such as biodiversity and soil sealing, which are strongly linked to climate change.\nHowever, the pandemic and the war in Ukraine have created a real need for action on many social issues. We have seen the devastating effects these events have had on various groups of people; for example, children, whose education and mental health have been severely affected. We see more clients creating initiatives and projects to address this.\nIn fact, clients are now beginning to link their performance towards environmental, social and governance targets with their financing, which we are able to support through sustainability-linked transactions and structures. This is where a client sets ESG targets they want to improve on and integrates them into their financing, underlining their commitment to their sustainability strategy.",
    "number_of_ratings": 7,
    "rating": 2.4,
    "likes": 17
}