{
    "url": "https://www.db.com/news/detail/20220517-transgender-in-india-seema-s-journey-from-hardship-to-hope?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 17, 2022",
    "tags": [
        "Asia-Pacific",
        "Diversity"
    ],
    "title": "Transgender in India: Seema’s journey from hardship to hope",
    "body": "Seema Kumar Javed Ali is a transgender woman from Mumbai. Her biological parents abandoned her at birth and her foster family left her when she was 10 years old. Homeless and alone, Seema spent many nights sleeping in rickshaws, in constant fear of being abused.\nThere are over 4.8 million transgender persons in India. Lack of awareness, social stigma and resulting discrimination means that they often face severe hardship and are compelled to resort to begging or prostitution to fend for themselves.\nSeema managed to find work as a domestic helper with a monthly salary of 1,000 rupees (around 12.50 euros). Eight years later and after a difficult marriage, Seema took charge of her life. She moved out of her house with savings of 20,000 rupees (around 245 euros) and was lucky to find work in a beauty salon, where she discovered her calling to become a beautician.\nWith her desire to finish her secondary education, Seema approached many schools but was denied admission. Then she found Masoom’s GSPM Night School in Mumbai. She attended classes virtually during the pandemic and has just done her tenth-grade exams. While she eagerly awaits her results, she has enrolled herself in a six-month hair and beauty course. Deutsche Bank has committed to providing Seema with seed money of 150,000 rupees (around 1,800 euros) to open her own beauty salon once she has finished her course. “I have always had a strong desire to be self-reliant, I now have hope to realise all my dreams!” says Seema.\nDeutsche Bank supports Masoom’s Night School Transformation Programme as part of its CSR In the Community programme. The programme pays for the secondary schooling of adults who have either dropped out or have never attended school. This allows them to work during the day to financially support themselves. Over the last six years, the bank has provided infrastructure, resources and capacity building for the school, positively impacting the lives of more than 6,600 adults.\nIn another community outreach programme during the pandemic, the bank distributed 230 hygiene and sanitation kits to members of the transgender community in Mumbai and Delhi.\n ",
    "number_of_ratings": 7,
    "rating": 4.0,
    "likes": 12
}