{
    "url": "https://www.db.com/news/detail/20220509-lift-off-for-basf-wind-farm-project?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 9, 2022",
    "tags": [
        "Corporate products",
        "Sustainability"
    ],
    "title": "Lift-off for BASF wind farm project",
    "body": "Deutsche Bank has successfully advised BASF on a complex M&A and project financing transaction for the acquisition and construction of the world’s largest offshore wind farm, Hollandse Kust Zuid (HKZ).\nFor BASF, the world’s largest chemical producer, this is the first major investment in renewable energy and a key step in its transformation toward climate neutrality by 2050. The wind farm will generate green electricity for BASF’s production sites in Europe. HKZ will have a maximum of 140 wind turbines and will produce green electricity equivalent to the annual consumption of over two million households. Construction has already started on the wind farm, which is located in the North Sea, approximately 53 kilometers off the west coast of the Netherlands.\n“This is the first time a corporate has acquired a major stake in a wind farm to secure its energy demand. Given the current macro environment, this strategy is key for corporates to facilitate independence from fossil fuels and ultimately to enable the green transition of our economy,” says Johannes Hermanns, Mergers & Acquisitions DACH at Deutsche Bank's Investment Bank.\n“Given the decreasing cost per MWh we expect that offshore wind will play a larger role in the energy mix in Europe and globally. Corporates as investors and as energy off-takers will be key to enable this transition process,” adds Michael Volkermann, Head of Project Finance at Deutsche Bank's Corporate Bank. \nKey transaction details\nOn June 24, 2021, BASF acquired a 49.5 percent stake in Vattenfall AB’s under-construction 1.5GW offshore wind farm project.\nOn December 6, 2021, BASF announced that it has entered into a definitive agreement to sell 51 percent of its stake to Allianz Capital Partners. With this transaction now complete, ACP effectively owns a 25.2 percent indirect stake in HKZ. As a part of the on-sale to ACP, BASF committed to purchase a vast majority of the power generated by the wind farm under a long-term corporate power purchase agreement.\nDeutsche Bank’s role\nDeutsche Bank has acted as a sole financial adviser to BASF both on the acquisition from Vattenfall with a total financial engagement for BASF of 1.6 billion euros, the subsequent sale of 51 percent of its stake to ACP and the project financing.\nDeutsche Bank structured the project financing from scratch, tailoring it towards the specific project structure and client’s requirements.\n ",
    "number_of_ratings": 9,
    "rating": 3.7,
    "likes": 13
}