{
    "url": "https://www.db.com/news/detail/20170830-a-message-from-john-eydenberg-chairman-deutsche-bank-americas-foundation-on-hurricane-harvey?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "August 30, 2017",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "A message from John Eydenberg, Chairman, Deutsche Bank Americas Foundation on Hurricane Harvey",
    "body": "Dear Colleagues,\nAll of us at Deutsche Bank are moved by the images and stories we are witnessing as Hurricane Harvey continues to leave devastating effects in Texas. There are reports of loss of life and many have been driven from their homes, losing most everything in its wake. While the full extent of damages is not yet known, it is apparent that the effect of the storm will be severe.\nIn addition to matching employee donations to charities responding to the disaster, the Deutsche Bank Americas Foundation is initially committing 300 thousand dollars to nonprofit organizations that will be active in Houston’s rebuilding, particularly for its most vulnerable residents. Grantees will include BakerRipley, a local community development nonprofit that has a longstanding relationship with the Houston office, and other community organizations, as they develop their efforts.\nOur thoughts also remain with our colleagues in the Houston office as they continue to endure the storm. We are grateful that all have been accounted for through the diligence of the Information & Resilience Risk Management (IRRM) team, who are working around the clock to ensure both personal safety and business continuity. The bank understands that some of our employees have been directly impacted by this, and is offering financial resources to help them with immediate short-term needs.\nJohn Cryan, who is closely monitoring the situation, said: “I would like to thank everyone for their dedication to ensuring the safety of our colleagues in Houston and for their desire to help those who need it most. We can take great pride in the compassion of our employees.”\nThank you again for your generosity.\nSincerely,\nJohn Eydenberg\nChairman, Deutsche Bank Americas Foundation\nVice Chairman, CIB Americas",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}