{
    "url": "https://www.db.com/news/detail/20170829-frank-strauss-joins-management-board-of-deutsche-bank?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "August 29, 2017",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Frank Strauß joins Management Board of Deutsche Bank",
    "body": "Frank Strauß will join the Management Board of Deutsche Bank on September 1, 2017. The Supervisory Board has appointed the 47-year-old to the management body. Together with President of Deutsche Bank Christian Sewing, Strauß will co-head the Private & Commercial Bank.\nHe will also remain in his role as Chairman of the Management Board of Postbank. Sewing and Strauß will be jointly responsible for merging Postbank with Deutsche Bank’s Private & Commercial Clients business. Plans for Strauß’s appointment to the Management Board had already been made in the spring of this year – the regulatory requirements for this have now been met.\nStrauß, who was born in Schleswig-Holstein, has a thorough knowledge of both organisations. Having completed training to become a bank officer in Iserlohn, he moved to Frankfurt in 1995, where he held various management positions at Deutsche Bank and Deutsche Bank 24, its former subsidiary. From 2002 onwards he coordinated European operations in the bank’s Private & Business Clients division (PBC). In 2005 he took over responsibility for developing the bank’s Asian operations in Mumbai and Beijing. One year later he was appointed Head of Private & Business Clients Germany. In July 2011 he moved to Postbank, where he became the Management Board member responsible for sales, before assuming the role of Chairman one year later.\n“We are strengthening our Management Board by appointing such a distinguished expert in private and commercial banking who is very well acquainted with both Deutsche Bank and Postbank”, said Paul Achleitner, Chairman of the Supervisory Board of Deutsche Bank. “Together with Christian Sewing, Frank Strauß will ensure that the upcoming merger will combine the best of both worlds.”\n“I’m looking forward to now working together with Frank on the Management Board”, said John Cryan, Chief Executive Officer of Deutsche Bank. “Our integrated Private & Commercial Bank will be a crucial factor for our success, especially in our home market of Germany.”",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 1
}