{
    "url": "https://www.db.com/news/detail/20170822-35-mm-a-story-of-collaboration?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "August 22, 2017",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "35 MM: a story of collaboration",
    "body": "Getting employees to collaborate on an important deal or high-stakes project is fairly common but getting them together to write a 200-page novel is more remarkable. Five employees in India did exactly that and the result is “35 MM – A Hidden Target”, a thriller available on Amazon and other leading online book stores.\nThe idea for collaborating on a fundraising book came from the India Service Centres’ Learning Committee, a staff network that promotes learning culture across India. The authors were selected after a contest which saw over 60 written submissions. “Choosing the authors was only half the battle,” says Artendu Mund, one of the project leads. “The real challenge was channeling their thoughts towards the common goal, while ensuring that their creative freedom remained intact.”\nThe five authors, who live in different Indian cities, collaborated for over a year and half to write and publish the book which tells the story of four individuals who set out on a quest for self-discovery as they run from personal conflicts. The quest, which allows them to pursue a shared passion for photography, takes them to exotic locations across Northeast India but soon turns into a battle of survival.\nThe authors relinquished their rights to the book with all royalties going to Sankalp Foundation, an Indian NGO that works with patients suffering with thalassaemia, a genetic blood disorder.\nWith demanding jobs and long work days, the authors had to find creative ways to make time for this project. “Inspiration can strike you anywhere and at any time; you have to find a way to turn your thoughts to words. Very often I wrote on my phone during my commute,” said Arvind R, one of the co-authors.\nThe co-authors of 35 MM are Arvind R, Neha Maltare, Sonal Gianchandani, Sandhya Konduru and Vikram Wakhlu.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}