{
    "url": "https://www.db.com/news/detail/20170803-24-hours-of-code-passion-creativity-and-a-whole-lot-of-coffee?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "August 3, 2017",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "24 hours of code, passion, creativity and a whole lot of coffee",
    "body": "After 24 hours of brainstorming, designing and coding, the winner of Hack I.T., Deutsche Bank’s largest hackathon, has been announced.\nThe winning team, Mavericks, in Pune, developed a prototype application called BuddyConnect that uses a user friendly interface and clever programming to match people with the required skills and experiences across the bank.\nDeutsche Bank wants to become more technology-led and part of that ambition is to establish shorter development cycles to speed up the process of innovation. Hackathons are an important part of this strategy as they create an environment where teams can come together and work intensively to reach a specific outcome.\nHack I.T. was Deutsche Bank’s third global hackathon and the biggest so far. It saw over 450 Deutsche Bank technologists in 12 locations compete around the clock to design, develop and build a fully functional prototype that helps create meaningful connections across Deutsche Bank’s 100,000+ employees.\n\"Events like this are important for the bank,” explained Pascal Boillat, Group Chief Information Officer. “Financial services are being transformed by digital technology and data. We need rapid transformation, rapid innovation, rapid development and rapid time to market. This event demonstrates all of this over 24 hours.”\nThe global event saw teams take part in Bangalore, Bucharest, Cary, Eschborn, Frankfurt, Jacksonville, London, Moscow, New Jersey, New York, Pune and St Petersburg. Teams worked alongside women from the bank’s Student to STEMette programme and engineering students from the Arkwright Scholarship Trust.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 0
}