{
    "url": "https://www.db.com/news/detail/20151125-capital-markets-outlook-2016-broad-diversification-key-to-stable-portfolios?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 25, 2015",
    "tags": [
        "Asset Management",
        "Capital markets",
        "Corporate products",
        "Investment Banking",
        "Wealth"
    ],
    "title": "Capital Markets Outlook 2016: Broad diversification key to stable portfolios",
    "body": "Deutsche Bank anticipates a continuation of the cyclical recovery in industrial countries and a stabilisation of the Chinese economy in 2016. Experts expect economic growth of around 3.5 percent worldwide and around 6.5 percent in China next year, as the bank announced in its Capital Markets Outlook 2016 presented in Frankfurt today.\n“One of the main factors driving this development is domestic consumption,”\nsaid Stefan Schneider, Deutsche Bank Chief German Economist. “In the sectors, we are currently observing a shift away from manufacturing and industry to more services and consumption worldwide.” The German economy is also likely to benefit from this development. Deutsche Bank expects gross domestic product (GDP) to rise by 1.9 percent in 2016 – the highest overall growth for Germany in five years – to which the spending in connection with the inflow of refugees could contribute some 0.25 percentage points.\nOn equity markets, valuations, which are already running rather high in some places, coupled with companies’ moderate profit expectations are limiting the potential of many indices. This is being exacerbated by a high level of price volatility, in line with expectations. Dr Ulrich Stephan, Chief Investment Officer for Deutsche Bank’s private and business clients, believes that equities are a preferred asset class in an environment of low interest rates. “Investors aiming for a minimum level of returns will not be able to avoid equities in 2016 either.” Stephan sees the DAX at 11,700 points at the end of 2016.\nAll in all, 2016 will hold particular challenges in store for investors, not only when it comes to equities. While real estate may offer interesting investment opportunities, adequate bond yields will probably be difficult to achieve without additional risk. Commodities could return to the centre of investor focus over the course of the year should the current excess supply diminish.\nIn Stephan’s opinion, it is therefore all the more important to diversify portfolios broadly across asset classes, regions and sectors, to take hedging mechanisms into account and to think carefully about every individual decision, also with a view to potential dividend payments when it comes to investing in equities.\nMacroeconomy: Weak trend, but stable cycle\nThe pace of global economic growth is likely to rise slightly for the first time in five years, potentially from 3.1 percent in 2015 to just under 3.5 percent in 2016, according to Deutsche Bank forecasts. “We are still in a cyclical phase of stabilisation,” Chief Economist Stefan Schneider said. Growth should be driven more strongly than in previous years by domestic consumption and services rather than industrial production.\n“However, especially in emerging markets, it will probably not be on par with the pre-crisis rates due to country-specific problems, the drop in commodity prices and the anticipated change in US monetary policy,” Schneider stressed.\nGermany: Above-trend growth\nIn light of modest global momentum, domestic demand will in all probability remain the main engine of the German economy. “Consumption is likely to grow by 1.8 percent in the year ahead. Following 2.0 percent in 2015, that would be the second-highest figure in the past 15 years,” Stefan Schneider forecast. The development of real incomes, which will remain favourable, and additional spending as a result of the inflow of refugees, which could contribute around 0.25 percentage points to economic growth, are set to have a stimulating effect, he added.\n“I expect the German economy to grow by a total of 1.9 percent in 2016,” Schneider said. Deutsche Bank anticipates the economy of the eurozone to grow by 1.6 percent. Chief Investment Officer Ulrich Stephan sees the continued slow pace of implementing reforms as the main risk factor: “Sooner or later, the members of the eurozone – including Germany – will no longer be able to keep up if they do not get serious about their reforms.”\nUS: Budget compromise creates relative calm\nThe US economy will also see slight growth in the year ahead, increasing from 2.4 percent in 2015 to 2.5 percent in 2016, according to Deutsche Bank. The hike in the key interest rate by the US Federal Reserve, which is anticipated in mid-December 2015 and will probably be followed by further changes to the interest rate in the year ahead, is unlikely to change this situation. Potential fallout from the presidential election campaign also appears manageable.\n“The fact that the budget for the next two years was approved in late October 2015 reduces the potential for conflict between Republicans and Democrats significantly,”\nUlrich Stephan said. However, the world’s largest economy will feel the impact of the propensity to invest, which remains low. Although IT and the consumer sector are likely to step up their investments, they will in all probability not be able to compensate for the decline coming from the oil industry, which made drastic cuts to capital expenditures as a result of the falling oil price.\nAsia: China’s growth is stabilizing\nIn China, the country’s government is likely to continue stimulating the domestic economy. “I expect the second-largest economy in the world to generate sound growth of around 6.5 percent in 2016,” Ulrich Stephan said. Alongside an expanding real estate sector, consumption within China could also make a significant contribution to growth.\nBy contrast, Japan is unlikely to benefit from the weak yen to the same extent in 2016 as in the past. Nevertheless, Deutsche Bank still expects to see growth of 1.5 percent there. Domestic consumption is providing short-term support, and the country should be able to benefit from the Abe administration’s reform policies in the long term, according to Stephan.\nCapital markets: Central banks moving in uncharted territory\nMonetary policy will retain its strong influence on the development of global capital markets in the year ahead. The consistency and transparency of the policy decisions made by the Fed, the European Central Bank (ECB) and their counterparts will determine whether central banks’ actions support or further unsettle markets. “After months of talk of raising interest rates, Fed chairman Janet Yellen suddenly started casting doubt about rate hikes in the near future back in September.\nThat kind of thing leads to great uncertainty on the markets,” Ulrich Stephan noted. Deutsche Bank now expects the Fed to raise the key interest rate for the first time on 16 December 2015, followed by one or two additional moves in 2016. In contrast, the ECB could still resolve to lower the deposit rate this year and then decide to expand its bond-buying programme until March 2017.\nWhen it comes to the US dollar, Stephan sees a clear trend: “I expect the greenback to continue gaining strength against all major currencies.” The dollar is likely to reach a price of at least 1:1 against the euro over the course of 2016. The timing of this parity depends to a great extent on the decisions of the Fed and the ECB and could even occur before the end of the year. The US dollar’s rapid rise in value would then slow correspondingly in 2016.\nThe negative impact of a successively stronger dollar will probably remain manageable for emerging countries. However, investors should expect short-term and at times greater exchange rate fluctuations, as well as the consequences to match, for their investments in foreign currencies, especially when it comes to countries with current account and budget deficits – known as double deficits – coupled with faltering structural reforms (such as Brazil and Turkey).\nAsset classes, regions and sectors\nBonds: Much ado about no return\nComparatively low-risk bonds, such as 10-year Bunds, are unlikely to produce interesting yields in 2016 either. “However, I see potential in investment-grade US corporate bonds,” Ulrich Stephan explained. These bonds could produce yields of around 3.5 percent. Disproportionately high risk is necessary for even higher yields. The default rate on interest payments among issuers of US high-yield bonds is likely to rise significantly – to 3 to 4 percent by the end of the year, including the potential to spread to Europe.\nIn Ulrich Stephan’s opinion, exchange rate development will play a major role in emerging market bonds: “If emerging market currencies stabilise against the US dollar and the euro, the high interest coupons could also lead to profitable yields once again that won’t be largely eaten up, as has been the case over the course of the year so far.” China’s influence is another factor. Emerging market bonds could benefit if the world’s second-largest economy pulls off a positive surprise.\nEquities: Seven year bull market – temper your bets\nAfter seven years of bull markets, share prices could see slower development on the whole and more pronounced volatility in the year ahead. First, corporate profits are likely to record a mere single-digit rise. Turnover growth has slowed significantly, and margins are already at record highs. Second, valuations have already reached fair levels. While Ulrich Stephan sees additional potential in some cases, he does not anticipate a broad-based expansion of price-earnings ratios, making it appear all the more important to take dividend yields into account.\nFor investors, the key will be to focus on the right parts of a diversified portfolio. At a regional level, Stephan believes that developed markets, such as the US or the eurozone, are generally more promising than emerging markets. When it comes to sectors and companies, the task at hand is to identify those capable of bucking the trend by continuing to increase turnover and margins, with a primary focus on cyclicals from the financial and technology sectors.\nIn consumer markets, investors should look to companies that cater to cyclical consumption rather than staples, such as the automotive and media sectors. Focus should shift over the course of the year to include more defensive equities from sectors such as healthcare and staples, which make products for everyday needs.\nEurope: Good prospects for the DAX\nEuropean equities should remain a popular investment in 2016. One reason for this is investment by institutional investors with comparatively low risk budgets, who could place greater focus on more defensive dividend equities as a replacement for low-yielding bonds. The reporting season for the third quarter of 2015 was also rather positive for eurozone companies.\nDeutsche Bank places profit expectations for Europe as a whole at a moderate 9 percent in 2016. “We expect the Stoxx 600 to reach 410 points by the end of 2016. That’s a price potential of nearly 10 percent,” Stephan said. On account of its strong cyclical nature, the DAX is likely to benefit additionally from a potential economic recovery in China and an improvement in market sentiment.\n“All told, I believe the DAX will hold many opportunities in store in the year ahead,” Stephan said, “especially considering that the headwind for the automotive sector could continue to die down over the course of 2016.”\nUS: Stable, with positive potential for surprises\nLosses in the energy sector in particular have led to somewhat weaker development on the US equity market over the course of 2015 so far. For the year ahead, Deutsche Bank expects to see a return to more stable growth. The anticipated key interest rate hikes by the Fed should continue to boost the US dollar and stimulate demand for US equities. “Above all, cyclical consumption, such as in the automotive and media sectors, looks promising to me.\nThe IT, pharmaceutical and financial sectors are also interesting due to the above-average profit expectations,” according to Stephan. Because of its size and importance, most investors will once again find it hard to steer clear of the US equities market in 2016. Deutsche Bank continues to keep a cautious eye on oil and gas companies.\nAsia: Interesting prospects overall\nIn Deutsche Bank’s view, it is worthwhile for investors to take a closer look at Asian equities markets. While the Indian equities market and the Chinese stock market in Hong Kong are the ones to watch, Stephan sees the main potential in developed markets, especially Japan. Japanese companies’ profit expectations, which remain high, and their large cash holdings, which leave a great deal of room for dividend increases or share buybacks, are the reasons for this.\nWhat is more, Japan appears to be on track to securing the future of its economy through sweeping reforms. “I think Japan should be a part of any balanced portfolio,” Stephan said.\nReal estate: Big city is beautiful\nThe global trend of migration to urban areas seen in recent years is set to continue in 2016. Supply growth is unlikely to be able to keep up with the corresponding demand for real estate, resulting in rising prices. In the US, Deutsche Bank continues to view the sound labour market as a strong driving force for both the residential and office real estate markets.\nIn Europe, German cities in particular, such as Hamburg or Cologne, are likely to be interesting. Unlike markets that have reached an advanced stage of maturity, such as London, these locations still seem to be fairly valued. Stephan: “The formation of a bubble on the German real estate market is not in sight at the present time.” All in all, Deutsche Bank believes that a globally broadly diversified real estate portfolio has the best potential for returns.\nCommodities: Strongly influenced by the dollar and supply\nDue to the many influencing factors, forecasts regarding the development of the oil price for the year ahead are associated with major uncertainties. “However, I believe that the oil price has probably at least bottomed out,” Stephan said. Still, supply and demand will probably not move more into line with each other until closer to the end of 2016, resulting in a rise in prices.\nLarger jumps should not be expected, barring any surprise decisions by OPEC to decrease output. Forecasts regarding gold are just as uncertain at the present time. Although some central banks, especially in emerging countries, could increase their reserves, rising interest rates in the US and a stronger dollar could create headwind. Stephan: “When it comes to gold, I see prices trending sideways or even falling in 2016.”\nAsset allocation: Low interest rates, volatile equities – multi-asset strategy could prove key to stable portfolios\nInvestors may be well advised to avoid focusing too strongly on just a few investments in the year ahead. “A multi-asset strategy – the broad diversification of a portfolio over different asset classes, regions and sectors – will be more important than ever in 2016,” Ulrich Stephan said. He considers a significant equity ratio at the beginning of 2016 to be advisable in a balanced securities portfolio, with a regional overweighting towards developed markets rather than emerging markets.\nThe allocation could be one-quarter each in German, Japanese and US equities combined with a mix of additional Asian and European stocks. When it comes to bonds, the focus is on investment-grade US corporate bonds. High-yield bonds, however, entail excessive risks in view of the expected yields. Real estate investments and liquidity should round out the portfolio. Commodity investments may become interesting once again over the course of the year, provided that the current excess supply diminishes.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}