{
    "url": "https://www.db.com/news/detail/20151119-deutsche-bank-supports-first-offshore-wind-project-bond?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 19, 2015",
    "tags": [
        "Sustainability"
    ],
    "title": "Deutsche Bank supports first offshore wind project bond",
    "body": "Deutsche Bank’s Global Transaction Banking division has been mandated as project agent, security trustee, paying agent, account bank and registrar for the acquisition financing of the Gode Wind 1 offshore wind farm in Germany.\nThe project will encompass 55 wind turbines, installed 33 kilometres north-west of Norderney, with a combined output of 330 megawatt, enough to power approximately 340,000 homes. Together with sister project Gode Wind 2 it will be Germany’s biggest offshore wind farm.\nGode Wind 1 owner Dong Energy agreed to sell a 50 per cent stake in the greenfield offshore wind farm to Global Infrastructure Partners, an independent infrastructure fund manager.\nThe EUR 556 million 10 year investment grade bond offering was financed by institutional debt and arranged by lead manager Talanx along with a group of German asset managers and insurance companies.\nDeutsche Bank will act in various capacities to support and manage the fixed rate deferred drawdown bonds issued privately through an investment vehicle. This includes the project agent role, which will assist both borrower and investors with ongoing management of key project information and guidance with decision making during the remaining construction period and operational phase of the project.\nRafe Morton, EMEA Head of Corporate Trust, Global Transaction Banking, Deutsche Bank, said: “We are very pleased to be supporting this first of its kind transaction. The project agent role was developed to support borrowers and investors throughout the lifecycle of their investment through our experience in infrastructure finance. The innovative structuring of the finance parties and continued appetite from non-traditional lenders for this asset class could open doors to similar opportunities for our transaction bank to work closely and more widely with sponsors and institutional investors going forward.”\nThis transaction is another first for Global Transaction Banking in the infrastructure space and the third project agent mandate following the closing of Belgium’s A11 and Germany’s A7 project bonds last year.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}