{
    "url": "https://www.db.com/news/detail/20151111-deutsche-bank-sells-frankfurt-city-center-site-to-gross-und-partner?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 11, 2015",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank sells Frankfurt city-center site to Groß & Partner",
    "body": "After two years of preparations, Deutsche Bank today announced the sale of its city-center site in Frankfurt am Main to Groß & Partner Grundstücksentwicklungsgesellschaft mbH (Groß & Partner). The transaction has already been fully completed and both parties have agreed to main confidentiality regarding the purchase price.\n\nAndreas Torner, Central Germany Regional Head at Deutsche Bank said: \"The sale of this city-center site means that we are consolidating our Frankfurt locations and freeing up this site at the heart of the city for Frankfurt's urban planners to assign it a new use. After many rounds of constructive talks with the City of Frankfurt and potential investors, we are pleased to have found in Groß & Partner a project developer that will endeavor to redevelop the site in a way that fits in perfectly with Frankfurt's urban landscape over a longer term.\"\nNikolaus Bieber, Managing Director at Groß & Partner, stated: \"This transaction marks the acquisition of one of the most attractive inner-city development sites in Germany. After more than two years of preparations, we are now looking forward to turning our attention to the upcoming tasks involved in this project, which is exceptional for Frankfurt. Information on the next steps will be provided in due course.\"\nOlaf Cunitz, Mayor of Frankfurt and the city's Chief Planning Officer, added: \"The City of Frankfurt has been an active partner throughout the entire sales process. The plans are an opportunity to redevelop this prime location in Frankfurt, thereby enhancing its attractiveness for all of the city's residents. First and foremost, we expect changes that will continue to make the banking district a lively and diversified location with a greater focus on residential space.\"\nThe 16,159m² site is located between Große Gallusstraße, Neue Schlesingergasse and Junghofstraße, and comprises a number of buildings and open spaces, including the wing at Junghofstrasse, which was built in several sections between 1952 and 1962, and the 21-storey office building at Große Gallusstraße 10-14, which the Bank moved into in 1971. Deutsche Bank will continue to occupy the office building and other necessary space there until 2017. After this time, staff will relocate to the \"Deutsche Bank Campus\" on Mainzer Landstraße 11-17, at the corner of Weserstraße, joining other employees who already work there.\nThe transaction with Groß & Partner does not affect the building next door at Rossmarkt 18 and the Deutsche Bank branch located there. This was sold in a separate transaction and leased back under a long-term agreement in January 2015.\nGroß & Partner has 140 people in its employ. The company describes itself as a fully-integrated project developer. It has completed a number of key projects, especially in Frankfurt and Hamburg. For example, the construction of new company headquarters for Deutsche Börse, Ernst & Young, LSG SKY Chefs and DB Schenker AG.\nWith the construction of four buildings in Frankfurt's Westhafen marina, Groß & Partner also played a role in redefining the location's image. Other property development projects include districts such as Gateway Gardens at Frankfurt airport or the Überseequartier (\"Overseas Quarter\") in Hamburg. Groß & Partner recently announced the construction of a 140m-high tower in Frankfurt in cooperation with Commerz Real, comprising a Melia hotel combined with hotel-related usage and business apartments.\n\nFor further information please contact:\nDeutsche Bank AG\nPress and Media Relations\nKlaus Thoma\nPhone: +49 69 910-33405\nE-Mail: klaus.thoma@db.com\n\nGroß & Partner Grundstücksentwicklungsgesellschaft mbH\nNikolaus Bieber\nPhone: +49(69)36 0095-419\nE-Mail: bieber@gross-partner.de\nWebsite: www.gross-partner.de",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}