{
    "url": "https://www.db.com/news/detail/20171128-deutsche-bank-to-collaborate-with-bank-of-taiwan?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 28, 2017",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Deutsche Bank to collaborate with Bank of Taiwan",
    "body": "Deutsche Bank and the Bank of Taiwan (BOT) have signed a Memorandum of Understanding to strengthen their partnership and focus on a number of opportunities important to both institutions. This will include credit and project finance opportunities related to Taiwan's green energy initiatives and the New Southbound Policy. The increased collaboration will leverage Deutsche Bank's world-class product expertise and BOT's strong local market knowledge and relationships. Additionally, through Deutsche Bank's extensive international network, BOT will be able to effectively expand its cross-border financial services capability to better serve Taiwanese companies doing businesses in Europe, the ASEAN region and North America.\nBOT is the largest bank in Taiwan and has long been ranked as the market’s No. 1 lead arranging and managing bank for domestic syndication loan business. Earlier this month, BOT received approval from Taiwan’s Financial Supervisory Commission to establish an office in Frankfurt, its first in continental Europe.\nDeutsche Bank’s APAC CEO Werner Steinmueller expressed his confidence in the strengthened cooperation between the two banks: \"We are pleased to sign this MOU and look forward to closer collaboration with one of Taiwan’s leading financial institutions. Deutsche Bank has an extensive global network and we are very proud of the long-term partnerships, like this one, that we have built around the world. We are delighted to partner with the Bank of Taiwan as it continues on its global expansion path.\"\n \nSigning the Bank of Taiwan–Deutsche Bank Memorandum of Understanding. From left to right: Michael Volkermann, Head of Infrastructure & Energy, Global Credit Trading, Deutsche Bank's CIB; Werner Steinmüller, Deutsche Bank’s APAC CEO; Joseph Jye-Cherng Lyu, Chairman of the Bank of Taiwan\nJoseph Jye-Cherng Lyu, Chairman of the Bank of Taiwan, expects this to be a long-lasting cooperation that will extend globally beyond Taiwan and Germany. \"Through this MoU, we are fortunate to adopt a strategy of standing on a giant's shoulders as we strengthen our global capabilities. The brand advantages, product strength, and extensive global network that Deutsche Bank possesses nicely complement ours, and we expect that this collaboration will generate significant mutual benefits.\" he said.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}