{
    "url": "https://www.db.com/news/detail/20171122-deutsche-bank-illustrates-its-commitment-to-lgbti-equality?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 22, 2017",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "Deutsche Bank illustrates its commitment to LGBTI equality",
    "body": "Human Rights Campaign recently recognized Deutsche Bank as among the world’s Best Places to Work for LGBTQ Equality after the bank scored a perfect 100 on HRC’s annual Corporate Equality Index. This is the 15th consecutive year that Deutsche Bank has received a top score from HRC for its commitment to workplace equality for members of the lesbian, gay, bisexual, transgender and intersex community.\nInclusion and diversity are at the core of Deutsche Bank’s values and it promotes an environment where all employees, including individuals of any sexual orientation, gender identity or expression, can realize their full potential.\nJohn Cryan, CEO, said: “Deutsche Bank is honored to have been named a ‘best place to work’ for LGBTI equality for 15 years in a row. Inclusion and diversity are core values for us at Deutsche Bank. We strive to empower our employees to make the bank and the communities in which we operate a more welcoming and supportive place for all.”\nUnited Nations Standards of Conduct for Business\nDeutsche Bank’s commitment to LGBTI equality extends beyond its walls and is demonstrated by tangible actions that impact society. The bank was an early adopter of the United Nations Standards of Conduct for Business, an effort to tackle discrimination against LGBTI people launched in September 2017.\nJoining ‘Friend of the Court’ Petitions to the Supreme Court\nDeutsche Bank was one of 76 companies and one of only two Wall Street institutions to sign onto an amicus curiae brief to the United States Supreme Court filed on October 11, 2017. The brief urges the court to hear the Evans v. Georgia Regional Hospital case and to rule that sexual orientation be included as a protected class under Title VII of the Civil Rights Act of 1964. An affirmative ruling by the court in the case would protect employees from workplace discrimination based on sexual orientation.\nDeutsche Bank similarly joined an amicus curiae brief to the Supreme Court in the Masterpiece Cakeshop v. Colorado Civil Rights Commission case filed on October 30, 2017. The brief was filed in support of ensuring that all Americans – including members of the LGBTI community – are treated fairly and equally under the law when doing business with public enterprises.\nAmicus curiae, a Latin phrase that translates to “friend of the court”, is a legal document that is filed with appellate courts in the US. The briefs are filed by individuals, organizations or groups and urge the court to hear a particular court case or to rule in favor of a particular outcome, in this case, to ensure equal rights for members of the LGBTI community.\nSteven Reich, General Counsel, Americas, explains: “The two cases address the civil rights and freedom from discrimination for LGBTI people from different angles. The Evans case centers on the expansion of nondiscrimination protections under Title VII of the Civil Rights Act of 1964 to include LGBTI people. In the Masterpiece Cakeshop case, the issue is whether a business operating in the public sphere can refuse services to customers based on religious beliefs. For Deutsche Bank, both cases share the fundamental principle that discrimination harms our employees and their loved ones, our business and society. We are pleased to continue to lend our voice to this important conversation.”\nAustralia Postal Vote on Marriage Equality\nDeutsche Bank joined more than 800 companies in signing an open letter of support for marriage equality for all Australians earlier this year. The Australian government later called a non-compulsory and non-binding postal vote asking Australian voters whether they support equal marriage rights. Sixty-one percent of voters voted to allow same-sex marriage, and the outcome should clear the way for an affirmative vote on marriage equality by the Parliament of Australia.\nTransMilitary Event\nDeutsche Bank’s LGBTI employee resource group, dbPride, held an event on October 23, 2017, in New York about transgender individuals in the US military. The event featured a screening of the Emmy-nominated short film Transgender, at War and in Love followed by a panel discussion with the filmmakers and other subject matter experts. Former Acting Under Secretary of Defense for Personnel and Readiness Brad Carson was joined by trans military advocates and moderator Rob Smith, a US Army veteran and reporter/producer for Yahoo! News.\nPowering Progress\nDeutsche Bank recently completed Powering Progress, an innovative competition for first-year and sophomore college students in the US to demonstrate their passion for social change by designing a project to help non-profit LGBTI community organizations grow. The campaign received over 90,000 impressions and received 70 submissions from teams of students.\n2017 Financial Times / OUTstanding Gala\nIn October, four bank employees in London were recognized for their work in support of LGBTI equality at the 2017 Financial Times / OUTstanding Gala. Darren Beaumont (COO) and Harjit Saggu (Group Audit) were both named as Top 50 Future Leaders of the LGBTI community, while Masa Yanagisawa (Co-Head of Japan Equity Sales) was nominated among the Top 100 LGBTI Executives. Eileen Taylor, Global Head of Regulatory Management, was again nominated as one of the Top 50 Ally Executives, recognizing those who support LGBTI colleagues by helping to create an inclusive working environment.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}