{
    "url": "https://www.db.com/news/detail/20171115-deutsche-bank-s-graduate-app-wins-in-2017-engage-awards?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 15, 2017",
    "tags": [
        "Careers",
        "Company",
        "Digitalisation",
        "Research",
        "Strategy"
    ],
    "title": "Deutsche Bank's graduate app wins in 2017 Engage Awards",
    "body": "This year, Deutsche Bank welcomed 650 new graduates from all over the world. Most probably, many things were new to them on their first day. However, not everything: A special mobile application on their smartphones eased those first day nerves because they had been able to get connected with the bank already through the “I am DB” graduate app.\nNow, this app has won a 2017 Engage Award in the Best Customer and Employee Engagement in Financial Services category. “It’s a great achievement to be recognised externally for our efforts in providing an engaging onboarding experience,” says Faye Woodhead, who is responsible for Graduate Recruitment and Employer Brand. The award also shows how much the demand in companies has changed because of the way we use social media platforms in daily communication.\nShared with all incoming graduate hires before they start, the app gives graduates and interns direct streams from the bank’s social media, careers and news channels plus organisational updates, videos and interviews with senior management. It also provides information regarding their training and programme logistics, while training modules explain Deutsche Bank’s culture and its expectations of graduates.\nThe verdict from one new graduate: “It’s been great hearing news stories particularly from leaders of the business and past graduates.” ‘I am DB’ had been one of the most important technical tools during his time at the graduate orientation in London.\nThe app also helps the graduate class make connections. “Through the direct messaging service, hires are able to find friends, peers, contacts from around the world to begin developing their network ahead of their start date,” explains Hannah Dodds, Graduate Recruitment, Human Resources, who received the award at the ceremony in London together with her colleague Joanna Broom, Employer Brand, Human Resources.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}