{
    "url": "https://www.db.com/news/detail/20200923-behind-the-headlines-listen-to-top-decision-makers-on-current-topics?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 23, 2020",
    "tags": [
        "Capital markets",
        "Company",
        "Investment Banking",
        "Sustainability"
    ],
    "title": "Behind the headlines: listen to top decision makers on current topics",
    "body": "Deutsche Bank Research is launching a second podcast series to its lineup: Behind the Headlines. This new series will see top decision makers at global corporations and institutions interviewed in-depth by Jim Reid, Deutsche Bank’s Global Head of Credit Strategy and Thematic Research. Reid will be digging deep for insights.\nThe first two episodes feature Stefan Scholz, Group Treasurer at Continental and Henrik Hänche, Group Treasurer at Deutsche Post DHL. The topics range from working from home, supply chain disruption and ESG to the opportunities of low interest rates.\nTesla as a disruptor was a salient part of the conversation with Scholz. “I underestimated Tesla in the beginning, Elon Musk has made really big steps forward. What I like at Tesla is that they were really progressive, disruptive, innovative. They introduced a kind of new technology that means they did not copy the existing IT infrastructure; they recognise that software is getting more important.”\nAnother highlight is Hänche’s take on changes in the treasury and financial markets: “What we're going to see going forward is low interest rates which we have not seen 10 years ago. Who remembers that interest rates 10 years ago were around you know 5% for a 10 year bond, nobody remembers that. We are going to see low interest rates going forward and we need to live with it with all pros and cons”.\nWhen asked whether cash raised, because of low interest rates and higher borrowing, could be used for M&A, Hänche responded that it depends which side you’re on because for Deutsche Post DHL with huge pension obligations around the world, low discount rates also increase pension obligations; for Hänche it is a matter of how to balance it.\n‘Behind the Headlines with Jim Reid’ will go where you go, when you want to go there.\nHosted on Deutsche Bank’s Research website it is also accessible on Spotify, Apple and Google Podcasts and Stitcher.\nEpisode 1: Stefan Scholz, Continental AG: Working from Home to Tesla to ESG\nEpisode 2: Henrik Hänche, Deutsche Post DHL Group: From globalisation to low interest rates",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}