{
    "url": "https://www.db.com/news/detail/20200922-signing-up-to-responsible-banking-one-year-on?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 22, 2020",
    "tags": [
        "Company",
        "Sustainability"
    ],
    "title": "Signing up to Responsible Banking – one year on",
    "body": "Acting responsibly, helping design a sustainable banking system for the future and supporting the global sustainable development agenda: these were the intentions Christiana Riley stated when officially signing the Principles for Responsible Banking at the United Nations General Assembly exactly one year ago. These Responsible Banking Principles were formulated by the UN Environment Programme Finance Initiative (UNEP FI) and the idea behind them is for banks who commit to the principles to play a leading role in supporting the UN Sustainable Development Goals (SDGs) and the Paris Climate Agreement.\nOn its first anniversary the achievements are encouraging. The number of signatories has risen from 130 to 189 in the meantime, and these banks now account for 40 percent of global customer assets according to the UNEP FI. The first litmus test of how well the banks are progressing is scheduled for the coming year.\nAll the signatories must then report on their achievements – not behind closed doors, but with a public disclosure. These progress statements will be collated by the UNEP FI, which it will use to produce its own detailed report. Deutsche Bank will fulfil this obligation in its next Non-Financial Report to be published in spring 2021.\nFor Viktoriya Brand, Head of Group Sustainability, her team and further departments, there is still plenty of work to be done. In any event Brand can certainly not complain about a lack of projects and initiatives within Deutsche Bank Group. On the contrary: “The past months have been highly intense – we sense how strongly the whole bank is shifting towards sustainability and how many doors are open to sustainable ideas. I’ve rarely experienced such a dynamic situation.”\nThat’s no wonder: in a short space of time Brand and her team have played a key role in a number of projects, including publishing a widely noted Fossil Fuels Policy, finalising a groundbreaking Sustainable Finance Framework and drafting the bank’s first Climate Statement.\nTo mark the first anniversary of signing the Principles we have summarised our most important achievements to date at a glance:\nIn May we set ourselves quantifiable targets for the first time for expanding our sustainable business activities covering the ESG (environmental, social, governance) space and thus supporting the transformation towards a sustainable economy. By the end of 2025 we aim to increase the volume of sustainable financing plus the portfolio of ESG investments under management to over 200 billion euros in total.\nWe quickly followed this with the successful placement of our first own green bond – an issue with a volume of 500 million euros. The proceeds are used to refinance sustainable projects only, for example to expand renewable energies.\nThe next step was signing the climate commitment of the German financial sector. By doing so, we voluntarily pledged to align our credit and investment portfolios with the goals of the Paris Agreement. This means we will disclose which emissions are associated with our credit and investment portfolios. In addition, we undertake to align our products and services, commitments and initiatives in such a way that global warming is limited to well below 2 degrees – if possible to no more than 1.5 degrees.\nIn the summer we reached another milestone: our Sustainable Finance Framework which is aligned on a best-effort basis to the EU Taxonomy Regulation. The Framework creates the basis for the bank to achieve its ambitious sustainability targets – a first in the European financial sector according to the independent consultancy ISS ESG.\nA few days earlier we had approved our new Fossil Fuels Policy which sets a strict framework for our business activities involving oil, gas and coal. We will end our global business activities in coal mining by 2025 at the latest in order to help drive the transformation to a sustainable economy. Effective immediately, we also pledged to no longer finance new oil and gas projects in the Arctic region or oil sand projects.\nAt the same time we were able to announce that we had signed the so-called Equator Principles, a risk management framework for assessing the environmental and social risk of financing projects. They ensure that strict environmental and social standards are applied to projects.\nOur \nPDF\nClimate Statement briefly summarises our wide-ranging approaches to fighting climate change. This statement details our stance on climate action and our package of measures to fight climate change – from sustainable finance and our own carbon footprint through to the participation of our employees.\nOf course this commitment is not restricted exclusively to climate protection: over 7,000 of our staff participated in our COVID-19 community relief campaign, which enabled us to provide more than 2.5 million euros – including the bank’s donations – to 40 organisations in 35 countries. Thanks to this support they managed to continue their work and provide more than 650,000 people with food and shelter – especially to homeless people, street children, low-income families, vulnerable senior citizens or refugees.\nAnother facet of responsible banking is the obligation for a bank and its staff to go the extra mile – especially during the kind of unprecedented times we are currently experiencing. And so we have been advising and supporting companies and the self-employed in submitting their applications for KfW relief loans and other public subsidies.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}