{
    "url": "https://www.db.com/news/detail/20200915-deutsche-bank-joins-150-business-leaders-and-investors-to-push-for-higher-2030-emissions-reduction-targets?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 15, 2020",
    "tags": [
        "Company",
        "Strategy",
        "Sustainability"
    ],
    "title": "Deutsche Bank joins 150 business leaders and investors to push for higher 2030 emissions reduction targets",
    "body": "As the European Commission sits down to discuss proposals for a new 2030 emissions target, more than 150 European businesses, investors and business networks are calling on EU leaders to back the ambition set out in the European Green Deal and reduce greenhouse gas emissions by at least 55 percent by 2030. The signatories include Deutsche Bank, Microsoft, IKEA, Unilever, H&M, Google, EDF, Signify and Apple.\nIn an open letter, CEOs from across Europe have outlined their determination to work with the EU to tackle the impacts of the Coronavirus pandemic while delivering a more climate-resilient and regenerative recovery. The letter shows the diversity of European business support for increased climate ambition, with companies from a wide range of sectors, including manufacturing, heavy industry, finance, consumer goods, power generation and technology, all supporting the 55 percent target.\n“Banks play a crucial role in this ambitious transformation,” said Deutsche Bank’s CEO Christian Sewing. We can and must help companies to do business more sustainably. But we need the EU to pave the way by providing common standards.”\nSigned by 157 businesses and investors, and 21 business networks, the letter states: “What we urgently need to see next is an ambitious implementation of the recovery package focused on achieving a green and digital transition, with the European Green Deal at its core and an elevated short-term emissions reduction target in its sights.”\nThe letter continues: “The right decisions now can help create and protect healthy, thriving and fair communities and secure a roadmap for a prosperous economy. From a business and investor perspective, clarity on the net zero transition pathway and timetables for each sector, as well as policy that enables substantial investments in carbon neutral solutions is essential. This in turn would provide us with the confidence needed to invest decisively at the necessary pace and scale to reduce emissions, create decent green jobs, drive innovation, and accelerate the rebuilding of a resilient zero carbon economy.”\nThe initiative is led by the European Corporate Leaders Group (CLG Europe), a cross-sectoral group of European businesses working towards delivering climate neutrality. Further details can be found on the group’s website.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}