{
    "url": "https://www.db.com/news/detail/20210520-sustainability-day?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "May 20, 2021",
    "tags": [
        "Strategy",
        "Sustainability"
    ],
    "title": "Deutsche Bank brings forward its target date for 200 billion euros of sustainable finance by two years to 2023",
    "body": "Business divisions to publish their own volume targets for sustainable finance and investments\nLarger vendors and suppliers will require an external ESG rating\nWomen to hold at least one-third of senior management positions by 2025\nFuel consumption of company car fleet in Germany to be cut by 30 percent by 2025 – zero carbon emissions planned for 2030\nEnvironmental, social and governance criteria are to become standard for products and services\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) will align its business even more strictly to environmental, social and governance (ESG) criteria and is setting ambitious targets for them. It aims to facilitate over 200 billion euros in sustainable finance and investments by the end of 2023, two years earlier than originally planned. “We have to progress as quickly as possible from ambition to impact”, said CEO Christian Sewing. “Since announcing our 200 billion euro target last year, we have made significantly more progress than we anticipated. We now want to achieve this volume sooner and we will report on progress transparently and in detail”. By the end of the first quarter of 2021 the bank’s business divisions (not including DWS) had facilitated sustainable finance and investments of 71 billion euros.\nDeutsche Bank is inviting today to its first Sustainability Deep Dive. At this three-hour virtual event it will report on progress made in the four pillars of its sustainability strategy: Sustainable Finance; Policies & Commitments; Own Operations & People; and Thought Leadership & Stakeholder Engagement. “Our ambition is to make ESG the new normal at Deutsche Bank – in our dialogue with our clients, in our own operations and in all our processes,” Sewing said. “Sustainability will thus become an integral part of our corporate culture”.\nThe principal measures and targets are:\nSustainable Finance\nFor the first time the bank is publishing annual sustainable finance targets for each business division. Of the target volume of at least 200 billion euros by 2023, 86 billion euros is planned to come from the Private Bank, 30 billion euros from the Corporate Bank and 105 billion euros from the Investment Bank. As an independent, listed company, asset manager DWS reports its own ESG targets separately; they are not included here.\nPrivate Bank Germany will implement an ESG advisory concept in all 400 Deutsche Bank branches by the end of 2022. It is also planning to offer at least one ESG option in every relevant product category by the end of this year. In addition, the Private Bank will focus on sustainable construction and plans to provide clients with additional advisory services that go beyond mortgages and real estate financing.\nThe International Private Bank, which includes the bank’s Wealth Management business, aims to make ESG investments the standard in its portfolio management from 2022. As ESG will be the default, clients will no longer have to opt into ESG products. The International Private Bank aspires to convert investments of at least one million clients to ESG over the next few years.\nThe Corporate Bank plans to enter into a strategic ESG dialogue with its 2,000 or so multinational corporate clients.  Advising clients holistically on ESG-Risks and their business transformations will become standard. Moreover, the Corporate Bank aims to boost its supply chain financing volume to one billion euros and offer its 800,000 commercial clients at least two standardised ESG financing solutions by the end of the year.\nThe Investment Bank plans to grow its market share of ESG bonds and loans over last year’s share. In the first quarter of 2021, the market share by fees in combined investment grade and leverage finance sustainable debt issuance rose to 6.1 percent, versus 4.3 percent in the year 2020 (source: Dealogic). In Fixed Income & Currencies (FIC) the bank aims to facilitate financing worth 2.8 billion euros for the construction of energy-efficient and social housing in 2021 alone. Moreover, numerous product innovations such as green investments and green repos are planned for institutional clients.\nPolicies & Commitments\nDeutsche Bank is pledging to adopt more ambitious policies. Last year, it already committed to calculating the carbon footprint of its roughly 440 billion euro loan portfolio by the end of 2022. Now it plans to also publish a target for its green asset ratio as a proportion of its banking book by mid-2022.\nBy year-end 2021, 50 percent of client-facing staff are to be offered training on the bank’s inhouse taxonomy for sustainable finance. Deutsche Bank’s taxonomy is already aligned with the EU Taxonomy.\nThe bank has set itself the target of helping clients to accelerate their own transformation. It therefore plans to devise credible transformation plans with companies facing complex ESG challenges. In the medium term, this will be the prerequisite for continued collaboration between the bank and its clients.\nOwn Operations & People\nMore female leadership: by 2025, 35 percent of Managing Director, Director and Vice President positions are to be represented by women; the current figure is 29 percent. For the two levels below the Management Board the target figure is at least 30 percent women – up from 24 percent currently. These objectives will work alongside Deutsche Bank’s existing initiatives to ensure it drives diversity and inclusion in the workplace and society.\nA more sustainable supply chain: from 2022, all the bank’s vendors and suppliers with an annual order volume of more than 500,000 euros will be required to have an external ESG rating. From 2023, a minimum rating will be a requirement in all new tender procedures or follow-on agreements with this minimum volume.\nReduced emissions: Deutsche Bank aims to reduce fuel consumption for its company car fleet in Germany (roughly 5,400 cars) by 30 percent by 2025. And it aims to reduce company car fleet carbon emissions down to zero by 2030.\nThought Leadership & Stakeholder Engagement\nIn cooperation with the Monetary Authority of Singapore, the city-state’s central bank, Deutsche Bank is establishing an ESG Centre of Excellence. Its task will be to focus on public and private ESG product development, advisory services and financing. It will be run by Kamran Khan, Deutsche Bank’s head of ESG in Asia-Pacific.\nRepresented by its International Private Bank, Deutsche Bank has become the first bank to be a full member of the Ocean Risk and Resilience Action Alliance.\nDeutsche Bank Research will regularly focus on ESG in its reports on the German Mittelstand.\nThe bank will roll out a concept for sustainability ambassadors. This group of experts from different business divisions and infrastructure functions will boost its representation at public forums and engage with stakeholders on ESG topics.\nIn its home market, Deutsche Bank aims to invest more in financial education. By the end of 2022, it plans to double the number of employees who provide financial education to schools at least once a year from 350 to 700.\nDeutsche Bank will present details of its goals and sustainability strategy at today’s Sustainability Deep Dive from 1pm to 4pm CET.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 27
}