{
    "url": "https://www.db.com/news/detail/20210519-deutsche-bank-appoints-daniel-ross-as-head-of-investment-banking-coverage-in-the-uk-and-ireland?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "London, May 19, 2021",
    "tags": [
        "Management & Leadership"
    ],
    "title": "Deutsche Bank appoints Daniel Ross as Head of Investment Banking Coverage in the UK and Ireland",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) announced today that Daniel Ross will join the bank as Head of Investment Banking Coverage in the UK and Ireland.\nDaniel will join from Barclays where he was Vice Chairman of UK Investment Banking and Global Head of Media. He will be based in London and report to Patrick Frowein and Berthold Fuerst, Co-heads of Investment Banking Coverage and Advisory in EMEA.\nFrowein said: “This is an important hire into our European business and shows our strong commitment to our UK investment banking business where we have a long-established corporate finance franchise with exceptional sectoral expertise.”\nFuerst said: “We have ambitious plans to strengthen further our UK business, and Daniel brings with him over 20 years’ experience in the industry, with an outstanding track record of advising clients and leading successful teams, and a broad network.”\nDaniel’s appointment follows a range of hires by Deutsche Bank in its European investment banking business recently including multiple Managing Directors into the EMEA Healthcare and TMT teams as well as a build-out of its European equity research business where it has hired over 30 research analysts and strategists in the past 12 months.\nDeutsche Bank finished the first quarter of 2021 in ninth position in UK investment banking, up from eleventh position last year. The bank advised on numerous transactions in 2020, with strong momentum into 2021, including acting as financial adviser and joint corporate broker on Unilever’s £120 billion unification of the Unilever Group; financial adviser to Caesars Entertainment on its £2.9bn acquisition of William Hill; financial adviser to Bally’s Corporation on its £2bn offer for Gamesys; joint global coordinator and joint corporate broker on the €2.75bn rights issue for IAG; and joint financial adviser and joint global coordinator of the €1.8bn recapitalisation of Tui Group.\n  For further information please contact:\nDeutsche Bank AG\nMedia Relations                                          \nAlison Moody\nEmail: alison.moody@db.com\n                                                          ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 6
}