{
    "url": "https://www.db.com/news/detail/20210518-announcement-of-new-global-head-of-afc-and-group-anti-money-laundering-officer?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "May 18, 2021",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Announcement of new Global Head of AFC and Group Anti Money Laundering Officer",
    "body": "Dear Colleagues,\nI am pleased to announce that the Management Board has appointed Joe Salama as Global Head of Anti-Financial Crime (AFC) and Group Anti Money Laundering Officer. He is succeeding Stephan Wilken who held this responsibility since October 2018.\nJoe has been with the bank for more than 10 years and currently serves as Global Head of Litigation & Regulatory Enforcement and General Counsel for the Americas. Prior roles include Americas Head of Litigation and Head of Legal for the Non-Core Operations Unit. In recent years, Joe has negotiated almost all of our major AFC-related legal settlements and has been a key contact for our monitors as well as for regulators and enforcers worldwide. He also chairs the Legal Diversity and Inclusion Council. Many of you know him as a great team player across the regions and a true culture carrier. Joe will be based in Frankfurt and in New York to ensure close collaboration with all our regulators. He will report to me and become a member of my Executive Committee. The appointment is subject to final regulatory approvals. The change will be effective as of July 1st to ensure a smooth transition. \nI also want to thank Stephan for his great contributions. Under his leadership, the AFC team has demonstrated significant progress in the fight against financial crime. Over the past 2 years, the bank has invested substantially in building its capabilities in Financial Crime Risk management. Stephan and his team has developed, and commenced implementation of, the bank’s AFC Strategy to address the foundational requirements for robust financial crime risk management. In addition, the bank has significantly upgraded its skill-set across all AFC risk disciplines, making senior subject matter expert hires in different jurisdictions in order to address regulatory short-comings. As a result the AFC team has grown to over 1,600 people. AFC has also worked closely with the businesses to formulate a target operating model which permit our business partners to actively manage our financial crime risks. Investments in improving data and technology continue. Stephan will assume a new responsibility within our bank, which we will announce in due course.\nAFC remains to be critically important. Regulators around the world vigilantly monitor the progress we have made, and we are working diligently to comply with the requirements. We will continue to strengthen our controls and increase collaboration within the AFC function as well as our collaboration with the business lines and the tech organization. We will continue our 60 day strategic review in the new CAO area. Joe will play an important role in this review. We will update you on our priorities and respective changes in the organization by mid of June.\nStrengthening Deutsche Bank’s control environment is a key priority for the Management Board and for each and every one of us. I am convinced that together we will be able to achieve our objectives. Please join me in thanking Stephan for his work and wishing Joe all the best in his new role.\nYours,\nStefan Simon",
    "number_of_ratings": 4,
    "rating": 3.8,
    "likes": 10
}