{
    "url": "https://www.db.com/news/detail/20210518-moody-s-places-deutsche-bank-s-ratings-on-review-for-upgrade?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "May 18, 2021",
    "tags": [
        "Investment Banking"
    ],
    "title": "Moody’s places Deutsche Bank’s ratings on review for upgrade",
    "body": "Moody’s Investors Service today placed all Deutsche Bank’s ratings on review for upgrade. A review for upgrade implies the possibility of a rating action within a shorter timeframe and is typically concluded within 30 to 90 days, according to the agency.\nMoody’s states: “the review for upgrade takes account of Deutsche Bank’s swift and pronounced progress towards its objective of achieving a more balanced and sustainable business model…coupled with the bank’s unchanged solid capital and liquidity buffers.”\nJames von Moltke, Chief Financial Officer, said: “I am delighted and encouraged by this move from Moody’s, which follows outlook upgrades from other rating agencies in recent months. We are steadily gaining recognition with these key stakeholders for the disciplined execution of our transformation strategy. Our priority now must be to maintain that discipline, and make further progress on our ratings.”\nEarnings strength and strong balance sheet management: key factors in self-financing Deutsche Bank’s transformation\nIn respect of disciplined execution of transformation, Moody’s noted: “Since Deutsche Bank announced its strategic overhaul in summer 2019, it has provided for almost €7 billion of restructuring and transformation charges and €1.8 billion in loan loss provisions.”\nFor Moody’s, Deutsche Bank’s success in financing transformation from its own resources is a key factor. The agency added: “Deutsche Bank’s regained earnings strength; its reduced capital and leverage exposure consumption; as well as significantly lower operating costs, strong liquidity and reduced dependence on confidence-sensitive market funding have allowed it to self-finance its strategic overhaul without a significant impact on its key capital ratios.”\nThe path to an upgrade: earnings momentum, strong risk management, and continued investment in technology and controls\nMoody’s makes clear that sustainability of Investment Bank revenues in normalising markets will be important. As part of the review for upgrade, the agency “will assess the sustainability of the bank’s most recent achievements in growing revenues and earnings, in particular its ability to maintain robust capital markets revenues in a less favourable market environment, without increasing its risk appetite.” Moody’s will also look for momentum in the Corporate Bank and Private Bank against the backdrop of interest rate headwinds.\nCredit quality, notably in focus industries, will be a factor. Moody’s review “will focus on the magnitude of risk exposures within Deutsche Bank’s generally well-diversified loan book, in particular exposures to sectors that have been most affected by the pandemic, such as commercial real estate, aviation and leisure.”\nMoody’s made clear that for Deutsche Bank, continued execution is all-important, in particular, “being able to sustain adequate profitability while continuing to invest to strengthen its technology platform and controls and risk management infrastructure.”\nKey factors: sustainability leadership and digitalisation\nMoody’s quoted two additional factors which will play a role in its upgrade review: digital transformation and sustainability. The agency made clear: “Moody’s will review the bank’s … ambition in developing itself into a sustainability leader among its peers.” Deutsche Bank will update stakeholders on the bank’s sustainability strategy at its first ‘Sustainability Deep Dive’ on Thursday. For more details of this event, click here.\nDeutsche Bank’s ratings: six months of turnaround in ratings outlook\nIn the past six months, Deutsche Bank has seen a turnaround in its ratings prospects with all three leading rating agencies. In November 2020, Moody’s upgraded its ratings outlook for Deutsche Bank from negative to stable. In January, Fitch Ratings lifted its outlook by two notches, from negative to positive, while S&P made the same move in February. With this latest move, Deutsche Bank’s ratings outlook now stands at positive/review for upgrade with all three leading agencies.\nAn overview of Deutsche Bank’s ratings with leading rating agencies, updated for today’s action, can be found here.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 11
}