{
    "url": "https://www.db.com/news/detail/20210518-deutsche-bank-and-singapore-fintech-stacs-complete-bond-in-a-box-proof-of-concept-on-the-use-of-dlt-for-digital-assets-and-sustainability-linked-bonds?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Singapore, May 18, 2021",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank and Singapore fintech STACS complete ‘bond in a box’ proof-of-concept on the use of DLT for digital assets and sustainability-linked bonds",
    "body": "Deutsche Bank Securities Services in Singapore and Hashstacs Pte Ltd (‘STACS’) today announced the completion of their proof-of-concept (‘POC’) referred to as “Project Benja”. Set in the context of tokenized securities in the securities market, the teams worked on digital assets interoperability across platforms and related custody, digital securities and cash delivery-versus-payment practice, distributed ledger technology (‘DLT’) to traditional systems connectivity, operating model evolution and smart contract templates including those involving sustainability-linked digital bonds.\nSTACS, in collaboration with Deutsche Bank Securities Services, was awarded the POC grant on 29 October 2020, which provides funding support for experimentation, development and dissemination of nascent innovative technologies in the financial services sector. The POC grant is part of the Financial Sector Technology and Innovation (‘FSTI’) scheme under the Financial Sector Development Fund administered by Monetary Authority of Singapore (‘MAS’).\nDeutsche Bank’s domain expertise and the respective teams’ technical designs were combined with STACS’ live DLT platform which allows for end-to-end bonds lifecycle management. The POC’s results were subsequently tested with industry participants – UBS, Malaysia National Stock Exchange Bursa Malaysia, and Union Bank of the Philippines (UnionBank) whose perspectives enriched the POC with more holistic assessments.\nThrough their involvement, Deutsche Bank and STACS were able to remodel and optimize the workflows involved to create a ‘bond in a box’ DLT platform, unlocking new efficiencies with rapid smart contracts issuances, and tested integration with payment modes like UBIN and Diem (Libra), digital custody and asset servicing, and Environmental, Social, and Governance (ESG) financing transparency needs.\nAnand Rengarajan, Asia Pacific Head of Securities Services at Deutsche Bank, said: “We are pleased with the results of this POC. With innovation at the forefront of our strategy, it is important to us to actively contribute to, and participate in the future of capital markets from a post-trade servicing perspective. This POC allowed us to assess the practical handling of tokenized assets, as well as the opportunities and challenges that could arise from their commercialization in Singapore, and potentially in other markets.”\nKamran Khan, APAC Head of ESG at Deutsche Bank, said: “Data transparency, reliability and security are corner stones of the emerging ESG capital market. This cutting-edge ‘bond in a box’ POC successfully explored the synergies between Fintech and ESG, using distributed ledger and smart contracts capabilities with cross-platform interoperability for ESG-compliant digital securities.”\nBenjamin Soh, Managing Director at STACS, said: “We are excited to have taken the first step towards turning a proof-of-concept to a proof-of-commercialization, through our collaboration with Deutsche Bank, and with other leading financial industry participants. In addition, with the world’s focus turning towards ESG and sustainability, we look forward to expanding our network’s efforts in the sustainability push of the next few decades, via DLT technology as the common technology infrastructural nexus.”\nFor further information, please contact:\nDeutsche Bank AG\nMedia Relations\nKarène Dufour\nPhone: +852 2203 7846\nE-mail: karene.dufour@db.com\nSTACS (https://stacs.io/)\nMarketing Manager\nGrace Lim\nPhone: +65 8511 7770\nE-mail: grace.lim@stacs.io",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 5
}