{
    "url": "https://www.db.com/news/detail/20210517-deutsche-bank-becomes-first-bank-to-join-ocean-risk-and-resilience-action-alliance-orraa-as-full-member?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "May 17, 2021",
    "tags": [
        "Sustainability"
    ],
    "title": "Deutsche Bank becomes first bank to join Ocean Risk and Resilience Action Alliance (ORRAA) as full member",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) has become the first bank to join the Ocean Risk and Resilience Action Alliance (ORRAA) as a full member, creating a partnership dedicated to bringing financial expertise and innovation to protect the ocean and the communities that depend on it.\nThe International Private Bank (IPB) of Germany’s largest bank will partner with ORRAA to encourage global action and private finance to invest in marine and coastal natural capital, to promote a sustainable blue economy and to build resilience in the regions most vulnerable to ocean-related risks, including sea-level rise and extreme weather events.\nLaunched at the United Nations’ Secretary General’s Climate Action Summit in 2019, ORRAA is a multi-sector collaboration between governments, financial institutions, insurance companies, environmental organisations and other stakeholders that aims to drive US$500 million of investment into coastal and marine ecosystems by 2030.\nThe partnership will offer new areas of engagement and impact to the bank’s clients, starting initially with ocean resilience research developed in close collaboration with ORRAA. Deutsche Bank International Private Bank has a long track record of offering environmental, social and governance (ESG) themed investments, integrating sustainability into its investment processes, and producing ESG, biodiversity and ocean risk research for clients.\n“Banks can be a positive force for social change, and partnering with ORRAA is another significant milestone towards embedding sustainability at the heart of everything we do for our clients and society,” said Claudio de Sanctis, Head of the International Private Bank and CEO of EMEA at Deutsche Bank.\nDe Sanctis added: “I have been passionate about the environment since spending much of my childhood in and around the ocean. As I have grown older I have been increasingly concerned about the damage we see around the world, so I could not be more excited about the long-term potential for this partnership, from thought leadership to client engagement and a positive impact on this most critical part of our ecosystem.”\nA healthy ocean plays a vital role in combating climate change, according to ORRAA. It is the planet’s largest carbon sink, and marine and coastal ecosystems such as coral reefs and mangroves offer cost-effective ways to mitigate climate risks while bringing a host of social and economic benefits to millions of people living in coastal areas. Yet a lack of understanding of the value of those ecosystems means they are amongst the most threatened and under-invested on Earth.\n“By joining ORRAA, Deutsche Bank can lead the way in setting the ambition for the finance sector in catalysing financial innovation and private investment for our oceans,” said Karen Sack, Co-Chair of ORRAA. “Together we can help build resilience in the most exposed and vulnerable communities around the world; protect and regenerate valuable natural assets; accelerate the pace of change in delivering the United Nations’ Sustainable Development Goals; and therefore reduce the environmental, economic and social impacts of climate and ocean change.”\nDeutsche Bank holds a Sustainability Deep Dive this Thursday, May 20, a three-hour virtual and interactive event where senior managers will give details on the bank’s sustainability strategy. It will include presentations by Chief Executive Officer Christian Sewing and the business heads, along with sessions with bank experts on topics such as ESG performance management, taxonomy, climate risk management, diversity and inclusion. For more information and to register, visit the Sustainability Deep Dive site.\nFor further information please contact:\nDeutsche Bank AG, Media Relations                                            \nAdrian Cox\n+44 20 7541 7775\nEmail: adrian.cox@db.com \nEva Mairinger\n+41 44 224 5951\nEmail: eva-caroline.mairinger@db.com",
    "number_of_ratings": 3,
    "rating": 5.0,
    "likes": 21
}