{
    "url": "https://www.db.com/news/detail/20210517-accelerator-for-southeast-asia-s-female-social-entrepreneurs-tackling-climate-change-and-sustainability?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Singapore, May 17, 2021",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Accelerator for Southeast Asia’s female social entrepreneurs tackling climate change and sustainability",
    "body": "Ashoka and Deutsche Bank’s CSR ‘Made for Good’ programme today launched DIWA – Capacity Building Program, to accelerate the impact women social entrepreneurs have in the field of climate change and sustainability.\nAshoka is an internationally acclaimed organisation that supports social entrepreneurs and facilitates change for good with networks and innovative ideas. Working in partnership with Ashoka, Deutsche Bank is contributing both financially and resources, including mentors from within Deutsche Bank.\nThis programme is aligned with Deutsche Bank’s corporate social responsibility initiatives which support the UN’s Sustainable Development Goals; #1 No Poverty, #2 Zero Hunger, #3 Good health and well-being, #4 Quality Education, #5 Gender Equality, #6 Clean water and sanitation and #11 Sustainable cities and communities.\nThe DIWA programme will support 12 women social entrepreneurs in Indonesia, Malaysia, Philippines and Thailand through a three-month long capacity building programme, as they prepare to expand their operations and create impact in tackling the challenge of climate change and environmental sustainability.\nAshoka Singapore Country Director, Rajesh Varghese said: “We need everyone to play a role in finding solutions to the climate crisis. Ashoka supports social entrepreneurs to lead this change ground-up, with initiatives and impact that moves the needle from awareness to action in the space of climate change and sustainability.”\nDeutsche Bank APAC Head of Corporate Bank, Investment Bank and CRU Operations, Caroline Liow said: “We are delighted to support and mentor these 12 talented women on their social entrepreneurial journey as they tackle the urgent challenge of climate change. By applying lessons from our digital transformation BOOST programme, we can help these women leapfrog and accelerate positive impact in the field of sustainability, which is also a core pillar of our bank’s transformation strategy.”\nThe DIWA programme consists of structured learning, beginning with a virtual kick-off and continuing with the Deutsche Bank BOOST and mentoring program. The mentoring will involve six Deutsche Bank leaders pairing with the 12 social entrepreneurs to help them grow to the next level of entrepreneurship.\nThe 12 social entrepreneurs chosen for the DIWA programme will be supported and mentored as they refine their business model. Mentors and social entrepreneurs will have access to tools and resources on leadership, impact strategies, financial models, and designing an investment deck.\nThe programme will culminate in a virtual pitch event at the end of 2021, where two social entrepreneurs will have a chance to win €5,000 Euros each.\nThe online training will equip the social entrepreneurs with the frameworks, learning tools, and ideas to effectively lead their teams toward creating systemic impact, consisting of the following:\nImpact strategies for system change:\nIdentifying and framing a problem statement with root cause analysis\nMapping the system and identifying key leverage points for change\nDesigning solutions for the direct and indirect impact\nWomen leadership for system change:\nShifting the narrative around women’s leadership and overcoming gender-specific barriers\nRecognizing the role as a leader, mother, community organizer\nAmplifying impact by building a culture of change making\nThinking about sustainability for systems change:\nIdentifying the right business model for the organization\nThe social investor mindset\nStorytelling for fundraising\nThis is the second year of partnership for Ashoka and Deutsche Bank which aims to accelerate positive change and build a thriving ecosystem for women social entrepreneurship in APAC.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}