{
    "url": "https://www.db.com/news/detail/20160729-stress-test-a-message-to-employees-from-john-cryan?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 29, 2016",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Stress test: a message to employees from John Cryan",
    "body": "Dear Colleagues,\nThe European Banking Authority (EBA) has announced the results of its 2016 EU-wide stress test. Deutsche Bank’s result can be summed up simply: we went in stronger and came out stronger, despite a test which was tougher. The result of the 2016 stress test shows the progress we have made.\nLet me give you some of the highlights:\nThe starting point for this test was Deutsche Bank’s fully-loaded Common Equity Tier 1 (CET1) ratio of 11.1 percent at the end of 2015. In 2014, our starting point was only 9.2 percent.\nThe stress test found that this would rise to 12.1 percent under its ‘baseline’ scenario, which does not account for strategic actions we plan to take as part of Strategy 2020. In the 2014 stress test, Deutsche Bank’s CET1 ratio in the baseline scenario was only 10.5 percent.\nIn the ‘adverse’ scenario, which assumes a severe economic and financial market shock, our CET1 ratio would be 7.8 percent, versus only 7.0 percent in the 2014 exercise.\nThis result is also significant because this stress test was more challenging than in 2014. First, the EBA now includes simulation of operational risk, including conduct and litigation risk. This reduces our CET1 ratio under the ‘adverse’ scenario by 2.2 percentage points. Second, the 2016 stress test simulates a much more severe financial market shock than in 2014.\nThis improved result is the fruit of hard work and many small steps forward. On several dimensions, Deutsche Bank’s risk profile and capital position have rarely been stronger.\nThere is more we can do. We aim to have our Non-Core Operations Unit materially wound down by the end of this year, having fulfilled its purpose. This will remove a considerable drag on our profitability. We will continue to invest to strengthen controls and focus on businesses where we have most to offer clients and where we see the right balance between costs, risks and returns. It is imperative that we continue on that path.\nOur environment is challenging and may become more so in the months ahead. The stress test results indicate that Deutsche Bank is well-equipped for tough times.\nYours sincerely,\nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}