{
    "url": "https://www.db.com/news/detail/20160729-deutsche-bank-results-of-2016-eba-stress-test?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 29, 2016",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank: Results of 2016 EBA Stress Test",
    "body": "The European Banking Authority (EBA) today announced the results of its 2016 EU-wide stress test. The aim of the exercise was to analyse how a bank’s capital position would develop by the end of 2018 under two different scenarios.\nThe stress test found that under its “baseline” scenario, Deutsche Bank’s (XETRA: DBKGn.DE / NYSE: DB) fully loaded CRR/CRD4 Common Equity Tier 1 (CET1) ratio would be 12.1% at the end of 2018. Under the “adverse” scenario, the stress test found that Deutsche Bank’s CET1 ratio would be 7.8% at the end of 2018.\nThe 2016 stress test included for the first time a simulation of the impact of operational risks including litigation. These reduced Deutsche Bank’s CET1 ratio in the “adverse” scenario by 220 basis points. Despite this, the bank’s CET1 ratio was found to be higher than in the 2014 stress test, when the CET1 ratio under the “adverse” scenario was found to be 7.0%.\n“We come out of the 2016 stress test stronger than in 2014, although this year’s exercise was more demanding,” said Deutsche Bank CEO John Cryan. “This improved result is the fruit of hard work and many small steps forward. The stress test shows that the bank is well equipped for tough times.” Management will focus on further strengthening the bank’s capital position as planned. He added: “We are on track to reach a CET1 ratio of at least 12.5% by the end of 2018.”\nWith regard to the CRD 4 leverage ratio (fully loaded), the 2016 EBA stress test found that Deutsche Bank’s would be at 3.9% in the “baseline” scenario and at 3.0% in the “adverse” scenario at the end of 2018.\nTable – Deutsche Bank’s CET1 ratios in the EBA stress tests 2014 and 2016 (fully loaded, in %):\nStress test   Starting point  Baseline scenario Adverse scenario \n 2014  9.2  10.5  7.0\n 2016  11.1  12.1  7.8\n\nThe EBA Template is available here. ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}