{
    "url": "https://www.db.com/news/detail/20160719-deutsche-bank-appoints-duo-to-lead-corporate-finance-in-germany-austria-and-switzerland?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 19, 2016",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank appoints duo to lead Corporate Finance in Germany, Austria and Switzerland",
    "body": "Patrick Frowein (45) and Berthold Fuerst (50) are appointed as Co-Heads of Corporate Finance in Germany, Austria and Switzerland with immediate effect. Whilst Frowein and Fuerst will have overall responsibility for Deutsche Bank’s corporate finance business in Germany and across the region, their principal focus will be to drive the Bank’s relationship coverage and the delivery of strategic investment banking products and advice to its largest corporate clients.\n“I’m pleased that with Patrick and Berthold we have chosen two very experienced bankers to lead our business in our home market,” said Jeff Urwin, Head of Corporate & Investment Banking (CIB) at Deutsche Bank. “Both are well known across the market, have been at Deutsche Bank for many years and have access to excellent networks within Germany and abroad.”\n“The German-speaking region is at the core of our CIB business, and we have been the leader in this market most of the last ten years, by quite some margin,” said Alasdair Warren, Head of CIB in Europe, Middle East and Africa (EMEA). “With our new leadership team we plan to further develop our business and extend our position. A strong base in our home market is essential if we are to re-establish our position as the leading corporate and investment banking business across Europe, which is our clear goal.”\nPatrick Frowein was previously Co-Head of Global Industrials within CIB. Industrials is comprised of the following sectors: Automotive, Diversified Industrials, Aerospace & Defence, Construction & Building Materials, Paper & Packaging, Transportation, and Business Services. He joined Deutsche Bank as Head of Diversified Industrials EMEA in 2006. Patrick has 20 years of investment banking experience starting his career in 1996 with SBC Warburg, which later became part of UBS. He initially worked in Frankfurt as an investment banker and moved to London in early 1998.\nBerthold Fuerst was previously Co-Head of M&A in EMEA. He headed M&A in the German speaking region as well as for industrial clients across Europe for many years. Berthold studied economics and finance and started his career at Deutsche Bank’s investment banking 20 years ago in equity capital markets.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}