{
    "url": "https://www.db.com/news/detail/20160718-discussion-in-the-financial-centre-frankfurt-what-will-brexit-mean-for-banks?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 18, 2016",
    "tags": [
        "Company",
        "Corporate products",
        "Management & Leadership",
        "Research"
    ],
    "title": "Discussion in the financial centre Frankfurt: What will Brexit mean for banks",
    "body": "Three weeks after the referendum in the United Kingdom the first domestic policy decisions have been taken – but the UK’s future relationship with the European Union will remain unresolved for months, if not years. How will access to the EU und British markets be regulated in future? How will conditions change for banks in London and Continental Europe? And what opportunities will open up for Germany’s financial centre?\nThese were the main questions addressed by a panel discussion at the University of Frankfurt. Sylvie Matherat, Chief Regulatory Officer and Member of the Management Board of Deutsche Bank AG, took part in a debate with Andreas R. Dombret, Member of the Executive Board of Deutsche Bundesbank, Ignazio Angeloni, Member of the ECB Supervisory Board, Ronald Kent from the British Bankers' Association and Lutz Raettig, Chairman of the Supervisory Board of Morgan Stanley in Germany.\n“The UK will make a decision, and we will adjust to this new reality,” said Matherat regarding the future relationship between the EU and the UK.\nDeutsche Bank is prepared to mitigate the consequences for the UK leaving the EU. As a bank with its head office in Germany and a strong presence in London it can respond flexibly to client needs, said Matherat. Overall, the bank has a stable global positioning thanks to its five main locations and balanced business model.\nMatherat stressed that in the current discussion “banks should not all be lumped together.” Should the UK lose its status of having access to all EU financial markets, this may provide banks in Continental Europe with a competitive advantage. Matherat said she does not expect that Brexit will prompt any change in Deutsche Bank's business model in UK over the short term.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}