{
    "url": "https://www.db.com/news/detail/20160714-deutsche-bank-singapore-wins-landmark-mandate-on-temasek-unit-s-private-equity-securitisation?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 14, 2016",
    "tags": [
        "Asset Management",
        "Capital markets",
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Deutsche Bank Singapore wins landmark mandate on Temasek unit's private equity securitisation",
    "body": "Deutsche Bank AG, Singapore branch (‘Deutsche Bank Singapore’) today announced that it has been mandated as transaction administrator and fund administrator on a landmark securitisation of private equity assets in Southeast Asia for Astrea III Pte. Ltd (‘Astrea III’).\nMarking the launch of Singapore’s first Collateralised Fund Obligation (CFO), the US$510 million bond issuance is backed by cashflows generated from a globally diversified pool of 34 private equity funds. The issuance is sponsored by Astrea Capital Pte. Ltd (‘Astrea Capital’), a wholly-owned subsidiary of Azalea Asset Management Pte. Ltd (‘Azalea Asset Management’). Azalea Asset Management is a wholly-owned subsidiary of Singapore investment company, Temasek Holdings.\nDeutsche Bank Singapore’s Corporate Trust and Alternative Fund Services teams have been mandated on the central roles of Transaction Administrator and Fund Administrator respectively. In addition, Deutsche Bank will also perform the role of Security Trustee and additional note agency roles.\nMargaret Lui, Chief Executive Officer of Azalea Asset Management, said: “We are proud to launch this unique product, which is also Singapore’s first listed private equity bond, to make private equity more accessible to the wider investment community. Deutsche Bank’s strong expertise and innovative technology used to service such structures were the key factors in our decision to work with the Bank.”\n\nYing-Ying Tan, Head of Global Securities Services – Asia Pacific at Deutsche Bank, said: “We are very pleased to receive this first mandate from Azalea Asset Management. Our one-stop-shop service offering for this ground-breaking transaction in Southeast Asia is a great demonstration of our market leading Corporate Trust and Alternative Fund Services capabilities working together in the region.”\nDeutsche Bank’s Corporate Trust and Alternative Fund Services teams are part of its Global Securities Services business.\nCorporate Trust provides corporates, financial institutions, hedge funds and supranational agencies around the world with trustee, agency, escrow and related services. The Bank offers a broad range of services for diverse products, from complex securitizations and project finance to syndicated loans, debt exchanges and restructurings.\nThe Alternative Fund Services team offers a full range of fund administration and banking services to alternative asset funds including fund accounting, net asset value calculation, shareholder services as well as investor and management reporting.\n\nFor further information, please contact:\nDeutsche Bank AG\nPress & Media Relations\nKarène Dufour\nPhone: +852 2203 7846\nE-mail: karene.dufour@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}