{
    "url": "https://www.db.com/news/detail/20160714-deutsche-bank-plans-to-appoint-werner-steinmueller-as-a-member-of-the-management-board?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 14, 2016",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Deutsche Bank plans to appoint Werner Steinmueller as a member of the Management Board",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) announced today that Werner Steinmueller, 62, Head of Global Transaction Banking (GTB), has been designated to join the Management Board and take on a new role as Chief Executive Officer of Asia Pacific. The Nomination Committee of the Supervisory Board will recommend these changes to the full Supervisory Board at its upcoming meeting on July 28. The appointment is also subject to regulatory approval.\nMr. Steinmueller joined Deutsche Bank in 1991 and has been the Head of GTB since 2004.\nDeutsche Bank’s GTB business is a leader in cash management, trade finance and securities services. The business is the world’s largest clearer of euros and a leading provider of export letters of credit in Germany and trustee for securities in the United States.\nMr. Steinmueller is designated to relocate to Hong Kong in the autumn and become the first-ever Management Board member to be located in this fast-growing region. Deutsche Bank is present in 16 countries in Asia Pacific and has approximately 20,000 employees in the region. It is intended that Mr. Steinmueller remains Chairman of the Postbank Supervisory Board.\nMr. Steinmueller will be succeeded as Head of GTB by John Gibbons, 56. Mr. Gibbons has most recently been Regional Executive for Europe, Middle East and Africa and Global Head of Banks and Broker Dealers for Treasury Services at J.P. Morgan.\nMr. Gibbons previously worked at Deutsche Bank and Bankers Trust from 1992 to 2001. He has worked in banking for 34 years, serving as a leader of transaction banking businesses.\nMr. Gibbons will be based in London and report to Jeff Urwin, Head of Corporate & Investment Banking. He is expected to join the bank in October.\nJeff Urwin, Head of Corporate & Investment Banking at Deutsche Bank, said: “I am grateful to Werner for his long-standing leadership in Global Transaction Banking and look forward to continuing our work together on the Management Board. In John Gibbons, we have recruited a seasoned, trusted professional to Deutsche Bank. He has the right combination of client focus and experience in running a transaction bank to manage our business for the future.”\nFor further information please contact:\nDeutsche Bank AG\nPress & Media Relations\nMonika Schaller\nPhone: +49 69 910 48098\nE-Mail: monika.schaller@db.com\nMichael West\nPhone: +852 22038403\nE-Mail: michael.west@db.com\nRenee Calabro\nPhone: +1(212)250-5525\nE-Mail: renee.calabro@db.com\nMichael Golden\nPhone: +44 20 7545 6469\nE-Mail: michael.golden@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}