{
    "url": "https://www.db.com/news/detail/20160711-deutsche-bank-supports-integrated-health-hub-in-underserved-neighborhood?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 11, 2016",
    "tags": [
        "Corporate Citizenship",
        "Sustainability"
    ],
    "title": "Deutsche Bank supports integrated health hub in underserved neighborhood",
    "body": "Deutsche Bank’s Community Development Finance Group (CDFG) provided a USD 18.4million loan to complete financing for an integrated mental health, primary care and community intervention center in East New York, Brooklyn, one of the most underserved areas of the city.\nCDFG deploys the Bank’s balance sheet in the service of bringing capital to distressed communities. These loans and investments support community economic development with a focus on developing quality affordable housing, by investing in Low Income Housing Tax Credit funds and working with intermediaries and other financial institutions to extend credit for predevelopment, property acquisition and construction financing.\nFunding to help expand the Institute for Community Living, (ICL) an award-winning human services agency with a mission to assist individuals and families affected by or at risk of mental illness with integrated comprehensive care designed to improve their wellbeing, recovery and participation in community living, came from USD 26.5million in New Markets Tax Credits.\nThe federal tax credit program was created in 2000 to encourage private investment in low-income communities by offering tax breaks to investors who provide below-market financing to projects in poor areas. Deutsche Bank’s CDFG contributed an USD 18.4million loan to complete the project's financing.\nThe new 44,600-square-foot center will offer nine different programs, including mental health and social services, as well as care coordination. The new site is scheduled for completion in 2018 and will double the ICL’s capacity for services to about 9,700 patients annually.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}