{
    "url": "https://www.db.com/news/detail/20200529-gerald-podobnik-on-sustainable-finance-if-we-don-t-act-now-we-ll-have-passed-up-an-opportunity?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "May 29, 2020",
    "tags": [
        "Sustainability"
    ],
    "title": "\"If we don't act now, we'll have passed up an opportunity\"",
    "body": "Mr Podobnik, up until just a few years ago the whole “sustainable finance” concept was seen as more of a marketing ploy. Has that changed?\nThat definitely came into it in the beginning. The first issuers wanted to send a message: look at us, we’re committed to operating sustainably. But the Paris Climate Agreement, the supplementary One Planet Summit in 2017 and ultimately the European Commission’s Sustainable Finance Strategy gave the idea a tremendous boost. From that moment on everyone noticed that it had been given a regulatory framework. And that in turn sped up its development.\nThat means the marketing phase is behind us?\nYes, because investors are gradually changing their behaviour as well. Firms are coming under increasing pressure to embed sustainability criteria in their governance practices. More and more institutional investors use sustainability criteria to manage their portfolios and are enquiring after sustainability ratings. Retail investors are now also warming to the topic. There are studies showing that firms with a stronger focus on ESG (environmental, social and governance) criteria are also more resilient in times of crisis. That’s a strong message.\nDeutsche Bank aims to facilitate 200 billion euros of sustainable financing and investments by 2025. Why weren’t we faster setting such targets?\nWe had been criticised for not having any specific targets. However, we wanted to adopt an orderly, structured and clear approach. We also wanted to use the European Union’s sustainability standard, the EU Taxonomy, as the basis for developing understandable criteria. It simply has to be clear which activities help towards reaching our targets and which ones do not. For topics such as renewable energies, sustainable production or sustainable farming, the criteria are based on internationally recognised standards and so are quite easy to define.\nFor other areas the EU stipulations are quite complex, but they provide a very good framework for how the assessment should be conducted. There are other areas, especially in the social sphere, where we had to stipulate the criteria ourselves. In the next step we had to then assess what we already have in our portfolio that complies with our in-house taxonomy. Doing so demonstrated how much we had already achieved. The consultancy ISS ESG has scrutinised our ESG criteria and ranked us eighth of 281 firms in the category financial institutions/banks and capital market.\nYet you’re calling on politicians to create more incentives for the financial sector to smooth the way for sustainable finance. Why’s that necessary?\nThe only way to help the financial sector make a huge shift towards sustainable finance in a short space of time is by offering incentives and through regulatory requirements. The question is also how to get all banks pulling in this direction. As a big bank we are already being watched by the capital market, analysts and investors.\nSmaller or regional banks, however, are not – they would need some easing of capital requirements, for example. A climate stress test for banks would also be a good idea: those with a good climate rating could be exempted from fulfilling certain requirements.\nWhat else needs to be done for companies to operate more sustainably?\nCompanies have to deliver vastly improved and more transparent reporting on how they plan to become more sustainable – and of course on what they have already achieved as well. After all, it’s standards and scalability that make capital markets work. What I mean is: there must be quantifiable and comparable metrics to identify how sustainably businesses operate. If we as banks have to be evaluated, then we must also be able to classify the business of our clients accordingly. And this requires standards similar to those for financial reporting.\nYou’re a member of the German government’s Sustainable Finance Advisory Council. Is progress being made on this count?\nThe EU is currently revising its directive on non-financial reporting for companies. We’re on the right track with that. And on the government’s Sustainable Finance Advisory Council our objective is to make Germany a leading light in this field.\nIts members are representatives from the financial sector and the real economy, civil society and academia. We are convinced that the current crisis provides an opportunity to take interventionary action to link growth and sustainability. The energies and resources we mobilise now will have long-lasting effects. So we also have to help to solve long-term challenges – chiefly the transformation to a climate-neutral economy. That’s the direction we aim to take.\nOf course there’s no shortage of people whose first priority is to look after the economy and think the climate should take second place. We see things differently however: we have to make the transformation into a more sustainable economy, one that is much more resilient to the risks of climate change for example. If we fail to act during this crisis then we will have passed up an opportunity.\nAs a banker who always has to represent the interests of his corporate clients, don’t you find yourself wrestling with the conflict between sustainability and economic efficiency?\nOn the government’s advisory council I don’t represent the bank; I was nominated in my personal capacity. And I am required to draw a strict distinction between the two roles. But leaving that aside: when we talk to our corporate clients their interests are always uppermost in our minds when we consider applying sustainable criteria.\nWe are currently seeing two trends shaping entrepreneurial developments: digitalization and sustainability. Those who fail to take a strategic view early enough will suffer long-term consequences. As such we always strive to ensure that acute problems are also addressed with a view to long-term success. When the coronavirus crisis began we all saw that parts of our economy lack resilience.\nThis shows how important a sustainably oriented economy can be. As a bank we can provide a decisive boost by supporting sustainability from every angle – for example by issuing our own green bonds.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}