{
    "url": "https://www.db.com/news/detail/20200522-male-allies-why-gender-equality-is-not-just-important-to-women?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "May 22, 2020",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "Male allies: Why gender equality is not just important to women",
    "body": "When it comes to supporting women to achieve their potential, it’s not just women who need to have each other’s backs. Men have a critical role to play. Deutsche Bank’s dbGO (Gender Opportunity) diversity network is partnering with The Women’s Foundation in Hong Kong on their Male Allies programme. Five senior male colleagues who are active participants of this programme explain why every man has a role to play.\n“Everyone deserves the same chance”\n“I want to ensure everyone has the same opportunities and chances within the firm as I have had. Equality and inclusion should be equal areas of focus with revenue and cost when setting business plans and objectives. We need to have a diverse pipeline of talent to take the firm forward. We have made significant progress, but there is more that can be done.” – Stuart Harding (Head of Trust & Agency Services, Asia Pacific and Head of Global Transaction Banking, Hong Kong)\n“We need to listen”\n“I want to help increase the number of female colleagues in senior leadership positions. We need mentoring and sponsorship initiatives that allow everyone to reach their personal development targets.“ – Christopher Chan (Head of Compliance, Hong Kong)\n“Not just important for women”\n“Gender equality is not only important for female colleagues. Our role is to influence and support other senior managers in promoting it.” – Geoffrey Yeung (Team Head of Wealth Management, North Asia)\n\nFrom left to right: Back – Geoffrey Yeung, Siddhartha Hari, Candice Cheng, Stuart Harding, Pietro Ciani and Claire Coleman. Front – Michelle Tennant, Vicki Noblett, Christopher Chan and Anna Lindfield\n“Men can’t be silent spectators”\n“To really drive diversity and inclusion, men can’t be just silent spectators. They have an important part to play in this journey and Male Allies are a key link to ensure there is broader engagement. They should not just be aware of the issues, but also be ready to engage in critical conversations and drive positive change.”- Pietro Ciani (Head of Strategic Equity Transactions Group, Asia Pacific)\n“We need to do away with stereotypes”\n“I want to expand our female leadership pool by addressing the issues women face in the workplace. As an industry, we need to do away with stereotypes. Through the Male Allies network I have gained a better understanding of inherent unconscious bias. It’s also an opportunity to network with some of the sharpest minds on this topic, and learn from them.” – (Siddhartha Hari – Head of Loans & Structured Credit, North Asia)\nAbout the partnership\nMale Allies is a flagship programme as part of The Women’s Foundation’s agenda aimed at advancing women leaders in the workplace in Hong Kong. Male Allies are business leaders who leverage their collective influence and personal engagement to advance gender equality within their organisations and more broadly across the Hong Kong business community. This partnership was driven by Deutsche Bank’s dbGO (Gender Opportunity) employee resource group in Hong Kong.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}