{
    "url": "https://www.db.com/news/detail/20200521-through-difficult-waters-wm-cio-updates-2020-outlook?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "May 21, 2020",
    "tags": [
        "Corporate products",
        "Wealth"
    ],
    "title": "“Through difficult waters”",
    "body": "The economic recovery from the COVID-19 crisis will only be partial and developed economies’ GDP will not return to pre-crisis levels before 2022, according to a new report by Deutsche Bank Wealth Management.\nWhile policy support will create investment opportunities, the pandemic will also create or exacerbate long-term tensions around the extent of political control; possible “addiction” to policy stimulus; and the impact of higher debt levels and government intervention on growth, according to WM’s Chief Investment Office.\n“Relatively sluggish growth, after the ﬁrst phase of the recovery, will increase worries around capital misallocation, high indebtedness and the renewed risk of a secular slowdown,” Global Chief Investment Officer Christian Nolting writes in the report. “We will be moving through difficult waters for some time yet.”\nThe global economy is likely to contract by 2.6% in 2020, held back by Eurozone output, down 7.5%, the CIO estimates. U.S. GDP is likely to fall 5.7%.\nA strong recovery in Chinese growth in 2021 to 9.0% will lift overall global growth to 5.4% next year. However, developed economies’ GDP will not return to pre-crisis levels until 2022.\nNonetheless, a number of asset classes may still offer opportunities in the current environment.\nContinued policy support will keep interest rates very low or negative in most economies. This will be one factor driving equity markets higher on a 12-month horizon, despite the modest economic growth outlook.\nWealth Management’s CIO also sees opportunities in high yield and other fixed income asset classes. Oil prices could rise slightly as demand slowly recovers. There is some further upside for gold.\n“One lesson that we can take from the crisis is that – even at times of extreme market stress – long-standing investment rules apply,” Nolting writes. “In the medium-term it is worth having a strategy and sticking to it – either at times of market downturns or the subsequent recovery.”\nHe adds: “In the long term, dangers around market timing mean that Strategic Asset Allocation (SAA) remains the way to deliver sustainable portfolio returns.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}