{
    "url": "https://www.db.com/news/detail/20200518-db-privat-und-firmenkundenbank-ag-merges-with-deutsche-bank-ag?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "May 18, 2020",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "DB Privat- und Firmenkundenbank AG merges with Deutsche Bank AG",
    "body": "• Entered in the commercial register on May 15, 2020\n• Important step towards cost reduction, cheaper refinancing and simpler structures in private clients business\n• Legal succession has no impact on client business\nWith the entry in the commercial register on May 15, 2020 Deutsche Bank has merged DB Privat- und Firmenkundenbank AG with Deutsche Bank AG. Clients, staff, balance sheet items and business assets have been transferred in full to the legal successor Deutsche Bank AG. The technical systems migration was carried out over the previous weekend.\nThe merger of the legal entities is an important element of the transformation for which Deutsche Bank set itself ambitious goals in summer 2019: by 2022 it aims to cut costs and refinancing expenses and grow revenues and profit. A major contribution to this is to come from the private clients business in the bank’s home market.\nKarl von Rohr, Deutsche Bank President and Head of Private Bank, said on the occasion of the entry in the commercial register: “Today we have completed one of the biggest bank mergers in the history of the Federal Republic of Germany seamlessly and as scheduled. Our teams have delivered this project during the corona pandemic while working from home in addition to performing their day-to-day tasks for our clients – further proof of our bank’s ability to perform, even in times of crisis.”\nThe change of legal form enables Deutsche Bank to cut costs significantly, because of the elimination of some of the infrastructure functions and the governance tasks that were retained in both Deutsche Bank AG and DB Privat- und Firmenkundenbank AG and that were executed specifically for the respective legal entity. In addition, refinancing and administrative expenses are reduced and corporate governance is simplified. The merger also lays the foundations for a technological solution, a first step being the migration of Postbank’s systems to Deutsche Bank’s IT by 2022. The Private Bank in Germany will implement this and other measures to comprehensively modernise its IT and process architecture over the coming years.\nStaff hitherto employed by DB Privat- und Firmenkundenbank AG will be transferred to Deutsche Bank AG as a consequence of the merger and will retain their existing employment terms in accordance with statutory provisions. Deutsche Bank Group becomes the authorised employer of all the civil servant personnel of Postbank. The discussions currently being conducted with employee representatives about expected job reductions are to be concluded promptly.\nThe merger will have no impact on clients of DB Privat- und Firmenkundenbank AG. Deutsche Bank will continue to serve its private and commercial clients with the Deutsche Bank and Postbank brands and all subsidiaries and branches of the former DB Privat- und Firmenkundenbank AG will continue to be operated unchanged by Deutsche Bank AG. The merger will not result in any changes to prices or products – nor to client support, the volume of services, contact persons and contact information. Manfred Knof will remain Head of Private Bank Germany, while Stefan Bender will continue as Head of Corporate Bank Germany.",
    "number_of_ratings": 4,
    "rating": 3.8,
    "likes": 9
}