{
    "url": "https://www.db.com/news/detail/20200515-deutsche-bank-americas-supports-covid-19-diversity-und-inclusion-action-agenda?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "May 15, 2020",
    "tags": [
        "Company",
        "Corporate Citizenship",
        "Diversity"
    ],
    "title": "Deutsche Bank Americas supports COVID-19 Diversity & Inclusion Action Agenda",
    "body": "On April 30, Deutsche Bank USA joined over 100 other companies in supporting a consortium of leading diversity & inclusion non-profit organizations to address the unique adverse impacts of the COVID-19 pandemic on marginalized groups. This public affirmation calls on supporters to promote inclusion, raise awareness, denounce bias, support communities and provide donations to help vulnerable populations.\nLow-wage earners are particularly vulnerable during this public health and economic crisis, and this pandemic has also claimed a disproportionate number of lives in communities of color and given rise to a surge of anti-Asian sentiment.\n“While everyone has been affected by COVID-19, systemic societal biases have a profound impact certain communities. This action agenda calls attention to the lived experiences of many Asian, Black, Hispanic/Latinx, and LGBTQ people, including our colleagues and their loved ones. During this unprecedented time, the work of our Employee Resource Groups, People Strategy teams, and CSR efforts remains a priority.” said Kathryn Burdett, Head of Diversity & Inclusion in the Americas.\nThe consortium was spearheaded by Ascend, the largest non-profit Pan-Asian organization for business professionals, and includes nine other leading organization in the area of diversity & inclusion. In addition to Deutsche Bank. Supporting companies span across all multiple industries and include American Airlines, American Express, Bank of America, The Coca Cola Company, Facebook, Google, Hewlett Packard Enterprise, IBM, Lockheed Martin Corporation, Mercedes-Benz, among others.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}