{
    "url": "https://www.db.com/news/detail/20200514-deutsche-bank-appoints-kamran-khan-as-head-of-esg-for-asia-pacific?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "May 14, 2020",
    "tags": [
        "Company",
        "Sustainability"
    ],
    "title": "Deutsche Bank appoints Kamran Khan as Head of ESG for Asia Pacific",
    "body": "Deutsche Bank today announced that it has appointed Kamran Khan to the newly created role of Head of ESG for Asia Pacific. He will be responsible for developing and coordinating the regional business strategy around ESG across all of the bank’s business divisions in the region.\nKamran brings decades of experience in financial markets, sustainable development, and corporate and public advisory. He was appointed by the Obama White House to serve as head of global investments and operations at the US Millennium Challenge Corporation. Previously Kamran established the World Bank Group Hub in Singapore and led the World Bank’s Infrastructure Finance Practice in East Asia. Over the course of his career, Kamran has led investments in sustainable development across Asia, Africa, Latin America and Eastern Europe. Most recently, he founded and led an impact fund targeting companies focused on achieving UN Sustainable Development Goals.\nKamran will be based in Singapore, reporting regionally to Asia Pacific CEO Werner Steinmüller and locally to David Lynne, Singapore Chief Country Officer, Head of Corporate Bank APAC, and Head of Fixed Income and Currencies APAC.\nWe have created this role as a statement of our intention to place ESG at the heart of our organization and the service we provide to clients in this region. ESG is a key strategic priority for us globally and regionally, and one that spans the full spectrum of our businesses. We are pleased to have someone of Kamran’s calibre joining to harness the strength of our platform and put our ambition into action.\nWerner Steinmüller\nDavid Lynne added, “The ESG imperative in Asia Pacific is incredibly strong. We recognize that as a bank with one of the broadest and deepest networks in local markets across the region, we have a unique role to play in the development of ESG frameworks and capabilities here. We are committed to pushing the ESG agenda forward in Asia Pacific, and Kamran’s appointment is but the first step along that path.”\nDeutsche Bank has had a longstanding commitment to sustainability. The bank has been a member of the UN Environment Programme Finance Initiative and signatory of its Declaration of Sustainable Development since 1992, achieved climate neutrality in operations since 2012, and has been a supporter of the Paris Climate Agreement since 2015. In 2019, the bank was a founding signatory of the UN Principles for Responsible Banking. The bank has also committed that by 2025 its total volume of sustainable financing and investments will exceed EUR 200bn, and that its operations will be powered entirely by renewable energy sources.\n\nFor further information please contact:\nDeutsche Bank AG\nCommunications\nAmy Chang\nPhone: +852 2203 8434\nEmail: amy.chang@db.com\nSarah Stabler\nPhone: +65 6423 8413\nEmail: sarah.stabler@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}