{
    "url": "https://www.db.com/news/detail/20200513-konzept-18-life-after-covid-19?language_id=1",
    "language": "DE",
    "article_type": "Research",
    "publish_date": "May 13, 2020",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "Konzept #18: Life after covid-19",
    "body": "With over a quarter of a million fatalities and many millions unemployed, the latest edition of Konzept - Life after Covid-19 - is devoted to thinking about the many ways in which the world will be different as a result of the virus.\nKonzept issue 18 opens on a hands-on note with calculations of how much investment countries need to inject into their health systems to make them robust enough for another pandemic. More important is how these funds are allocated and Deutsche Bank Research provides a framework for countries to follow. It then examines prior pandemics and finds that they catalyse much change in society.\nEconomists disagree about whether the eye-popping stimulus packages created in response to covid-19 will result in inflation, or whether deflation will become a permanent fixture. Two analysts with different views argue each side, while others tackle the more immediate question: how will we pay for the trillions of stimulus dollars governments are borrowing?\nAs hundreds of millions around the globe embrace digital technology for work and play, Konzept looks at some of the likely permanent effects including the forced migration of reluctant businesses to the online realm and the rise in digital payments.\nAnd with much discussion about the side effects of this technological advancement, Konzept consider protests from people who are hating working from home, and those who lament the end of privacy with the new track-and-trace apps.\nFinally, Konzept puts two mega issues – inequality and climate change – under the covid-19 spotlight. Here, they see good news. Download Konzept #18 to hear it.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}