{
    "url": "https://www.db.com/news/detail/20200513-we-kept-our-promise-and-planted-more-than-150-000-trees-to-mark-our-150th-anniversary?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "May 13, 2020",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "We kept our promise and planted more than 150,000 trees",
    "body": "Since 2010 more than 4,500 of the bank’s staff worldwide have been leaving their desks, strapping on their boots and volunteering with families in tree-planting sessions organised by our Corporate Social Responsibility team. By the end of 2019 they had planted 90,000 trees!\nAnd to mark the bank's 150th anniversary, we set ourselves a very ambitious target: to plant 60,000 new trees this year alone, bringing the total number up to 150,000. The coronavirus pandemic and the social distancing restrictions that were consequently put in place posed a real challenge for the bank because tree-planting couldn’t go ahead as usual.\nChristine Schwake from the CSR team at Deutsche Bank has managed the project from its inception and she is delighted: “We kept our promise nevertheless! We can all be proud of what we’ve achieved: exceeding our own target after just four months so that the total number of trees planted already tops 173,000.\nOnce the lockdown restrictions had been imposed, we asked Trinkwasserwald® e.V. to continue the planting in spring and in a fantastic effort, our long-term partner did just that. Every one of our colleagues who joined in has demonstrated their commitment to sustainability and the communities we operate in. And we’d like to thank them all warmly!”\nPlanting trees can secure drinking water\nOur cooperation partner for planting sessions in Germany is Trinkwasserwald® e.V.. The charity works to increase the amount of available groundwater and drinking water in Germany and to secure those levels. In close collaboration with forest owners and forestries the charity transforms existing monoculture coniferous forest areas into deciduous or mixed woodland that can better cope with warmer temperatures.\n“So far, our bank and our colleagues have helped create roughly 28 hectares of woodland that generates more than 22 million litres of additional clean drinking water – a really personal and tangible positive impact on the society we live in,” says Christine Schwake. Colleagues in Birmingham, Jacksonville, Johannesburg and in the Philippines have also been volunteers in reforestation projects for many years now.\nLess paper means more trees\nThe nationwide anniversary planting sessions in Germany are also part of the Private Bank’s eSafe campaign, which started last October and – also in cooperation with Trinkwasserwald e.V. – has been planting one tree each time an online banking client activates an eSafe (digital document safe). The Private Bank is also on track to achieve its own goal of planting 150,000 trees by the end of 2020.\n\nThe BHW building society launched a similar campaign on February 1 this year: it promises to donate a tree for each customer who takes out one of its quick loans with our Postbank financial advisors. By the end of this year, our colleagues expect to be able to plant another 4,000 trees in the German city of Hamelin.\nPlus You - Deutsche Bank’s volunteering and giving community\nOur Plus You programme provides the opportunity for employees to get involved and give to causes close to their hearts. In 2019, 25 percent of our colleagues were engaged in volunteer projects and invested some 220,000 hours of their time in social projects. These include planting trees together with Trinkwasserwald® e.V. as well as other regional environmental protection organisations.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}