{
    "url": "https://www.db.com/news/detail/20200512-deutsche-bank-sets-itself-ambitious-sustainability-targets?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "May 12, 2020",
    "tags": [
        "Company",
        "Strategy",
        "Sustainability"
    ],
    "title": "Deutsche Bank sets itself ambitious sustainability targets",
    "body": "At least 200 billion euros of sustainable financing and investments by 2025\nFramework in place to issue first green bond\nElectricity to come solely from renewable sources by 2025\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) has for the first time published quantifiable targets for expanding its sustainable business activities covering the ESG (environmental, social, governance) space and aims to support the transformation towards a sustainable economy. By the end of 2025, the bank will increase its volume of ESG financing plus its portfolio of sustainable investments under management to over 200 billion euros in total.\n“We are driven by a very strong conviction to help shape the global change to a sustainable, climate-neutral and social economy,” says Deutsche Bank CEO Christian Sewing. “The target of 200 billion euros in sustainable financing and ESG investments is ambitious compared to our peers. However, we are starting from a good base because, as a globally active financing house, we can serve the growing demand of our clients for sustainable investment products by ourselves.”\nThe minimum volume of 200 billion euros within six years includes loans granted by 2025 and bonds placed by Deutsche Bank during this period. It also includes sustainable assets managed by the Private Bank as of the end of 2025. Deutsche Bank is thereby following the standards used in the industry. The ESG assets of around 70 billion euros managed by asset manager DWS as of the end of 2019 are not included in these calculations.\nWhen defining which activities it will classify as sustainable, the bank will be guided by the EU Taxonomy – the European Union’s ESG standard. In areas where the EU has yet to develop its own standards, Deutsche Bank will rely on its own transparent criteria.\nThe bank will report annually on the progress towards achieving this target in its Non-Financial Report. It will also disclose more details on its definition of sustainable finance by the end of the second quarter 2020.\nSince the beginning of 2020, the bank has advised clients on 22 transactions, placing ESG bonds with an underwriting volume of nearly 3.5 billion euros. These included green bonds, social bonds, sustainable bonds and bonds linked to sustainability criteria. Deutsche Bank is currently number 10 in the global ranking for sustainable bonds (source: Dealogic).\nFoundations laid for first green bond\nDeutsche Bank has established a comprehensive framework and can, with immediate effect, raise funds for refinancing by issuing its own green bonds. This will enable the bank to raise funds for further developing renewable energy sources or for projects aimed at boosting energy efficiency. As previously announced, Deutsche Bank aims to issue its first green bond sometime this year, subject to market conditions.\n“Green” assets include loans and investments in companies, assets or projects that focus on renewable energy, energy efficiency and so-called green buildings that are built according to environmental and sustainability standards. Deutsche Bank’s Green Bond Framework is based on the Green Bond Principles of the International Capital Market Association (ICMA) as well as on the latest guidance in the EU Taxonomy developed by the European Union’s Technical Expert Group on Sustainable Finance.\nThe independent consulting firm Institutional Shareholder Services ESG (ISS ESG) has reviewed the bank’s Green Bond Framework and issued an expert opinion, confirming not only the bank’s exemplary conduct but its consistency with the UN Sustainable Development Goals. As part of its evaluation, the consulting firm assessed the bank’s ESG performance, giving it “Prime” status (C rating). This ranks Deutsche Bank in eighth place among 281 companies that have been assessed in the category financial institutions/banks and capital market.\nElectricity consumption to come solely from renewable sources by 2025\nDeutsche Bank also has a blueprint to make its operations more sustainable. By 2025 at the latest, Deutsche Bank aims to power its operations entirely using renewable energy. At the end of 2019, nearly 80 percent of the bank’s electricity across the world came from renewable energy sources. This step is consistent with its policy of transitioning to carbon neutrality and of reducing emissions of primary greenhouse gases.\nDeutsche Bank’s business operations have been climate neutral since 2012*. The energy efficiency measures the bank implemented in 2010 have enabled it to reduce its energy consumption by more than a quarter. In order to offset the remaining carbon emissions, the bank buys Verified Emission Reduction certificates.\nProgress made with guidelines for financing business\nTo anchor the topic of sustainability throughout the company, Deutsche Bank will sign up to the Equator Principles – a set of environmental and social governance rules for project financing due diligence.\nFurthermore, Deutsche Bank expects to be able to adopt a new oil and gas policy by the end of the second quarter, which will provide a clear framework for financing and investments in this area.\nDeutsche Bank is convinced that the banking sector has a decisive role to play in the transformation of the economy in order to achieve the targets of the Paris Climate Agreement and the UN Sustainability Goals. Over the past decades, Deutsche Bank has supported numerous sustainability programmes, starting with UN Global Compact in 2000 through to its signing of the UN Principles for Responsible Banking in September 2019.",
    "number_of_ratings": 4,
    "rating": 1.0,
    "likes": 12
}