{
    "url": "https://www.db.com/news/detail/20180702-deutsche-bank-hosts-its-third-annual-dbaccessautotech-event?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 2, 2018",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "Deutsche Bank hosts its third annual dbAccessAutoTech event",
    "body": "Is electrification and autonomous driving a risk or opportunity for the industry? Are tech firms an existential threat, another competitor or a partner to traditional auto original equipment manufacturers? These and other questions were at the focus of the recent dbAcessAutoTech event in London. The leading conference of its kind, it brings together auto, tech and insurance experts, and this year attracted more than 120 investment professionals and senior technology leaders.\nTim Rokossa from Deutsche Bank, Equities Research, Automotive team, said: “There are many conferences that give investors the chance to meet with corporates, but they always meet with the same people either from investor relations or possibly the Chief Financial Officer.\nOur idea is that we connect them with the product people who don’t usually talk to the capital market community. Ultimately, these are the guys that know what's going on and which trends are coming up. What clients also appreciate is the broad reach we have with not only automotive but also tech and insurance companies attending. This really gives you a chance to get the whole picture and not \"just\" the auto view.”\nJohannes Schaller, European Tech Analyst and also from Deutsche Bank’s Equities Research team, said: “Semiconductors and software are the key enablers of automated driving and e-mobility. Understanding the auto industry's views and challenges as it adopts these new technologies is therefore paramount for investors in this fast growing part of the tech sector.”\nBelow is a selection of the key quotes:\nMatthias Zink, CEO Automotive at Schaeffler Group: “There are challenges and opportunities with autonomous driving, but at Schaeffler most are opportunities with new mobility concepts.”\nJochen Schröder, Head of E-Mobility at Schaeffler Group: “Mechanical knowhow will always be needed even in a world full of electric vehicles.”\nBernd Fastenrath, HERE Technologies: “If you think of mobility as a service it’s all about understanding where your customer is, how you can pick him up, where he needs to go, and optimising everything around it for the best customer experience.”\nEric Schuh, Global Head P&C Solutions, Swiss Re: “By 2025 80% of all cars that are sold in developed markets will have advanced data feeds. They lower the risk for the driver as their decisions are safer. Completely autonomous cars will take longer, most likely another 15 to 20 years.”\nPaul Reynolds, Head of Equities Research EMEA, summarised the event \"The main trends that are driving change in the automotive industry are; car ownership in dense urban areas will continue to decline as fleets of robotaxis will start to be operated in cities from 2020 onwards, which will require new business models.\nEver tougher emission limits will mean the future is electrified. The internal combustion engine still has a great future but it will have to be partly electrified to comply. The industry will have to find a way to cope with the costs and governments will have to decide between incentives, fuel tax and the environmental impact\".",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}