{
    "url": "https://www.db.com/news/detail/20180824-deutsche-bank-takes-stake-in-payments-technology-start-up-modo?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "August 24, 2018",
    "tags": [
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Deutsche Bank takes stake in payments technology start-up Modo",
    "body": "Deutsche Bank today announced that it has acquired an equity stake in US-based ModoPayments, LLC (Modo), an industry leader in digital payments innovation.\nIn line with Deutsche Bank’s strategy to grow its transaction banking franchise, Modo’s technology will help the bank expand its existing digital business-to-business and business-to-consumer payments business. In particular, Deutsche Bank will be able to extend payments into non-bank payment platforms such as Alipay, Paypal, M-Pesa and WeChat beyond traditional banking channels, e.g. payment transactions to mobile wallets and peer-to-peer networks.\n“Payments are the bloodline of banking. More and more global payments are executed electronically via Fintech and online platforms,” said John Gibbons, Head of Global Transaction Banking at Deutsche Bank. “Our investment and partnership with Modo will help us to provide our corporate and institutional clients with new digital payment functionalities and accordingly more flexibility in facilitating these transactions. Going forward, we will be able to directly process payments to mobile wallets and app-based payment solutions.”\n“Modo’s technology will allow us to provide new transaction services and payment alternatives for the rapidly growing digital economy, for example, vendors who provide products or services like entertainment content or application development and want to be paid in their mobile wallets, an important area of growth,” adds Michael Spiegel, Global Head of Deutsche Bank’s Cash Management.\n“The Modo team is focused on doing the most good for the most people by reducing friction in payments. That is why we do what we do every day, and this partnership with Deutsche Bank is a great opportunity to work with one of the world’s largest payment providers that can implement our technology on a global scale and further our reason for being” said Bruce Parker, founder and CEO at Modo. \"We're excited to see where this relationship can take us and how we can continue creating interoperability between payment systems around the world.\"\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nAbout Modo\nModo is a payments technology company that focuses on reducing friction throughout the payments industry. Modo's technology creates interoperability between systems without requiring changes to the systems involved. Headquartered in Dallas, Texas, Modo has been partnering with some of the largest and most innovative players in the financial industry since its founding in 2010. Visit www.modopayments.com to learn more.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}