{
    "url": "https://www.db.com/news/detail/20180824-with-a-little-help-from-my-buddy-making-cultural-events-more-inclusive-and-accessible?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "August 24, 2018",
    "tags": [
        "Company",
        "Corporate Citizenship",
        "Culture",
        "Diversity"
    ],
    "title": "Making cultural events more inclusive and accessible",
    "body": "It’s already dark. Flames engulf the huge bull’s head at Wacken Open Air festival; the dust gets into your nose, tickling and making you cough.\nNot that it bothers Moni from Hamburg or Kevin from the Sauerland. Moni pushes Kevin in front of the main stage onto this world-famous field. Kevin is beaming. He has always dreamt of seeing Wacken for himself – the small village in Schleswig-Holstein that becomes a mecca every year in early August for 75,000 fans of heavy metal from all over the world.\nAnd when the Judas Priest lead singer Rob Halford cruises onto the stage on a Harley-Davidson, Kevin feels like the luckiest man on earth. Flanked left and right by like-minded revellers, he’s one of the crowd, he's among equals, he’s one of the many. Despite his wheelchair, and thanks to Ron Paustian, Moni’s boss during the festival.\nPaustian is the founder and director of “Inklusion muss laut sein”. For ten years he has been calling on event organisers throughout Europe to make concerts, festivals and cultural events just as accessible for people with severe disabilities as for every other visitor. However, his project didn't really get going until 2016, when Paustian received recognition for his work from startsocial – an organisation whose mission is to help those who help others.\nIts patron is Angela Merkel and Deutsche Bank is one of its main sponsors. Back then, Christian Sewing presented him with his prize and held the laudatory address.\nAs a national prizewinner, Paustian was assigned two mentors from the business world – experts with whom he could discuss all his ideas. He wanted to become bigger, do more; not because he felt sorry for people with disabilities, but for his own enjoyment and benefit – “no-one would believe me if I said something else anyway,” he says. Why for his own benefit? Paustian has a mental illness that means he can only go to large gatherings if he has someone to accompany him.\nTogether with his mentors, he took his project and, in the space of just three months, turned it into a charitable organisation. From his home – just a couple of miles from Wacken – he spends all his time on the telephone, promoting the organisation and constantly posting on social media. And it’s working. People are talking about him; word of mouth is a powerful tool. The number of chaperones rose from 350 in the first year to 550 in the second. This year, about 1,000 are planned.\nSeeking support for his cause, Paustian continually pestered his friends, Thomas Jensen and Holger Hübner, who set up Wacken Open Air 29 years ago. And his persistence paid off: this year for the first time, wheelchair users like Kevin were able to move around the festival grounds on dedicated paths.\nAnd deaf festivalgoers were able to understand song lyrics thanks to a sign language interpreter – instead of only being able to sense the bass notes and drums, as is mostly the case. Accessible toilets and showers have already been provided for several years. “Every year they do more for inclusion and accessibility”, says Paustian, smiling.\nEverything else is taken care of by people like Moni, Kevin’s favourite chaperone. She is one of 1,700 buddies across Europe that Paustian’s organisation has in its database.\nIf someone with a disability calls Paustian to say they are planning to go to a pop concert or techno festival and would like a chaperone to push their wheelchair or take them by the arm, Paustian looks in the database for a buddy with a similar taste in music; ideally someone fairly local who has time and above all will enjoy the experience. Instead of getting paid, they get free admission to the concert.\nRon Paustian has set himself some challenging goals: “To be able to organise a chaperone whenever anyone asks, we need a pool of between 20,000 and 30,000 buddies.” The problem is money: “If the pool grew to that size we would need an office and would have to employ someone to manage it. We can’t do that with the 10,000 euros in donations we currently receive each year.”\nAnnual expenses already total around 28,000 euros. Paustian makes up the shortfall himself – out of his own pocket or by selling items from his record collection or other possessions.\nAnd Paustian still handles everything on his own: he does all the accounts and the organisational tasks; he writes emails and answers telephone calls – a full-time job. “But if our medium-term goal is to support more inclusion and accessibility projects, we won’t have any other choice but to hire someone to help out,” Paustian says. And that costs money. That’s not stopping him, though: “We carry on fighting, every single day. And that’s the way it should be; otherwise you become lazy and remiss.”\nDeutsche Bank added “Inklusion muss laut sein” to its “PlusYou” donations portal in July this year (available in Germany only). If you would like to make a donation for Wacken 2019, please contact Ron Paustian here.\nStartsocial is a nationwide competition to promote volunteer work. Its patron is German Chancellor Angela Merkel. True to its philosophy “Help for Helpers”, startsocial awards 100 four-month coaching scholarships as well as prize money to outstanding social projects every year. Some 500 professionals and managers serve as coaches or jurors every year, providing their expertise on a voluntary basis. The competition has been running since 2001 and is a pioneer in counselling voluntary social initiatives in Germany. Deutsche Bank has been a partner of the startsocial competition since 2012. More than 250 bank employees have been volunteer jurors or coaches in the meantime.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}