{
    "url": "https://www.db.com/news/detail/20180802-japan-s-pension-funds-are-back-and-putting-pressure-on-the-yen?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "August 2, 2018",
    "tags": [
        "Research"
    ],
    "title": "Japan's pension funds are back",
    "body": "The yen is down significantly against the dollar in recent weeks and Japanese pension funds’ hunger for overseas equities is one reason why, according to Deutsche Bank Research.\nWhen Japan’s giant pension funds decide to invest in foreign shares, for instance US equities, they need to sell yen and buy dollars to fund the purchases – and the amounts are so vast that they can contribute to depressing the yen.\nSpeaking to The Wall Street Journal, Deutsche Bank’s Asian currency strategist Mallika Sachdeva said: “It has been quite surprising that dollar-yen has not moved lower even though we’ve had a lot of trade related stress.”\nAccording to Sachdeva, the reason can be attributed to Japanese pension funds diving into offshore equities, led by the Japan Government Pension Fund (JGIP).\n“As the world’s largest pension fund with 1.5 trillion US dollars in assets, the magnitude of JGIP means that even a small portfolio adjustment has a huge impact, which we’re seeing in the currency,” Sachdeva said.\nAs the third most traded currency in the world – and a so-called haven currency that people traditionally buy during market instability - the yen’s move is significant for global markets.\nIn a recent FX Special Report, Sachdeva and her team note that pension fund flows – when pension funds move large amounts of money in or out - have historically been a big driver of the dollar-yen exchange rate, and so their reappearance after almost two years of absence is important.\nIn a Q&A, Sachdeva explains how pension flows are challenging the reputation of the yen as a safe haven currency.\n1. What is unusual about the way the Japanese yen is behaving?\nThe yen is traditionally considered a safe haven currency, which means it is expected to strengthen when global asset markets and risk sentiment weaken. This reputation developed because historically Japanese corporates offshore would repatriate funds when markets got choppy. However, recently the Japanese yen actually fell below a major technical level, even as trade tensions escalated with the US announcing possible tariffs on 200 billion dollars of Chinese goods. The yen falling in this environment is significant, and signals another theme.\n2. What might be driving this unexpected Japanese yen weakness?\nWe believe Japanese pension funds have returned to international equity markets for the first time in two years, and this is driving the yen’s weakness. Our analysis shows Japanese funds are aggressively buying overseas equities, perhaps taking advantage of value in the recent sell-off. The last time Japanese pension funds aggressively bought foreign stocks was in late 2014 and 2015, and we saw the yen weaken then too.\n3. What does this shift in Japanese pension fund behaviour mean for international markets?\nGiven the enormity of Japanese pension funds (the Government Pension Investment Fund alone has 1.5 trillion US dollars in assets) even small shifts in asset allocation can be significant. It appears that pension funds have recently increased buying of foreign stocks after sell-offs. This behaviour might be dampening the traditional relationship between risk and the yen, which suggests the yen would rise in a significant equity sell off. Pension fund buying may also support equity markets, particularly in the US markets, which has been the largest recipient of Japanese inflows into equities this year.\n4. Why is the Japanese yen important for FX markets and global markets generally?\nThe Japanese yen is the third most actively traded currencies in the world. In 2016, it was more than 20 percent of average daily turnover in the FX market, and equivalent to more than 1 trillion US dollars a day. Because of very low interest rates in Japan, the currency is used by diverse set of market participants, from corporate borrowing, to funding for speculative carry trades.\n5. The last few years have seen a widespread increase in Asian institutional asset managers investing overseas. What does this mean for capital markets and investors?\nAsian institutional investors have joined the ranks of the world’s largest investors. Given the large surplus of savings in Asia, particularly in the more developed North Asian economies, many regional institutional investors are looking abroad for higher yields and diversified assets. Japanese pension funds are not alone in increasing their allocation to overseas assets. Asian life insurers, public pension funds and asset managers are all looking at foreign bond and equity markets.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}