{
    "url": "https://www.db.com/news/detail/20180801-q2-results-show-good-earnings-growth-in-eurozone?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "August 1, 2018",
    "tags": [
        "Capital markets",
        "Corporate products",
        "Investment Banking",
        "Research"
    ],
    "title": "Q2 results show good earnings growth in Eurozone",
    "body": "As more and more companies have reported second quarter earnings in recent weeks, the general mood in markets is more upbeat than many analysts had anticipated. See which areas have been hot - and which not - according to experts from Deutsche Bank Research.\n“We have seen relatively good earnings growth rates in the Eurozone in the second quarter of 2018,” says Sebastian Raedler, Head of European Equity Strategy at Deutsche Bank. “With about 40% of market capitalisation having reported Q2 results, European earnings per share (EPS) growth has accelerated to 6% year-on-year, up from 0% in Q1.”\nThis is in line with the consensus expectations for the companies that have reported. Deutsche Bank Research says this is a good result given that the sharp deterioration in Euro area growth momentum in Q2 pointed to the risk of a downside surprise for the Q2 earnings season.\nConsensus expects EPS growth to end up at 3% for the Q2 reporting season overall and then to accelerate to 10% in Q3. “Financials are by far the most interesting sector in Europe at the moment. Looking forward, we think that the growth momentum will stabilise,” says Raedler. Energy and consumer discretionary have equally seen high EPS growth in the earnings season so far, while only utilities and technology have seen negative growth.\nAmong countries, French companies delivered the strongest Q2 EPS growth so far, at 19%, with Germany and Spain following closely behind, also with double-digit growth. Italy by contrast has seen strongly negative EPS growth (though consensus expects it to rebound next quarter).\n\nDeutsche Bank’s European equity strategists expect full-year EPS growth of 9% for 2018, which would mark a slowdown from last year’s 15%, but is slightly above the 8% consensus. Yet, they are tactically cautious on the outlook for European equities, projecting downside to 360 on the Stoxx 600, 8% below current levels. This is because they see headwinds from a rise in the euro-dollar exchange rate back to 1.20 and a rebound in real bond yields (i.e. the discount rate for equities) on the back of a recovery in Euro area core inflation.\nKey sector overweights include mining, which should benefit from near-term USD weakness and a recovery in the China PMI, following the recent monetary easing in China, and banks (a play on the likely stabilisation in Euro area growth momentum, following the recent slowdown, as well as upside to German bond yields).\nAmong their sector underweights are airlines and luxury goods. The former being a cyclical sector that has not yet fully discounted the Euro area growth slowdown and the rise in the oil price and the latter being a sector that has outperformed its historical relationship with the global growth cycle.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}