{
    "url": "https://www.db.com/news/detail/20180620-deutsche-bank-moves-reconciliation-services-to-smartstream-to-further-improve-processing-and-reduce-costs?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "June 20, 2018",
    "tags": [
        "Investment Banking"
    ],
    "title": "Deutsche Bank moves reconciliation services to SmartStream to further improve processing and reduce costs",
    "body": "As part of its transformation strategy, Deutsche Bank has selected SmartStream Technologies’ Centre of Excellence (CoE) to provide an off-site operations platform - including three services which will allow the bank to streamline, simplify and reduce the costs of its reconciliations environment.\nWith the growth in volume of reconciliations, the processing of large quantities of data has become complex. Many financial institutions are exploring utilities to ensure accuracy and cost savings. With the addition of the CoE to Deutsche Bank, SmartStream will provide the bank with three distinct managed services: Reconciliations On-Boarding, Production Support and Operational Reconciliation Services.\nThe new services will improve processing of reconciliations by making it faster and more cost-effective. The integration of the overall service will be done in a phased approach, where Deutsche Bank will increase productivity and reduce costs through mutualisation.\nSmartStream’s Transaction Lifecycle Management (TLM) Reconciliations Premium solution performs Nostro and Securities, as well Intersystem reconciliations at Deutsche Bank and the CoE will manage all of these processes. Further efficiencies will be gained by reducing the complexity of systems, processes and technology, whilst creating a governance structure to define best practices for all reconciliations at the bank.\nBobby Handa, Head of the Global Reconciliations Group, Deutsche Bank, states: “This step is part of our journey to reduce the complexity of our IT environment. Modernising our reconciliation processing is critical to increasing productivity, reducing costs, as well as meeting regulatory requirements. Our aim with the CoE is to apply continuous process improvement across our business lines, as well as minimising and eliminating any likely risks”.\nHaytham Kaddoura, CEO, SmartStream, comments: “We are delighted that Deutsche Bank has embraced the managed service utility and what it provides to reconciliations operations. As a team we are working to provide a complete and sophisticated end-to-end reconciliations process, designed to give the bank a competitive edge with centralised reconciliations services, which will enable growth, provide stability and mitigate risk. We at SmartStream have invested a significant amount of R&D in the CoE, which comes with a powerful team capable of running the entire operation, hence reducing the burden on management time at Deutsche Bank”.\nFor further information, please contact:\nNew York:\nMark Roth\nChief Marketing Officer, SmartStream Technologies, Inc.\nTel: (212) 763-6509\nEmail: mark.roth@smartstream-stp.com\nLondon:\nNathan Gee, Senior Marketing Manager, SmartStream Technologies\nTel: +44 (0) 20 7898 0630\nEmail: nathan.gee@smartstream-stp.com\nShamira Alidina, Media Relations Director, Dina Communications\nTel +44 (0) 7801 590718\nEmail: shamira@dinacomms.com\nSen Shanmugasivam, Head of COO Communications, Deutsche Bank AG\nTel +44 (0) 20 7547 2838\nEmail: senthuran.shanmugasivam@db.com\nAbout SmartStream Technologies\nSmartStream provides Transaction Lifecycle Management (TLM®) solutions and Managed Services to dramatically transform the middle and back-office operations of financial institutions. Over 1,500 clients, including more than 70 of the World's top 100 banks, 8 of the top 10 asset managers, and 8 of the top 10 custodians rely on SmartStream’s solutions.\nSmartStream delivers greater efficiency, automation and control to critical post trade operations including: Reference Data Operations, Trade Process Management, Confirmations and Reconciliation Management, Corporate Actions Processing, Fees and Invoice Management, Collateral Management, Cash & Liquidity Management and Compliance Solutions. Used independently or as a suite of solutions and services, clients gain a lower cost-per-transaction whilst reducing operational risk, aiding compliance and improving customer service levels.\nFor more information about SmartStream visit: www.smartstream-stp.com\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\n ",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 1
}