{
    "url": "https://www.db.com/news/detail/20180620-startsocial-winners-recognised-in-the-federal-chancellery?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 20, 2018",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "startsocial winners recognised in the Federal Chancellery",
    "body": "The startsocial competition culminates every year with the award ceremony in the Federal Chancellery. And this year was no exception. On June 20, Angela Merkel – patron of the competition – invited the most promising initiatives to celebrate their deserved success in Berlin.\n\n\nThe 2017/2018 round received applications from around 300 social startups, charities and initiatives. Of these, 100 were chosen for a four-month coaching scholarship to further develop their ideas or organization together with experienced experts and leaders – among them three Deutsche Bank employees. 25 finalists were invited to Berlin, where seven of these received prizes and were singled out for their exemplary social commitment.\n\nThe Chancellor also presents a special award; this year it went to Wolfsträne e.V., a Leipzig-based charity that provides bereavement support to young people who have lost close family members.\n\nKarl von Rohr, President and Chief Administrative Officer of Deutsche Bank, highlighted the importance of inclusion and applauded Treffpunkt Suppenküche Bad Doberan for its contribution in this field. The initiative offers people from all walks of life a place where they can enjoy a meal and talk to people they might not usually rub shoulders with in their day-to day lives. Every week, 500 people come along to the soup kitchen.\n\n\nDeutsche Bank has been one of the main partners of startsocial since 2012. More than 300 colleagues have since supported social initiatives as jurors or coaches all over Germany. As part of its enterprise programme for social good Made for Good, Deutsche Bank also partners with a number of former startsocial finalists and prize winners – initiatives like “Start with a Friend” (prize winner 2015/2016) and “Über den Tellerrand“ (competition finalist and non-profit organisation that promotes open-mindedness and exchanges between cultures), both of which support Deutsche Bank in its pledge to find “1,000 Integration Coaches”.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}