{
    "url": "https://www.db.com/news/detail/20180619-mapping-the-world-s-prices-2018?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 19, 2018",
    "tags": [
        "Research"
    ],
    "title": "Mapping the World's Prices 2018",
    "body": "In our 7th annual DB survey of global prices and living standards, we rank 50 cities that are relevant to global financial markets. We consider Quality of Life, Salaries, Rents and Disposable After-Rent Income, and our Weekend Getaway, Cheap Date and Bad Habits indices. We then look at the individual series of the prices of goods and services. Our survey highlights relative prices around the globe and how they have changed over time.\nIn currency terms the last 12 months have been about Dollar and especially EM FX weakness, and Euro strength. GBP has also bounced back. This hasn’t changed the order at the top too much, but it’s caused a pause in the march of US cities up the top of the leaderboards on salaries, rents and prices of goods and services. It’s hard to believe now that when this report was first published in 2012, the US was a relatively very cheap place internationally.\nThe same cannot be said of Zurich, which has perennially topped the expensiveness list in many categories, often followed by Nordic/Scandinavian cities. Major European and US cities then jostle for position depending on the product/service. EM cities remain much cheaper and, if anything, the gap has been widening rather than narrowing over the lifetime of this report.\nBy the time next year’s report comes out, Brexit will have occurred, and if we rank the main global European cities that could compete with London for big business, we find that on a personal level it might depend on whether you value quality of life or simply want to maximise after-rent disposable income.\nIf it’s the latter, London has actually improved over the last 12 months thanks to cheaper rents and higher dollar-adjusted salaries. In order, Frankfurt (5th), London (13th), Amsterdam (17th), Dublin (25th), Paris (27th), Madrid (28th) and Milan (29th) make up the Brexit competitors list based purely on the money left in your pocket after rent. NYC is 7th on the list for those who want to leave the scene entirely; Zurich (1st) is top for those who want to escape the EU/UK but remain nearby.\nIf, on the other hand, Brexit has made you view quality of life as the priority, Frankfurt (9th) is your best EU large city choice followed by Amsterdam (10th), Madrid (23rd), Dublin (28th), Paris (32nd), London (33rd) and Milan (34th). If quality of life is your only concern, Wellington remains the best place to reside. Zurich, Copenhagen, Edinburgh and Vienna fill out the top 5. At the other end of the scale are Brazil and China.\nOnly four global cities make the top 10 in both quality of life and after-rent disposable income: Zurich (2nd and 1st), Sydney (8th, 4th), Copenhagen (3rd, 10th) and Frankfurt (9th, 5th). Generally, MDW megacities are home to one of the big dilemmas in life: quality of life versus money. Tokyo seems to offer the best balance (13th, 15th). NYC (31st, 7th), Paris (32nd, 27th) and London (33rd, 13th) trail behind. EM megacities score badly as their wages lag MDW peers and they have much higher pollution, poorer health care and safety, and often more extreme climate.\nFor a weekend getaway, Copenhagen is the most expensive city in the world followed by Milan, Oslo, Vienna and Zurich. Istanbul is now the cheapest, helped by the recent large FX fall.\nZurich is again the place to choose your dates carefully or persuade the other party to pay. It’s 30% more expensive to date here than in the next 4 cities (Copenhagen, Oslo, Tokyo, and Amsterdam). Marry young in Switzerland and save your top-ranked disposable income.\nOur Bad Habits index (cigarettes & beer) is most expensive in Oslo, Melbourne, Sydney, Auckland and Dubai. EM countries are generally cheap places to indulge.\nThose living in Singapore, Copenhagen or Oslo are probably healthier than their international counterparts as it’s so expensive to buy a car that surely residents walk or cycle everywhere. But Oslo and Copenhagen have the most expensive trainers, so maybe locals should live close to the office. Cars are 6th most expensive in Amsterdam but filling your car up is the priciest in the world, taxis the 4th, and car hire the 3rd, so again the bike sounds attractive. It shows how policy and duties help shape habits.\nRather fittingly, the cheapest place in the world to buy a cappuccino is Milan, where it’s a third of the cost in Copenhagen, Paris, Zurich or Hong Kong.\nIf you want to surf the net in a summer dress and have a beer at the same time, Dubai is the most expensive place in the world to do it as it tops the list in all three.\nInterestingly, with all the allegations around Russian interference in global elections via social media, Moscow has the cheapest internet in the world.\nKeep your house clean in Helsinki, where the cost to hire a cleaner is highest. Perhaps bringing snow into the house makes it a tougher job than elsewhere. Indeed, the top 5 cities on this measure are familiar with snow (Oslo, Zurich, Stockholm and Boston) even if the 6th (Sydney) and 7th place (San Fran) aren’t.\nLondon only tops the list in most expensive public transport, but it’s 2nd in the cost of cinema tickets and car rentals. So best to stay at home and watch TV instead.\nIf you’re an Apple addict then it’s best to wait until a holiday to the US, HK or Japan to upgrade. Brazil, Greece and Denmark are bad places to casually walk into an Apple store as they have the most expensive iPhones in the world.\nAt the heart of our study is the bigger-picture debate about whether purchasing power parity (PPP) corrects itself over time. In theory, mean reversion should occur even if it takes a number of years to do so. Exchange rates should adjust for large price differentials across countries (or vice versa), especially between areas of similar economic development. Our largely light-hearted analysis of global living standards and the cost of goods and services should be relevant for all global investors as it monitors the regions that are cheap or expensive – and how they change.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}