{
    "url": "https://www.db.com/news/detail/20180614-deutsche-bank-launches-evault-technology-to-power-paperless-solution?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "June 14, 2018",
    "tags": [
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Deutsche Bank launches eVault technology to power paperless solution",
    "body": "Deutsche Bank today announced it has successfully launched eVault – a secure digital repository for exchange of documents – making it the first third-party document custodian to offer solutions for the handling of secure documents for its clients.\neVault is a legally compliant solution to move securely original electronic files from one party to another, while preserving its unique digital ownership. The eVault platform ensures authentication of the original documents in passing between owners, irrespective of how many duplicate electronic files there may be of the same record. The repository system relies upon digital tamper-proof seals and has an audit trail that ensures compliance and provides detailed reporting.\n “The launch of our eVault reflects our continued commitment to provide innovative solutions for our clients,” said Jose M. Sicilia, Deutsche Bank’s Head of Trust and Agency Services. “Our top priority is to deliver market leading solutions for clients that enables them to conduct their current and future business in the most streamlined manner.”\nDeutsche Bank is the first bank to make use of the technology, which will empower the bank’s document custody group to take possession of electronically originated assets for clients as the loan market continues to transition to a paperless process.\n“With the eVault technology, our Document Custody group solidifies its leadership position as a comprehensive solution provider to handle both current and future market trends, and it is an important step in our overall digitization strategy,” said Thomas Nielsen, Chief Digital Officer for Deutsche Bank’s Global Transaction Banking business. “We continue to capitalize upon the remarkable capabilities afforded by new technologies in order to optimize our clients’ experience. This is just the beginning.”\nFor further information, please contact:\nDeutsche Bank AG\nPress & Media Relations\nLawton King\nPhone: +1 212 250-0622\nE-Mail: lawton.king@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}