{
    "url": "https://www.db.com/news/detail/20200225-nyse-opening-bell-celebrates-deutsche-bank-s-black-leadership-forum?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 25, 2020",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "NYSE opening bell celebrates Deutsche Bank's Black Leadership Forum",
    "body": "Deutsche Bank’s Black Leadership Forum (BLF) opened the New York Stock Exchange on Wednesday, February 19 in celebration of Black History Month.\n“Ringing the NYSE opening bell with Americas CEO Christiana Riley and other members of the Americas ExCo is a message that Deutsche Bank is committed to being a diverse and inclusive workplace,” said Paul Trussell, Managing Director, Equity Research, and Co-Chair of BLF. “It is recognition for work that has been done by the Multicultural Partnership & BLF over the years to push a more inclusive agenda, but more importantly, it symbolizes a new beginning at the bank in which management is not just supportive of the efforts – they are committed to taking necessary actions to improve the culture.”\nRenee Cummins, Vice President, Corporate Bank, and Co-Chair of BLF, said, “This was a first for the Black Leadership Forum and marked a true display of partnership and progress. We are very encouraged by Christiana’s and the bank’s commitment to making DB a more inclusive workforce and proud to help drive the progress the firm is making across ethnic and racial diversity.”\n“When we rang the bell we were celebrating all the hard work that has got us to where we are now. But we were also marking the way forward from here as we tackle this issue with more passion and focus,” said Christiana.\nBLF is part of the Multicultural Partnership (MCP), an Employee Resource Group. BLF has held numerous events to celebrate black culture at the bank including panel discussions with senior leaders,and mentorship and recruiting activities.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}