{
    "url": "https://www.db.com/news/detail/20200211-deutsche-bank-successfully-completes-issuance-of-additional-tier-1-capital?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "February 11, 2020",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Deutsche Bank successfully completes issuance of Additional Tier 1 capital",
    "body": " Today, Deutsche Bank AG (XETRA: DBKGn.DE / NYSE: DB) placed undated Additional Tier 1 securities with a principal amount of USD 1.25 billion (approximately EUR 1.15 billion equivalent).\nThe securities will bear a fixed coupon of 6.0 percent, payable annually, until 30 April 2026. The Bank can call the securities on each day between 30 October 2025 and 30 April 2026, thereafter on 30 April of each succeeding year. The applicable rate of interest will be reset at five year intervals starting on 30 April 2026 on the basis of the then prevailing 5 year US Treasury Yield plus the initial credit spread of 4.524 percent per year. The securities are registered with the U.S. Securities and Exchange Commission.\nThe securities (ISIN US251525AX97) are expected to be listed on the Luxembourg Stock Exchange and traded on the Euro MTF market.\nThe securities will be subject to a write-down provision if Deutsche Bank’s Common Equity Tier 1 capital ratio falls below 5.125 percent and be subject to other loss absorption features pursuant to the applicable capital rules. The denominations of the securities are USD 200,000. Deutsche Bank Securities Inc. acted as sole bookrunner for the offering.\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nChristian Streckert\nPhone: +49 69 910 38079 \nRupert Trefgarne\nPhone: +44(20)754-15635\ndb.presse@db.com\nInvestor Relations\n+49 800 910-8000\ndb.ir@db.com\nAbout Deutsche Bank\nDeutsche Bank provides retail and private banking, corporate and transaction banking, lending, asset and wealth management products and services as well as focused investment banking to private individuals, small and medium-sized companies, corporations, governments and institutional investors. Deutsche Bank is the leading bank in Germany with strong European roots and a global network.\nForward looking statements\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 22 March 2019 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir \nFor readers in the US\nDeutsche Bank has filed a registration statement (including a prospectus) with the U.S. Securities and Exchange Commission (the “SEC”) for the offering to which this communication relates. Before you invest, you should read the prospectus in that registration statement, the supplement to that prospectus Deutsche Bank expects to file with the SEC and other documents Deutsche Bank has filed and will file with the SEC for more complete information about Deutsche Bank and this offering.\nYou may get these documents, once filed, free of charge by visiting EDGAR on the SEC Web site at www.sec.gov. Alternatively, Deutsche Bank will arrange to send you the prospectus after filing if you request it by calling Deutsche Bank at +49 800 910 8000.\nFor readers in the UK\nThis communication is only being distributed to and is only directed at (i) persons who are outside the United Kingdom, (ii) investment professionals falling within Article 19(5) of the Financial Services and Markets Act 2000 (Financial Promotion) Order 2005 (the “Order”) or (iii) high net worth entities, and other persons to whom it may lawfully be communicated, falling within Article 49(2)(a) to (d) of the Order (all such persons together being referred to as “relevant persons”).\nThe securities covered by this communication are only available to, and any invitation, offer or agreement to subscribe for, purchase or otherwise acquire such securities will be engaged only with, relevant persons. Any person who is not a relevant person should not act or rely on this communication or any of its contents.\nFor readers in the EEA and in the United Kingdom\nIn relation to each member state of the European Economic Area and the United Kingdom an offer of any of the securities covered by this press release may not be made in such member state except that an offer to the public in such member state may be made pursuant to an exemption under the EU Prospectus Regulation and provided further that no such offer shall require Deutsche Bank to publish a prospectus pursuant to Article 3 of the EU Prospectus Regulation.\nThe expression “offer to the public” in relation to any securities in any member state of the European Economic Area or the United Kingdom means the communication to persons in any form and by any means, representing sufficient information on the terms of the offer and the securities to be offered, so as to enable an investor to decide to purchase or subscribe for those securities as defined by Article 2(d) of the EU Prospectus Regulation.\nFor readers in Canada\nThis communication does not constitute an offer to sell, or the solicitation of an offer to buy or subscribe for, any securities referenced in this communication, and cannot be relied on for any investment contract or decision. This communication is only addressed to, and directed at, certain investors in Canada who are accredited investors and permitted clients as defined in Canadian securities legislation. A Canadian offering memorandum, including the prospectus filed with the SEC, will be available to such investors upon request by calling Deutsche Bank at +49 800 910 8000.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}