{
    "url": "https://www.db.com/news/detail/20200210-deutsche-bank-to-issue-additional-tier-1-capital?language_id=1",
    "language": "DE",
    "article_type": "Ad-hoc Release",
    "publish_date": "February 10, 2020",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank to issue Additional Tier 1 capital",
    "body": "Frankfurt am Main, 10 February 2020 - Deutsche Bank AG (XETRA: DBKGn.DE / NYSE: DB) announces its intention to issue securities that qualify as Additional Tier 1 (AT1) capital. The issuance is expected to be of benchmark size with a minimum of USD 1 billion.\nThis was decided by the Management Board with the approval of the Chairman’s Committee of the Supervisory Board.\nThe transaction represents a further step in managing Deutsche Bank’s regulatory capital requirements by preserving a level of AT1 instruments of 1.5% or more of risk-weighted assets on a fully-loaded basis. In addition, it supports progress towards the 4.5% fully loaded leverage ratio target for 2020.\nThe securities will be subject to a write-down provision if Deutsche Bank’s Common Equity Tier 1 capital ratio falls below 5.125% and be subject to other loss-absorption features pursuant to the applicable capital rules.\nThe decision to issue these securities is based on the authorization granted by the Annual General Meeting in 2018. The denominations of the securities will be USD 200,000. Deutsche Bank Securities Inc. will act as sole bookrunner for the placement.\nThe securities are registered in the United States.\n\nContact:\nMedia Relations\nChristian Streckert\nPhone: +49 69 910 38079\nEmail: christian.streckert@db.com\nInvestor Relations\nPhone: +49 800 910-8000\nEmail: db.ir@db.com\n_________________________________________________________________\nDeutsche Bank AG\nTaunusanlage 12\n60325 Frankfurt am Main\nGermany\nISIN: DE0005140008\nWKN: 514000\nListed: Regulated market in Berlin-Bremen, Duesseldorf, Frankfurt (Prime Standard), Hamburg, Hanover, Munich und Stuttgart; EUREX; NYSE\nThe International Securities Identification Numbers (ISINs) of further financial instruments issued by Deutsche Bank AG, and admitted to trading on a domestic organized market or for which such admission has been applied for, are listed in the attached PDFs.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}