{
    "url": "https://www.db.com/news/detail/20200206-coronavirus-how-deutsche-bank-joined-the-fight?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 6, 2020",
    "tags": [
        "Corporate Citizenship",
        "Corporate products"
    ],
    "title": "Coronavirus – how Deutsche Bank joined the fight",
    "body": "The outbreak and rapid spread of Coronavirus has dominated headlines for weeks now. The fight is on to try and stop the virus spreading and even Deutsche Bank has a small role to play!\nAs the outbreak developed, Deutsche Bank’s client, a leading global medical technology company, received over a dozen very urgent orders to support a number of hospitals in Wuhan and other cities in China. Some of their products are instrumental in the diagnosis and confirmation of this virus. Of course the company was under tremendous pressure to complete these orders as quickly as possible.\nThere was one potential stumbling block: the client’s procedures require that payment confirmations be in place before shipments can be arranged. Since these orders came in over the Lunar New Year holiday, the automated linkage between the national clearing system and Deutsche Bank China was unfortunately shut down.\nGiven the urgency of the situation, the Deutsche Bank Corporate Bank Ops team in China came up with an alternative solution. Even while the office was officially closed, the team managed to manually track the arrival of payments via the national clearing system, BEPS (Bulk Electronic Payment System), so that they could provide email confirmations as soon as they came through. As a result, all orders were processed as quickly as possible, and the crucial equipment was delivered to hospitals without delay.\nChina Head of Deutsche Bank Global Transaction Banking, Dirk Lubig said: “I’m proud that we were able to respond quickly and flexibly to meet our client’s needs. The impact of our client’s work is tangible and significant in the battle against this new strain of Coronavirus and we are so glad to have been able to play a small part in supporting them. We often talk about being client-centric, and this experience really brought that focus into action. In an emergency scenario, under extraordinary circumstances, and an extremely trying time for the entire country, our team came together and was able to find a solution. We couldn’t be more proud.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}