{
    "url": "https://www.db.com/news/detail/20200205-deutsche-bank-research-transition-to-digital-payments-could-rebalance-global-economic-power?language_id=1",
    "language": "DE",
    "article_type": "Research",
    "publish_date": "February 5, 2020",
    "tags": [
        "Corporate products",
        "Digitalisation",
        "Private products",
        "Research"
    ],
    "title": "Deutsche Bank Research: transition to digital payments could \"rebalance global economic power\"",
    "body": "In a new three part series Deutsche Bank Research examines the past, present, and future of the payments industry.\nWhen people discuss the future of payments they tend to predict the end of cash. The team behind the ‘Future of payments’ series has a different view. Not only do they think cash will be around for a long time, they see the transition to digital payments as having the potential to do no less than rebalance global economic power.\nThe report by Marion Laboure and Jim Reid highlights those sceptical about digital currencies citing the large energy needs and point out that currencies such as bitcoin and Facebook’s libra have encountered significant regulatory hurdles. Yet, if the growth in blockchain wallet users continues to mirror that of internet users, then by the end of the decade, they will number 200 million, quadruple the current level. This will be encouraged by governments, banks, corporates, and payment providers who all stand to benefit from the digitalisation of payments. And when countries and companies eventually look back at the way they transitioned to digital payments, it may become very apparent how they achieved their standing in the world economy.\nThe report forecasts that while cash will stay, the coming decade will see digital payments grow at light speed leading to the death of the plastic card. The report goes on to state that over the next five years, mobile payments may comprise two-fifths of in-store purchases in the US, quadruple the current level. Similar growth is expected in other developed countries, however, different countries will see different levels of shrinkage in cash and plastic cards. In emerging markets, the effect could arrive even sooner. Many customers in these countries are transitioning directly from cash to mobile payments without ever owning a plastic card.\nAs China (and India) develop electronic, crypto, and peer-to-peer strategies, the epicentre of global economic power could shift. China is working on a digital currency backed by its central bank that could be used as a soft- or hard-power tool. In fact, if companies doing business in China are forced to adopt a digital yuan, it will certainly erode the dollar’s primacy in the global financial market.\nRead the ‘Future of payments’ series.\nThe Future of Payments - Part I. Cash: the Dinosaur Will Survive ... For Now\nThe Future of Payments - Part II. Moving to Digital Wallets and the Extinction of Plastic Cards\nThe Future of Payments - Part III. Digital Currencies: the Ultimate Hard Power Tool",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}