{
    "url": "https://www.db.com/news/detail/20180531-information-on-media-reports-about-the-regulatory-ratings-of-our-us-entities?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "May 31, 2018",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Information on media reports about the regulatory ratings of our US entities",
    "body": "Here’s the bank’s statement on the reports:\n“As a matter of policy, we do not comment on specific regulatory feedback. The ultimate parent of the Deutsche Bank Group, Deutsche Bank AG, is very well capitalized and has significant liquidity reserves. The entities named in the article are three specific U.S. subsidiaries – DB USA Corp, Deutsche Bank Trust Corporation, and Deutsche Bank Trust Company Americas, our principal U.S. banking subsidiary, which has a very robust balance sheet as disclosed in our annual and quarterly regulatory filings. We have previously indicated that our regulators have identified various areas for improvement relating to our control environment and infrastructure. We are highly focused on addressing identified weaknesses in our U.S. operations.\"\nAnd here’s additional background information the bank published on its intranet:\nHave the US regulatory authorities changed the bank’s rating and does this mean the bank is in troubled condition?\nWe do not comment on any supervisory ratings as our communication with regulators is confidential. It is important to note that Deutsche Bank AG is very well capitalized and has significant liquidity reserves. As we clearly noted in our annual report in March 2017, Deutsche Bank has been engaged in remediation work to strengthen our internal control environment and infrastructure and to address concerns that have been identified both internally and by our regulators. There are no concerns with regard to the financial stability of Deutsche Bank AG.\nWhat are the remediation deficiencies the regulators identified and how quickly will these issues be resolved?\nWhile we are not allowed to comment on our discussions with regulatory authorities we note that there are resolutions of four enforcement actions which are published on the website of the Federal Reserve (www.federalreserve.gov). These resolutions relate to our internal control environment and infrastructure. We are highly focused on addressing the issues with our U.S. operations and will continue working diligently to solve them. None of these issues affect our ability to serve clients.\nWhat is the financial health of the US subsidiaries?\nAll of our U.S. subsidiaries have very robust balance sheet as disclosed in our quarterly regulatory filings. The assets of the three entities concerned are below ten percent of the overall balance sheet of Deutsche Bank Group.\nDBTCA:\nDBTCA’s latest regulatory filing as of March 31, 2018, included $9.1 billion of Common Equity Tier 1 Capital, a Common Equity Tier 1 Capital ratio of 98.15% and a Tier 1 Leverage Ratio of 21.68%.\nDBTCA also had a strong liquidity position with 75% of its $42.1 billion of total assets invested in cash on deposit with the Federal Reserve Bank or financing activities backed by US Treasury securities collateral.\nDB USA Corp:\nDB USA Corporation’s latest regulatory filing as of March 31, 2018, included $7.1 billion of Common Equity Tier 1 Capital, a Common Equity Tier 1 Capital ratio of 15.88% and a Tier 1 Leverage Ratio of 7.3%.\nThe capital base includes the consolidated subsidiaries, and thus reflects a broader and different risk profile that that of DBTCA, which holds primarily cash, loans and liquid securities.\nDBSI:\nDBSI’s most recent annual report as of December 31, 2017, included $10.5 billion of US GAAP Equity, $12.2 billion of Regulatory Net Capital, and $11.9 billion in excess of the required minimum net capital.\nExcess Net Capital (regulatory capital in excess of regulatory minimum capital requirements pursuant to SEC Rule 15c3-1 – Net Capital Rules) is well above the minimum capital requirements and well in excess of what’s required considering DBSI risk profile and current assets.\nWhat regulators cover each of the entities?\nThe primary regulator of most of our U.S. banking entities is the Federal Reserve. The FDIC is the primary regulator of our Delaware bank and insures DBTCA’s deposits to the extent provided by law. Our New York branch is supervised by the Federal Reserve and the New York State Department of Financial Services. DBSI is regulated by the Securities and Exchange Commission.\nDo the reported control weaknesses affect clients?\nNo, we are fully able to service our clients’ needs and we are doing business as usual. Nevertheless, we are determined to resolve these matters as expeditiously as possible.\nAre we committed to our U.S. business?\nThe answer clearly is “yes.” As Christian Sewing said at a public reception on Wednesday in Berlin, the U.S. is the most important market for Deutsche Bank outside Germany. Our recent strategic announcement is not a result of the regulatory actions but part of a program to increase the profitability of the firm. We are fully committed to our Corporate & Investment Bank, Wealth Management and Asset Management businesses in the U.S.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}