{
    "url": "https://www.db.com/news/detail/20180524-annual-general-meeting-2018-speech-of-christian-sewing?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "May 24, 2018",
    "tags": [
        "Company",
        "Management & Leadership",
        "Strategy"
    ],
    "title": "Annual General Meeting 2018: Speech of Christian Sewing",
    "body": "Annual General Meeting\nFrankfurt am Main, 24 May 2018\nChristian Sewing\nChief Executive Officer\nDeutsche Bank AG\n– Check against delivery –\nDear Shareholders,\nI too would like to bid you a warm welcome to this year’s Annual General Meeting. It’s a pleasure to see so many of you here today.\nAs you can imagine, this is a very special day for me. Explaining our work to you should be the most important day of the year for any CEO. And standing here before you for the first time, I can only say how true this is. You are our shareholders, our bank belongs to you – a bank that plays an exceptionally important role in the economy, in Germany, in Europe, and far beyond.\nSo it is our task to manage our bank in your best interests, dear shareholders. And in the best interests of our clients and employees and for the benefit of society.\nThat is what we on the Management Board aim to do, that’s what I personally aim to do, and I’m sure I speak for all our employees in more than 60 countries across the globe.\nI know that some might say: how does that all fit? How can we operate “for the benefit of society” but at the same time announce an ambitious cost cutting programme which will also lead to job cuts?\nAnd it’s true – this is a difficult situation. But in fact our current earnings position leaves us with no other choice. We have to deliver sustainable profitability and lay the basis to do so over the long term. That is the most important task for us, and for me.\nMy personal goal here is to place our bank back at the centre of society. A bank can only be successful if it is part of society. We are trustee to our clients, a risk manager, and much more. We are a part of the infrastructure of this country. We are a part of this country.\nIn recent weeks, I have not only seen what people expect of our bank; I have also felt how highly this institution is regarded. I received around 800 letters and emails.\nThese were all notes of congratulations, but at the same time, many of those who wrote to me also told me clearly of their expectations and wishes. Let me quote a couple:\n“Germany needs a leading financial institution that can do business and is respected across the world. The competitiveness of this institution has direct consequences for the competitiveness of the whole country.” That was from a member of the leadership team of one of our main international competitors.\nThe following words from the Chairman of a trade association illustrate this: “There are many projects outside Germany where it is crucial to have a reliable partner who understands both the landscape of family-owned companies in Germany, and the overseas market in question.”\nI would also like to refer to Germany’s Minister of Finance Olaf Scholz, who, in a public statement, said: “We need banks in Germany that do business across the world, that can compete at an international level and that are able to develop their strengths.”\nSo that, Ladies and Gentlemen, tells you what our clients expect. But it also shows you what society and political circles expect of us – and rightly so. And you in turn, dear shareholders, expect a profitable bank – and also rightly so.\nWhenever you take on a new task, it’s a good exercise to write yourself a letter, setting out what you want to achieve. I didn’t write that letter, but I did ask myself where I see our Deutsche Bank in five years.\nI truly believe that it is crucial – especially in these turbulent times – to have a kind of mission statement. All of us need to know what we stand for, what objectives we’re pursuing and what values we wish to hold.\nSo, where do I see Deutsche Bank?\nWe want to be relevant – to our clients, to our investors, and to society as a whole. What do I mean by that? Deutsche Bank has to have a presence, and a voice, wherever we do business. And yes, we have relinquished our position somewhat in recent years. Our task now must be to win it back.\nWe want to be excellent. For us to be relevant, we need to provide excellent services, advice and products. We have to have clear selling point for our clients. Every day. And reliably so. But this also means we have to focus on what we really do well. We have to have a realistic chance of occupying one of the top spots wherever we do business.\nThat’s why Deutsche Bank has to stand for innovation – that is my third point: The only banks that will survive the disruption in the financial industry are those that anticipate, today, what clients will want tomorrow. That means that in the digital world, we have to remove all obstacles standing in the way of our creative minds and focus much more on teamwork.\nBut as we strive for innovation, we should not neglect one thing: stability. A strong balance sheet is crucial, in this respect our position has rarely been better. Additionally, we have to achieve a better balance between our business divisions to reduce the volatility of our earnings. Only then will we be able to generate sustainable returns organically. And only then will we make the headlines less frequently. It won’t do us any harm to be a bit more boring.\nSo we are well advised to remain committed to our virtues - in the digital world, too. And this means more than anything: we have to remain trustworthy. A great strength of our bank is our close relationships with our clients. We have built these over many years, sometimes over decades and, in some cases, over more than a century.\nBut trust demands even more of us. We need to be credible. That’s especially true with regard to our shareholders. If we publish targets, we must meet them. It has to be transparent and verifiable for you that we are on the right track.\nThat’s what Deutsche Bank has to stand for, Ladies and Gentlemen. We want to be relevant, excellent, innovative, stable and trustworthy.\nThese five characteristics are part of what we are. This is our DNA. But now, our task is to sharpen our profile again. These characteristics, and this mission, guide our actions. Then our bank will achieve long-term commercial success.\nAnnual and quarterly results\nOur financial results demonstrate that we have not always lived up to this aspiration. We ended the 2017 financial year with a loss of 735 million euros.\nHowever, the year was not as bad as it may appear at first glance. We generated pre-tax profit of 1.2 billion euros. If it had not been for the US tax reform and the resulting accounting effect of 1.4 billion euros, we would have generated a net profit of around 700 million euros.\nOf course, that would also have been too low.\nHow did that happen?\nRevenues fell by 12 percent – which was mainly due to subdued capital markets activity and the historically low interest rates.\nWe also have to improve in terms of expenses. Costs adjusted for one-time effects declined by three percent only.\nIn view of the unsatisfactory results, the Management Board and Supervisory Board today propose a dividend of 11 cents per share. My dear shareholders, this is not satisfactory, neither for you nor for us.\nHow was our start to the new year?\nIn the first quarter of 2018 we were able to record a profit. But the result was just around half of the previous year’s figure.\nIn the second quarter the revenue environment remains challenging, particularly for our Corporate & Investment Bank. Additionally, it’s already clear that the restructuring will impact our results this year. For the full year, we expect restructuring and severance charges of up to 800 million euros. However, I can assure you that we have a very firm basis for paying the coupons on our Additional Tier 1 capital.\nHowever, Ladies and Gentlemen, despite all of the justified criticism of our results and returns, there is one thing we should not overlook: today, your Deutsche Bank is more stable than it has ever been in the past 20 years. In this respect, we have made significant progress.\nA considerable part of this progress is due to my predecessor John Cryan. John played a leading role in ensuring the bank was able return to stability following the turbulent months in autumn 2016. We are very grateful to him both for this and for his tireless efforts.\nA few figures highlight how far we have come.\nAt the end of the first quarter our Common Equity Tier 1 (CET1) capital ratio was at 13.4 percent - back in 2012 it was 7.8 percent if we were to apply today’s standards. This increase demonstrates that we managed to reduce risks. And of course it also reflects the capital increases, which you, our shareholders, made possible. We have doubled our shareholders’ equity since 2008 to roughly 62 billion euros.\nWe now have liquidity reserves of around 280 billion euros. Compared to where we were ten years ago, these represent more than 200 billion of additional liquidity – and back then our balance sheet was around one third larger than it is today.\nOn the risk side, we’re also on solid ground. Our credit and market risk is close to historic lows. Our figures are among the best of our global peers. The whole bank has done a great job here, especially our Chief Risk Officer Stuart Lewis and his team.\nIn addition, litigation cases are no longer a dominant theme for us. We have significantly reduced our risks in this area. Of our 20 most significant matters, 15 have now been largely or fully resolved. So now we can look ahead, instead of watching the rear view mirror. Let me take this opportunity to thank my colleague Karl von Rohr and our colleagues in the Legal department.\nLadies and Gentlemen, all of this demonstrates that we have made good progress in our restructuring efforts. But we are not yet where we should be. Therefore we must act, and we must act swiftly and forcefully.\nWhat does that actually mean?\nThe four strategic priorities\nWe in the Management Board have formulated four strategic priorities. We communicated the cornerstones back in April. Today, I will talk you through further details.\n1. Our first objective is to achieve a better balance between the business divisions\nTo become yet more stable, we’ll improve the mix of our revenues. We are committed to our capital markets business – but we want to be better balanced. We aim to increase the share of revenues that comes from recurring sources. Or, to put it differently, it has to be our aim to ensure a high degree of stable earnings even in difficult markets.\nThat is why we have decided to expand those businesses with the least risk of volatility. By 2021, we aim to sustainably generate approximately half of our Group revenues from our Private & Commercial Bank and our Asset Management business, DWS.\nAnd on top of that there’s our Transaction Bank, which offers payment solutions and trade finance. Together, these more stable business divisions should contribute about 65 percent of our earnings. This would put us at about the same level as our American and European competitors.\nBut how exactly do we plan to achieve this? This brings me to the second point:\n2. Growth in our Private & Commercial Bank and DWS\nThe answer to this is actually quite short: we just need to do what we set out to do in the spring of 2017. The strategy for both our Private & Commercial Bank and our asset management arm DWS is the right one – we’re convinced of that. We just have to implement it consistently.\nAnd we are on the right track. A good example here is the merger of Postbank with Deutsche Bank’s private & commercial clients business in Germany: in fact, the two units will be legally merged this weekend.\nThat is a great success - one that many considered unthinkable when we announced our plans 14 months ago. It is the largest merger of two banks that the ECB has overseen since the single supervisory mechanism was established.\nThis merger had a number of prerequisites: a waiver, a Pfandbrief licence and extension to the new legal entity of the legal decree [which authorises us to employ former public servants]. All of this may sound technical and not create major headlines.\nBut these steps required lengthy discussions and negotiations. I would like to highlight the so-called waiver from the ECB that will enable us to manage liquidity better across the Group. That shows you the trust that the supervisory regime places in us. And we won’t disappoint them.\nLadies and Gentlemen, Deutsche Bank is often criticised for failing to reach targets it has set itself. This time it is different: we have delivered on everything we said we would back in March 2017 when we communicated the merger of Deutsche Bank and Postbank. This management team has accomplished something which didn’t succeed in the first merger attempt before 2015.\nSoon, we’ll look very different. Our “Bank for Germany” will serve more than 20 million clients from a single company with joint management overseen by my fellow Board member Frank Strauß. We’ll keep our two strong brands: Deutsche Bank and Postbank.\nWe will then be the undisputed No. 1 in the German market with private and commercial clients. And that is another example of “relevance”, Ladies and Gentlemen. Due to our scale we will be in a stronger position in a banking sector which will consolidate ever more quickly. We will be able to set standards – both in terms of advisory services and products.\nWe will be able to grow the business powerfully, specifically by assets under management and by lending volume.\nThat is why we are not only planning on making cost savings on synergies but also growing revenues. In the past two years, we increased revenues despite a lot of restructuring and despite low interest rates.\nAdditionally, our experience so far and the constructive dialogue with the trade unions have both convinced me that we are on the right track to achieve the planned cost reductions and revenue growth of 900 million euros per year by 2022 at the latest. Our cost-income ratio would then be below 65 percent. And we are working on accelerating this restructuring.\nWe also want to strengthen our international Private & Commercial Banking business. While we decided to withdraw from Poland and Portugal, we are focusing on our franchise in Italy and Spain. In both countries we are relevant and excellent –that makes us one of the leading foreign banks.\nThat has to be our motto: we invest in areas in which we excel. And we will withdraw from areas where we see no prospects of becoming a leader in the long term. That’s what was behind our disposals in Poland and Portugal and that’s exactly how we aim to proceed in other businesses.\nWe will also invest in our digital offering. I could read out a long list. Whether it’s multibank aggregation, robo-advisory, our “Finanzguru” expense manager – all of these innovations have been developed involving our Digital Factory.\nAnd going forward we will not only be a bank but a digital assistant which will accompany users in their daily lives in a simple and convenient way. For this purpose we are creating a completely new platform.\nI don’t want to reveal too much today: a basic version is set to launch in the second half of this year. Get ready for a surprise. Some 12 million millennials are potential customers for us in this space.\nI’d now like to move on from our business with private and commercial clients. Let me now talk about a further growth area, which is global: our Wealth Management business.\nIn Germany, Europe and Asia, in the Middle East and America, we’re confident of revenue growth. Today, we have more than 200 billion euros under management, and revenues in 2017 were around two billion euros. The market is growing as wealth increases, and we have the excellence to participate in that.\nIn many countries, we’ll hire new advisors in a focused manner – while cutting back in other areas, for example through the integration of our private bank in Cologne, Sal. Oppenheim.\nSo you can see, Ladies and Gentlemen, as far as our Private & Commercial Bank is concerned, I am very optimistic. Everywhere, we’re implementing our plans and moving forward. We expect to be able to sustainably grow revenues in the Private & Commercial Bank, year after year, while simultaneously reducing our cost base as planned. That also means that we can achieve a return on equity of significantly more than 10 percent. That’s important, specifically with regard to our earnings mix and stability.\nAnd we can also say that we have delivered on what we set out to do at DWS – we delivered and we will continue to deliver. In March we successfully floated our asset management business on the stock exchange - one year ahead of our deadline, despite challenging markets.\nDWS’s CEO Nicolas Moreau and his team have presented clear objectives: they are aiming at net inflows of three to five percent per year in the medium term. The basis for this is excellent products – and DWS has plenty. Seventy-eight percent of its funds outperformed the benchmark index in the last five years. We deliver true long-term value for our clients here – and for you, dear shareholders.\nOf course DWS will not be resting on its laurels. It is set to make more focused hires of new staff to achieve these goals, both in Germany and other European markets as well as in Asia. DWS is also expanding its product range, for instance in structured loans or sustainable investment products, which are becoming more popular. Just last week, DWS launched a sustainability index fund.\nAt the same time, the cost/income ratio is set to improve in this business, too: from 76 percent at present to below 65 percent in the medium term.\nNow let me turn to our biggest business - our..\n3. ... Corporate & Investment Bank\nWhen I presented our plans 18 days after I took office, there was an expectation that we would start making radical cuts. I even read in one article that not a single stone would be left standing.\nSo let me state quite clearly, Ladies and Gentlemen: we are committed to our Corporate & Investment Bank. And we are staying international; we are active in more than 60 countries. And that’s the way it’s going to stay. Many of our clients do business with us precisely for this reason: because of this international network.\nTo give you an example: out of our top 100 global clients, 88 do business with us in or related to the Asia-Pacific region. This is a great success story – not least for my Management Board colleague Werner Steinmüller, who oversees the region out of Hong Kong. And the figures are even more impressive for the United States: 98 of our top 100 clients use our US offerings.\nIf we want to remain relevant for our clients we have to offer such a network. Deutsche Bank was founded almost 150 years ago to accompany German companies abroad. These roots are deep and will remain.\nThat means we have to offer much more than just loans. Not only large corporations but also small and medium-sized companies with strong export businesses need much more than just vanilla financing nowadays. We can provide this “more”: for example, if a company in Germany wants to hedge its exports against interest rate and currency risks, no one will look after it better than Deutsche Bank.\nThat’s an example of the positive impact we make. Our campaign of that name includes real-life examples of clients and employees from all our businesses. The finance and treasury departments of many international companies rely on us. This is not financial acrobatics, it has nothing to do with gambling: these are services that facilitate far better planning for corporations and institutional investors.\nWe will continue to play a leading role in most businesses. Here are some examples\nOur Transaction Bank produces annual revenues of almost four billion euros. We are global No. 1 in euro clearing. Around a quarter of worldwide payment volumes in euros flow through our systems.\nIn export finance we are No. 2 in Europe and rank among the top three worldwide.\nIn the foreign exchange markets we are an undisputed top-three player – indeed, No. 1 in FX derivatives. Every day we talk to our clients in this area. Our Autobahn trading platform offers clients a unique trading infrastructure which they can integrate into their own systems. That’s a significant competitive advantage.\nIn fixed income and credit trading we have ranked among the global top five for many years with a high market share. In this business, we place and hedge risks for our corporate clients.\nIn the origination and advisory business we rank among the leaders in Germany and in Europe. At the same time our expertise lets us play at the forefront in important industries around the world.\nThat includes typical German companies, but also companies in the media and technology sector, where we have been involved in some of the world’s most important transactions in the past months – advising Disney and BSkyB, for example.\nMy dear shareholders, I could go on. Whether it’s issuing or trading high-yield bonds, commercial real estate or other complex financing solutions, we have top positions in many sub-segments.\nBut I want to say something else. We are a partner for our clients and support them with our financing solutions every day. We stand side-by-side with the finance directors and treasurers of many corporations, and of family firms. That’s crucial: we are relevant here, too.\nAnd we are working not in shrinking but in growing markets: the number of companies with a market capitalisation of more than one billion dollars is likely to double in the coming decade. All of these companies are our potential clients – and I am confident that one day, many of them will indeed be our clients.\nIt is also true, though, that we need to focus on what we really do well. Which means, in turn, that other areas need to scale back. Either because they’re no longer as relevant for our key client groups, or because we do not enjoy a leading position in that particular market.\nThis also requires painful measures, and I know what that means. It was no easy decision for us in the Private & Commercial Bank to sell our business in Poland and Portugal. But it simply was the best solution.\nUnder the leadership of Garth Ritchie, we thoroughly analysed the Corporate & Investment Bank and drew the appropriate conclusions.\nHere is the result:\nWe plan to significantly shrink our Rates business in the US and reduce leverage exposure. We do not see this business as our core competency. In contrast, we will continue to invest in our European rates business, as this business remains a strength for both the bank and for the clients it serves.\nOur Equities business is an area which we have analysed intensively over the past few weeks before deciding to make substantial cutbacks:\n- In Cash Equities, we will make substantial reductions and will focus on electronic solutions and our most relevant clients.\n- Likewise in Prime Finance, where we will be reducing the balance sheet by a quarter, which corresponds to 50 billion euros.\n- In total, around 25 percent of jobs in the Equities business are going. This reduction is already fully underway, and so far, due to the considered way we’ve handled this, we have not seen any meaningful revenue attrition.\nNow turning to our Corporate Finance business: we will, of course, continue to be present in this business, but in future we will focus on sectors and segments that are most relevant for our most important clients or in which we have a strong global position. Where we are not so strong, we will scale back. One example is the oil and gas sector in the US – we are in the process of completely closing our office in Houston, Texas.\nThis focusing is already visible. In the past seven weeks, we have separated from 600 employees in our Corporate & Investment Bank. And we aim to shrink the balance sheet, our so-called leverage exposure, which is currently around 1.05 trillion euros, by more than 100 billion euros by the end of 2019, which is a reduction of about 10 percent. We aim to get the bulk of this done by the end of this year.\nBut let me repeat: in those areas where we decide to stay - and that is the greater part of our business - we will expand. Where we are strong, we aim to capture market share or at least grow with the market. We are and will remain Europe’s leading corporate and investment bank with a global network. And accordingly, our return on equity should significantly improve.\nLadies and Gentlemen, maybe that’s not radical enough for some. And it’s actually quite easy to cut things on paper and calculate how much you, my dear shareholders, will benefit. We take proposals like these seriously, we are evaluating them carefully, and we have assessed a number of options.\nBut it’s not that simple. I’m all for being radical, but first and foremost I’m responsible. A bank is a sensitive organism. Instead of creating value, any disorderly or precipitate actions can destroy value very quickly, instead of creating it. And I took on this job to create value for you.\nAnd we can only do this if we manage our costs better. Overall, our production costs are too high. And that brings me to our fourth priority:\n4. Rigorous cost management\nLadies and Gentlemen, it is not as if we haven’t made cost savings in recent years. In 2017 our bank’s adjusted costs were 2.6 billion euros lower than in 2015. But as we can see from our cost/income ratio, we haven’t cut costs enough.\nThis year adjusted costs will not exceed 23 billion euros. And for 2019 the target is 22 billion euros.\nIn order to meet these targets we will need both short-term and long-term measures:\nWe have started at the top. The Management Board has already been slimmed down by a quarter. We’re also in the process of significantly slimming down the two layers below the Management Board.\nWe have reduced the leadership teams in the Corporate & Investment Bank and the Private & Commercial Bank substantially. Smaller committees, less hierarchy and more individual responsibility – that’s our motto.\nWe’ll reduce expenditure in the Corporate & Investment Bank by more than one billion euros by the end of 2019. In doing so, we’ll also be looking at the related infrastructure – here, we can reduce costs without diluting our contact with our clients.\nFrom 2019 onwards, we also expect substantial savings in the Private & Commercial Bank thanks to the merger. In this area, we aim to save around 500 million euros in the coming year.\nBut we also need to be far more thorough. We will rigorously automate our Operations area – in other words the ‘engine room’ of our bank, across all businesses. Let me give you an example of what that means: in the Private & Commercial Bank, we’ve identified more than 3,300 work processes by which we carry out our day-to-day work. Many of these processes are in fact still carried out manually. In the past two years we have automated the hundred most cost-intensive of these processes.\nThat alone led to a reduction of 300 jobs. The result? Lower expenses and more reliable, and now more scalable, processes. Our new Chief Operating Officer, Frank Kuhnke, was responsible for this transformation in the Private & Commercial Bank. He will now work through the entire company in the same systematic manner and automate processes. There is large potential for cost savings in this.\nAnd we won’t stop there. We’ll also significantly reduce costs in the IT area. Up until now we have been constantly reinventing the wheel in many places, particularly in the individual business areas. That makes us too expensive.\nBut what does that mean in practice? We know where our centres of competence should be – for example, in areas such as IT security, data, cloud usage or the organisation of current business. In the second half of the year we’ll bundle corresponding activities and cut costs.\nWe’ll combine all this with a systematic programme for long-term cost reduction for which our CFO, James von Moltke, is responsible. This is also a matter of “heavy lifting”, for example when it comes to our external service providers. We will achieve better conditions if the Group acts in a unified manner instead of each area negotiating separately. And we will analyse more closely what we really need.\nYou may well ask why we haven’t already taken action on these points, some of which seem obvious. The answer is that we’ve taken it in some areas already, but not yet in others. Perhaps also because, in the light of the significant challenges of the past two years, we didn’t give it the focus it needed. But that, my dear shareholders, is now the task of this Management Board.\nWhen we cut costs significantly, this will also lead to a reduction in jobs. The number of full-time equivalents will drop from its current level of over 97,000 to well below 90,000 by the end of 2019.\nTaking such decisions is something that my Management Board colleagues and I do not take lightly. Job cuts are, however, unavoidable if our bank is to become sustainably profitable. This is our duty, first and foremost to you, our owners.\nWe'll also implement all this in the most socially responsible manner possible. We will not only look at our permanent staff, but also service providers, consultants and temporary staff.\nAnd we'll make use of natural fluctuation and hiring freezes where these are sensible. That’s not just in the interests of our employees, it also helps reduce restructuring and severance charges. Mainly because of this we expect that these charges will not exceed 800 million euros this year, despite the size of the programme.\nIt’s also important to stress that despite all the pressure on costs, rigorous controls are essential. We have learned our lessons from the past: behaving ethically and with integrity must be at the core of what we do. This principle remains unchanged. My Management Board colleague Sylvie Matherat is responsible for this area, and we know it is in good hands.\nLadies and Gentlemen, what will this restructuring mean for our bottom line? We continue to expect that we can attain a post-tax return on tangible equity of approximately 10 percent in normalised business conditions from 2021 onwards.\nHowever, we are aware that this target is rather far away. I therefore want to reiterate what I said earlier: we want to set targets which are verifiable and achievable. That’s the only way in which you, our investors, know exactly where we are in our restructuring.\nTherefore we will soon present a clear plan which shows how we aim to develop our costs and our returns on equity. It will demonstrate how we are to improve step by step and year by year. We promise to be more transparent, dear shareholders. I think that’s in your best interests.\nSummary\nLadies and Gentlemen, despite all the challenges we shouldn’t forget where came from and everything we have already achieved.\nOur balance sheet is stable and gives us a solid platform.\nTwo of our three business divisions have a clear strategy which they have to execute. No more and no less. There’s no longer any strategy debate here.\nIn our Corporate & Investment Bank, we now also know exactly where we’re headed. We have adapted our strategy, and now we’re going to implement. We will invest where it is profitable to do so – for you, our shareholders, for our clients and for our bank.\nAnd finally, on the cost side we are most rigorously tackling the root causes of costs. We’re not going to debate back and forth and question everything, or constantly find reasons why something won’t work. Instead, we’re going to implement. That’s what matters now.\nLadies and Gentlemen, this is how, gradually, Deutsche Bank will once again become the bank you have known for many years. Decisions will be made and then implemented – quickly.\nBut we don’t need to look back to the past if we want to remind ourselves of our strengths.\nWe have longstanding client relationships, some of which go back generations.\nWe have a leading position in many important business areas.\nWe have successful innovations plus enough scope to develop more ideas.\nAbove all, however, we have excellent, highly skilled and loyal staff worldwide. And I particularly want to emphasise that today, when we’re announcing job reductions.\nFrom many face-to-face discussions I know that our colleagues want one thing from us above all: clarity. They want us to be clear in our statements, clear in our leadership and clear in our implementation. This rigour has to be our day-to-day maxim, our mantra. That’s what you expect of us. It is also what our employees expect of us.\nIn the past few weeks I’ve visited many of our major hubs, including London, New York, Hong Kong and Singapore, Milan, Bonn and Berlin. What I always find heartening there is how so many colleagues identify so closely with this bank despite everything we have been through.\nThey have worked very hard in recent years to stabilise the bank and at the same time to still be there for our clients. I would like to take this opportunity to express deep gratitude to all members of staff worldwide for their tireless dedication, also on behalf of you, our shareholders.\nLadies and Gentlemen, since I started at Deutsche Bank almost 30 years ago, I have always been – or rather, nearly always been – proud to be able to work for this great institution. And many others feel the same. In the past few years, it’s that pride that has, at least partially, been lost.\nThat’s why I take office as Chief Executive with the goal of restoring exactly that pride. Don’t misunderstand me: I’m not talking about arrogance, but pride. Pride in working for Deutsche Bank; pride in giving one’s all for a cause, and performing at the top of one’s ability; pride in what we are achieving.\nIf we succeed, then perhaps you will also again feel a little pride in being our clients and our shareholders.\nThat’s why we aim to be relevant, excellent, innovative, stable and trustworthy. This is what Deutsche Bank must stand for once again.\nLadies and Gentlemen, my Management Board colleagues and I, our leaders and all our employees, we all know who is responsible for the success of Deutsche Bank. We are. That is the responsibility we bear – those of us who are sitting up here. That’s why it’s so important for me to be accountable to you, our owners. And of course it’s my aim to do the same next year, although in different circumstances.\nFor that reason, I am asking for your trust and your support. That trust and that support will be an incentive for us and our employees. We are going to set Deutsche Bank back on the road to success. We owe it to ourselves. We owe it to our clients. And we owe it to you, dear shareholders.\nThank you very much!",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}