{
    "url": "https://www.db.com/news/detail/20180524-deutsche-bank-finalises-equities-business-review?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "May 24, 2018",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Deutsche Bank finalises Equities business review",
    "body": " Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) will significantly reshape its Equities Sales & Trading business. Overall, the bank aims to reduce headcount in this area by approximately 25%. In Cash Equities, it will concentrate on electronic solutions and its most significant clients globally. In Prime Finance, the bank will reduce leverage exposure by a quarter, equivalent to a reduction of approximately €50 billion.\nThese business reductions will contribute to a decrease in leverage exposure in the Corporate & Investment Bank of over €100 billion. This is approximately 10% of the €1,050 billion euros of leverage exposure reported at the end of the first quarter of 2018. The majority of this reduction is expected to be achieved by the end of this year.\nWe remain committed to our Corporate & Investment Bank and our international presence – we are unwavering in that.We are Europe’s alternative in the international financing and capital markets business. However, we must concentrate on what we truly do well.\nChristian Sewing, Chairman of the Management Board\nTogether with its decision to right-size the expense base in the Corporate & Investment Bank, Deutsche Bank will accelerate the pace of cost reduction across the organisation. In 2018, as already announced, the bank envisages adjusted costs not to exceed €23 billion. For 2019, the Management Board plans to reduce adjusted costs to €22 billion with no further significant disposals currently planned.\nIn connection with the implementation of these plans, the number of full-time equivalent positions is expected to fall from just over 97,000 currently to well below 90,000. The associated personnel reductions are underway.\nThe Management Board reaffirms its target of a post-tax return on tangible equity (RoTE) of approximately ten percent in a normalised business environment. The bank will seek to reach this goal from 2021 onwards. Although results in 2018 will reflect the impact of the aforementioned actions, including planned restructuring charges of up to €800m, the bank aims to deliver steady growth in return on capital over the coming years.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}