{
    "url": "https://www.db.com/news/detail/20230428-deutsche-bank-agrees-to-combine-uk-and-ireland-corporate-finance-business-with-numis?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 28, 2023",
    "tags": [
        "Investment Banking",
        "Strategy"
    ],
    "title": "Deutsche Bank Agrees to Combine UK and Ireland Corporate Finance Business with Numis",
    "body": "Deutsche Bank today announces that it has reached an agreement on the terms of a recommended all-cash offer for the acquisition of Numis Corporation Plc.\nNumis is a leading UK corporate broking and advisory house providing strategic advice and capital market connectivity to 166 retained corporate broking clients, including 64 clients in the FTSE 350, representing almost 20% of the index.  \nThe Transaction will allow Deutsche Bank to accelerate its Global Hausbank strategy by unlocking a much deeper engagement with the corporate client segment in the UK, enabling Deutsche Bank to become a leading provider to more than 170 corporate clients for their comprehensive financial and advisory needs.\nThe Management Board of Deutsche Bank and Board of Numis are convinced that the Transaction represents an exciting strategic opportunity to combine Deutsche Bank’s existing UK and Ireland corporate finance business with Numis to establish a leading force in UK investment banking with a prominent position across corporate broking, strategic advisory (including M&A and growth capital), equity and debt capital markets and equity research, sales and execution, and to leverage Deutsche Bank’s comprehensive and global product offering across the Corporate Bank and the International Private Bank.\nUnder the terms of the Transaction, Numis shareholders will be entitled to receive a total of 350 pence per share, valuing Numis at approximately £410 million. The Board of Numis intends to recommend the Transaction unanimously to Numis shareholders. Deutsche Bank has received an irrevocable undertaking from Numis’ largest shareholder to vote in favour of the Transaction.\nThe Transaction is expected to complete during the fourth quarter of 2023, subject to certain conditions including approval by Numis shareholders and receipt of regulatory approvals.\nAssuming closing in Q4 2023, Deutsche Bank anticipates that the transaction will be EPS accretive from 2024 and will deliver an attractive return on regulatory capital consumed. The CET1 ratio impact at closing is expected to be approximately (9) basis points.\nThis Transaction is strongly aligned to our Global Hausbank strategy and has the potential to unlock significant value within both the Numis and Deutsche Bank franchises. We have been evaluating how to accelerate the growth of our business in the UK and, as a leading UK franchise with a long history of successfully delivering superior client service and growth, Numis represents a compelling strategic fit. The combination enables us to realise greater revenue opportunities across our shared client base and to deepen our engagement with UK corporates. There is strong and complementary cultural alignment between Deutsche Bank and Numis that will propel the combined business to deliver exceptional client service, and we look forward to welcoming Numis management and employees to the Deutsche Bank Group. \nFabrizio Campelli, Head of Corporate Bank and Investment Bank at Deutsche Bank \nThis press release must be read in conjunction with the Rule 2.7 announcement which is available on the London Stock Exchange RNS and along with other documents related to the transaction on https://investor-relations.db.com.\nMedia Contacts\nDeutsche Bank Communications                                                             \nVictoria Garrod\nCharlie Olivier\nPhone: +‍44 207 547 2409\nFGS Global (PR Adviser to Deutsche Bank)                                           \nJames Murgatroyd\nRory King\nPhone: +44 207 251 3801",
    "number_of_ratings": 8,
    "rating": 4.3,
    "likes": 22
}