{
    "url": "https://www.db.com/news/detail/20230426-deutsche-bank-to-sharpen-management-board-s-focus-on-accelerating-strategy-execution?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, April 26, 2023",
    "tags": [
        "Company",
        "Management & Leadership",
        "Personnel announcements",
        "Strategy"
    ],
    "title": "Deutsche Bank to sharpen Management Board’s focus on accelerating strategy execution",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today announced changes to its Management Board to further sharpen its focus on clients’ needs, the bank’s areas of growth and operational excellence. The leaner management team is tasked with accelerating the implementation of the bank’s Global Hausbank strategy. Against the backdrop of a challenging environment, costs and controls will continue to be areas of significant focus.\nAs previously announced, Karl von Rohr, President and responsible for the Private Bank, Asset Management and the German and EMEA regions, has informed the Supervisory Board that he will not be seeking to renew his contract once his current term as Member of the Management Board concludes at the end of October 2023.\nChristiana Riley, CEO for the Americas and Member of the Management Board, has decided to take on a new opportunity outside of Deutsche Bank. She will leave the bank on the day following the Annual General Meeting on May 17, 2023.\nThe new, smaller Management Board will consist of nine people. Claudio de Sanctis will join the Management Board and assume responsibility for the Private Bank as of November 1, 2023, at the latest. He has been responsible for the International Private Bank (IPB) in recent years, successfully transforming both retail and wealth management units and positioning them for future growth.\nJames von Moltke, President and Chief Financial Officer, will assume responsibility for the Asset Management division, which consists of Deutsche Bank’s majority stake in DWS, in addition to his current roles, as of November 1, 2023, at the latest.\nStefan Simon, Chief Administrative Officer (CAO) who is responsible for relations with regulatory authorities as well as for Legal and Governance, Compliance and Anti-Financial Crime (AFC), will additionally take over responsibility for the Americas as of May 18, 2023. He will relocate to New York. Next to supporting the development of the business as well as the client and investor coverage in the region, the bank’s priorities include its ambition to meet regulatory requirements. Simon will be tasked to establish a state-of-the-art risk and controls culture which is embedded in growing business lines.\nThe regional responsibilities for Germany, Europe, the Middle East and Africa (EMEA, ex UK and Ireland) and the Asia-Pacific region will be combined under the leadership of Alexander von zur Mühlen as of November 1, 2023, at the latest. He will foster Deutsche Bank’s client-centric approach and enhance cross-divisional and cross-regional collaboration to further optimize client services globally. With offices in Frankfurt and Asia, he will manage the bank’s relations with key clients and stakeholders in the regions he is responsible for. Given his deep experience from roles in Treasury, Strategy, Capital Markets and regional coverage, he will be an important driver for our global offering to our home market customer base as well as the rising number of overseas clients with global banking needs.\nIn this new structure, Rebecca Short, who successfully managed Deutsche Bank’s transformation, will take on an expanded Chief Operating Officer (COO) role, effective June 1. In that function, she will have primary responsibility for costs across the group. To strengthen the link between performance and outcomes across the bank, Human Resources and Global Real Estate will also fall under the COO’s remit. Short keeps oversight of transformation and regulatory remediation governance. \nThe roles of Fabrizio Campelli (Corporate Bank and Investment Bank), Bernd Leukert (Technology, Data and Innovation) and Olivier Vigneron (Chief Risk Officer) remain unchanged.\n“In the past years, Christian Sewing has, together with his leadership team, successfully led Deutsche Bank through a comprehensive transformation in a challenging environment and positioned the bank for future growth,” Alex Wynaendts, Chair of the Supervisory Board, said. “It is time to focus the Management Board on the next phase of the bank’s growth strategy, which is now more than ever about sustainable profitability, efficiency and effective controls. The new leadership team positions Deutsche Bank optimally to achieve this.”\nCommenting on the outgoing Americas CEO, Wynaendts said: “Christiana Riley has successfully repositioned the bank’s Americas business, sustainably improved relations with important local stakeholder groups and achieved remarkable success in strengthening the culture in the region. I would like to thank Christiana for her commitment and wish her all the best in her future endeavours.”\nThe changes are subject to the usual regulatory approvals.",
    "number_of_ratings": 13,
    "rating": 3.2,
    "likes": 13
}