{
    "url": "https://www.db.com/news/detail/20230424-friederike-rotsch-appointed-general-counsel-of-deutsche-bank?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, April 24, 2023",
    "tags": [
        "Management & Leadership",
        "Personnel announcements"
    ],
    "title": "Friederike Rotsch appointed General Counsel of Deutsche Bank",
    "body": "Deutsche Bank today announced the appointment of Dr. Friederike Rotsch as General Counsel of Deutsche Bank, effective September 5, 2023. She will report to Stefan Simon, Management Board Member and Chief Administrative Officer, and be based in Frankfurt. Rotsch succeeds Karen Kuder, who joined DWS as Chief Administrative Officer.\n“Friederike is renowned in Germany as a seasoned and highly respected General Counsel,\" said Simon. “We assessed a broad and diverse range of candidates, across industries and regions, and she was the outstanding choice to take our Legal department forward. I look forward to working with Friederike to develop our advisory capabilities further and support the sustainable growth ambitions of the bank.”\n“I am honoured to join a German institution with a rich history and exciting future in the financial sector,” said Rotsch. “I have followed the transformation of Deutsche Bank as an interested observer for a number of years and am now keen to contribute to its next chapter of remarkable progress.”\nRotsch joins from Merck, a leading science and technology company, where she has served as Group General Counsel, Head of Group Legal & Compliance for the past 9 years, leading a global team of experts. Rotsch is an accomplished and experienced lawyer, with deep expertise across corporate law, governance, M&A, capital markets and dispute resolution. She serves on the Supervisory Board of SAP since 2018 and has the role as Lead Independent Director since 2022.",
    "number_of_ratings": 8,
    "rating": 3.9,
    "likes": 17
}