{
    "url": "https://www.db.com/news/detail/20230418-karl-von-rohr-not-seeking-to-renew-his-contract-as-member-of-deutsche-bank-s-management-board?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, April 18, 2023",
    "tags": [
        "Management & Leadership",
        "Personnel announcements"
    ],
    "title": "Karl von Rohr not seeking to renew his contract as Member of Deutsche Bank’s Management Board",
    "body": "Karl von Rohr, President of Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) has informed the Supervisory Board that he will not be seeking to renew his contract beyond his current term as Member of the Management Board concluding at the end of October 2023.\nSpeaking about von Rohr’s time in the role, Alex Wynaendts, Chairman of the Supervisory Board of Deutsche Bank, said: “In his more than 25 years with Deutsche Bank, Karl von Rohr has contributed significantly to the development of the bank. During his tenure as a Member of the Management Board he has played a major role in re-establishing Deutsche Bank as a profitable and credible institution. Over the past few years, he has very successfully positioned the Private Bank for efficiency and growth. The Supervisory Board welcomes the fact that he will serve out his contract, which runs until the end of October. We thank him sincerely for his service and wish him every success in his future career.“\nChristian Sewing, CEO of Deutsche Bank said: “I respect Karl’s decision to leave Deutsche Bank after more than a quarter of a century to pursue new endeavours. I thank him for his excellent performance and his unwavering desire to take Deutsche Bank further forward. In the past eight years, and for the last five years as President on the Board, Karl has been a strong and very trusted partner who was instrumental to our successful transformation. His dedication and collaboration are second to none and I look forward to another sixth months to jointly make Deutsche Bank even stronger.”\nKarl von Rohr said: “After eight years on the Management Board and the successful completion of so many important steps of Deutsche Bank’s transformation, this is the right time for me to pursue new endeavours. I have found it deeply fulfilling to do my part in helping the institution return to a solid foundation that enables profitable growth – especially in the German home market. None of this would have been possible without so many colleagues throughout the bank who have been part of my journey. My sincere gratitude goes to them. Until my contract expires in October, I will remain fully committed to supporting Deutsche Bank’s continued success.”\nVon Rohr joined Deutsche Bank in 1997. In 2015 he became a Member of the Management Board, initially responsible for Human Resources as well as for Legal and Governance. In April 2018, he became President, later also taking over responsibility for the Private Bank and for Deutsche Bank’s Asset Management in July 2019, which mainly consists of the majority holding in fund manager DWS. Von Rohr has been Chairman of the Supervisory Board of DWS since 2018.\nDeutsche Bank will provide an update concerning Karl von Rohr’s succession in the Management Board in the near future.",
    "number_of_ratings": 41,
    "rating": 1.5,
    "likes": 4
}