{
    "url": "https://www.db.com/news/detail/20230405-deutsche-bank-lands-ecm-bank-of-the-year-for-primary-capital-raising-in-globalcapital-s-2022-emea-ecm-awards?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 5, 2023",
    "tags": [
        "Investment Bank",
        "Awards"
    ],
    "title": "Deutsche Bank lands ECM Bank of the Year for Primary Capital Raising in GlobalCapital’s 2022 EMEA ECM Awards",
    "body": "The award was decided by GlobalCapital’s equity capital markets editorial team. The GlobalCapital Awards are the only bespoke awards dedicated to equity capital markets in the EMEA region.\nAidan Gregory, equities editor, GlobalCapital, said: “In this environment we feel it is more important than ever to recognise the achievements of the banks that performed well in difficult circumstances, proving the resilience of their businesses, as well as the issuers who completed highly innovative and transformational deals in some of the most volatile markets in recent years.”\nStephane Gruffat, Co-Head, Equity Capital Markets, EMEA, Deutsche Bank, said : “Our platform proved successful in 2022 – Deutsche Bank led 5 of the 7 largest capital increases in Europe and priced some very visible and complex transactions.”\nSome of the noteworthy capital increases include:\nRWE’s €2.4bn Mandatory Convertible Bond\nCheplapharm’s €550m Equity Private Placement\nAir-France KLM’s €2.3bn Rights Issue and €305m Convertible Bond\nCredit Suisse’s CHF4bn Capital Increase\nALD’s €1.2bn Rights Issue\n  Deutsche Bank was also awarded runner-up in the ‘ECM Bank of the Year DACH’ category and for its Senior Bookrunner position in the Porsche IPO. Porsche’s IPO was voted ECM Deal of the Year and was the largest IPO ever carried out in Europe in terms of market capitalization at  around €78 billion. Deutsche Bank was also a Joint Global Coordinator of one of the Top 5 ‘outstanding deals of the year’ – Air France KLM’s Rights Issue.\nSaadi Soudevar, Co-Head, Equity Capital Markets, Deutsche Bank, commented : \"A testament to our clients' and our team's hard work that these landmark transactions have been recognised with these awards. For ECM our core focus is to continue to deliver solutions for our clients across EMEA to meet their capital structure and strategic objectives.”",
    "number_of_ratings": 9,
    "rating": 3.7,
    "likes": 4
}