{
    "url": "https://www.db.com/news/detail/20250220-deutsche-bank-helps-hashkey-exchange-to-expand-fiat-deposit-channels?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 20, 2025",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank helps HashKey Exchange to expand fiat deposit channels",
    "body": "Deutsche Bank has helped its client HashKey Exchange, Hong Kong’s largest licensed virtual asset exchange, to launch a new fiat deposit channel, enhancing user experience on the exchange’s platform.\nNext-Gen banking solutions in digital asset space\nHashKey Group’s two main arms, HashKey Exchange (a virtual asset trading platform) and HashKey Capital (a global digital asset manager), had specific banking needs. HashKey Exchange needed a provider to facilitate operational and customer flows, including FX requirements, while HashKey Capital sought support for investor fund collection and settlement with investees and liquidity providers, particularly for digital assets.\nDeutsche Bank was chosen for its extensive experience in servicing new economy companies. The bank provided HashKey Exchange with operational and client-money accounts, along with virtual accounts to improve reconciliation processes. For HashKey Capital, Deutsche Bank opened accounts to manage existing and upcoming funds, facilitating investor inflows and settlements.\nAs a result of these solutions, HashKey Exchange gained clear oversight of exchange-related funds and benefited from Deutsche Bank's FX4Cash module for real-time rates and efficient execution. HashKey Capital consolidated its funds in Asia with a streamlined account structure.\nHashKey Exchange clients gain access to fiat deposits via Deutsche Bank\nDeutsche Bank will provide fiat currency deposit services to HashKey Exchange, effective immediately. Clients of HashKey Exchange can directly deposit Hong Kong dollars or US dollars into virtual accounts managed by Deutsche Bank, offering an alternative to existing deposit options on HashKey’s Exchange. This service leverages Deutsche Bank’s API-based virtual account solution.\nOle Matthiessen, Head of Corporate Bank for Asia Pacific and Middle East & Africa and Global Head of Cash Management said: “We are delighted to help HashKey Exchange expand its suite of solutions and enhance the experience of its customers. Our expertise with serving clients in the fintech, platform and digital economy space positions us strongly to partner with HashKey Exchange to take its operations to the next level and grow for the long-term.”\nHai Yang Ru, Chief Risk Officer of HashKey Group said: \"Our collaboration with Deutsche Bank marks a significant step in strengthening HashKey Exchange’s banking relationships. By integrating Deutsche Bank's API-based virtual account solution, we are enhancing the flexibility and convenience of fiat deposit services for our users. HashKey Exchange remains committed to expanding its banking partnerships, improving user experience, and ensuring the highest standards of security for user funds.\"\n As of January 15, 2025, HashKey Exchange ranked seventh on CoinGecko’s global exchange list. It is the highest-ranked licensed virtual asset exchange in Hong Kong.",
    "number_of_ratings": 3,
    "rating": 5.0,
    "likes": 8
}