{
    "url": "https://www.db.com/news/detail/20250218-deutsche-bank-s-mark-fedorcik-to-retire-after-30-years-alison-harding-jones-appointed-as-global-head-of-origination-and-advisory-and-co-head-of-the-investment-bank?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main / London, February 18, 2025",
    "tags": [
        "Investment Banking",
        "Personnel announcements"
    ],
    "title": "Deutsche Bank’s Mark Fedorcik to retire after 30 years – Alison Harding-Jones appointed as Global Head of Origination & Advisory and Co-Head of the Investment Bank",
    "body": "Deutsche Bank announced today that Mark Fedorcik has informed the bank about his intention to retire from the industry and take on a new challenge in the corporate sector. He has been with the firm for 30 years, most recently as Co-Head of the Investment Bank and Global Head of Origination & Advisory (O&A).\nAs Fedorcik’s successor, the bank appointed Alison Harding-Jones as Global Head of O&A, effective 1 April. She will also become Co-Head of the Investment Bank alongside Ram Nayak, Head of Fixed Income and Currencies, and join the Bank’s Group Management Committee.\n                                                                                                                                  Alison Harding-Jones\nHarding-Jones joined Deutsche Bank in January 2024 as Global Head of Mergers & Acquisitions (M&A). Previously she worked at Citigroup in London, where she was most recently Head of EMEA M&A, Vice Chair of the EMEA Corporate and Investment Banking business, and Head of the Global M&A Cross Sell Group. Prior to Citigroup, she spent over 25 years at UBS (previously S.G. Warburg) where she held a number of senior roles including Head of APAC M&A, Head of CEEMEA Investment Banking, and Co-Head of EMEA M&A. Harding-Jones has lived and worked in London, Hong Kong and New York during her career.\nShe will report to Fabrizio Campelli, Deutsche Bank’s Head of Corporate Bank and Investment Bank and Member of the Management Board.\n“Since joining as a graduate in 1995, Mark has spent his entire career at Deutsche Bank and has played an integral role in the development of our O&A business. He assumed responsibility for the Investment Bank and the O&A business globally in 2019, during a challenging period, and has been instrumental in overseeing a successful turnaround, achieving significant growth and market share gains in recent quarters. Mark has played a pivotal role in shaping the culture of the Investment Bank; developing and attracting talent and fostering a culture of positive energy. He has always been truly dedicated to the success of both our clients and the bank, and I would like to thank him for his many valuable contributions over the years,” said Fabrizio Campelli.\n“At the same time, I am delighted to announce such a strong successor for Mark within our own ranks. Alison brings vast experience based on more than 30 years in the industry and has achieved an impressive track record. Since joining Deutsche Bank a year ago, she has made a significant impact in further evolving our M&A franchise and contributed to setting and delivering on Mark’s strategic agenda for the O&A business overall. Investing in our O&A franchise is a core priority in our strategic growth, and we remain focused on this, and our Investment Bank overall, as part of our Global Hausbank strategy. I am looking forward to working closely with Alison and Ram Nayak as we continue to grow our Investment Bank business as planned, both this year and beyond, and bring the best of Deutsche Bank to our clients.”\n                                                                                                                                           Mark Fedorcik\nMark Fedorcik said: “It has always been a privilege for me to work for Deutsche Bank, this has been the job of a lifetime. After 30 years, it is time for a change, and I look forward to taking on a new challenge in the corporate sector. I would like to thank my colleagues and clients for their great partnership and passion over the past decades. It is comforting to know that Deutsche Bank’s O&A business will be in very capable hands, across a talented and seasoned management team. I look forward to working closely with Alison to ensure a smooth transition and then watching her and the team continue to drive this business forwards.”\nAlison Harding-Jones added: “Since joining Deutsche Bank last year, I have been impressed by its extremely strong team, global network and exceptional expertise across a wide range of financial products and services. We are following a clear strategic path to deliver on our plans, we have seen a very strong momentum in recent quarters, and I am convinced that our potential is even greater. I feel honoured to lead our O&A business globally and look forward to working closely with Ram to continue to deliver against the strategy of our Investment Bank.”",
    "number_of_ratings": 5,
    "rating": 4.4,
    "likes": 5
}