{
    "url": "https://www.db.com/news/detail/20250210-deutsche-bank-wins-multiple-bond-house-of-the-year-titles?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 10, 2025",
    "tags": [
        "Americas",
        "Asia-Pacific",
        "Europe",
        "Middle East",
        "Awards"
    ],
    "title": "Deutsche Bank wins multiple Bond House of the Year titles",
    "body": "Deutsche Bank celebrated a string of victories at the prestigious IFR Awards 2024. The bank received recognition across multiple categories, showcasing its comprehensive expertise and unwavering commitment to client success.\nIn addition to its involvement in several deal awards, Deutsche Bank garnered top honors in the following categories:\nEuro Bond House: recognising the bank's deep understanding and dominance in the Euro bond market.\nReverse Yankee Bond House: a testament to Deutsche Bank's expertise in facilitating bond issuances in European currencies by US companies.\nSwiss Franc Bond House: highlighting the bank's robust systems and trusted reputation in the Swiss Franc bond market.\nHigh-Yield Bond House in Asia: acknowledging Deutsche Bank's exceptional performance and guidance in the Asian high-yield bond market.\nIFR lauded Deutsche Bank's market expertise and client-centric approach. The publication highlighted the bank's 150-year legacy of adapting to evolving market dynamics and delivering tailored solutions for its clients.\nSpecifically, IFR praised Deutsche Bank's \"best-in-class systems\" and \"massively increased market share\" in the Swiss Franc bond market. In the Asian high-yield bond arena, Deutsche Bank was hailed as a \"championship team\" for its work on multiple debut deals and its far-reaching influence across the region.\nDeutsche Bank's impressive performance at the IFR Awards 2024 is a testament to the bank's collaborative spirit, unwavering client focus, and dedication to innovation. The bank's success is attributed to the seamless teamwork across the Corporate Bank (CB) and the Investment Bank (IB), notably its Origination & Advisory (O&A) and Fixed Income & Currencies (FIC) businesses.",
    "number_of_ratings": 4,
    "rating": 5.0,
    "likes": 8
}