{
    "url": "https://www.db.com/news/detail/20250204-green-steel-salzgitter-s-ambitious-vision-for-the-industry?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 4, 2025",
    "tags": [
        "Sustainability"
    ],
    "title": "Green steel – Salzgitter’s ambitious vision for the industry",
    "body": "An industry in upheaval\nThe blast furnace, the heart of steel production, needs coal to extract pig iron at over 1,500 degrees. And coal means carbon dioxide –lots of it. German steel mills alone emit around 40 million tons every year. With strict limits now in place in the European Union and in Germany, this cannot continue.\nTo change costs money, though. According to a study by strategy consultancy Oliver Wyman, the industry would have to invest 1.5 trillion euros worldwide to become climate-neutral by 2050. The pressure on producers is particularly great in Europe. On the one hand, the region has ambitious climate targets, while at the same time producers in Asia - China for example – produce more cheaply and with fewer environmental regulations.\nHowever, environmentally friendly steel could become a competitive advantage because demand is increasing. In fact, climate-friendly steel significantly reduces emissions for downstream industries – first and foremost the automotive industry, household appliances, but also onshore and offshore wind power.\nThe steel sector is a crucial decarbonisation enabler for multiple industries, as utilizing green steel reduces upstream Scope 3 emissions of corporates relying on steel, a factor particularly relevant for the German economy.\nLavinia Bauerochse, Global Head of Sustainable Finance, Deutsche Bank Corporate Bank\nSalzgitter AG: sticking to transformation despite tense economic development\nWith their SALCOS® (Salzgitter Low CO2 Steelmaking) programme, the company is pursuing an ambitious vision. By 2033, they want to reduce their CO2 emissions by up to 95 percent – something that is possible if they use hydrogen instead of coal in the future.\nThe principle is simple; the implementation complex. In a process that produces significantly less CO2, hydrogen is used to reduce the iron ore directly, leaving a solid iron “sponge”, which is then refined into crude steel in a so-called electric arc furnace. To achieve this, Salzgitter already has one hydrogen electrolyser in operation and is working with partners to establish the whole SALCOS® program. Despite the tense economic environment, Salzgitter is sticking to the transformation as they are convinced that they can benefit as a pioneer.\nHigh investments necessary\nHowever, the costs of the transformation are enormous. Salzgitter invests 2.3 billion euros in phase 1 of its SALCOS programme. Since it was classified by the European Commission as an \"Important Project of Common European Interest (IPCEI)\", there was a financing grant of one billion euros from the Federal Republic of Germany and the state of Lower Saxony, where Salzgitter is based; the remaining 1.3 billion euros is raised by Salzgitter itself.\nAs a long-standing partner, Deutsche Bank acted as a lender as well as the sole sustainability coordinator and carried out the classification process for green loans.\nChallenges and opportunities\nSetting up a new production facility is not enough, though; the steel industry also needs stable framework conditions for the transformation, including competitive energy prices, enormous quantities of green hydrogen and a network to distribute it. Hydrogen is still expensive, and the CO2 price alone is not enough to offset the additional costs of green steel. For the transformation to be a success, Salzgitter needs the right economic policy framework.\nMartin Zappe, project manager of SALCOS, assumes that customers are willing to pay a slightly higher price for the environmentally friendly product. Customers such as BMW, VW and Daimler have already ordered green steel to make their own supply chains more sustainable. And the European market could benefit in the long term if climate-friendly steel becomes an export product. Nevertheless, Salzgitter is in favour of so-called lead markets for green steel, in which for example the public sector sets green steel quotas for public contracts.\nThe vision\nIf Salzgitter is successful, it could set a precedent. The industry is already planning similar projects. Ultimately, the steel industry could not only secure its place in the economy, but also influence other industries. Once considered the burdensome legacy of the industrial age, the new facilities like direct reduction plants and electric arc furnaces as well as the steel they make could become a symbol of a greener future.",
    "number_of_ratings": 3,
    "rating": 5.0,
    "likes": 11
}