{
    "url": "https://www.db.com/news/detail/20210706-deutsche-bank-in-china-is-top-bond-connect-market-maker-for-the-third-consecutive-year?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 6, 2021",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank in China is top Bond Connect market maker for the third consecutive year",
    "body": "Deutsche Bank China has once again been awarded “top market maker” by Bond Connect for the third year running.\nLaunched in 2017 to connect mainland China and Hong Kong bond markets, the bond scheme has since become the primary channel for international investors in China’s Interbank Bond Market. Right from the start, Deutsche Bank has been among the top three foreign banks in terms of client base and transaction volumes.\nChina Head of Global Emerging Market Trading at Deutsche Bank, Zhaoting Xu, says: “We have witnessed phenomenal northbound investment growth since Bond Connect launched. The increasing allocation to RMB assets by global investors will continue, driven by continued low global rates, bond index inclusion, and the opening up of China’s capital market. With the most comprehensive capital market solutions in mainland China and global expertise, we are ready to support more global investors tapping into China market and are increasingly helping Chinese clients diversify their portfolios globally.”\nFacts and figures at a glance\nAs of the end of June this year, 78 out of the world’s top 100 asset managers from 34 jurisdictions had set up 2,650 unincorporated accounts across 695 financial institutions to invest in the China Interbank Bond Market.\nIn April this year, Bond Connect recorded the highest ever trading volume in a single day of 49.61 billion renminbi (7.68 billion US dollars). Average daily turnover reached 30.53 billion renminbi (4.73 billion US dollars) in June 2021.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}