{
    "url": "https://www.db.com/news/detail/20210705-catalyst-podcast?language_id=1",
    "language": "EN",
    "article_type": "Media Release News",
    "publish_date": "July 5, 2021",
    "tags": [
        "Asia-Pacific",
        "Digitalisation"
    ],
    "title": "Catalyst podcast",
    "body": "Deutsche Bank has just launched a new podcast series: Catalyst. Crafted by the bank’s Innovation Network, which plays a central role in the bank’s digital strategy, the podcast is part of Deutsche Bank’s efforts to explore and learn from how organisations across various industries are dealing with and reacting to the transformation, disruption and innovation around us today.  \nWith the first season reflecting specifically on developments in Asia Pacific, the series will feature individuals at the helm of new-economy companies such as Wise, Shopee and Zalora, enabling colleagues at Deutsche Bank to draw upon key learnings that can be applied back to financial services and to enhance clients’ experience. \nThe first episode kicks off in the financial services industry, with Head of APAC Strategy & Innovation at Deutsche Bank, Marcus Trotter, chatting with Samarth Bansal, APAC Business Development Lead from Wise, about the rise of digital banks and how they are challenging and reimagining the sphere of payments. An ex-programmatic trader at Goldman Sachs, Samarth is a fintech explorer with a firm belief that the future of this space will be shaped by increased ecosystem partnerships that are ultimately centred around the customer.\n“We are really excited to share the new podcast series, Catalyst. There is a lot we can learn from other organisations within and beyond financial services and through these conversations we hope to spark ideas and insights. This is a fantastic initiative from the Innovation Network Team in APAC”, says Luc Mériochaud, Global Head of Innovation Network and Corporate Venture Capital at Deutsche Bank. \nListen now to Episode 1 “Is the future of payments borderless?”\nAlso available via Spotify.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 3
}