{
    "url": "https://www.db.com/news/detail/20210705-emirates-first-to-launch-new-industry-payment-solution-in-partnership-with-deutsche-bank?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "July 5, 2021",
    "tags": [
        "Corporate products",
        "Private products"
    ],
    "title": "Emirates first to launch new industry payment solution in partnership with Deutsche Bank",
    "body": "Emirates announced the launch of Emirates Pay a new account-based payment method for purchasing air tickets. Emirates Pay is now available for Emirates customers in Germany and the UK who are purchasing tickets via emirates.com. \nEmirates is the world’s first airline to launch this payment alternative powered by a white-label solution jointly developed by the International Air Transport Association (IATA) in partnership with Deutsche Bank.\nMichael Doersam, Chief Financial Officer at Emirates said: “We’re pleased to be the first airline to roll out this new account-based solution for our customers. Our aim is to provide our customers with choice, convenience, and the best possible experiences at every touchpoint. Customers who don’t have a credit card, and those already using direct payments for other purchases, will welcome the simplicity and security of this method when making travel purchases. When it comes to payments solutions, we’ve always kept close to the latest innovations so that we can offer our customers in different markets the most secure and convenient options.”\nChristof Hofmann, Global Head of Corporate & Payment Solutions at Deutsche Bank said: “We are very proud that Emirates, which is widely recognized as one of the world’s best airlines, is the first airline to implement the new payment solution. The launch of Emirates Pay not only sends a very positive message to all of us that the airline industry is putting COVID behind, but more importantly that Emirates is clearly focused on improving client experience at the transactional level when moving into a brighter, post COVID world.”\nTechnical information:\nEmirates Pay is an alternative method for travellers to pay for air tickets purchased online by directly debiting their bank account.\nIt is based on real time payments and Open Banking / Request-to-Pay schemes.\nWith this new solution the airline provides all the necessary account and payment information and passengers approve the payment initiation in a convenient way via their online or mobile banking.\nFor airlines, the new payments solution offers a cost-competitive payment alternative with faster settlement times, supporting enhanced airline liquidity as well as reduced payment fraud.\nFor consumers, the new payments solution addresses the demand for more secure and frictionless payment options, including account-to-account payments, for which a card is not required.",
    "number_of_ratings": 3,
    "rating": 3.7,
    "likes": 11
}