{
    "url": "https://www.db.com/news/detail/20210701-celebrating-young-leaders-driving-social-change?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 1, 2021",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Celebrating young leaders driving social change",
    "body": "Innovative business models led by young leaders have been selected as the five Deutsche Bank Awards for Creative Entrepreneurs (DBACE) 2021 competition winners to secure funding from a pot of 60,000 pounds and 12-months of expert business guidance for their socially driven ventures.\nDBACE, a flagship Corporate Social Responsibility (CSR) programme forming part of the bank’s Made for Good social enterprise pillar, recognises the increasing need to empower talented 18-30 year olds, both during and in the wake of the pandemic. Delivered in partnership with not-for-profit creative industries incubator MeWe360, the awards seek to enable as many young visionaries, regardless of their background or stage of their business, the opportunity to progress through resources, advice and expert webinars.\nAnnounced via Zoom to an audience of industry experts and Deutsche Bank employees, the winners were revealed at a celebratory event by Reuben Christian, Edutainer and Creative Confidence Coach. The five winners are:\nAmeenah Begum, Founder of Cos Colours, repurposes waste produced by the cosmetics industry by upcycling make-up into watercolour paint.\nCharlie Blair, Founder of The Blair Academy, reaching over 5,000 people across care and community settings so far, the Academy combats loneliness and promotes the improvement of physical and mental health through hip hop dance.\nJameisha Prescod, Founder of You Look Okay To Me, an online space for the chronic illness community. The platform aims to expand into a film production company, telling more stories about how illness, race and cultural identities collide.\nNahum McLean, Founder of African Diaspora Dance Association (ADDA), an organisation aiming to expand the curriculums and the training of dances that fall under the African Diaspora.\nNeba Sere, Selasi Setufe and Akua Danso, Co-Directors of Black Females in Architecture (BFIA), a social enterprise and global membership organisation with almost 400 members offering shared knowledge, advice, guidance, access to the personal networks, job opportunities and more.\nIn addition to the winners, five additional shortlisted applicants will receive DBACE business support bursaries, benefiting from tailored guidance and industry mentoring. \nEstablished in 1993, DBACE is the UK’s longest running awards for the creative industry. The expert MeWe360 team will now develop a 12-month tailored business and leadership programme for each winner to help take them one step closer to achieving their ambitions.\nThe creative industries remain one of the hardest hit from the pandemic, and yet despite the challenge the leaders and thinkers who make up the sector are adapting their businesses to be resilient to the impact. We are proud to celebrate and support these innovators through DBACE year on year. Sitting at the heart of Deutsche Bank’s social responsibility strategy within our Made for Good social enterprise pillar, the awards receive hundreds of applications and the competition is fierce. We’ve recognised the quality of ventures and ideas increasing year on year, which is why we upped the prize fund by an extra £10k to a £60k prize pot for the 5 winners, alongside bespoke business support from our excellent partners MeWe360. This year’s breadth of creativity and drive for positive social impact combined with potential for leadership gives reason to be optimistic about the road ahead for our winners.\nLareena Hilton, Global Head of Brand & CSR, Deutsche Bank\nKevin Osborne, founder and CEO, MeWe360 says: “Now in our third year of partnership with Deutsche Bank in delivering and helping to shape the DBACE programme, it is with great excitement that we welcome the five DBACE 2021 winners to our 12-month incubator programme. Alongside the funding awarded, our individually tailored business support, access to networks and peer learning are critical to help ensure the five winners' enterprises come to fruition. We look forward to seeing these individuals flourish as creative changemakers.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}