{
    "url": "https://www.db.com/news/detail/20210831-christian-sewing-s-speech-at-the-wirtschaftstag-2021?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "Berlin, August 31, 2021",
    "tags": [
        "Europe",
        "Company",
        "Corporate products",
        "Digitalisation",
        "Private products",
        "Research",
        "Strategy",
        "Sustainability"
    ],
    "title": "Christian Sewing's Speech at the Wirtschaftstag 2021",
    "body": "Dear Ladies and Gentlemen,\nThe title of our panel fits perfectly. But the question is not whether we need a \"fresh start\" after Covid. The question is what it needs to look like in order to succeed.\nWhat is the challenge?\nIt will not work without a fresh start. In order to secure competitiveness and prosperity in Europe and at the same time combat climate change, gigantic investments are necessary.\nThe question is: who can – and who should – shoulder them? And: how can we create the conditions to invest effectively and efficiently and for it to happen quickly?\nFor one thing is clear: we are dealing with a race – a race along two major trends. Digitalisation has only gained further speed due to the pandemic. Here, however, we in Europe are already far behind the US and China in consumer business. And we now have to be careful that we don't lose out in the industrial sector as well. We may not have Silicon Valley, but we do have a vibrant and innovative German Mittelstand sector. This is our unique competitive advantage, which we must not only protect, but expand.\nAt least with regard to the second megatopic, sustainability, things are looking better. In many green technologies, Germany and Europe have a head start. But let's not fool ourselves: the global competition has woken up. Here, too, we have to accelerate if we don't want to squander our opportunities.\nSo what is our answer?\nThere are many aspects, but one is of particular importance: we need to mobilise private sector resources to the greatest possible extent. To be sure, government investment can act as a catalyst – building infrastructure and targeting industries that are critical to our future competitiveness. But ultimately, what will matter most is that we keep private capital in Europe and channel it to Europe.\nHere, the Americans are far ahead of us – both in terms of the depth and breadth of their capital market. We urgently need to catch up – based on strong banks and significantly better market conditions.\nFour factors are crucial for this, and they must finally move further up the political agenda:\nFirst, we need a true single financial market in Europe. I would go as far as to say that this aspect is of existential importance for Europe. Without an integrated European capital market, there can be no Green Deal. And we often overlook that government investments can be managed much more efficiently in combination with a stronger private capital market.\nSecond, we must finally strengthen funded pension provision. In this way, we will not only generate funds for investments, we will also link the prosperity of the people even more strongly with the success of our companies – and at the same time work against the threat of old age poverty. This in turn will also strengthen the social market economy as a whole.\nThird, we must set the right priorities regarding regulation. It was important that we made our banking system more secure over the past 10 years. Now, however, we must also monitor how we can enable the transformation of the economy. That is why we should not, for example, introduce capital requirements right now that do not take European economic structures into account – that’s what the discussion on Basel IV is about. A social market economy does not mean that regulation should become the dominant factor for the economy.\nAnd fourth, we must return to a more normal interest rate environment as soon as possible. The US never introduced negative interest rates. The result: Eurozone banks have paid more than 30 billion euros in negative interest rates to the ECB since 2014, while US banks received more than 130 billion dollars in deposit interest from the Federal Reserve during the same period. So we are talking about a delta of more than 150 billion dollars in pre-tax profit!\nToday, we see not only more efficient banks in the US, but also an enormous economic upswing, which in turn benefits pension funds and thus the people.\nTo make Europe fit for the 2020s, however, we need not only more investment, but also a different attitude.\nWhat do I mean by that?\nWe have to learn to be simple, fast and courageous again, instead of slow, complicated and over-cautious.\nWe have to think about more Europe and bigger, instead of falling back into small-scale nationalism – because only then will we really be able to use the advantages and achievements of Europe.\nWe must finally accept that we are in a tough global competition for prosperity and technological leadership. And the outcome of this competition will determine where we will be in 50 or 100 years as an economy and therefore also as a society.\nIn short: Germany must live up to its role: we are the fourth largest economy in the world, we should act like it and not be afraid to take a leadership role in Europe. And that also means that we must always keep Europe's stability, including its financial stability, in mind.\nWe must embrace competition instead of protecting ourselves from it; invest in prosperity instead of conserving it; strengthen Europe instead of overburdening it with complicated rules.\nLet me be clear: I am deeply convinced of our potential in Germany and Europe. In Germany in particular, I see great foundations. But we now need the focus, the clarity, the determination and the leadership to implement the necessary steps.\nIn all of this, however, ladies and gentlemen, there is a condition without which it cannot be done: we must put the coronavirus pandemic behind us, and there is only one way to do this: vaccinate, vaccinate, vaccinate. Not only in the industrialised countries, but worldwide, especially in poorer countries. Every euro we spend on this is well spent.\nNow I am looking forward to Christian Lindner's speech and then to our discussion on how we can best make a fresh start. Thank you very much.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 19
}