{
    "url": "https://www.db.com/news/detail/20210818-deutsche-bank-wins-best-emerging-markets-fx-trading-platform-at-the-fx-markets-asia-awards-2021?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "Singapore, August 18, 2021",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank wins Best Emerging Markets FX Trading Platform at the FX Markets Asia Awards 2021",
    "body": "Deutsche Bank’s leading market making capabilities and innovative platform offerings in Asia were recognised at the FX Markets Asia Awards 2021. The bank won Best Emerging Markets (EM) Trading Platform of the year.\nJudges lauded the bank for its breadth of EM products and relevance to clients across the region. As a key market maker in the region, Deutsche Bank provides liquidity across multiple asset classes in large sizes and long tenors in these markets, utilizing its intricate setup and innovative platforms to provide corporate and institutional clients with access to Global Emerging Markets (GEM) across Asia and the rest of the world.\nThe bank has built a unique platform across Asia that seamlessly connects onshore and offshore markets, supported by its trading capabilities, broad-based product suite, strong regulatory relationships and innovative structuring capability. One example is GEM Connect, a component-based solution developed by the bank’s Corporate Bank and Fixed Income & Currencies business in APAC, which links treasury processes together into automated workflows, simplifying complex processes for clients such as collections, payments, funding and FX in capital-restricted APAC markets.\nAshok Kumar Das, Head of Asia Local Markets, Fixed Income & Currencies said: “Despite the volatile market environment during the onset of COVID-19, we were able to provide consistent liquidity across all asset classes and markets, providing competitive pricing when overall market liquidity was significantly reduced compared to normality. This has enabled recent gains in our market share across Asia.”",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 5
}