{
    "url": "https://www.db.com/news/detail/20210809-female-fintech-competition-2021?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "August 9, 2021",
    "tags": [
        "Digitalisation",
        "Entrepreneurship"
    ],
    "title": "Female FinTech Competition 2021",
    "body": "Deutsche Bank has once again joined forces with Atos, Google Cloud and TechQuartier to launch the third annual Female FinTech Competition.\nFinTechs with a female founder or female(s) in the top management groups are invited to enter the competition to pitch their business case. Prizes will be offered from the hosting companies. Winners will have the opportunity to access and benefit from the hosts’ expertise and resources, including spending time with relevant coaches.\n“Gender diversity is much-needed in the FinTech sector. There is plenty of evidence that greater gender diversity results in more successful new ideas, products and services. The Female FinTech competition is a fantastic opportunity to showcase technology talent, it is also a way for Deutsche Bank to engage and support a community of female founders. After the incredibly high standard of pitches at last year’s event I am excited to meet the 2021 contestants,” said Gil Perez, Deutsche Bank, Chief Innovation Officer.\nJoining Perez on the judges panel are Lucas Schmitt, Head of Innovation Products at TechQuartier, Laurence Lafont, VP Industry Sales EMEA Google Cloud, and Carol Houle, SVP Global Head of Consulting and Marketing in Financial Services and Insurance market at Atos.\nAhead of the event the hosting organisations will offer a coaching event on August 31, 2021 during which they will share their expertise and perspectives on how to create a winning business case in order to access capital and resources to grow your Fintech. More details to follow.\nThe Atos global FinTech Programme includes the FinHub, a fast-track onboarding programme with access to Atos’ network of major financial services companies with legal and go-to-market support from Atos. It also includes access to Atos Financial Services Sandbox, through which Atos helps FinTechs develop their offerings by combining expertise and solutions to test, create and develop new services.\nWomen who are interested in coaching competition entrants are also encouraged to register on the competition site to share their industry and/or technical knowledge and experience.\nEntrants should register their interest in participating or coaching in the competition by September 24, 2021. Business cases must be submitted by October 1, 2021. Six successful teams will be shortlisted in early October and winners will be announced during the finals of the competition that will be held virtually on October 21, 2021.\n2020 winner Seema Khinda Johnson from Nuggets said, “Winning is a huge boost for us, given the opportunities to work with Deutsche Bank, Atos and Google. Alongside credibility, it shines a light on the urgent need for Nuggets, the importance of a verified digital identity and creating trust in transactions, to the wider business community.\"",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 14
}