{
    "url": "https://www.db.com/news/detail/20210804-matchable-a-new-way-to-volunteer-for-social-good?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "August 4, 2021",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Matchable: A new way to volunteer for social good",
    "body": "From finance and technology, to networking and product development, Deutsche Bank employees have a wealth of skills to offer, at work and outside. These skills can go a long way towards supporting charities, non-profits and impact start-ups, especially at a time when many need the extra help.\nThat’s why in the UK Deutsche Bank is launching a pilot Corporate Social Responsibility (CSR) partnership with Matchable, a tech for good platform reimagining volunteering. The partnership matches employees’ unique skills with ambitious non-profits and impact start-ups, enabling these organisations to focus on essential services while advancing their causes.\nBridging the skills gap in the third sector\nThe third sector has been hit especially hard by the pandemic, with a 6.4 billion pound loss of income for the UK's charities, leaving 1 in 10 facing bankruptcy*. This is at a time when their services have become ever more important with growing demand.\nSkills-based volunteering allows qualified professionals to lend their expertise to the third sector, helping to ease the resource constraint while providing skilled expertise that can be hard to find.\n“Employees have a fantastic set of insights and experience that can really help transform an organisation’s impact. The time, advice and skills offered by employees are simply out of reach for the impact start-ups, non-profits and charities we work with,” says Matchable Founder & CEO Wai Foong Ng.\nFreedom of choice, time and interest\nThe partnership offers UK employees the opportunity to select from a range of projects with pioneering start-ups, charities and social enterprises worldwide. All projects are curated to ensure measurable impact, ambitious thinking and realistic outcomes so employees can make the biggest difference in the time they have – from 30 minutes to 3 months and beyond.\nThe variety of projects on the Matchable platform and flexibility of commitment means that there is something for everyone.\nAmy Harris, Head of Corporate Social Responsibility UK adds, “This is a powerful and meaningful way for employees to strategically share their skills and make a positive impact for marginalised and disadvantaged communities anywhere in the world. We are especially pleased as Matchable benefitted from our CSR Made for Good social enterprise project Women in Social Tech in 2019. It’s fantastic to see how the project’s business support and guidance has helped them grow to where they are now.”\n* Source: https://www.theguardian.com/world/2020/jun/09/coronavirus-leaves-one-in-10-uk-charities-facing-bankruptcy-this-year ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}