{
    "url": "https://www.db.com/news/detail/20210803-best-international-transaction-and-trade-finance-bank-in-asia-pacific-and-more-wins-for-client-solutions?language_id=1",
    "language": "EN",
    "article_type": "Corporate Bank News",
    "publish_date": "August 3, 2021",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Best International Transaction and Trade Finance Bank in Asia Pacific and more wins for client solutions",
    "body": "Deutsche Bank’s leadership in cash management, payments, and trade and supply chain finance in Asia Pacific was recognised at The Asian Banker – Transaction Finance Awards this week. The Bank was named Best International Transaction Bank in Asia Pacific, and retained its top positions for Best International Trade Finance Bank in Asia Pacific (Four years in a row) and Best Global (EURO) Clearing Bank in Asia Pacific (Seven years in a row).\nDeutsche Bank also took home the Banker’s Choice Awards for it’s innovate digital solution for real-time loan disbursements for Home Credit India Finance, and for a bespoke export document handling solution for Hyundai Corporation.\nThe Asian Banker Transaction Finance Awards recognises financial institutions’ achievements in corporate and transaction banking based on market share, uniqueness and quality of products and services and operational excellence. The winners for these awards are determined through a combination of surveys, interviews and field research by The Asian Banker’s research staff.\nDavid Lynne, APAC Head of Corporate Bank and Fixed Income and Currencies, said: “The impressive tally of awards from this and other outlets is an excellent recognition of the resilience and determination of our teams to respond to changing client needs and deliver the best solutions for them. As we continue to work together to strengthen our platform and stay focused on serving our clients, I’m confident that we will see more wins ahead.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}