{
    "url": "https://www.db.com/news/detail/20220330-deutsche-bank-wins-ministry-of-finance-thailand-s-sustainability-bond-contributor-award?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 30, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank wins Ministry of Finance Thailand’s Sustainability Bond Contributor award",
    "body": "Deutsche Bank was awarded Sustainability Bond Contributor by Thailand’s Ministry of Finance (MoF), the first for a foreign investment bank at the ThaiBMA Best Bond Awards 2021, held on 30 March 2022.\nThe MoF’s Sustainability Bond Contributor accolade is granted to active bond players who have significantly contributed to primary and secondary market activities of MoF’s inaugural sustainability bond issuance, the first of its kind in Southeast Asia [1]. The sustainability bond was first issued in August 2020 to fund the government’s green infrastructure and social relief programmes related to Covid-19.\nAdditionally, the Sustainability Bond Contributor is recognised for its role in promoting activity in Thailand’s government bond market through direct investor outreach and education, as well as active engagement with bond market stakeholders.\nDeutsche Bank Head of Global Markets and Head of ICG, Thailand, Ms. Teerada Tuppun said, “Social and sustainability bonds have a key role to play in alleviating the unprecedented economic and social disruptions brought upon by the Covid-19 pandemic. We are honoured to have contributed in growing onshore and offshore liquidity for MoF’s first-ever sustainability bond, and remain committed to working closely with the ministry to drive its efforts in achieving economic growth that is sustainable and inclusive.\n“This award is not just testament to the strength of our local market expertise, but more importantly the role we can play in sustainable development.”\nThe ThaiBMA Best Bond Awards seek to recognise exemplary organisations and individuals who have contributed to development of Thailand’s bond market, in both the public and private sectors. It is organised by the Thailand Bond Market Association, a regulatory association under Thailand’s Securities and Exchange Act. Award winners are determined based on nominations by a panel of jury as well as participants in the bond market.\nThailand’s local currency bond market has developed rapidly over the past decade, as the government continued to support the country’s economic development. \nAs of September 2021, the local currency bond market had a total notional outstanding of THB14.5 trillion (US$430 billion), more than doubled from THB7.1 trillion (USD$229 billion) in 2011. Government bonds contributed to a 73% share of total bonds in the September 2021 period[2].\nFor further information please contact:\nDeutsche Bank AG Media Relations\nDerrick Tee\nPhone: +65 8788 5403\nEmail: derrick.tee@db.com                                 \n  [1] Source:\nPDF\nThailand’s Inaugural Sustainability Bond Issuance is well received\n\n[2] Source: AsianBondsOnline",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 6
}