{
    "url": "https://www.db.com/news/detail/20220322-india-using-the-sun-to-secure-clean-tap-water-supply?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 22, 2022",
    "tags": [
        "Asia-Pacific",
        "Corporate Citizenship"
    ],
    "title": "India: using the sun to secure clean tap water supply",
    "body": "Deutsche Bank is helping to bring fresh water to 50,000 people in the Raigad district of Maharashtra, India using solar-powered pumps. Through its regional Corporate Social Responsibility (CSR) In The Community partnership with the Swades Foundation, Deutsche Bank has brought clean drinking water to 12,000 households in India since 2016.\nDirect access to fresh water is life-changing for communities in Maharashtra. Instead of walking miles to fetch clean water every day, people can use the time to make a living. The pumps we helped Swades supply were previously powered by electricity from the grid but supply is expensive and can be unreliable in remote parts of India.\nFor example, after cyclone Nisarga hit Maharashtra in June 2020,  Chiklap village was without electricity for two months. The households in Chiklap also had to bear the monthly maintenance costs for electric pumps, amounting to a total of around 24,000 Indian rupees per year (around 280 euros at the current exchange rate).\nSince switching to solar in December 2021, Chiklap’s electricity costs have come down drastically and maintenance costs are down to a third of what they used to be. Nishant Katalkar, the Village Development Committee president of Chiklap, said, “We are forever grateful to the Swades Foundation and Deutsche Bank. We can save more than 16,000 Indian rupees (about 190 euros) annually on the electricity bill. Swades Foundation’s initiatives have always brought peace and happiness to our village.” As part of this effort, 34 solar-powered water schemes have been installed in the district, impacting a total of 1,800 households.\nThrough our long-standing partnership with the Swades Foundation, Deutsche Bank has also funded irrigation projects to help over 1,000 farmers access water for agriculture to increase their yield and annual income. The bank’s CSR efforts have also helped plant 40,000 fruit trees to boost social and economic development in Maharashtra’s rural communities.\nPhotos provided by Swades Foundation.",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 8
}