{
    "url": "https://www.db.com/news/detail/20220321-job-search-site-launched-for-ukrainian-refugees?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "London, March 21, 2022",
    "tags": [
        "Careers",
        "Digitalisation"
    ],
    "title": "Job search site launched for Ukrainian refugees",
    "body": "JobAidUkraine is a website that matches open roles with Ukrainian refugees fleeing the war,\nOver 6,000 postings and 27,000 role searches every day\nDeutsche Bank helped to find volunteers to improve the site and was a frontrunner in posting roles\nJobAidUkraine is a free-to-use site that encourages companies to post available jobs and matches them with Ukrainian refugees who express an interest. Both fully remote roles and those that are based in specific locations can be listed on JobAidUkraine.  \nThe website provides a simple opportunity for companies to post open roles in English and Ukrainian language, tailored to the skills of Ukrainian refugees. The process to apply for open roles is simple and straightforward. Furthermore, the website provides information for Ukrainian refugees and companies on topics such as work permits, contracts or application processes. Entrepreneurs Marcus Diekmann and Christian Weis initiated the platform and are founding the NGO JobAidUkraine e.V with other initiators to develop the project further.\nAfter establishing the website with basic functionality, JobAidUkraine and Deutsche Bank joined forces to accelerate the effort over the coming weeks. This included mobilizing global volunteers with coding experience within 24 hours from Deutsche Bank’s Technology, Data and Innovation division to support the development of the website. Further to this, Deutsche Bank was one of the first companies to publish open roles on the platform.\nThe initial impact of the website is encouraging: over 6,000 job postings, 27,000 Ukrainians searching for roles on the site every day and 490.000 page visits since launch on 1 March 2022. “We are overwhelmed by the response to the job platform, which has been created with volunteers,\" explains entrepreneur and initiator of JobAidUkraine Marcus Diekmann. \"In the future, even more refugees will come to us, that is foreseeable for everyone. Good integration only succeeds with job prospects - and we as a European society can help. We stand with Ukraine, together forward.\"\nThe website is continuously developing to include intelligent technology that supports the matching process. This includes recommendations to both refugees and employers on roles and candidates respectively and video applications instead of traditional CVs.\nThe site is a proposed first step for helping people that are displaced by conflicts globally to find new jobs.\n“JobAidUkraine is an example of how quickly support can be set-up to help solve a critical challenge many people are suddenly facing today,” says Rafael Otero, Head of Corporate Bank Technology at Deutsche Bank.  Michael Ilgner, Head of HR and Real Estate at Deutsche Bank, added: “Our thoughts are with the people of Ukraine and we encourage companies to take a look at the website and join us in posting open roles.”",
    "number_of_ratings": 7,
    "rating": 2.7,
    "likes": 19
}