{
    "url": "https://www.db.com/news/detail/20220310-a-message-from-christian-sewing-on-idd?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 10, 2022",
    "tags": [
        "Strategy"
    ],
    "title": "A message from Christian Sewing on our strategy and today's Investor Deep Dive",
    "body": "Dear Colleagues, \nWe have been working towards today's Investor Deep Dive across all areas of our bank so that we can present investors and analysts, clients, journalists and, of course, all of you with a solid blueprint for our bank’s future path. \nNow, like so much else, this day is overshadowed by Russia's attack on Ukraine. We condemn this aggression in the strongest possible terms. Our thoughts are with the people in the war zones and their terrible suffering as well as with the many refugees who have to leave their homeland, not knowing whether they will ever be able to return. We are particularly thinking of our colleagues in Ukraine, but also in Russia.  \nWe do not know today what the consequences of this war will be. And no one can fully assess the extent to which the crisis will affect the economy, our clients or, indeed, our bank.  But I can assure you that we have been risk managing the situation since early on. We began scenario planning last year and reduced our exposure to Russia significantly. As a consequence, our risks today are well contained. We published details on this on Wednesday evening. \nTwo aspects are important to us in this context: firstly, we will continue to support our clients in a spirit of partnership and remain part of the solution for them. We are often asked why we are not withdrawing completely from Russia. The answer is that this would go against our values. We have clients who cannot exit Russia overnight. And, as far as we can, we will continue to also support them, too, at this difficult time. \nThere are, however, types of business we will cease.\nFirst and foremost, it is our duty to support the German government and its international partners in their consistent stance and all their measures. At Deutsche Bank, we are fully committed to this. It must be up to all of us to defend democracy and freedom. This is the best thing the democratic world can do now to secure the stability of the global economy and long-term prosperity. \nAt this stage, it pays off all the more that we have put our bank on a solid footing over the past four years. We are entering this difficult phase for the global economy in a very stable and resilient condition. In recent years, and especially during the Covid crisis, we have shown that we can deal with such an environment.   \nWe are in a much better position today than we were in 2018. We have a robust balance sheet, a strong CET 1 capital ratio, ample liquidity, first-class risk management and improved controls. And we are sustainably profitable, so that we can also cushion possible setbacks, which so far have not become apparent. After our good performance in 2021, we have also made a strong start to the new year and are currently on track to achieve our targeted return on tangible equity of 8 percent this year. \nAbove all, however, we have found our balance again. After years of successful transformation, we know that our strategy is the right one. And we know exactly what our bank stands for and where we are headed.\nWe have a clear aspiration: to be the Global Hausbank for our clients. You may be familiar with the term; it was the title of the book we published two years ago to celebrate our bank’s 150th anniversary. And, indeed, we have been working towards this goal in recent years. But we can become much better; in order to lend greater support to our clients and to grow as a bank. It is precisely this ambition that is at the heart of today's Investor Deep Dive. \nWhat is a Global Hausbank? Why is this mission so important to us? \nA Global Hausbank is a bank that is the first port of call for companies, institutional clients, retail and private clients and affluent individuals in all financial matters, with a global network and local expertise, with unique risk management and outstanding solution and product competence, as well as modern technology platforms. In short, a Global Hausbank is a reliable partner no matter what.\nAnd probably at no point in time since the fall of the Berlin Wall has the need for such a partner been as great as now – in an environment rife with uncertainty and volatility.\nBill Gates said in 1994 that one day banking would still be necessary, but banks would not be. The situation today, though, is a different one: granted, the range of banking services is greater, the number of financial service providers higher than ever before. But banks are needed just as much as ever – to support companies, institutional and private clients navigate an increasingly complex world. Advisory, the classic banking business, is experiencing a renaissance.  \nOur clients are not only facing the challenges that come with the current tensions; they also have to deal with macroeconomic shifts that have not been seen for decades. The phase of expansionary monetary and fiscal policy must end sooner or later. High debt and ageing societies are pushing states to their limits worldwide. At the same time, our clients have to deal with the transformation to a sustainable economy and keep pace with technological progress as it continues to accelerate.  \nWe want to be the bank that is part of the solution for our clients at this difficult time of complex challenges. And we believe that we are better equipped for this than virtually any other bank in Europe. We have the necessary expertise, product and solution competence and a vast network across the globe. Our clients appreciate that we are strong in the Americas and Asia. Together, the two regions account for more than 30 percent of our revenues.  \nWe are convinced that this opens up great potential for us to grow faster than the market in the coming years.  \nThat is why, despite all the geopolitical uncertainties, we are going into our Investor Deep Dive with confidence today. This is not about an entirely new strategy; rather it is an evolution of what we have successfully done in recent years. We have built a strong foundation. And there are opportunities to be had from our set-up with four well-positioned businesses. Building on this, we would like to give you an idea of what we want to achieve in the coming years.  \nWe will focus on four goals: \nWe are aiming for average annual revenue growth of between 3.5 and 4.5 percent, a growth rate similar to what we have achieved in the core bank in recent years. Achieving this would mean that we would reach a revenue level of around 30 billion euros annually in 2025. \nTo get there, we will make targeted investments in our strengths – in technology and our controls, in our expertise and products, and in growth areas such as sustainability. We are funding this by further reducing complexity and reinvesting what we free up in our business. By the end of 2025, we are aiming for a cost-income ratio below 62.5 percent. \nWe will invest primarily in those areas where we can achieve higher marginal returns. As a result, we expect a significant increase in our profitability. By the end of 2025, we aim to achieve a return on tangible equity of more than 10 percent – an important threshold as this would mean it is higher than our cost of equity for the first time in many years.\nIf we succeed in all this, we will be able to build up considerable amounts of capital over the next few years.\nOn the one hand, and this is the fourth goal, we want to distribute a total of eight billion euros to our shareholders for the years 2021 to 2025 via dividends and share buybacks. On the other hand, we plan to wisely invest a significant portion of this sum in our business in order to enable further growth beyond 2025 – a time frame for which we already have a clear direction in mind for our bank: we aspire to be a European market leader that can play an active role in banking consolidation on our continent. \nYou can follow today’s Investor Deep Dive live. Register using this link. During the course of the year, we will invite our investors to further events at which we will then provide information on the strategic plans of the individual businesses and on our sustainability strategy. \nTopics like this and the current environment raise many questions, which is why I am taking the time on Monday, March 14, from 1 to 2 pm CET for you to join me and ask your questions. You will receive a separate email with details of the invitation to this \"Ask me Anything\" session. \nAlthough our Investor Deep Dive is taking place today in an environment different to what we would have hoped for, it is nevertheless one more milestone on our journey. It is the prelude to a new phase, a phase in which the focus will be on efficiency, investments and, in particular, on growth. We are determined to continue the successes of recent years and we believe we are best placed to do so. \nHowever, we will only be successful if each and every one of us makes a contribution to becoming even better. Together we can achieve a lot, as we have proven in recent years. All of us in the Management Board are very grateful to you for this.  \nNow it is important to press on with just as much determination and strength, fully focused on achieving the best for our clients, for our shareholders and for our bank as a whole.  \nBest wishes, \nChristian Sewing ",
    "number_of_ratings": 3,
    "rating": 1.0,
    "likes": 15
}