{
    "url": "https://www.db.com/news/detail/20221216-knorr-bremse-rewards-its-suppliers-for-more-sustainable-business-practices?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "December 16, 2022",
    "tags": [
        "Corporate products",
        "Sustainability"
    ],
    "title": "Knorr-Bremse rewards its suppliers for more sustainable business practices",
    "body": "Knorr-Bremse is strengthening its ESG measures in cooperation with Deutsche Bank and expanding the Supply Chain Finance program to include sustainability aspects\nSuppliers with good sustainability performance benefit from more attractive financing terms\nKnorr-Bremse AG is systematically driving its ESG efforts and, with the support of Deutsche Bank, is linking its existing Supply Chain Finance program (SCF) to ESG ratings of suppliers. By providing financial incentives to promote increased sustainability among its suppliers, Knorr-Bremse is taking another decisive step towards creating more sustainable value chains.\nFor 15 years now, suppliers of Knorr-Bremse have benefited from the Supply Chain Finance program run by Deutsche Bank. For example, they get their money sooner because the bank pre-finances at attractive interest rates until Knorr-Bremse pays the invoice. The financing costs for the suppliers are based on the creditworthiness of Knorr-Bremse, which usually reduces the financing costs for the suppliers.\nAdding sustainability components to the program increases these financial benefits for the suppliers; those who operate more sustainably are rewarded with even better financial terms. In this way, the global program will gradually encourage more and more suppliers to improve their ESG measures.\nFrank Markus Weber, Chief Financial Officer and Executive Board Spokesman of Knorr-Bremse AG: \"Our Supplier Early Payment Program is becoming more sustainable: With our Syndicated Loan and our Sustainability Linked Bond, we have already shown how financing instruments and sustainability can be combined in a meaningful way.\nThe Sustainability Linked Supply Chain Finance Program, implemented in collaboration with Deutsche Bank, is now the third financing instrument with which we at Knorr-Bremse are specifically promoting sustainability. The financial benefits arising from the latest program make an ESG rating particularly attractive for suppliers, creating a win-win situation for both sides: for our suppliers and for us as Knorr-Bremse.\"\nJan-Philipp Gillmann, Head of Corporate Bank EMEA, Deutsche Bank: \"Sustainability-linked Supply Chain Finance programs enable our clients to create an incentive for their suppliers to be more sustainable. By improving their ESG rating, suppliers can further reduce financing costs together with their clients.\"\nSuppliers in the Sustainability-linked Supply Chain Finance program (SSCF) can choose between two ESG rating providers: Ecovadis and NQC. Thus, the program provides more flexibility compared to similar offerings. This is NQC’s debut in an SSCF program. NQC’s supplier assurance platform is used by many global automobile brands to assess their suppliers.",
    "number_of_ratings": 10,
    "rating": 3.0,
    "likes": 27
}