{
    "url": "https://www.db.com/news/detail/20221215-meet-our-esg-experts-chris-jaques?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 15, 2022",
    "tags": [
        "Sustainability"
    ],
    "title": "Meet our ESG experts: Chris Jaques",
    "body": "Chris, what are you working on right now?\nWe recently released our first set of net zero targets complementing the carbon footprint of our corporate loan book that we released earlier in 2022. Since then, we have been integrating these aspects into our decision making in our Net Zero Alignment Forum demonstrating how we are managing our pathways towards these targets. These are new tools and resource aspects for us as a bank to manage.\nWhat are your next steps?\nIn the coming year, we will continue to build and integrate our risk management capabilities across the ESG spectrum, with a focus on developing our public disclosures and enhancing our ability to measure and most critically manage our exposure to climate risk. More sector targets will definitely come in areas such as real estate.\nHow does Enterprise Risk Management support clients’ transitions to low-carbon models?\nWe partner closely with the business and coverage teams as well as the Sustainability Office to assist the transparency around carbon measurement and approaches. Net zero should be a win/win for both us and our clients. Our clients’ transitions to a low carbon economy are not risk free – we must also have a comprehensive understanding of associated risks, such as physical risk like the flooding in Germany or global wildfires as well as traditional risk areas like credit risk. By understanding our own vulnerability and exposure to these risks, we can guide our colleagues, who can then guide our clients towards net zero.\nNet zero should be a win/win for both us and our clients\nChris Jaques\nYou model climate risk – what does that mean?\nOur general operating mantra in Risk is “no surprises”, so we have worked both internally and with industry peer groups to refine methodologies and approaches to modelling climate risk. Crucially we need a forward-looking modelling approach for these events, such as global warming and increased event risk. It’s a new world for us. There is a wide array of challenges around ESG in both financial and non-financial risk terms; our job is to have an objective view of the risks and find ways to develop and integrate models and frameworks in a similar way to our normal standards of rigor around risk.\nOur general operating mantra in Risk is “no surprises”\nSo you’re embarking on new territory?\nYes, especially if you factor in the rapidly evolving approaches to data, methodologies and models in this space. Take the recent ECB stress test: this was the first ever climate risk stress test run by the ECB – some parts of the stress test examined the impact of climate risk on Deutsche Bank over the next three decades, we do not replicate such a long duration view on any other risk type. Therefore, we need to work out how to better model and integrate climate risk stress testing. A lot more work needs to be done collectively in the industry around how to design and use stress tests in climate risk to effectively steer banks in the right direction.\nCan you talk to us about the corporate loan portfolio as an example of risk modeling?\nOur corporate loan portfolio is a key concentration within our scope 3 emissions. We model the carbon emissions across all industries but in particular the carbon intensive sectors like auto, oil and gas, power and steel. We also analyse the key client contributors and the impact of varying data and methodological approaches. e. Collectively across the 1st and 2nd lines we have formed the Net Zero Alignment Forum where we look at transactions and these developments from all perspectives. This helps in demonstrating how active the dialogue is now within the Bank on this topic.\nESG data is notoriously hard to come by; how do you move forward without the data you need to model risk?\nThe measurement of emissions and lack of accurate data are major challenges for everyone dealing with climate risk. We work on certain approaches to deal with the lack of data and to proxy data when we don’t have specific client disclosures. Equally, where we have client data, we must ensure that it is credible. The data space will continue to improve, I hope rapidly, as we get better data and better ways to analyse it. Right now, it is vital that we are transparent with what we’re doing and how we’re dealing with data so people can understand the numbers. Of course, greater impetus from governments and regulators to enhance data disclosures would be hugely beneficial.\nThe measurement of emissions and lack of accurate data are major challenges for everyone dealing with climate risk\nDeutsche Bank aims to restrict activities that cause clear damage to the environment. What role does Enterprise Risk Management play?\nWe are bringing transparency to this space, internally and through disclosures of the bank’s involvement and public impact. And that’s important because it helps us make tangible progress and support our credibility, for example by setting 2030 reduction targets and outlining our pathway to net zero.\nOur clients come from very different economies in very different stages of economic development. Can a one size fits all approach work here?\nWe do not have a one size fits all approach. It’s not enough to have transition, we need a just transition. Our job is not to walk away from activities with our clients that are carbon intense; our job is to enable those clients to transition while also understanding the broader impacts of not just the environmental, but also societal impacts. Imagine a carbon intense company that employs a significant number of people in a weak economy. In a worst-case scenario, it shuts down and all those people lose their jobs. Instead, we can help that company work towards a lower carbon model that benefits the environment and takes the social aspect into account at the same time.\nIt seems that the E gets more focus than the S and the G…\nSimply put there is huge dispersion within the term ‘ESG’. Equally we have new challenges and complexity that are inextricably linked to, for example, fossil fuels with the energy crisis in Europe right now. This requires greater investment to enable energy security and to expedite renewables, and it will take time. In the short term, we need other suppliers of fossil fuels to support this energy security, and as a Bank there will be financing requirements. This may present volatility with our net zero strategy in the short term. As a global bank, we look at and incorporate the complexity of different countries, client bases and sectors, and our understanding, expertise and analysis helps us manage the associated risks.\nTen years ago, climate risk did not touch my job at all. Now there’s not one day that I don’t have ESG discussions in my diary\nESG is in sharp focus in every aspect of business and finance. How has the topic grown for you?\nTen years ago, climate risk did not touch my job at all. Now there’s not one day that I don’t have ESG discussions in my diary. The bank is committing more resources to ESG and Risk is a key component of that – we have dedicated ESG teams within CRO and specifically a climate risk team in ERM.\nEnterprise Risk Management can trigger a lot of change. How do you create awareness for ESG and climate risks across Deutsche Bank?\nFirstly, we cooperate closely with the businesses and the Sustainability Office. Secondly, we say that everyone is a risk manager, and it’s true: but now everyone is also an ESG risk manager, because there are very few areas in which ESG doesn’t touch someone’s day job in some aspect. It’s not just about having dedicated staff, but about getting the knowledge, expertise and awareness to all of us who work within the Bank.",
    "number_of_ratings": 30,
    "rating": 2.6,
    "likes": 13
}