{
    "url": "https://www.db.com/news/detail/20221214-deutsche-bank-achieves-industry-first-for-its-internal-agile-coaching-programme?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "December 14, 2022",
    "tags": [
        "Digital banking & services"
    ],
    "title": "Deutsche Bank achieves industry first for its internal agile coaching programme",
    "body": "In a first for the financial services industry, the International Consortium for Agile (ICAgile) has accredited Deutsche Bank for its internal Agile Coaching programme.\nThe agile way of working is spreading rapidly throughout Deutsche Bank and is helping to continuously deliver value to power the bank’s transformation. The accreditation enables the bank to issue certificates to employees who successfully pass the internal agile coaching course and meet the high standards set by ICAgile.\n“We applaud Deutsche Bank’s pioneering level of investment in creating a transformational coaching capability,” said Shannon Ewan, ICAgile’s Managing Director. “Over the years, we’ve seen the tremendous power of effective coaching for catalysing transformation in people and organisations. Furthermore, by doing this in-house, Deutsche Bank can tailor this globally-recognised learning journey to maximise its relevance and impact within its culture.”\nThe first cohort included agile coaches, transformation leads, product owners and those in a leadership roles across Europe and Asia regions. The course includes 40 hours of synchronous education split over a minimum of 4-6 weeks. Between lessons, participants are required to practice what they have learnt and bring insights into the next class.\n“We focus on empowering our own people in any role, and at any level in the organisation to develop the skills and competencies required for Agile coaching,” said Mo Koujan, who leads Deutsche Bank’s internal coaching programme and supports teams across the organisation as Enterprise Coach. “With this initiative we are strengthening our internal capabilities to support our bank’s agile transformation.”\nThe education focuses primarily on the mindset, roles, and responsibilities of an Agile Coach. On meeting the certification requirements, participants would have demonstrated their ability to differentiate between key Agile Coaching dimensions of mentoring, facilitating, professional coaching and teaching, and will also gain the skills needed to create a safe environment for meaningful collaboration to empower our agile teams to improve their team dynamics and agile ways of working.\nThe accreditation is a further step in accelerating the adoption of agile as a core element of Deutsche Bank’s transformation – following a formal recognition of agile roles in the bank, the introduction of an Agile Career Development Framework to showcase career paths, as well as initiatives including the Group Agility Awards. Thousands of employees across all business areas and infrastructure functions already use agile methods in their daily work.",
    "number_of_ratings": 19,
    "rating": 4.3,
    "likes": 16
}