{
    "url": "https://www.db.com/news/detail/20210630-study-funded-by-deutsche-bank-americas-foundation-urges-nyc-to-tackle-non-tuition-costs-for-city-university-of-new-york-students?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 30, 2021",
    "tags": [
        "Americas"
    ],
    "title": "Study funded by Deutsche Bank Americas Foundation urges NYC to tackle non-tuition costs for City University of New York students",
    "body": "A new report published today by the Center for an Urban Future urges the New York City mayor and City Council to provide a free MetroCard and fully subsidized textbooks for all City University of New York (CUNY) community college students. The report was researched and written by the Center for an Urban Future and made possible thanks to a grant from Deutsche Bank Americas Foundation.\nThe study finds that several thousand community college students in New York City drop out of school every year and a leading cause is their inability to afford a MetroCard, textbooks, Internet service, and other expenses beyond the cost of tuition. While the report commends policymakers working to make tuition free, it shows that as many or more community college students in the five boroughs need help affording the mountain of non-tuition costs to succeed.  \nThe report, titled Opportunity Costs, concludes that providing a free MetroCard to all community college students and eliminating the cost of textbooks will help significantly more low-income New Yorkers earn a college credential, access good jobs, and springboard into the middle class.\nWhile free tuition would help numerous students in New York, the study points out that a majority of those attending CUNY colleges already effectively pay no tuition—thanks to federal and state financial aid programs. According to the report, 58 percent of all full-time CUNY students attend tuition-free, but the numbers are likely even higher for community college students. Indeed, the average full-time community college student at CUNY receives financial aid in excess of the total amount of tuition and fees.\nBut while most students receive support for tuition costs, the report shows that typical non-tuition costs add up to several thousand US dollars a year, with a MetroCard typically costing students $1,143 for the academic year; books and supplies amounting to an additional $1,364 per year; Internet service running about $600 a year; and childcare costing at least $7,200 a year. Many CUNY students also struggle with the cost of food and housing.\nThese costs are often debilitating for CUNY’s mostly low-income community college students. According to the study, 71 percent of community college students in the city live in households earning less than $30,000 a year and 17 percent attend school while raising a child.\nThe lack of public aid for non-tuition expenses also pushes an alarming number of community college students in New York to work more than 20 hours a week, which itself contributes significantly to the high dropout rate. Overall, more than 52 percent of full-time CUNY community college students work while attending school, with 56 percent of them working more than 20 hours per week. By comparison, the average Harvard senior with a job works just 8 hours per week. This high workload often impacts academic performance and, in turn, causes students to lose the government-backed tuition assistance that is predicated on maintaining a 2.0 grade point average.\nThe study, which was informed by interviews with more than 50 community college students and dozens of nonprofit leaders who work closely with CUNY students, finds that non-tuition costs are a significant factor explaining why only 27 percent of full-time, first-time CUNY community college students earn a two-year associate’s degree within three years—and over half drop out within that time.\n“In today’s economy, CUNY’s community colleges are the city’s most accessible springboards to the middle class, but far too many New Yorkers who enroll in these schools are seeing their dreams of a better life derailed due to financial burdens beyond the cost of tuition,” said Jonathan Bowles, executive director of the Center for an Urban Future. “Many of the same low-income students didn't have to pay for a MetroCard, textbooks, or breakfast and lunch while attending public high school. It's time to extend those basic supports to students attending public community colleges.\" \nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nDylan Riddle\n+1 (904) 386-6481\ndylan.riddle@db.com\nAbout the Center for Urban Future\nThe Center for an Urban Future (CUF) is an independent think tank focused on creating a more inclusive economy in New York and expanding economic opportunity for all New Yorkers. This report is the latest in a long series of studies by CUF detailing CUNY's vital role as a springboard to the middle class in New York and calling attention to the need to help far more CUNY students succeed in earning a credential.\nAbout Deutsche Bank Americas Foundation \nDeutsche Bank’s commitment to serving communities in the Americas is grounded in a longstanding tradition of social responsibility. While advocating for a just society, CSR Americas pursues a strategy of equity and inclusion through a program of loans, grants and investments. Throughout its philanthropic pillars—community development, education (Born to Be) and social and creative enterprise (Made for Good)—the bank applies an asset-based approach that highlights communities’ strengths and supports stakeholder-led strategies for creating social and economic opportunity. CSR Americas partners across the firm as well, promoting a culture of citizenship and developing employees’ capacity to effect positive social change.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}