{
    "url": "https://www.db.com/news/detail/20210629-james-von-moltke-appointed-as-chair-of-esma-s-euro-risk-free-rates-working-group?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "June 29, 2021",
    "tags": [
        "Corporate products"
    ],
    "title": "James von Moltke appointed as Chair of ESMA’s Euro Risk-Free Rates Working Group",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) The European Securities and Markets Authority (ESMA) today announced the appointment of James von Moltke as Chair of the Working Group on Euro-Risk Free Reference Rates (EUR RFR WG).\nThe Working Group is responsible for advancing the adoption of Risk Free Reference Rates in the euro area. This follows the Financial Stability Board’s assessment that financial markets’ reliance on LIBOR poses clear risks to global financial stability. The Working Group’s responsibilities include promoting the widespread transition from the LIBORs across a range of financial products and identifying potential impediments to the widespread adoption of the euro short-term rate  (€STR).\nMoltke’s first meeting as Chair of the Working Group will be on 1st July 2021. He takes over from ING’s Tanate Phutrakul following the conclusion of the EUR RFR WG’s initial mandate, which culminated in a number of recommendations on euro area benchmark transition and reform.\nJames von Moltke said: “A smooth transition from IBOR to risk-free rates is vital for the financial services sector, for the clients we serve, and for investors around the world. I am honoured to take on this role. I look forward to building on the progress made under Tanate’s leadership, and working with our partners across Europe’s financial and regulatory landscape to help the industry move efficiently to alternative risk free rates.” \nDeutsche Bank has been actively engaged in IBOR transition for a number of years. In 2017, it set up a dedicated IBOR Transition Programme to develop and execute its plan to transition to alternative risk free reference rates and coordinate engagement with clients.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 6
}