{
    "url": "https://www.db.com/news/detail/20210621-deutsche-bank-and-fiserv-announce-joint-venture-for-payment-acceptance-in-germany?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "June 21, 2021",
    "tags": [
        "Private products"
    ],
    "title": "Deutsche Bank and Fiserv announce joint venture for payment acceptance in Germany",
    "body": "Joint venture to enable delivery of unique merchant acquiring solutions in the German market\nJoint venture to combine Clover payment acceptance solution with Deutsche Bank’s integrated banking services\nProcessing of payment acceptance for several thousand Deutsche Bank clients from the start\nDeutsche Bank, Germany’s largest bank, together with Fiserv, a leading global provider of payments and financial services technology, today announced a joint venture to create a comprehensive provider of payment acceptance and banking solutions. The joint venture will serve small and medium-sized enterprises (SMEs) in the German market and will be based in Frankfurt am Main, pending regulatory approval.\nThis Deutsche Bank and Fiserv joint venture will help SME clients adapt to the changing post-Covid marketplace by equipping them to sell their products and services across a full range of digital and in-person channels using modern payment acceptance solutions, including the popular Clover® point-of-sale platform from Fiserv. The companies plan to bring multiple payment solutions together, complementing Deutsche Bank’s banking offering, and deliver a combination unique to the market. This saves merchants from having to enter into multiple contracts with a variety of payment providers.\n“By combining Fiserv payment solutions with our banking products, we will be able to deliver accounts, payment solutions and banking services to our SMEs,” says Stefan Hoops, Head of Corporate Bank at Deutsche Bank. “Today, no other provider of such services in Germany can offer this in depth combination of acceptance solutions with banking services being a true “one-stop-shop” for our clients. This will translate into a better client experience, lower costs and reduced complexity for clients,” added Hoops.\nThe joint venture expects to serve several thousand clients from the start. Deutsche Bank, together with their Postbank and Fyrst brands, has around 800,000 SMEs who will benefit from the new solutions going forward. The joint venture will also offer services to non-Deutsche Bank-clients and is expected to employ a low triple-digit workforce.\n\"Together with Deutsche Bank, we will be able to help small and mid-sized enterprises in Germany do business in new ways, bringing them a compelling combination of solutions and services to streamline their payment acceptance and banking capabilities,\" said John Gibbons, Head of EMEA at Fiserv. “We look forward to bringing new solutions to merchants as they continue to advance their payment acceptance capabilities to meet changing customer expectations in a rapidly evolving post-Covid world.”\n\nFor further information, please contact:\nDeutsche Bank AG\nCommunications\nHeinrich Froemsdorf\nEmail: heinrich.froemsdorf@db.com\nFiserv\nCommunications\nAnn Cave\nEmail: ann.cave@fiserv.com",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 29
}