{
    "url": "https://www.db.com/news/detail/20210608-the-ocean-is-full-of-new-possibilities?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 8, 2021",
    "tags": [
        "Sustainability"
    ],
    "title": "The ocean is full of new possibilities",
    "body": "The ocean constitutes more than 90 percent of our planet. Yet, as of today, 60 percent of the world’s marine ecosystems have been degraded or are being used unsustainably. Just roughly one percent of the world’s oceans and adjacent seas is protected, compared to 12 percent land area; between 30 and 35 percent of the global extent of critical marine habitats such as seagrasses, mangroves and coral reefs are estimated to have been destroyed. Commercial overexploitation of the world’s fish stocks is so severe that an estimated up to 13 percent of global fisheries have collapsed. By the year 2100, without significant changes, more than half of the world’s marine species may stand on the brink of extinction.\nIn support of World Oceans Day today, June 8, International Private Bank (IPB) colleague Pedro Carrillo shares his passion for capturing – and helping preserve – the beauty of life underwater, and shares what we can all do to help conserve the world’s largest resource.\nPedro Carrillo leads a team of 120 employees working on creating agile banking processes for Deutsche Bank clients in the International Private Bank (IPB). A 22-year veteran of the bank, Carrillo has worked in Frankfurt, Warsaw and his current home Madrid, where he took on his new role of IPB Agile Banking Tribe Lead this January. But it was 16 years ago that he first took up his point and shoot camera – an Olympus, housed in acrylic – and shot his first photos of life under the sea. \nSince then Carrillo’s images of life underwater in Asia, Africa, the US and the Caribbean have garnered him international recognition, including wins and finalist positions in several noteworthy competitions, including those of  Nature´s Best / Smithsonian Museum; the British Broadcasting Corporation (BBC); and National Geographic.\n“Once I had the camera in my hand, the ocean was full of new possibilities,” said Carrillo. “Underwater, beauty is all around you; you can move freely in a completely new environment. That alone is an amazing experience – then add the thrill of coming close to a whale or a shark, or a sea creature you’ve been searching for forever. It’s indescribable.”\nCarrillo, who now has an arsenal of cameras and lenses at his disposal (his favourite is the Nikon D810 in a Seacam housing with Ikelite strobes), is often asked how he prepares to meet creatures that would terrify most people.\n“The key to interacting with any sea creature – whether they’re playful sea lions or dolphins, quiet seahorses or the more  menacing-looking whales and sharks – is to be respectful and understand that the encounter is on their terms,” he explained. “You have to wait for them to realise you’re not a danger; then their curiosity overpowers their natural shyness and they approach you. At that point you just have to be ready; the encounter will be over in the blink of an eye.”\nSurprisingly, Carrillo explained, it is the whales and sharks that are the shyest of them all, despite their size and reputation. It takes weeks of planning, local expertise, patience and perseverance to capture images of these majestic creatures, particularly as they are very hard to find and prefer to keep to themselves.\n“In fact, it’s funny – and depressing – how scared people are of sharks when we are a much bigger threat to both them and us,” Carrillo said.\nThe statistics support this claim. The International Union for Conservation of Nature (IUCN)’s list of endangered oceanic species is rapidly growing; the critically endangered category at an even faster rate. The exploitation of sharks and rays is a prime example: more than 100 million of these creatures are captured each year just so their fins can be consumed, while the rest of the animal is discarded – often while still alive.\nFrom observation to preservation\nCarillo has seen the damage to the ocean floor and its effects on sea creatures firsthand, sharing that he has often been astonished at how quickly a previously visited dive site has been ruined by the time he returns. Part of the problem, he explained, is that the underwater ecosystems are hidden from the public eye, so things that wouldn’t be tolerated on land go unchallenged underwater. Overfishing, exploitation, sewage, plastics and overall environment degradation happen on a daily basis, but seldom make headlines – and even then the impact is not long-lasting.\nThis – and the increasing extinction rates amongst the ocean’s creatures – is why Carrillo is committed to raising awareness of  both the beauty of underwater life and the perils it faces.\n“Photography is a powerful tool for conveying specific messages, particularly in these times of shorter attention spans and fast consumption. There’s a saying that you can only love – and therefore protect – what you can see, so that´s the gap we underwater photographers try to fill. I support communities by publishing their protection efforts to the world, I expose areas that are harming their coast in the hope of getting the public to react, and I support environmental organisations by donating photos to their cause.”\nHelping to stop the degradation of the ocean and the extinction of marine life is something everyone can get involved with, Carrillo said.\n“When we read about the sources of marine pollution and the threats to coastal and marine habitats, we might think that only agricultural practices, coastal tourism, port and harbor and urban developments are to blame,” he said. “But something as simple as reducing our plastic consumption to the absolute minimum is one thing we can each do to make a significant difference to the state of the oceans.”\nGetting serious about recycling, consuming only products from selective fisheries, and supporting conservation efforts or communities that actively protect their coasts are also steps in the right direction.\nOnce the world opens up again, Carrillo plans to take shots of killer whales in Norway, sperm whales in the Azores and Dominica, and whatever swims his way in the Galapagos and Cocos. His ultimate location is Antarctica. He will continue working to raise awareness of the importance of saving the world’s oceans. To see more of his photography, check his official Instagram page @pedrocarrillophoto\nAll photos courtesy of Pedro Carrillo.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 15
}