{
    "url": "https://www.db.com/news/detail/20220331-flucht-aus-der-ukraine-was-muss-europa-jetzt-in-der-migrationspolitik-tun?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "March 31, 2022",
    "tags": [
        "Company",
        "Research"
    ],
    "title": "Can the Ukrainian refugee movement change European migration policy",
    "body": "More than three million people have fled Ukraine and are seeking shelter in Germany, Poland and many other European countries. The Russian invasion of Ukraine has led to a large refugee movement in Europe. How is the European Union dealing with this challenge and what impact does the refugee movement have on the legal situation for refugees in the EU? Has Europe learned from the dispute over the reception, distribution and accommodation of refugees in 2015 and 2016?\nListen to the new episode of the ThinkForward podcast by the Alfred Herrhausen Gesellschaft now. In this episode, three top-class experts discuss the situation of refugees from Ukraine in Europe. Prof. Dr. Cathryn Costello, Dr. Grazyna Baranowska and Anne Kjaer Bathel raise the question how the current situation is different to the refugee movement in 2015 and what the EU must do now. The episode is moderated by Ursula Weidenfeld.\nThe guests:\nProf. Dr. Cathryn Costello is Professor of Fundamental Rights at the Hertie School in Berlin and Co-Director of the Center for Fundamental Rights. She is an expert on international and European asylum and migration law. She has conducted research for the UNHCR, the Council of Europe and the European Parliament and holds a PhD in law from Oxford University.\nAnne Kjaer Bathel is CEO and co-founder of the ReDI School of Digital Integration. She is a graduate of KaosPilot in Denmark, a mix of a business and a design school. Before her current job, she worked as a corporate social responsibility consultant. In 2012, she moved to Berlin to found the Berlin Peace Innovation Lab. In 2015, in response to the refugee crisis, Anne co-founded the ReDI School of Digital Integration, a vocational training programme that teaches programming and texting skills to refugees and marginalised groups. More than half of them are women and girls.\nDr Grazyna Baranowska is a researcher and teaches at the Hertie School. She specialises in international human rights law and international humanitarian law and is an assistant professor at the Institute of Legal Studies of the Polish Institute of Science, where she also holds a PhD in international law.\nYou can find the current episode of the ThinkForward podcast and all other episodes of the series on Spotify, Soundcloud and Apple Podcasts.",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 18
}