{
    "url": "https://www.db.com/news/detail/20220328-deutsche-bank-successfully-completes-issuance-of-additional-tier-1-capital-instruments?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "March 28, 2022",
    "tags": [
        "Financial Results"
    ],
    "title": "Deutsche Bank successfully completes issuance of Additional Tier 1 capital instruments",
    "body": "Today Deutsche Bank AG (XETRA: DBKGn.DE / NYSE: DB) issued Additional Tier 1 (AT1) capital instruments with a principal amount of total 750 million euros. The issuance addresses Deutsche Bank’s solvency requirements and supports its Tier 1 leverage ratio.\nThe securities will bear a fixed coupon of 6.75%, payable annually, until 30 April 2029. The Bank can call the securities, subject to prior supervisory approval on each day between 30 October 2028 and 30 April 2029, thereafter between 30 October and 30 April of each subsequent year. The applicable interest rate will be reset at five year intervals starting on 30 April 2029 on the basis of the then prevailing 5 year Euro swap rate plus the initial credit spread of 5.692% per year.\n“We are pleased to have completed this issue, which strengthens our capital position and enables us to deploy our balance sheet further in support of our clients,” said Dixit Joshi, Group Treasurer. “Strong investor demand for the issue, which was over seven times oversubscribed, reflects investor appetite for Deutsche Bank and support for our strategy of sustainable growth built on successful transformation. We have launched 5 successful issuances so far this year, including our recent 1.5-billion-euro issue of Tier 2 capital, and have already completed a substantial portion of our 2022 capital market funding plan.”\nThe new AT1 securities (ISIN DE000DL19WG7) are expected to be listed on the Luxembourg Stock Exchange and traded on its regulated market.\nThe denominations of the securities are 200,000 euros. Deutsche Bank AG acted as sole bookrunner for the offering.\nThe securities of Deutsche Bank AG mentioned in this release have not been registered under the Securities Act of 1933, as amended (“Securities Act”) and will be issued under “Regulation S” of the Securities Act only and may not be offered, sold or delivered within the United States absent registration under the Securities Act or an exemption from registration requirements.\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nChristian Streckert                                                              \nPhone: +49 69 910 38079                                                \nEduard Stipic                       \nPhone: +49 69 910 41864\ndb.media@db.com \nInvestor Relations\n+49 800 910-8000\ndb.ir@db.com ",
    "number_of_ratings": 2,
    "rating": 1.0,
    "likes": 11
}