{
    "url": "https://www.db.com/news/detail/20220325-yngve-slyngstad-nominated-for-election-to-deutsche-bank-s-supervisory-board?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, March 25, 2022",
    "tags": [
        "Management & Leadership"
    ],
    "title": "Yngve Slyngstad nominated for election to Deutsche Bank’s Supervisory Board",
    "body": "The Supervisory Board of Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) recommends that the bank’s shareholders elect Yngve Slyngstad (59) to the Supervisory Board at the Annual General Meeting (AGM) on May 19, 2022. Slyngstad would succeed Gerhard Eschelbeck, who will not stand for re-election when his five-year term ends at this year’s AGM.  \nSlyngstad was CEO of Norges Bank Investment Management (NBIM), the entity managing the world´s largest sovereign wealth fund in Norway, for 13 years. Prior to that he led the fund’s equity management organisation since its establishment in 1998. Earlier this month he joined Aker ASA, a Norwegian investment company, to oversee its newly created asset management division. The organization will be focused primarily on investments related to energy transition necessitated by climate change. Slyngstad holds degrees in economics, law, political sciences and philosophy from universities in Oslo and Paris, and the University of California.  \n\n“We very much look forward to Yngve Slyngstad joining the Supervisory Board,” said Mayree Clark, Chair of the Supervisory Board’s Nomination Committee. “We will benefit from his network in the global financial industry and his vast experience as one of the pioneers of sustainable investing, as well as his current focus on cutting edge matters related to climate change and energy transition.”  \n\nPaul Achleitner, Chairman of the Supervisory Board, added: “We are delighted to be able to nominate Yngve Slyngstad, in line with our longstanding approach to bring together highly capable individuals in a diverse Supervisory Board which brings expertise and judgement for the benefit of the bank.”  \n\n“I greatly appreciate the Supervisory Board’s nomination,” Slyngstad said. “Deutsche Bank plays a crucial role in the development of Europe’s financial industry and will play an important role in the financing of the transition to a sustainable and carbon-neutral economy. Subject to the vote at the AGM, I would be delighted to contribute to the further development of Deutsche Bank’s strategy.”  \n\nAchleitner thanked Gerhard Eschelbeck, Chief Information Security Officer at Aurora Innovation, Inc., who joined Deutsche Bank’s Supervisory Board in 2017: “Gerhard Eschelbeck has been a highly esteemed member of our Supervisory Board and made important contributions, in particular with his experience and expertise in technology. We thank him for his excellent work and wish him well in his new endeavours.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}