{
    "url": "https://www.db.com/news/detail/20220311-deutsche-bank-reports-continued-delivery-of-transformation-in-2021-and-clear-targets-for-2025?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "March 11, 2022",
    "tags": [
        "Financial Results"
    ],
    "title": "Deutsche Bank reports continued delivery of transformation in 2021 and clear targets for 2025",
    "body": "Annual Report: transformation drives strong performance in 2021\nHighest profit since 2011 with net profit up fourfold to € 2.5 billion\nNet revenue growth of 6% to € 25.4 billion\nImprovements in post-tax RoTE¹ and cost/income ratio\nProposed capital distribution of approximately € 700 million to shareholders\n2021 compensation reflects cost discipline and reward for performance\nTotal compensation down 2% to € 9.9 billion due to efficiency measures\nVariable compensation up 13% to € 2.1 billion, reflecting significantly improved results\nUpdated strategic and financial roadmap through 2025\nDeutsche Bank to strengthen its position as ‘Global Hausbank,’ becoming first point of contact for a greater number of clients\nClear financial objectives for 2025, building on transformation:\nPost-tax RoTE1 above 10% with cost/income ratio below 62.5%\nCompound annual revenue growth of 3.5%-4.5% from 2021-25\n~€ 8 billion of capital distribution in respect of financial years 2021-2025²\nNon-Financial Report: ahead of target and raising ambitions in sustainability\nSustainable financing and investment volumes rise threefold to € 157 billion\n€ 200 billion+ target accelerated to 2022 with €100 billion per year 2023-2025\nGreenhouse gas emissions from own operations down 63% since 2019\nUpgrades from four sustainability rating agencies\nInvesting in talent and diversity\n1,420 graduates and vocational trainees hired, up 10% over 2020\n20% of Management Board and 30% of Supervisory Board posts held by women\nTarget of at least 35% women in senior ranks by 2025\nPeople Survey commitment index at highest level since 2012\n“2021 was a pivotal year for Deutsche Bank”, said Christian Sewing, CEO. “We achieved our highest profit in ten years, made significant progress on our transformation journey, and we are working towards delivery on our 2022 objectives. Thanks to the outstanding efforts of our people, we delivered improved performance, set the course for a more sustainable business, and contributed in the communities we serve around the globe. As our strategy evolves, we can build on successful transformation to deliver sustainable growth and higher returns to shareholders through 2025.”\nDeutsche Bank’s (XETRA: DBKGn.DE / NYSE: DB) 2021 audited results, published today in the Annual Report, confirm delivery across all financial and strategic milestones of its transformation during 2021. There were no meaningful divergences from the bank’s unaudited results published at the Annual Media Conference on 27 January 2022.\nIn respect of events subsequent to December 31st 2021, the Annual Report describes Deutsche Bank’s exposures to Russia and Ukraine and the potential risks resulting from Russia’s invasion of Ukraine. On March 9, the bank reported that Russia exposures are very limited and set out measures taken to mitigate these exposures. Additional details are available on the bank’s website: https://investor-relations.db.com/RussiaExposure\nTransformation on target with highest profit since 2011\nDeutsche Bank’s 2021 Annual Report confirms progress towards the goals of the bank’s transformation programme, launched in 2019. The benefits of transformation are evident in the bank’s 2021 financial performance:\nProfit before tax up more than threefold to € 3.4 billion and net profit up fourfold to € 2.5 billion\nPost-tax return on tangible equity (RoTE)¹ up from 0.2% to 3.8%, with Core Bank RoTE1 up from 4.0% to 6.4%\nCost/income ratio improved to 85%, from 108% in 2019\nNet revenues up 6% year on year to € 25.4 billion\n97% of total anticipated transformation-related effects already recognised\nProposed capital distribution to shareholders of approximately € 700 million\nCommon Equity Tier 1 (CET1) capital ratio of 13.2%, in line with the bank’s commitment of above 12.5%\nA clear strategic and financial roadmap through 2025\nAt its Investor Deep Dive on 10 March, Deutsche Bank outlined its strategic and financial roadmap through 2025, building on the progress of its transformation programme. Deutsche Bank aims to build on its position as ‘Global Hausbank’ by becoming the first point of contact in all financial matters for an even larger number of clients.\nThe bank aims to further strengthen cross-divisional collaboration through four leading core businesses, harness growth by driving its business strategies, and self-fund investments by enhancing efficiency.\nIf successful, this strategy would enable anticipated capital distribution to shareholders of around € 8 billion in respect of the financial years from 2021-2025, subject to the requisite approvals.\nThe bank published clear financial objectives for 2025:\nPost-tax RoTE¹ of greater than 10%\nCompound annual revenue growth of 3.5% -4.5% from 2021, implying net revenues of approximately € 30 billion in 2025\nA cost-income ratio of below 62.5% with enhanced operating leverage through cost discipline enabling self-funded investments\nThe bank also published details of its capital plan through 2025. This includes:\nMaintaining a CET1 capital ratio of approximately 13%, subject to a minimum threshold of 200 basis points above the expected Maximum Distributable Amount threshold of approximately 11%\nTangible equity retention to support business growth and implementation of the first elements of the expected Basel III regulatory capital changes effective January 1, 2025\nThe Management Board announced its intention to reach a total payout ratio of 50% of net income attributable to shareholders in 2025 and thereafter.\nFurther details of the bank’s strategic and financial roadmap through 2025 are available on the bank’s website: https://investor-relations.db.com/IDD2022.\nCompensation: discipline and reward for performance in 2021\nTotal compensation awarded to Deutsche Bank employees in respect of 2021 was € 9.9 billion, down 2% from € 10.1 billion in 2020. This development reflected lower severance and fewer retention payments compared to the prior year, together with workforce reductions and exchange rate effects.\nFixed compensation was € 7.4 billion, down slightly from € 7.5 billion in 2020. Variable compensation increased by 14% to € 2.1 billion, mainly driven by the bank’s improved financial performance.\nThe Management Board, comprising ten members on a full-year equivalent basis, received total compensation for 2021 of € 66.5 million, up from € 50 million in 2020, reflecting performance against targets. This year on year development partly reflects a € 4.6 million reduction in Management Board compensation in 2020, against the backdrop of the COVID-19 pandemic, which included a reduction in the Group Component of variable compensation and an additional reduction in total compensation of one twelfth.\nNon-Financial report\nDeutsche Bank’s 2021 Non-Financial Report, also published today, outlines the bank’s role in the transition to a sustainable and climate-neutral economy; governance and operations; technology, data and innovation; and people and corporate social responsibility activities.\n2021: a pivotal year for sustainability at Deutsche Bank\nThreefold rise in sustainable finance volumes: volumes in sustainable financing and investment ex-DWS, cumulative since the beginning of 2020, more than tripled in the year, reaching € 157 billion by the end of 2021, up from € 46 billion at the end of 2020, and significantly ahead of the bank’s end-2021 target of € 100 billion.\nRaised ambitions: Rapid growth enabled Deutsche Bank to accelerate its volume target of at least € 200 billion. At its Sustainability Deep Dive in May 2021, the bank brought forward the date for achieving this target from end-2025 to end-2023. After announcing its full-year 2021 volumes in January 2022, Deutsche Bank again accelerated this target to end-2022. In its Investor Deep Dive of March 10, the bank announced an additional ambition of at least €100 billion per year from 2023 to 2025.\nSince January 2021, delivery on sustainable volume targets has been factored into the bank’s top executive compensation framework.\nSupporting industry initiatives: Deutsche Bank underlined its commitment to work with partners from across the finance industry and beyond to combat climate change. In 2021, the bank joined the Net Zero Banking Alliance (NZBA) and Partnership for Carbon Accounting Financials (PCAF), contributed to working groups of the United Nations Environment Programme Finance Initiative (UNEP FI) and partnering with the Ocean Risk and Resilience Action Alliance to launch an Ocean Resilience Philanthropy Fund\nAs a founding member of NZBA, Deutsche Bank has pledged to align emissions in its loan portfolio to net zero by 2050, in line with the Paris Agreement, and to help clients finance their transition to less carbon-intensive operations. This builds on the bank’s commitments to no longer finance new oil & gas drilling in the Arctic and oil sands projects in all jurisdictions, and to exit the financing of thermal coal mining by 2025.\nOn March 4, 2022, Deutsche Bank published data on financed greenhouse gas emissions in its corporate loan book and provided an update on net zero target setting in key industry sectors. More details are available online.\nReducing the bank’s own carbon footprint: Deutsche Bank further reduced the environmental impact of its own operations during 2021. Progress since 2019 included:\n63% reduction in greenhouse gas emissions from own operations\n20% reduction in total energy consumption\n91% of electricity consumption from renewable sources, up from 75%\n71% of all waste recycled, up from 61%\nRating agency upgrades: several ESG rating agencies have recognised the bank’s progress. CDP has raised the bank’s climate change score from C to B; S&P Global raised its score for Deutsche Bank 60 out of 100 points in its S&P Global CSA Assessment, up from 56 points in 2020, putting the bank back in the Dow Jones Sustainability Europe Index. Deutsche Bank’s Sustainalytics score improved from 30.0 (high risk) to 27.4 (medium risk).\nContinuing to reinforce the control environment\nDeutsche Bank has implemented and continues to embed new processes and systems to reinforce and enhance its control environment and has invested around € 3 billion in its control functions since 2019. Building on this momentum, the bank aims to continue to invest in controls during the next phase of its strategy. This includes expanding the risk framework in the evolving areas of non-financial risk, climate risk and cyber risk; continuing to develop preventative controls; and investing in enabling technologies such as machine learning and artificial intelligence.\nPeople and social responsibility\nSupporting staff through the pandemic: Deutsche Bank’s staff continued to face significant upheavals in their working environment and personal lives due to the COVID-19 in 2021. Up to 73,000 people have had to work remotely. Deutsche Bank took steps to support both the physical and mental wellbeing of staff, providing around 14,500 vaccinations to employees, relatives and external contractors.\nThe number of staff volunteering as Mental Health First Aiders grew to around 450 in 2021.\nAdapting to the future of work: in preparing for the post-COVID environment and in response to feedback from staff in the 2021 Future of Work employee survey, the bank is implementing a hybrid model which combines the advantages of remote and in-office work.\nWinning the commitment of staff: in the bank’s 2021 People Survey, the commitment index reached 71%, up from 69% in 2020 and the best level since 2012. The enablement index, at 73%, was down slightly from 2020 but remained close to decade-long high levels.\nInvesting in talent: Deutsche Bank continued to invest in talent during 2021, despite the constraints of COVID-19. The bank hired 1,420 graduates and vocational trainees, up from 1,287 in 2020, and invested some € 38 million in employee training.\nSupporting diversity: with people from 156 different nationalities working in 58 countries worldwide, diversity is core to Deutsche Bank. The bank’s commitment to gender diversity was reflected in several developments during 2021:\nWomen accounted for 20% of the Management Board, 30% of the Supervisory Board and 47% of all staff\n47% of all Director Acceleration Program participants and 45% of Vice President Acceleration Program participants were women\nThe bank launched its ’35 by 25’ commitment, with the aim that at least 35% of Managing Director, Director and Vice President roles are held by women by 2025\nLesbian, Gay, Bisexual, Queer and Intersex (LGBTQI) inclusion: Deutsche Bank is committed to an inclusive work environment and, in 2021, won two prestigious awards for its work in this area: the Human Rights Campaign Foundation’s ‘Best Places to Work for LGBTQ Equality’ and Yahoo Finance’s ‘OUTstanding LGBT+ Role Model Lists’. \nContinuing to support communities in challenging times\nCOVID-19 did not prevent Deutsche Bank and its people from engaging with communities during 2021. Initiatives during the year included:\nLaunching the #NotAlone campaign which provided over € 1 million for mental health projects, helping partner charities reach more than 123,000 children and young people\nDonating € 2 million for COVID-19 relief projects in India, including the provision of oxygen concentrators and hospital beds, with additional donations of nearly\n€ 200,000 from employees\nSupporting employees teaching financial literacy in schools. Over 600 employees in Germany have registered; by end-2022 that number is expected to reach 700\nRaising nearly € 1 million to provide disaster relief to victims of flooding in Germany and Benelux countries from Deutsche Bank, the Deutsche Bank Foundation, and employees\nCorporate Social Responsibility: During 2021, Deutsche Bank and its foundations invested € 52.1 million in corporate social responsibility (CSR) initiatives and art, culture and sport projects. These included Born to Be, the bank’s youth engagement programme, and Made for Good, which supports social and creative ventures. More than 3.2 million people worldwide were reached by these programmes during 2021.\nEmployee volunteering: 15,487 employees, or 18% of total staff, participated in the bank’s volunteer programmes, up from 12,885 in 2020, donating over 133,000 hours of their time. Direct employee donations to charitable causes, and matching donations by the bank, raised € 7.4 million for charitable causes during the year. \nOther financial and regulatory reports\nToday Deutsche Bank published its 2021 Pillar 3 Report and Annual Financial Statements of Deutsche Bank AG under German accounting rules (HGB). In addition, the Annual Report on Form-20-F will be made available today.\n¹For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ on pp 17-25 of the fourth quarter 2021 Financial Data Supplement\n²Anticipated cumulative payout in respect of FY 2021-2025 (i.e. including distributions in respect of 2025, payable in 2026) subject to meeting strategic targets and German corporate law requirements, AGM authorization and regulatory approvals\nAvailability\nAll reports can be downloaded from www.db.com/annual-reports. The Annual Report on Form 20-F, which will be submitted to the US Securities and Exchange Commission today, will also be made available following submission (English only) on the website: investor-relations.db.com/reports-and-events/sec-filings-for-financial-results.",
    "number_of_ratings": 4,
    "rating": 2.5,
    "likes": 16
}