{
    "url": "https://www.db.com/news/detail/20220310-deutsche-bank-raises-its-return-on-tangible-equity-target-to-above-10-percent?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "March 10, 2022",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank raises its return on tangible equity target to above 10 percent",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) announces an evolution of its strategy focused on delivering sustainable growth and higher returns at an Investor Deep Dive hosted today. By 2025, the bank aims to increase returns on average tangible equity (RoTE)¹ to above 10% and organically generate significant additional tangible equity.\nThis is expected to be achieved through a combination of revenue growth, further efficiencies and self-funded investments. Subject to successful implementation, this strategy would enable anticipated capital distributions to shareholders of around € 8 billion in respect of the financial years 2021-2025 and substantial re-investment into Deutsche Bank’s four leading businesses.\nDeutsche Bank’s financial targets for 2025 are:\nPost-tax RoTE¹ of greater than 10%, with disciplined resource allocation driving profitability;\nCompound annual revenue growth of 3.5-4.5% from 2021, with implied net revenues of approximately € 30 billion in 2025;\nA cost/income ratio below 62.5%, reflecting revenue growth with further cost discipline, supported by ongoing efficiency initiatives enabling self-funded reinvestment.\nThe Global Hausbank: a strong platform for sustainable growth\nDeutsche Bank’s sustainable growth strategy builds on the fundamental transformation of the bank since 2019. The core of this strategy is to further expand Deutsche Bank’s position as the 'Global Hausbank’. As the market leader in one of the world’s strongest economies with a comprehensive suite of products, Deutsche Bank aims to become the first point of contact in all financial matters for an even larger number of clients and to further strengthen cross-divisional collaboration. \n”Over the past three years, we have built strong foundations for a resilient and sustainably profitable Deutsche Bank”, Christian Sewing, Chief Executive Officer, said. “Our strategy is now about shifting to sustainable growth and increased distributions to our shareholders. Our bank is well placed to help clients navigate through geopolitical and macroeconomic shifts, including the current uncertainties. And we are strongly positioned to help clients accelerate their transition to a more sustainable and digitized economy.”\nCapital plan through 2025: supporting growth and returns to shareholders\nDeutsche Bank’s capital plan is based on maintaining a Common Equity Tier 1 (CET1) capital ratio of approximately 13% in 2025, subject to a minimum threshold of 200 basis points above the expected Maximum Distributable Amount threshold of approximately 11%. The plan includes tangible equity retention to support business growth and implementation of the first elements of the expected Basel III regulatory capital changes effective January 1, 2025.\nThe Management Board announced its intention to reach a total payout ratio of 50% of net income attributable to shareholders in 2025 and thereafter.\nCompleting transformation: a positive start to 2022\nThe current geopolitical and macroeconomic environment creates uncertainties whose impact cannot yet be fully assessed. Nevertheless, performance in January and February was ahead of the comparable period last year across key metrics as management continues to work toward delivery of its financial and transformation objectives for 2022.\nGroup highlights² for the year to date as of 28 February, including a two-month pro rata (two-twelfths) share of Deutsche Bank’s annual bank levy in both 2022 (plan) and 2021, include:\nPost-tax return on average shareholders’ equity of 10.6%, versus 8.6% in the year to 28 February 2021\nPost-tax RoTE¹ of 11.8%, up from 9.7% in the year to 28 February 2021 and ahead of the 2022 target of 8%\nCore Bank post-tax RoTE¹ of 13.8%, up from 12.1% in the same period of 2021 and compared to a 2022 target of above 9%\nCost/income ratio of 64.1%, down from 68.0% in the same period of 2021 and below the full-year 2022 goal of 70%\nCET 1 ratio of around 13.2%, well above the bank’s 2022 goal of above 12.5%\nDeutsche Bank aims to reach its 2022 goals through a combination of revenue growth, further reductions in adjusted costs ex-transformation charges1, and the substantial elimination of transformation-related effects¹, 97% of which were recognised by the end of 2021.\n“For the full year 2022, we continue to expect to deliver a post-tax return on tangible equity of 8 percent”, said James von Moltke, Chief Financial Officer. “We have had a good start to the year across our businesses. While the war in Ukraine creates increased uncertainty in the market environment, our exposures to Russia are contained and well controlled.”\nBuilding on progress of transformation since 2019\nDeutsche Bank’s roadmap for 2025 is based on the progress of its transformation program launched in 2019. This included exiting non-strategic activities, refocusing the core businesses, reducing costs, investment in technology and controls and effective management of capital. Achievements to the end of 2021 have included:\nProfit before tax of € 3.4 billion, versus € 1.3 billion in 2018\nBusiness volume growth and share gains across core businesses, with revenues of € 25.4 billion in 2021, up 6% year on year\nReductions of € 3.6 billion in adjusted costs ex-transformation charges and reimbursable Prime Finance-related expenses¹ since 2018\nCapital Release Unit leverage exposure down 86% and risk weighted assets down 61% since year end 2018, while reducing the cost burden from legacy assets by € 2.2 billion\nThe self-financing of transformation, as organic capital generation and accretion from non-strategic asset reduction largely offset transformation-related costs and regulatory inflation\nStrong growth in sustainable financing and investment, which reached € 157 billion by the end of 2021, and bringing forward the original 2025 target, of over € 200 billion in Environmental, Social and Governance (ESG) financing and investment ex-DWS, to year end 2022\nDeutsche Bank will host an Investor Deep Dive starting at 13:00 CET today. Christian Sewing, Chief Executive Officer, and James von Moltke, Chief Financial Officer, will present a review of the bank’s current transformation programme and discuss Deutsche Bank’s strategy and financial objectives through 2025. The materials will be available on https://investor-relations.db.com/IDD2022.\n¹For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ on pp 17-25 of the fourth quarter 2021 Financial Data Supplement\n²Preliminary and unaudited",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 24
}