{
    "url": "https://www.db.com/news/detail/20220705-deutsche-bank-publishes-modern-slavery-and-human-trafficking-statement-2021?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "Frankfurt am Main, July 5, 2022",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank publishes Modern Slavery and Human Trafficking Statement 2021",
    "body": "Deutsche Bank has published its\nPDF\nModern Slavery and Human Trafficking Statement 2021. This is an annual statement published mid-way through the year since 2017. It describes how the bank approaches human rights issues and how it is helping to combat modern slavery and human trafficking. For example, 2021 saw the company publish a revised code of conduct for suppliers and introduce EcoVadis Sustainability Ratings, which are used to assess suppliers’ compliance with a set of 21 sustainability measures. The bank also made efforts to increase awareness of the topic of human rights amongst its employees by holding training sessions on sustainable finance and corporate social and environmental responsibility.  In addition, the bank organised a staff training event last year in partnership with Stop The Traffik, an NGO that works to combat modern slavery and human trafficking.\nDeutsche Bank is committed to ensuring that human rights are respected. It continuously works to improve its internal guidelines and initiatives on human rights issues.\nIn 2020, the bank set up the group-wide Human Rights Working Group, which brings together management staff from a range of departments including Anti-Financial Crime (AFC), Procurement, Non-Financial Risk Management, Legal, HR, Communications and Social Responsibility. They track developments in human rights around the world, identify significant risks for the bank in this area and coordinate human rights activities across the group.\nThe profits from modern slavery and human trafficking are often fed into the global financial system. This allows criminals to launder the illegal funds, making them appear legitimate. To tackle this, the Anti-Financial Crime department set up an additional human rights working group in 2021 focussed on financial crime.",
    "number_of_ratings": 3,
    "rating": 3.7,
    "likes": 6
}