{
    "url": "https://www.db.com/news/detail/20220809-are-family-businesses-more-resilient?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "August 9, 2022",
    "tags": [
        "Private products",
        "Research"
    ],
    "title": "Are family businesses more resilient?",
    "body": "A recently published study from Deutsche Bank’s International Private Bank (IPB) found that many German family-owned businesses fare better in complex crises like the Covid pandemic.\nWhy is that and what can other companies learn from them?\nThe analysis, conducted by the IPB’s Head of Investment Banking Solutions (IBS), Dr. Markus Eckey, and IBS Product Specialist, Sebastian Memmel, concluded that listed family businesses have advantages over businesses without a family as an anchor investor that make them more resilient in times of crisis.\n\n\n\"Our research shows that family businesses are better able to cope with complex crises,\" says Dr. Eckey. While the share prices of family-owned businesses slumped by 23.7 percent during the first phase of Covid, companies without a family shareholder saw their share prices drop even more – by 30.7 percent. \"In the case of family-owned businesses, the slump is on average smaller in a crisis, and the recovery usually comes much faster,\" Dr. Eckey explains.\nThe study found that family-owned businesses’ share prices returned to pre-Covid levels three weeks earlier. Dr. Eckey and Memmel identified three factors that provide higher resilience in crises:\n1.     Emotional anchoring\nAs anchor investors, families or founders are often more emotionally attached to the company than other major investors. Their focus is on long-term business success. At times of crisis especially, this can give a company more stability.\n2.     Short decision-making channels\nFamily businesses are often managed centrally and decision-making is fast. This enables them to react quickly in crisis situations and adapt quickly to changing conditions. In addition, members of the family often occupy managerial positions.\n3.     Financial stability\n\"Family businesses often have a more conservative capital base, which gives them more stability in a sudden crisis,\" Dr. Eckey explains. This usually shows in higher equity ratios. Therefore, family businesses usually have an easier time securing their liquidity in tough market conditions.\nAnother striking finding from the study is that listed family businesses are more profitable. According to the study, their return on equity (RoE) averaged seven percent in 2020. For companies without a family shareholder, average RoE was minus 11 percent.\nA role model for others\nDr. Markus Eckey and Sebastian Memmel believe that the way family businesses have shown their resilience during the Covid crisis can serve as a role model for other companies: \"Other companies can certainly learn from the combination of long-term orientation, short decision-making processes and financial stability to better prepare themselves for future crises,\" Dr. Eckey added.\nDr. Markus Eckey and Sebastian Memmel\nFurther information on the methodology and the results of the English-language study as well as the full version (paywall) \"Impact of COVID-19 on family business performance: evidence from listed companies in Germany\" are available on Emerald Insight.",
    "number_of_ratings": 137,
    "rating": 4.5,
    "likes": 412
}