{
    "url": "https://www.db.com/news/detail/20220809-deutsche-bank-adopts-measures-to-further-reduce-its-energy-consumption?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "August 9, 2022",
    "tags": [
        "Sustainability"
    ],
    "title": "Deutsche Bank adopts measures to further reduce its energy consumption",
    "body": "The bank has announced plans to further reduce its electricity consumption in Germany. \nMeasures related to reducing gas consumption will follow once the German government has made corresponding decisions.\nDeutsche Bank is introducing a comprehensive package of energy saving measures in its German operations that will help the bank save an additional 4,900,000 kWh of electricity each year. This is equivalent to the average annual consumption of around 1,600 two-person households. The plan will reduce short- and long-term energy consumption and supports the German government’s energy saving efforts.\nThe bank will implement the following measures to save electricity:\nIn the summer months, air conditioning will consume less power as the maximum room temperature in all office buildings and branches is raised from 23°C to 25°C.\nThere will only be cold running water in all washrooms.\nIlluminated outdoor advertising and logos on buildings will be switched off between 10 p.m. and 6 a.m., as will interior lighting at night. Only lighting necessary for security purposes and lighting in the branch foyers for ATMs will remain switched on.\nThe fountain in front of the head office in Frankfurt will be turned off.\nThese measures will be introduced gradually but as quickly as possible in the approximately 1,400 buildings in Germany that the bank uses either in whole or in part.\nDeutsche Bank also plans to reduce its gas consumption. It has already identified measures that will help it achieve the EU Commission's target of using 15 percent less gas between August 2022 and May 2023. However, as pending decisions by the German Federal Network Agency and the German government will influence the specific measures, implementation is being held off.\nDeutsche Bank’s operations are already highly energy efficient thanks to various energy-saving measures. In 2017, the bank implemented an energy management system in Germany in accordance with industrial standard DIN ISO 50001, as part of which the bank adheres to the following:\nConverting lighting to energy-efficient LED technology in office and branch buildings.\nIntroducing building control technology that uses artificial intelligence to reduce the amount of energy used to heat and cool its large sites.\nConverting to energy-efficient pumps in heating systems.\nReducing the amount of energy used for cooling in technical rooms.\nDeutsche Bank’s plans to reduce its real estate portfolio is also helping cut energy consumption. At the end of 2024, the bank will have 40 percent less space in Frankfurt and nearby Eschborn than at the beginning of 2021. In Bonn, the bank has moved staff from several old buildings to the new building at Neuer Kanzlerplatz. This will save 5,000,000 kilowatt hours of electricity and 6,200,000 kWh of gas annually. Across Germany, the bank has reduced the amount of electricity it directly purchases by 25 percent compared to 2018.\nCurrently, 91 percent of the bank's electricity worldwide comes from renewable sources. By 2025, the bank aims to source 100 percent of its electricity for its own global business operations from renewable sources and has therefore joined the global RE100 initiative, a global initiative led by the Climate Group.",
    "number_of_ratings": 8,
    "rating": 5.0,
    "likes": 24
}