{
    "url": "https://www.db.com/news/detail/20190122-davos-2019-sticking-together-as-the-world-falls-apart?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 22, 2019",
    "tags": [
        "Careers",
        "Research"
    ],
    "title": "Davos 2019 : sticking together as the world falls apart",
    "body": "Davos 2019 will be marked by Industry 4.0 – the game changer of our time. More and more areas of our lives are going digital – even including political processes. The familiar world order is also changing, old certainties are wavering, and then there are the threats posed by climate change, terrorism and economic crises. Many people no longer believe that politicians and businesspeople are up to the task. And all these challenges mean that any success stories go virtually unnoticed. For example, millions of people have managed to escape from extreme poverty during the past ten years.\nDeutsche Bank is also putting societal issues at the very top of its agenda in Davos. It is offering clients and other guests its own programme together with internationally renowned experts: Creating Convergence in a De-coupling World.\nNo lecturing from a lectern\nOne particularly important element is “The Table Davos” format. The “table” can be found in a small art gallery in Davos where guests can gather to spend 90 minutes discussing a specific topic, for example the platform economy with the experts Mathias Döpfner, CEO of Axel Springer SE, and Andrew McAfee, a researcher at MIT. Or they might prefer to listen to what the former president of Iceland Ólafur Grimsson has to say about climate change.\nKishore Mahbubani, Professor at the National University of Singapore, will be striking a provocative tone by claiming that the rapidly growing Asian and Chinese economic area will have overtaken the “Old Economy” in Europe and the US in a few years.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}