{
    "url": "https://www.db.com/news/detail/20190121-davos-2019-geopolitics?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 21, 2019",
    "tags": [
        "Research"
    ],
    "title": "Davos 2019 – Geopolitics",
    "body": "Within the next decade, it is certain that China will become the world’s largest economy. Is America struggling to understand its changing relationship with China? Is it possible for America and China to achieve a new modus operandi with a philosophy of “live and let live”, in which neither America nor China challenges each other’s core interests? As President Xi said in Davos in 2017: “We should adhere to multilateralism to uphold the authority and efficacy of multilateral institutions.” All these adjustments will require sensitive diplomatic negotiations.\nConflicts of an Urban Age\nTuesday, January 22, 2019. 7:30 – 09:00\nThe 21st century is the century of urbanisation. In 2007, half of the world’s population was living in cities; the UN estimates that by 2050, it will be three quarters of the world’s population. Both the extent and pace of this process bring about marked questions of sustainability, prosperity, and equity. This session first described the dynamics of urbanization and then discussed how these questions could be addressed.\nQuotes:\n“By the end of the century, the labour force of Sub-Saharan Africa will be larger than that of India and China combined”, Anna Herrhausen says.\nAnna Herrhausen: “It is important that we get our cities – existing ones and new ones – right.”\nRicky Burdett: \"In the short time span of 25 years, cities have grown larger and more quickly than ever before. Fishing villages have been transformed into megacities and deserts have become urban playgrounds. The speed and scale of this transformation is unprecedented. Every hour more than 50 new residents are added to the populations of cities like Lagos, Delhi, Kinshasa and Dhaka.\"\n\"New city forms are emerging with profound social and environmental consequences for billions of urban dwellers. Instant cities of immense fragility and precariousness appear overnight, while others struggle to invest and plan urban futures able to adapt and change in response to unknown needs, pressures and desires.\"\nBuilding cities for a billion people over the next decades is an opportunity to plan to get things right by accommodating future growth, or to get them wrong by imposing inflexible solutions. Some cities have grasped the opportunity to plan and grow more equitably, others have suffered sprawl and unplanned growth.\"\nIs This the End of the 1980 – 2016 Globalisation Super-cycle?\nWednesday, January 23, 2019. 08:00 – 09:30\n\n1980 – 2016 saw a super cycle of globalisation. Will 2016 be seen as the start of super cycle of de-globalisation? Huge global demographic changes post 1980 helped see a surge in the global labour force and has ultimately helped fuel populism.\nChina integrating itself into the global economy for the first time in centuries at the same time reinforced the trend and excess labour was subsequently under constant price pressure.\nUltimately, this multi-decade worker frustration has reached the mainstream and has led to Brexit, Trump, Italian populism and the rise of other non-establishment parties. We discussed whether this will continue and what could be done to reverse this trend.\nQuotes:\n“We think, the period 1980-2016 saw a globalisation super-cycle that is now reversing to varying degrees”\n“Many benefited from globalisation, but many were left behind\"\nThe New World Order\nWednesday, January 23, 2019. 12:00 – 13:30\nWithin the next decade, it is absolutely certain that China will become the world’s largest economy. Is America struggling to understand its changing relationship with China? Is it possible for America and China to achieve a new modus operandi with a philosophy of “live and let live”, in which neither America nor China challenges each other ’s core interests? As President Xi said in Davos in 2017, “We should adhere to multilateralism to uphold the authority and efficacy of multilateral institutions.” All these adjustments will require sensitive diplomatic negotiations. The time to prepare for them is now.\nQuotes:\nGlobal economic conflicts: “Civilisations have life cycles, and the Chinese civilisation is now on a powerful upswing, driven by deeper forces such as cultural confidence”, says Kishore Mahbubani\nGeopolitical Strategies for Discussion: “India and China have decided that they can be responsible global citizens” \n“Until 1820, China and India had the world’s two largest economies and they will reclaim their positions within the next decades”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}