{
    "url": "https://www.db.com/news/detail/20190117-exit-from-brexit-what-our-experts-say?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 17, 2019",
    "tags": [
        "Research"
    ],
    "title": "Exit from Brexit? What our experts say",
    "body": "Many of us are following the news in the UK these days with their eyes glued on television. But how do Deutsche Bank’s experts assess the latest developments regarding Brexit? There is range of views, as you can read below.\nDavid Folkerts-Landau, Group Chief Economist and Global Head of Research\n“The question whether an agreement can be reached depends on how far the EU is willing to concede that it has used its strong negotiating position to push the May government into an agreement that was not tenable. On this point I am not overly optimistic. A so-called “disorderly” exit will not be as disorderly as commonly described. Economic necessity on both sides of the Channel will result in transitional emergency measures to achieve a continuation of cross border commerce. The short-term pain will be borne on both sides of the English Channel. We can predict with confidence that a disorderly exit without transitional emergency measures will produce a recession in 2019 in an already weakening EU economy. Even with a so-called disorderly exit the UK will recover economically over 3 to 4 years. In the long term, the UK outside the EU is highly likely to outperform the EU economically as a bloc.”\nOliver Harvey, Head of Brexit research at Deutsche Bank\n“After more than two years since the UK triggered Article 50 to leave the EU and over 18 months of negotiation, a positive Brexit resolution is finally in sight. We turn bullish on the pound, and target 0.84 in EUR/GBP.”\nHelmut Kaiser, Chief Strategist Germany, Wealth Management\n“As seen since the Brexit vote in June 2016 the fate of UK equities is highly dependent on the direction of GBP. Any decisions or policies that would lead into a “no deal” Brexit would amplify investors’ aversion to UK assets. While a sharp fall in GBP could act as cushion for UK stocks, such scenarios would add significant uncertainty, and could lead to a spike in volatility, accompanied with generally negative market sentiment.“\nStefan Kreuzkamp, Chief Investment Officer (CIO) and Co-Head, Investment Group\n“Unfortunately, everything remains possible: new elections, an extension of the deadline for Article 50, or even a second referendum. Like many of our peers, we continue to hope for an orderly exit of the United Kingdom from the EU. But the path to get there remains unclear, and in any case cobbled with plenty of hurdles. We also have to acknowledge that the probability of a hard Brexit has increased.”\nStefan Schneider, Chief Economist for Germany\n“It is a certain paradox: the clear defeat of Prime Minister Teresa May in particular could now pave the way for a cross-party solution in London. For the unpopular compromise with the EU, as it crashed to failure, could still become acceptable with some changes in London. The vast majority of MPs do not want a disorderly Brexit. The uncertainty for the German economy caused by Brexit will probably continue for some time to come. However, the German export industry has done its homework in recent months and is also preparing for a hard Brexit. Companies have prepared themselves to forge new supply chains and will make greater use of warehousing instead of just-in-time production.”\nUlrich Stephan, Chief Investment Officer Private and Commercial Clients\n“Many analysts have raised their forecasts for the pound because of the likely decline in uncertainty and are generally positive about the future of the British economy. I, too, expect the pound to remain strong: it is conceivable that May's catastrophic defeat will force a consensus in Parliament that will lead to renegotiations with the EU and can prevent a hard Brexit.\"",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}