{
    "url": "https://www.db.com/news/detail/20190116-deutsche-bank-receives-outstanding-community-reinvestment-act-rating-for-25th-consecutive-year?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 16, 2019",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank receives “outstanding” Community Reinvestment Act rating for 25th consecutive year",
    "body": "In 1994 – while the European Union was young and smartphones were still fantasies of science fiction, Deutsche Bank’s US predecessor company Bankers Trust Company Americas received its first “Outstanding” rating for its performance under the Community Reinvestment Act (CRA) from the Federal Reserve Bank of New York. Deutsche Bank has gone on to earn the highest-possible CRA rating in every subsequent examination, including the most recently-announced assessment for the 2015 through Q1’18 period.\nFirst signed into law in 1977, the Community Reinvestment Act is a federal law that requires regulators to assess and issue a public rating on how well a bank meets the needs of communities in terms of development lending, investing and services. Deutsche Bank was lauded for having “a high level of community development loans (and) community development services or qualified investments, particularly investments that were not routinely provided by private investors.”\nRegulators also noted the bank’s “excellent responsiveness to the credit and community development needs of its assessment area” of New York City and its extensive use of “innovative or complex” investments and financings. This deep engagement with the needs of low- and moderate-income neighborhoods has been an area of strength for Deutsche Bank, which committed 619 community development loans and investments totaling approximately $1.7 billion during the three plus years of the evaluation period.\nThe assessment highlighted Deutsche Bank’s commitment to affordable housing, which the Federal Reserve cited as an acute need in New York City. The bank targeted over 80% of its lending and investing toward affordable housing, including the proprietary Supporting Housing Acquisition and Rehabilitation Effort (“SHARE”) and Working Capital programs, which provided early stage financing and support for nearly 6,000 units of supportive and affordable homes in New York.\nIn addition to financing affordable housing, Deutsche Bank advances a range of other community development activities. The Community Development Finance Group and Deutsche Bank Americas Foundation support programs that ensure a high-quality educational environment for young people, build healthy communities, promote inclusive financial services and drive economic development in low- to moderate-income (LMI) neighborhoods. The bank’s employees contribute to this body of work, and to the bank’s CRA performance, through their ongoing pro bono and nonprofit board service for community-serving organizations.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}