{
    "url": "https://www.db.com/news/detail/20201216-alone-and-yet-united-helping-in-times-of-covid-19?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 16, 2020",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "Alone and yet united: helping in times of Covid-19",
    "body": "Our traditional charitable projects and fundraising activities in the Holiday Season are under a special star this year. For many people it will be a different Festive Season, in a small group, maybe by yourself. This makes our colleagues’ voluntary commitment and initiatives for disadvantaged and needy people all the more important. But distance rules and contact restrictions make it more difficult to get involved in charitable projects. We are therefore looking for new ways of helping, together with our non-profit partner organizations worldwide. We digitize our mentoring and coaching programmes across geographical borders, collect donations for local charities through connecting projects such as the PlusMySteps Challenge in 15 countries, and initiate alternative relief campaigns for people in need.\nThis is also the case in Frankfurt where the annual joint packing of parcels with seniors for the Christmas in a Shoebox project had to be canceled. Nevertheless, the needy children from mainly Eastern European countries will still receive their gifts. Thirty-five Deutsche Bank employees filled and packed 400 shoe boxes. As a substitute for the traditional Christmas party, a Christmas concert series lets seniors forget their worries about the virus for a while.\nDeutsche Bank has been flying the flag for those affected by HIV and AIDS on World AIDS Day since 2007 – this year too. Many charities – including AIDS relief organizations – currently have high donation shortfalls. In compliance with the hygiene and distance rules, colleagues were again involved in fundraising campaigns in Germany on December 1st. For the first time, the AIDS-Hilfe teddy bears could also be purchased online. In previous years, over 22,000 teddies were sold. This year, we raised more than 10,000 euros with around 1,500 bears sold. \nDonations for children experiencing homelessness doubled\nWe want to bring joy to children affected by homelessness in Leipzig and Berlin at Christmas. In the capital alone, one and a half van loads of in-kind donations were handed over to our partner organization Straßenkinder e.V. – twice as many as last year. In Frankfurt and Berlin, colleagues fulfill over 1,000 wishes from children and people in need – this year the wish cards are hanging on virtual Christmas trees. In many other German cities too, colleagues are getting involved, making Christmas decorations or packing bags full of gifts for children's hospices, nursing homes, food banks or other charities.\nIn London and Birmingham, employees can support by purchasing gift cards for those in care or by donating decorations for hospices. Many seniors and people with disabilities in Camden can look forward to festive Christmas mail. In addition, in-kind donations are being collected for homeless people in one of London’s poorest boroughs with our long-standing partner organisation Whitechapel Mission.\nIn Ireland, the Society of St. Vincent de Paul provides help to thousands of families which includes both essential food items as well as Christmas treats. Deutsche Bank volunteers have taken part in this annual food appeal for many years.\nThis year, our commitment to the Irish Charity of the Year, Write to Read, was recognised: we made it onto the shortlist of the Chambers Ireland Sustainable Business Impact Awards. We have been cooperating with Write to Read since 2012 and have since supported 13 disadvantaged primary schools in the Dublin city area to deliver innovative, quality literacy programmes where children are supported and encouraged to develop reading and writing as lifelong habits.\nIn South Africa. in the run-up to Christmas, we partnered with Food & Trees for Africa, to create a food garden for a school in Tembisa Township. Food & Trees work with projects in impoverished township communities, with a focus on food security, greening the environments and an education element on how to plant and maintain the gardens.\nCreating emotional links despite contact restrictions\nIn Singapore, colleagues want to create a pre-Christmas mood with a virtual baking event. Together with the charity SUN-DAC, a centre for people with disabilities, they bake Christmas treats via video conference.\nOur New York office is also celebrating a premiere this year by participating in the city's Secret Snowflake programme. As part of Deutsche Bank’s long-standing commitment to students experiencing homelessness, employees are answering 1,000 holiday wish letters from local youth in shelters or temporary housing.\nSo a lot is different this year. However, we are continuing our projects - partly on new channels and in innovative formats. \"The common commitment to enable communities and economies to prosper connects our colleagues and charitable partners across regions in the Covid-19 year 2020,\" says Lareena Hilton, Global Head of Brand Communications and Corporate Social Responsibility at Deutsche Bank. \"We thank all of them for creating a #PositiveImpact in their communities and for supporting the less fortunate around the world.”\nSeason’s greetings to all!\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 46
}