{
    "url": "https://www.db.com/news/detail/20201209-a-message-on-our-investor-deep-dive?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 9, 2020",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "A message on our Investor Deep Dive",
    "body": "Dear Colleagues,\nWhen we presented our new “Compete to win” strategy in London in July 2019, there were considerable doubts: would we be able to achieve our ambitious cost targets? Could we finance the biggest transformation in two decades with existing resources? And would our newly established Core Bank even be competitive?\nNow almost six quarters have passed and we can safely say that we have delivered on what we promised last year. That is exactly what today, our second Investor Deep Dive, is all about. We are going to show our investors what we have achieved together. And we are going to talk about what’s coming next: the third phase of our transformation. It will be different from the last two as we’re now switching from defence to offence.\nWe began fundamentally reshaping our bank back in 2018. In this first phase, we had to stabilise our business in order to even be able to launch the subsequent transformation. Our new strategy last summer marked the beginning of the second phase – one on which we can look back with pride.\nWe have achieved all our targets and we have fulfilled all our plans, sometimes even exceeding them. We have cut costs, reduced the balance sheet outside of the core business, managed risk conservatively and further strengthened our controls.\nThe question whether we can fund our transformation with existing resources is off the table. And despite this transformation, despite the pandemic and despite a global recession, we have been exemplary in serving our clients. We achieved year on year revenue growth in the first nine months and expect to close this turbulent year with a pre-tax profit.\nBut these figures are just one aspect of our success. Another aspect that is just as important is that we are once again gaining relevance. Today, no-one asks why we have a Deutsche Bank. We have impressively demonstrated during this crisis that we are needed – all of us together. And I’d like to thank you all most warmly for this on behalf of the Management Board.\nWe are now entering the third phase of our transformation – a phase in which we must also focus on sustainable growth and reliable profitability.\nWe have established a strong starting position; all our businesses are already benefiting from the fact that we have focused on our strengths. At the same time, this third phase is also marked by a far-reaching transformation in the economy as a whole, even beyond the pandemic. Digitization, climate change, and the increasing fragmentation of the global economy are making it necessary to restructure entire value chains, some of which are even being completely broken up.\nA universal bank, as we are, is now particularly called for. We therefore see the current difficult environment not only as a challenge, but also as a great opportunity. Our response to this is four growth initiatives:\nThe financing needs of companies and governments will continue to rise – and this is where we have our strengths: our Corporate Bank and our Investment Bank with a focus on the financing business. We are a financing powerhouse: whether it is our credit expertise, our Debt Capital Markets business or fixed-income trading – all of these will be in high demand in an environment like this. And in these areas, this year especially, we have impressively demonstrated how we support our clients worldwide and gain market share.\nIn times of negative interest rates, when asset preservation in ageing societies is becoming an ever-greater challenge, banks with exceptional advisory skills are at an advantage. Our Private Bank in Germany as well as our International Private Bank and our asset manager DWS will benefit most from this. In our home market, we are leaders in both areas of business, and our International Private Bank is gaining ground not only in Europe, but worldwide. We have the expertise, we have the products and we have the size to be a winner here in difficult times – despite the headwinds negative interest rates are causing.\nWe will benefit even more from our global network. In times of trade conflicts, globalisation will not disappear – but it will become more complicated. International companies need us all the more urgently as a strong partner with intimate regional and local knowledge. This is what we – as a global Hausbank – stand for, in particular our Corporate Bank and its network in 151 countries, with strong footholds in the United States and Asia.\nWe are also ideally positioned for a fourth major trend – sustainability. As a universal bank, we can create the kind of investment products that investors are increasingly looking for. After the considerable progress made in the past twelve months, this topic is gaining traction. Starting next year, the compensation of our most senior managers will be linked to us achieving our ambitious sustainability goals. DWS already has around 80 billion euros in assets under management that meet the highest environmental, social and corporate governance (ESG) standards.\nWe will be talking to our investors and analysts today about our opportunities and how we intend to take advantage of them, and of course we will keep you informed on the intranet.\nOver the past few months, my colleagues on the Group Management Committee and their teams have prepared detailed presentations that give a rare and deep insight into our bank. I would therefore like to encourage you to take the time to take a look at some of the material.\nLet me emphasise another priority, though: for us to be able to take these opportunities and turn revenue potential into sustainable profitability, we must at the same time maintain our rigorous discipline in terms of costs and capital. Confidence in our company has returned over the past few years largely because we managed to achieve each target we previously announced.\nWe intend to continue resolutely along this path of success, which is why we have adjusted our 2022 cost target from 17 billion down to 16.7 billion euros. The Covid crisis has highlighted additional savings potential – especially in view of our costs for office space and travel.\nWe will also continue to manage our balance sheet conservatively. With a Common Equity Tier 1 (CET1) capital ratio of 13.3 percent at the end of the third quarter, we do have some leeway – but we will examine carefully where we can put this to best use. We will continue to manage our risks conservatively in an uncertain environment. And we still need to strengthen our processes and controls. We reinforce our commitment to deliver a post-tax return on tangible equity of eight percent in 2022. Our progress so far shows us that we are on the right track. \nSo in this third phase of our transformation, our path will not be fundamentally different. But we are shifting gears. Exactly how we intend to do this will be the subject of tomorrow's Global Leadership Offsite. I will update you again following what will be two very work-intensive days.\nThank you very much for everything you have done to bring our bank this far – for your great commitment, your discipline, your tireless support. Let us look back with some pride at what we have achieved so far. But let us also stay focussed and continue working in the same way we have been these past few years. We have seen that it is worth it. I am very much looking forward to the next stage in our journey. \nBest wishes,\nChristian Sewing",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 9
}