{
    "url": "https://www.db.com/news/detail/20201209-12-wins-at-the-asset-country-awards-for-outstanding-asia-deals?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "Singapore, December 9, 2020",
    "tags": [
        "Awards",
        "Capital markets"
    ],
    "title": "12 wins at The Asset Country Awards for outstanding Asia deals",
    "body": "The Asset has recognised several Deutsche Bank deals in North Asia at the magazine’s Country Awards this year, including wins for ‘Best sovereign bond’ in Indonesia; ‘Best High-Yield bond’ in China; ‘Best cross-border M&A’ in China, and ‘Best Formosa bond’ for a sovereign in Taiwan. \nSovereign strength  \nAlso in the sovereign category, Deutsche Bank was recognised for its 4 billion euro mega sovereign bond for China’s Ministry of Finance (MoF) last month, the bank’s second consecutive annual euro benchmark for China and sixth consecutive transaction for the Ministry.  \nUnderlining Deutsche Bank’s market-leading strength in this category across the region, the bank also won ‘Best sovereign bond ‘ for the Republic of Indonesia’s US dollar 4.3 billion SEC-registered triple-tranche bond in April and for the State of Israel’s US dollar 5 billion single-tranche Formosa bond in March.\nIn other key wins, Deutsche Bank took home ‘Best cross-border M&A in China’ for PepsiCo’s US dollar 705 million acquisition of Be & Cheery in February. Acting as exclusive financial advisor to Be & Cheery, the APAC M&A team was able to progress the deal to announcement despite the significant challenges posed by the pandemic in China at the time.\nThe Asset Country Awards 2020: Deutsche Bank wins:\n·         Indonesia – Best sovereign bond – Republic of Indonesia USD 4.3 billion SEC-registered triple-tranche bond\n·         Indonesia – Best new bond – Hutama Karya USD 600 million government-guaranteed bond\n·         India – Best social bond – Shriram Transport Finance Company USD 500 million social bond offering\n·         India - Best new bond - Adani Electricity Mumbai USD 1 billion fixed rate senior notes\n·         India - Best high yield bond - Vedanta Resources USD 1.4 billion amortizing 3NC2 senior secured bond\n·         India – Best LBO - Baring Private Equity Asia USD 600 million leverage buyout financing for Hexaware Technologies\n·         China – Best sovereign bond - China Ministry of Finance EUR 4 billion multi-tranche senior bond\n·         China - Best quasi-sovereign bond - China Development Bank GBP 1 billion fixed rate senior unsecured bond\n·         China - Best high yield bond - Fosun International US 600 million senior notes\n·         China - Best cross-border M&A - PepsiCo USD 705 million acquisition of Be & Cheery\n·         Macau – Best bond - Studio City Finance Limited USD 1 billion dual-tranche bond\n·         Taiwan – State of Israel USD 5 billion single-tranche Formosa bond\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}