{
    "url": "https://www.db.com/news/detail/20171108-exclusive-artwork-by-marc-quinn-from-deutsche-bank-collection-now-on-display-at-tag-farnborough-airport?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 8, 2017",
    "tags": [
        "Art",
        "Corporate Citizenship"
    ],
    "title": "Exclusive artwork by Marc Quinn from Deutsche Bank Collection",
    "body": "Customers of Farnborough Airport can now enjoy an exclusive display of work by the leading British contemporary artist, Marc Quinn which are on loan from the world renowned Deutsche Bank Collection. In collaboration with Tatiana Ojjeh, Deutsche Bank Art, Culture & Sports and Deutsche Bank Wealth Management, the series of five works, entitled Through Eye of History, is on view at the airport’s state-of-the-art terminal until early next year, further enhancing the customer experience at Europe’s leading business aviation airport.\nAssembled by Tatiana Ojjeh, founder of ARTLINER: Art & Aviation and on loan to the airport courtesy of Deutsche Bank Art, Culture & Sports, this unique and striking collection of works by Marc Quinn presents images of the world map from various perspectives over images of the human eye.\nI am delighted to share this outstanding collection with new audiences beyond traditional museums and galleries and am confident that the airport’s customers will enjoy this unique experience.\nTatiana Ojjeh\n“This visually stunning collection is a welcome addition to our award-winning main terminal and following the success of our earlier exhibition of Damien Hirst artwork is the latest example of our on-going commitment to creating a unique and bespoke customer experience at the airport,” said Farnborough Airport CEO, Brandon O’Reilly.\n“The work of Marc Quinn is truly inspiring and we are delighted to present these works from the Deutsche Bank Collection to Farnborough. This initiative is part of our aim to provide clients, staff, and the general public with platforms to interact and experience aspects of today’s art, culture and sports,” said Thorsten Strauss, Global Head of Art, Culture & Sports at Deutsche Bank.\n“Art, Wealth Management and even our private jet financing capabilities resonate with many of our clients and other travellers. Our collaboration with Tatiana, Artliner and Farnborough will further enhance the quality of their experience while they are transiting through the airport. Hopefully, the artworks on display will add happiness and serenity to their journey,” said Salman Mahdi, Global Vice Chairman, Deutsche Bank Wealth Management.\nAbout Farnborough Airport\nFarnborough Airport is Europe’s leading business aviation airport and a key gateway to London. The airport is biennial host to the world’s leading airshow, the Farnborough International Airshow. Farnborough is the birthplace of British aviation and home of the country’s first powered flight in 1908.\nAbout Artliner\nArtliner was founded to bring modern master and contemporary artworks to audiences in creative new ways. It consults with buyers and galleries to identify important works, often from world-class collections or previous major museum shows, and creates exhibitions tailored to spaces unique to the world of private aviation.\nContact: Tatiana@artliner.com / +44 7825 499199\nAbout Deutsche Bank, Art, Culture & Sports\nDeutsche Bank’s commitment to art is a component of its Art, Culture & Sports department. The unit pools together the bank’s sponsorship programmes, developing them in a conceptual way. Together with its divisions, Deutsche Bank aims to provide customers with new ways to access art, culture and sports. Its involvement in contemporary art means Deutsche Bank is setting standards worldwide, be it with the Deutsche Bank Collection, one of the world’s most important collections of contemporary artworks on paper and photography, international exhibitions and the Deutsche Bank KunstHalle in Berlin. The bank has been present at selected art fairs such as Frieze London and New York for many years.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}