{
    "url": "https://www.db.com/news/detail/20171107-florian-drinhausen-to-become-general-counsel-of-deutsche-bank?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 7, 2017",
    "tags": [
        "Company"
    ],
    "title": "Florian Drinhausen to become General Counsel of Deutsche Bank",
    "body": "Florian Drinhausen (49) will become Deutsche Bank’s General Counsel next year, leading the Legal Department. He replaces Co-General Counsels Christof von Dryander and Simon Dodds, who will leave the bank at the end of the year and as of March 31, respectively. From January 1, 2018, Drinhausen will take on von Dryander’s responsibilities, and will then be sole General Counsel as of April 1. He will also still be responsible for the bank’s governance structures around the world.\n“The Legal Department has had very successful years under Christof and Simon’s leadership. This has been thanks to their exemplary cooperation and hard work,” says Management Board Member for Legal and Labour Director (Arbeitsdirektor) Karl von Rohr, adding that he is delighted that with Florian Drinhausen, the bank has found an internal successor. “He is an excellent lawyer and a very experienced manager, who is very familiar with the bank and the challenges we are facing,” says Karl von Rohr.\nThe future General Counsel was a partner at law firm Linklaters for close to ten years, before joining Deutsche Bank in 2014 as General Counsel for Europe, the Middle East and Africa. He took over the Global Governance function in 2016. Drinhausen received a doctorate in law from the University of Cologne and a master’s degree (LLM) from King’s College in London. He is an honorary Professor at the EBS University of Business and Law.\nBanking and capital markets legal expert von Dryander joined Deutsche Bank in 2013 after more than 30 years with the law firm Cleary Gottlieb Steen & Hamilton. At the time, he took over the role of General Counsel for Germany and Central & Eastern Europe as well as for the Asset & Wealth Management and Private & Business Clients divisions globally.\nDodds also began his career at Cleary. He joined Deutsche Bank 1999 as General Counsel for United Kingdom as part of the takeover of Bankers Trust. In 2002, he also assumed legal responsibility for Western Europe and became Global Head of Compliance in 2010. Both were appointed as Co-General Counsels of Deutsche Bank two years ago.\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Contact\nChristine Peters\nPhone: +49 69 910-62303\nE-mail: christine.peters@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}