{
    "url": "https://www.db.com/news/detail/20171102-deutsche-bank-tops-asia-sovereign-debt-league-tables?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 2, 2017",
    "tags": [
        "Investment Banking"
    ],
    "title": "Deutsche Bank tops Asia sovereign debt league tables",
    "body": "Last week when the People’s Republic of China issued its first sovereign US dollar bond in thirteen years, Deutsche Bank was selected as one of only four international bookrunners. The landmark 2 billion US dollar transaction drew very strong investor demand and will help to establish a new benchmark curve for future foreign currency bonds from Chinese state-owned issuers. The unrated bonds have since traded close to par with US treasuries.\nThis successful transaction nicely highlights Deutsche Bank’s dominance in Asia’s sovereign bond market, where the bank ranks number one in year-to-date league tables, commanding nearly 16 percent market share, according to Bloomberg. This year alone, the bank has helped China, Mongolia, Indonesia, Sri Lanka, and the Philippines raise more than 12 billion US dollar from global markets.\nThe strength within the region leverages and complements the bank’s success on Sovereigns, Supranationals, and Agencies (SSA) globally as well as in the Australian market. Deutsche Bank is also currently the #1 investment bank for all government and semi-government bonds in Australia, having led ten transactions totalling 23.45 billion Australian dollar for 2017 year-to-date .\nJake Gearhart, Asia Pacific Head of Debt Origination and Syndication said, \"Our track record in bringing regional sovereigns to the market speaks for itself, and our recent role in such a symbolic, globally important issuance for China was an honor. Deutsche Bank’s selection on the transaction is a direct reflection of the strength of our fixed income platform in China, both onshore and offshore. We are very proud of the work we have done over the years as a bank across the entire franchise that has contributed to the opening of the country’s massive fixed income markets, both in G3 currencies (US dollar, euro and the Japanese yen) and in Renminbi.\"",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}