{
    "url": "https://www.db.com/news/detail/20171101-deutsche-bank-leads-three-out-of-four-insurance-ipos-in-india?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 1, 2017",
    "tags": [
        "Capital markets",
        "Investment Banking"
    ],
    "title": "Deutsche Bank leads three out of four insurance IPOs in India",
    "body": "This quarter, Deutsche Bank led India’s two largest insurance initial public offerings (IPOs) since 2010. The bank’s Equity Capital Markets business managed General Insurance Corp of India’s (GIC) 1.7 billion US dollar listing and SBI Life’s 1.3 billion US dollar IPO, as the Indian insurance companies took advantage of the strong underlying market to tap into investor appetite.\nIncluding ICICI Prudential’s 2016 904 million US dollar issue, Deutsche Bank has now arranged the IPOs of three of the four currently listed Indian insurance companies.\nGIC is a wholly owned company of the Government of India and one of the country’s largest reinsurers. SBI Life is a joint venture between India’s largest bank, State Bank of India, and BNP Paribas Cardif, the French bank’s insurance subsidiary. Both companies stand to benefit from the growing insurance business in India which traditionally has lower insurance penetration.\nDeutsche Bank is also the only bank to book run all the 6 largest IPOs since 2007. \"These marquee transactions underscore our expertise in executing equity capital markets transactions and strengthens Deutsche Bank’s leadership position in the Indian and Asian market,\" said ECM India Head, Sanjay Sharma.\nThe 1.7 billion US dollar GIC IPO is the largest Indian insurance flotation since 2010 and third largest in India year-to-date. The offering is part of the Indian government’s plan to sell stakes in state-run firms and is expected to help augment GIC’s capital base for growing its business internationally. The transaction saw strong participation from institutional investors, with Deutsche Bank procuring the most orders among the syndicate of five banks.\nSBI Life raised 1.3 billion US dollars from institutional and non-institutional investors. The order book was 3.6 times subscribed, a significant feat given the issue size. Deutsche Bank has now led all four of SBI’s large equity offerings including its 4.3 billion dollar rights issue in 2008.\nDeutsche Bank also helped the Indian Government with its 5 percent stake sale in its mining public sector unit (PSU) Neyveli Lignite (NLC), as part of its PSU disinvestment programme. The sale brought in funds of 116 million US dollars.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}