{
    "url": "https://www.db.com/news/detail/20171218-2017-a-season-filled-with-positiveimpact?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 18, 2017",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "2017: a season filled with #PositiveImpact",
    "body": "Throughout the year, Deutsche Bank employees create a positive impact for clients and society. During the Christmas season, their commitment is even stronger: they pack food boxes for low-income families in Japan, donate shoes for children in South Africa, or organise Christmas bazaars and fundraising initiatives to support the less fortunate in communities around the world.\nThe annual Charity Trading Day is a tradition in South Africa. Since 2000, Deutsche Bank employees and institutional clients have joined forces to donate the revenues of one trading day to charitable projects. This year’s proceeds\n– 3 million South African rand (approx. 200,000 euros) – go towards Deutsche Bank’s Born to Be youth engagement programme, specifically to Empowervate’s Youth Citizen Action Programme (YCAP), which motivates youth to be implementers of positive change and active citizens.\nOn World Aids Day (Dec 1) Frankfurt colleagues sold more than 1,500 teddy bears, which have become an icon of the initiative since 1980. They stand for a world without prejudice and social exclusion. This year, more than 12,000 euros has been raised for HIV charity AIDS-Hilfe.\nEmployees from all divisions in London organised a Christmas party at a community centre for vulnerable people in Poplar. This year also marks the twentieth anniversary of StreetSmart, a fundraising charity for homeless people in the UK. Since Deutsche Bank started supporting StreetSmart in 2006, the charity has generated 6.1 million pounds. Another milestone was reached with our UK Charities of the Year Autisitica and Hope and Homes for Children, for which employees have raised a record 4 million pounds.\n  Equally, the annual Donate One Day initiative has been a major success in Singapore. This year, over 500,000 Singaporean dollars (approx. 300,000 euros) was raised for four partner organisations. In addition, a Christmas charity bazaar took place on International Volunteer Day to connect colleagues with selected partner charities\nOur Spanish colleagues joined the national campaign “Una Sonrisa por Navidad” (A Smile for Christmas), providing Christmas presents to children in need. The children can make wishes via cards hanging on Christmas trees in Spanish branches. Further Christmas tree initiatives for the benefit of disenfranchised people also took place at other locations across Germany and Europe.\nChristmas in a Shoebox has become an integral part of our portfolio in Germany. This year, colleagues sent 500 gifts to children in poorer regions of Eastern Europe. We also encourage colleagues, clients and the interested public to support our partner charities in Germany and to make donations.\nIn the coming months, our engagement will continue. Colleagues are already looking forward to supporting soup kitchens in a local church in Frankfurt or at the Whitechapel Mission in London.\nMerry Christmas and Happy New Year 2018 from the CSR team.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}