{
    "url": "https://www.db.com/news/detail/20171215-who-is-propping-up-the-bitcoin-market?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 15, 2017",
    "tags": [
        "Corporate products",
        "Cryptocurrencies"
    ],
    "title": "Who is propping up the Bitcoin market?",
    "body": "In a research note published on December 14, Deutsche Bank Global Financial Strategist Masao Muraki outlined the typical profile of a potentially large constituency of investors in the cryptocurrency market. Following a December 11 Nikkei report which stated that 40% of cryptocurrency trading in October and November was yen-denominated, and estimates in the market that Japanese traders have reportedly come to account for nearly half or cryptocurrency trading, Muraki explored the true face of investors engaged in leveraged FX trading.\n“Mrs. Watanabe” is a term often used in financial media to represent the typical Japanese retail investor who trades in FX. Japan accounts for 54% of the world’s leveraged foreign exchange (FX) trading. Muraki posits that “Mrs Watanabe” retail investors are shifting from leveraged FX trading to leveraged cryptocurrency trading.\nMuraki notes that data from GMO Click Securities indicates that men hold 79% of FX trading accounts, and that 63% of these men are aged 30-49. The typical Japanese leveraged FX trader is thus a man in his 30s or 40s, so more likely a “Mr Watanabe”. He points out that according to a survey by the Bank of Japan, Japanese retail investors are less financially literate than their US peers across all age groups. A recent survey by the Financial Futures Association of Japan also reveals that the top three reasons Japanese retail investors engage in leveraged FX trading are 1) expectations of high returns, 2) they can easily invest in foreign currencies, and 3) many investors are earning profits.\nGiven that cryptocurrencies like Bitcoin that have pure distributed systems do not have value guaranteed by an issuer, theoretically the valuation of exchange rates between legal tender and cryptocurrency should be the vital factor in determining fair value. However, retail investors like “Mr Watanabe” are currently carrying out price discovery.\nMuraki cautions that due to high intraday volatility in cryptocurrency trading, compared to normal FX trading, there is high risk of retail investors suffering losses greater that margin. And since leveraged cryptocurrency trading services are available in Japan, Muraki adds that brokers could end up booking credit losses. “Some major FX brokers are using the same 25-times leverage limit that applies to FX trading, but there are no direct rules in leveraged trading of cryptocurrency,” Muraki notes.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}