{
    "url": "https://www.db.com/news/detail/20171215-blockchain-the-power-of-interaction?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 15, 2017",
    "tags": [
        "Corporate products",
        "Cryptocurrencies"
    ],
    "title": "Blockchain: The power of interaction",
    "body": "Blockchain technology looks set to revolutionise key parts of the financial system as it plays its role in the unstoppable onward march of digitalisation. While it remains unclear just where the decentralised register principle will ultimately prevail, this technology most certainly has potential.\nHas the cargo been loaded onto the container ship? Has it gone through customs? Might the ship already have left the port?\nCargo shipping is highly bureaucratic. Dozens or even hundreds of individual steps need to be documented. Up to now, most of this documentation was done on paper, which makes the process expensive, complex and can delay transport – very problematic with perishable goods.\nThis might soon be a thing of the past. There have been tests for a process giving all participants the same up-to-date information so that everyone knows at any time which stages the ship has passed through, which approvals have been submitted and which still need obtaining. And it is blockchain technology that is making this possible.\nBlockchain has gained fame as the technology that underpins the cryptocurrency bitcoin, whose surge in value is being widely discussed. And yet, blockchain is wrongly in bitcoin’s shadow; the digital currency is just one of many possible uses for the technology. The Economist recently even compared its rise to the invention of double-entry accounting 500 years ago. Does blockchain technology really have the same historical dimension?\nOne thing is sure: it has the potential to initiate significant change, including in the financial services industry, changing banks’ business models as well as the business models of their clients from a multitude of industries.\nAs an engineer working for Boeing and Ford, I was always impressed by the degree of process excellence those manufacturing industries have achieved. Blockchain could provide an opportunity for banks to make progress in that respect as well. Technology and financial experts are, however, still not agreed on just how much potential blockchain actually has. The test and pilot phase is well underway.\nBlockchain technology is based on a decentralised transaction register or log or, more accurately, distributed ledger technology (DLT). Put simply, blockchain is a digital accounting system that does away with the need for a central register. What is special about blockchain is that although numerous parties play a role in this decentralised accounting system, a consensus is reached about which entries are correct. Data sets, for example transactions, are entered as blocks of data into a digital register once the participants agree on these data. The blocks are given a time stamp and contain all data that is important for the transactions and are linked to each other.\nIt might sound cumbersome at first, but it is something from which we could profit in several areas of our lives: essentially, anywhere where lists or registers are kept or need continual updating. A good example is the logistics sector, another is the financial industry. At the end of the day, banks’ inner workings are a large collection of lists, registers and accounts.\nSo what advantages might blockchain technology bring to banks?\nTo begin with, blockchain simplifies operations, for instance by automating the process of matching positions against accounts. It makes clearing and settlement faster and avoids reconciliations at late stages. Second, the high level of transparency also helps banks fulfil regulatory requirements more efficiently. And third, the new technology also reduces the risk of a business partner not, or not adequately, fulfilling their obligations; the conditions of any transaction are transparent and fixed, not to be changed. Fourth, this also reduces the risk of fraud because the decentralised register stores the entire data pertaining to any transaction as well as the origins of the traded assets. And fifth, blockchain technology also saves money as interim steps and bypasses become superfluous because all the parties use a common register.\nThe result is that banks might utilise the benefits of blockchain in many areas – for example in securities trading, trade finance and corporate finance, for instance with syndicated loans and bond issuance. However, private distributed ledgers are the only type suitable for banks, otherwise known as “permissioned ledgers”, where the participants know each other. This is because banks must have precise knowledge of their clients and protect their data. In public ledgers, by contrast, the participants are anonymous – as is the case with bitcoin, for example.\nWhile the expectations of DLT are constantly growing, it is currently still only a minor player. A lot of testing is still being conducted, including by Deutsche Bank. Although our experts expect the first applications in the financial sector may be launched in the coming year, for most of them the pilot phase will last years rather than months.\nThe main reason is that banks have to comply with strict requirements laid down by regulatory authorities and lawmaking institutions – and this is right and proper. A bank has to comply with data protection laws, its systems and the technologies must function at all times even during stress phases.\nThese exacting standards are one of the reasons why banks are working closely together to develop distributed ledger technology. Deutsche Bank is currently participating in several consortiums. In the “Utility Settlement Coin” project for instance, we are combining the advantages of both digital and traditional currencies to smoothen transactions using blockchain, first between other banks and later between companies. And we were one of the founding members of the joint platform “we.trade” (formerly “Digital Trade Chain”) that was set up in cooperation with other European banks to simplify domestic and international trading for small and medium-sized enterprises.\nThe technology has potential, but it also has limits. It is not the answer to all the questions that affect the future of the banking business. We see DLT as merely one of a number of digital trends to turn the whole industry on its head and propel change. Other things that command just as much of our attention are: artificial intelligence, cloud technology, the Internet of things, and opening programme interfaces both to external developers as well as to fintechs.\nDigitalisation is the financial sector’s greatest revolution since current accounts stopped being run on paper. When we say that companies like Deutsche Bank have to become technology companies, it’s not just a hollow phrase. Everything is in a state of flux. We can no longer reliably tell how the financial world will look in 10 years. One thing is certain: only those companies that have managed to digitalise their businesses will still be a part of it. And blockchain is one of the building blocks to achieve this.\n©Handelsblatt, 15 December 2017, page 72-73",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}