{
    "url": "https://www.db.com/news/detail/20171214-deutsche-bank-rolls-out-new-ai-based-equities-algorithmic-platform-in-apac?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "December 14, 2017",
    "tags": [
        "Corporate products",
        "Private products"
    ],
    "title": "Deutsche Bank rolls out new AI-based equities algorithmic platform in APAC",
    "body": "Deutsche Bank today announced the implementation of an upgraded equities trading platform with artificial intelligence (\"AI\") capabilities, setting a new benchmark for best execution, a key focus for financial institutions ahead of MiFID II.\nUnder MiFID II, financial institutions will have to demonstrate they have taken sufficient steps to obtain the best possible result when executing client orders. Using a unique combination of next-generation algorithms, Deutsche Bank's enhanced equities trading platform is one of the most functionally rich solutions deployed in the market to date.\nThe proprietary platform, Autobahn 2.0, was designed with a self-learning mechanism allowing its systems to predict equities pricing and volume with more accuracy, thereby enhancing the quality of execution. Furthermore, the system is equipped with momentum detection, to allow Autobahn to change behaviour in trending markets or switch quickly at inflection points. This will offer investors a powerful new tool in achieving and demonstrating best execution for their trades.\nThe platform has already been rolled out in most Asia Pacific markets with completion targeted in early Q1 2018.\nHani Shalabi, Co-Head of Equity Execution for APAC at Deutsche Bank said, \"We are proud to be adding significant horsepower to our already well-known Autobahn platform, paving the way for new best execution standards. The enhanced capabilities from a prediction and measurement perspective will be very valuable for our clients as they ready themselves for a MiFID II world.\"\nNick Silver, Co-Head of Equity Execution for APAC at Deutsche Bank added, \"Autobahn 2.0 will also help us to reduce technology risk and save costs for our clients, which strengthens our broader service offering. Our system is smarter and sharper than it has ever been.\"",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}