{
    "url": "https://www.db.com/news/detail/20171212-china-2018-outlook-striving-for-a-new-growth-model?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 12, 2017",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "China 2018 outlook – striving for a new growth model",
    "body": "Deutsche Bank has published its\nPDF\n2018 China economic outlook. According to Dr. Zhiwei Zhang, Deutsche Bank’s Chief Economist and Head of Equity Strategy for China, 2017 has been a good year for China's economy, with strong consumer and service-sector growth. The property market boom continued in tier 3 cities. Supply-side reforms have paid off with improved industrial profits. The global economic environment was also supportive, with strong growth in Japan and Europe. Market volatility was subdued, and the renminbi (RMB) has been strong against a weak US dollar.\nThe next five years hold a number of structural challenges for China. Global interest rates look set to rise. The labour force in China is shrinking. Property and infrastructure investments face constraints as growth drivers. So, in the next few years, China will strive for a new growth model – focusing more on sustainability and quality, and less on speed. We expect a few sectors, such as advanced manufacturing and medium-to-high end consumption to emerge as new growth engines in 2018.\nGDP growth is likely to slow to 6.3 percent in 2018. The figure may drop to below 6.5 percent in H1, which will lead the government to loosen property sector policy somewhat in Q2 and enable a small rebound in H2.\nIn terms of policies, China will probably maintain its official fiscal deficit at 3 percent of GDP, but total fiscal spending is expected to slow, dropping from 13 percent to 5 percent. Deutsche Bank expects the People’s Bank of China (PBOC) to keep benchmark policy rates stable in 2018, with risk to the upside, particularly in H2. The bank also expects the PBOC to cut the reserve requirement ratio (RRR) twice in H2 2018. The USD/CNY exchange rate is anticipated to be 6.70 and 6.90 at the end of 2018 and 2019 respectively, as the shrinking current account surplus puts persistent pressure on the RMB to depreciate.\nHeading into 2018, the external economic environment is changing. Monetary conditions are tightening at major central banks. The quantitative easing peak is now behind us: asset purchase programmes of the European Central Bank and the Bank of Japan will reduce in size, and the Fed's balance sheet will shrink in 2018. Meanwhile, the Fed is clearly in a rate hike cycle, with the next hike expected in December. Deutsche Bank economists expect four more Fed hikes in 2018 and three in 2019.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}