{
    "url": "https://www.db.com/news/detail/20230929-deutsche-bank-wins-best-global-fx-provider-in-euromoney-fx-awards?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 29, 2023",
    "tags": [
        "Global",
        "Investment Bank",
        "Awards"
    ],
    "title": "Deutsche Bank Wins Best Global FX Provider in Euromoney FX Awards",
    "body": "Today, Euromoney announced that Deutsche Bank is the best Global FX Provider in this year’s FX Awards.  \nIn addition to the Best Global FX Provider, Deutsche Bank scooped accolades in multiple categories: \nBest FX Bank Europe \nBest Bank for FX Trading \nBest Bank for Forwards/Swaps \nBest Bank for FX Spot \nBest FX Bank Asia-Pacific  \nThe Euromoney Foreign Exchange Survey has been a respected benchmark in the wholesale FX market for over 44 years.  This year, a panel of industry experts representing banks, providers, and buy-side corporations rigorously evaluated contenders against a range of measures.\nIn its write up on the global award, Euromoney noted the global breadth of Deutsche Bank’s FX business, the market share gains made by the bank in key segments such as spot transactions, and the enhancements made to the bank’s electronic trading platform Autobahn.\nRam Nayak, Co-Head of the Investment Bank and Head of Fixed Income & Currencies at Deutsche Bank, said: “Foreign Exchange has long been a core strength of Deutsche Bank. We welcome the 2023 results which affirm our position as the go-to bank for clients looking for FX solutions.”\nDavid Leigh, Head of European FX at Deutsche Bank, said: “Through sustained investment in our technology we have been able to produce increasingly sophisticated and innovative solutions for our clients enabling them to execute faster, smarter and in a way that is tailored to their bespoke needs.”\n\nContact \nJo Court \n+44 (0) 7879 272651 \njoanne.court@db.com  ",
    "number_of_ratings": 4,
    "rating": 5.0,
    "likes": 7
}