{
    "url": "https://www.db.com/news/detail/20230927-dominik-hennen-to-manage-newly-created-personal-banking-unit?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, September 27, 2023",
    "tags": [
        "Personnel announcements"
    ],
    "title": "Dominik Hennen to manage newly created Personal Banking unit",
    "body": "Deutsche Bank has appointed Dominik Hennen as Head of Personal Banking. The business unit comprises the retail activities of both the Deutsche Bank and Postbank brands, serving the majority of the 19 million customers of the Private Bank. Hennen will start on October 1, 2023 and will join the Private Bank Executive Committee. He will report to Lars Stoy, Head of the Private Bank in Germany.\nClaudio de Sanctis, member of Deutsche Bank’s Management Board and Head of the Private Bank, said: “We aim to expand our market leadership in retail banking in Germany. Dominik Hennen is a leader who knows how to efficiently target a business model to meet the needs of customers, relying on new digital products, innovative distribution channels and excellent customer service. He is the ideal person to drive the next phase of growth of our German retail business.”\nLars Stoy added: “By bringing our customers together on a unified IT platform, we have completed the groundwork  to rigorously digitalise our processes, products and services. Over the course of his career, Dominik Hennen has implemented several major transformation processes at financial service providers. He also has a deep knowledge of sales processes and will continue to consistently align the organisation with the needs of our customers.”\nDominik Hennen joins Deutsche Bank from insurance group Talanx, where he has held various Management Board positions since 2017, most recently Chief Transformation Officer in the Germany retail division. As a member of the management board of HDI Versicherungen he was responsible for the digital and agile transformation of the German organisation and, as interim Head of Operations, he overhauled and stabilised the firm’s customer service. From 2017 to 2021, he was Chief Sales and Marketing Officer at PB Lebensversicherung (life insurance) where he was, among other things, responsible at board level for establishing new digital distribution channels. During this time, he also managed the company’s sales partner relationship with Postbank for five years. He began his career in 2007 with McKinsey and Company, where he worked in growth, merger and restructuring projects in banking and insurance.\nDominik Hennen said: “The retail business, which encompasses two household brands in Deutsche Bank and Postbank, which are known to everyone, has enormous potential. The outlook is good following the completion of the IT migration providing room for new growth initiatives. And Deutsche Bank has the smartest minds in the industry as well as enormous excellence in sales. I’m looking forward to working with the team to strengthen our market-leading position with excellent products and services for our customers.",
    "number_of_ratings": 8,
    "rating": 3.3,
    "likes": 10
}