{
    "url": "https://www.db.com/news/detail/20230920-christian-sewing-s-keynote-at-the-handelsblatt-banken-summit-2023?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 20, 2023",
    "tags": [
        "Company"
    ],
    "title": "Christian Sewing's keynote at the Handelsblatt Banking Summit 2023",
    "body": "Good morning,\nI am very pleased to be with you today and to talk to you about the environment in which banks operate. This may surprise you, because the headlines in recent weeks have been anything but pleasing: \"The fat years are over,\" \"Germany is sinking into mediocrity\" or even \"Germany is crashing\" were just some of the words used – and again and again the metaphor of the sick man was used.\nBut there were also other voices. Two weeks ago, Mr Matthes, you called for more optimism in a piece in Handelsblatt. And that's exactly where I want to start today: I don’t know where to begin with all the swan songs that are currently being sung to Germany's economy. We are not the sick man of Europe.\nWe still have a great deal of substance, first-class companies, highly trained specialists and resilience that we have proven several times in recent years. And even if we are not – or no longer – the pioneers in most technologies, our economy has proven time and again that it is still at the forefront of adapting innovations.\nThis does not all disappear simply because the economy does not grow for three quarters. But it is also true that there are structural weaknesses that hold back our economy and prevent it from developing its great potential. And we will become the sick man of Europe if we do not address these structural issues now.\nThese weaknesses are clearly identified: energy costs are too high and unpredictable, slow Internet connections plague many regions, outdated rail networks, significant backlogs in digitalisation, a shortage of skilled workers, excessive bureaucracy and long approval procedures.\nAnd actually, on most of these issues, there is broad agreement on how to address them. If you put the many reform proposals that are currently circulating side by side, there is a great deal of overlap in terms of content. That is why I will not go into detail about the necessary reforms in this speech. It's pretty clear what needs to be done. And this has been the case for years.\nWhy, then, do we see so little actual change? From my point of view, there are three crucial points:\nThe first concerns our attitude: the success of the 2010s made us too complacent. For too long, we got the idea that the economy will continue to run itself and that we don't have to do much to succeed. We discuss the four-day week, the redistribution of wealth and whether growth is still desirable at all. In doing so, we negate the basic economic principle that you must do something before you get something. And we have created a paralyzing aversion to change.\nThat’s a big contrast to the turn of the century, when Agenda 2010 laid the foundation for the golden decade of the German economy. At that time, there was a consensus, a broad acceptance that we needed to change. We need this consensus again, and we need it urgently. Investors from abroad tell us this very clearly. They are expressing ever more open concerns about whether Germany is in a position to change at all. Their scepticism is increasingly reflected in their investment portfolios – which they often prefer to deploy elsewhere. And that directly harms our economy.\nMy second point is even more fundamental. For me, all the reform plans that have been presented so far have one flaw: they are far too nationally conceived – at a time when Europe's unity is more in demand and necessary than ever. At least since Russia's invasion of Ukraine more than 18 months ago, we have known that we are at a geopolitical tipping point. Globalization as we knew it no longer exists. Today, people around the world are once again thinking more in terms of blocs, distinguishing between allies and rivals. The economy will also be re-shaped by these geopolitical shifts. And for me, that means, first and foremost, that Europe as a region or bloc must be given a completely new status. We have talked a lot in recent years about Europe's strategic autonomy. However, this will only happen if Europe gets serious and consistently strengthens what we have in common: that is, finally completing the internal market and pursuing a common energy and education policy. And that means that the necessary investments in defence follow a European strategy – anything else would be completely inefficient. A real agenda that allows Europe more sovereignty and independence from other states and regions would be the best form of de-risking in a world of global conflict and uncertainty.\nThis leads to my third point and what needs to be the focus of the Handelsblatt Banking Summit. And that is the importance of our financial centre – here in Frankfurt and in Europe as a whole. A European agenda can no longer ignore the issue of financial autonomy. Last year, we learned a bitter lesson about how wrong it was to rely exclusively on a single, non-European supplier for natural gas. We must not repeat this mistake in the financial sector – even if we are talking about dependence on an ally like the United States. Europe needs a more efficient and globally competitive financial system – including much deeper capital markets and banks that have the capacity and expertise to provide their clients with access to these markets.\nIn a world marked by conflict and the formation of blocs, the European economy must not become too dependent on non-European banks.\nChristian Sewing, CEO\nI don't need to tell you that the trend has been going in the opposite direction for years. There are not even a handful of European banks that are globally competitive. And these banks, too, are falling further and further behind the global market leaders – and not just the Americans. China's ICBC has nearly $500 billion in equity, compared to Deutsche Bank's $60 billion. At $3.4 trillion, its loan book is larger than that of Deutsche Bank, Unicredit, Santander and HSBC combined.\nLadies and gentlemen, something urgently needs to change here. In Europe, we need a framework that gives banks more leeway to lend, facilitates capital market financing and enables Europe-wide growth. I am not saying this out of self-interest: in a world marked by conflict and the formation of blocs, the European economy must not become too dependent on non-European banks. What is needed are domestic banks that are able to act and that can protect themselves against multiple risks. And there is a need for strong institutions that support states and companies in their digital and sustainable transformation. That involves advice and risk management – but it's also about financing on a huge scale. \nThat is why I can only renew my plea: the European capital markets union must come into being in order to ensure the long-term financing of our economy. On the way there, we need intermediate steps such as facilitation of securitisation. The joint initiative of Finance Ministers Lindner and Le Maire on this is a strong signal that I highly appreciate. And we need regulation that does not restrict banks further and further but also keeps an eye on their competitiveness.\nBut ladies and gentlemen, I do not want to make things too easy for myself and simply hold others accountable. The biggest task lies with us banks. As a result of the global shifts, our role is also changing – and in my view, it is becoming bigger and more important. We are more in demand than ever as risk managers and advisers. This is a great responsibility, but also a great opportunity to create new trust. We can and must now prove that we create added value for our clients. If we succeed in doing so, I am convinced that there will also be an increasing willingness to meet us halfway when it comes to regulation.\nWe have created the conditions for this in recent years. We have restructured ourselves and brought ourselves into a robust condition in order to be fully there for our clients in difficult times. With success: Germany's and Europe's banks are now more profitable than they have been for many years.\nBut we must not deceive ourselves: we are still lagging behind our international competitors, even if the special economic situation caused by interest rates currently glosses over this somewhat – more for some institutions, less for others. That's why we need to keep working hard, become even more profitable, invest in people and technology, and optimize the customer experience.\nI say this in the full knowledge that we at Deutsche Bank and Postbank have recently disappointed our customers very much in this respect. We have not lived up to our responsibility here – and now we have to work all the harder to fix the problems quickly and completely - and regain trust.\nIf we can do this, and if we – as a bank and as an industry – live up to our established role, then we will have a great, perhaps even unique, opportunity to make a fundamental contribution to our economy, to underpin our important role and thus also to lay the foundation for future growth.\nWhat I said earlier also applies to us banks: we too must be prepared to give everything for success. We need to be hungry to deliver the best possible performance for our clients, moving forward with optimism and confidence. And we have to be prepared to change again and again, because the environment and our clients’ requirements will also change constantly.\nThis is the most important contribution we can make. So that our economy remains competitive – and so that we can soon read more positive headlines again.\nThank you for your attention.",
    "number_of_ratings": 12,
    "rating": 4.7,
    "likes": 22
}