{
    "url": "https://www.db.com/news/detail/20230912-deutsche-bank-announces-launch-of-db-investment-partners?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 12, 2023",
    "tags": [
        "Investment Banking"
    ],
    "title": "Deutsche Bank announces launch of DB Investment Partners",
    "body": "Deutsche Bank has today announced the launch of DB Investment Partners (DBIP), a new investment manager established to give institutional and high net worth clients access to private credit investment opportunities. The entity will operate independently of Deutsche Bank, and Deutsche Bank will retain its existing balance sheet-driven private credit business.  \nDBIP will be independently chaired by Jon Aisbitt, the former Chairman of Pension Insurance Corporation and Man Group plc. It will be run day to day by CEO Raheman Meghji.\nDB Investment Partners will invest across a range of private credit investment strategies and asset classes including corporates, real estate and asset-based finance. This will include renewable finance and energy transition financing as well as infrastructure financing globally.  \nDBIP CEO Raheman Meghji said: “Deutsche Bank has a longstanding track record in private credit investing across sectors and geographies. DBIP will offer investors a way to access a set of differentiated investment opportunities sourced through Deutsche Bank’s global banking footprint and local market presence.”\nChairman Jon Aisbitt said: “I am excited to be taking on the chairmanship at DB Investment Partners. Investor and borrower demand for private credit solutions continues to grow. Deutsche Bank has a strong track record in the space and the senior DB Investment Partners team has a wealth of investment experience through the cycle and across asset classes.”\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations                                             \nCharlie Olivier\nCharlie.olivier@db.com\n+44 7917151627\nAlexandra Umpleby-Walker\nAlexandra.umpleby-walker@db.com \n+44 7467448780",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 14
}