{
    "url": "https://www.db.com/news/detail/20230907-deutsche-bank-helps-boost-supply-chain-financing-for-smes-in-asia-pacific?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 7, 2023",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank helps boost supply chain financing for SMEs in Asia Pacific",
    "body": "Deutsche Bank is partnering with The Asian Development Bank (ADB) to make supply chain financing more accessible for small and medium-sized enterprises (SMEs) in Asia Pacific through an agreement that could facilitate over 200 million US dollars in additional trade in the region each year.\nSupply chain finance provides critical working capital to companies, helping them to increase business activity and trade. Banks play an important role in the process, managing the capital invested in the supply chain and reducing the risk for the parties involved.\nHow it works\nThrough the new ‘Risk Participation Agreement’, Deutsche Bank and ADB will share the risk involved in supply chain financing, meaning that both parties can help more SMEs through ADB’s Trade and Supply Chain Finance Program.  \nIn this case, Deutsche Bank supports the SMEs via its Global Hausbank clients; offering them supply chain financing which helps improve cash flow to their suppliers, typically SMEs. By sharing the supply chain risk with ADB, Deutsche Bank can help facilitate more financing to these clients and their supply chains.\nFacilitating growth \nFor smaller enterprises, the agreement means increased access to the financing they need to scale up their operations, “boosting prosperity and creating jobs,” says ADB’s Director General of Private Sector Operations, Suzanne Gaboury. \n“We are proud to partner with the ADB on this important initiative,” said Matthew Moodey, Head of Trade Finance and Lending for Asia Pacific. “Together, we will help smaller companies achieve growth.” \nADB estimates that the gap between the demand for trade finance and the money available for it is at least 2.5 trillion US dollars in Asia Pacific, with SMEs the worst affected. \nSMEs in the pharmaceutical and agriculture sectors in developing parts of the region are expected to benefit most from this agreement.\nYou can read the full press release from ADB here.",
    "number_of_ratings": 10,
    "rating": 3.8,
    "likes": 31
}