{
    "url": "https://www.db.com/news/detail/20151029-deutsche-bank-announces-details-of-strategy-2020?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 29, 2015",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Deutsche Bank announces details of Strategy 2020",
    "body": "Targets:\nCost reduction:\nAdjusted costs* below EUR 22 billion in 2018\nGross savings of EUR 3.8 billion by 2018 with restructuring and severance costs of EUR 3.0 – 3.5 billion, two-thirds of which to be spent by 2016\nCost income ratio of approximately 70% in 2018 and 65% in 2020\nFull exit from 10 countries\nCapital strength:\nLeverage exposure reduction of approximately EUR 170 billion and risk weighted asset reduction before regulatory inflation of approximately EUR 90 billion by 2018\nPlanned suspension of dividend on common equity for the fiscal year 2015 and 2016\nCommon Equity Tier 1 capital ratio of at least 12.5% from end 2018\nLeverage ratio of at least 4.5% at end 2018 and at least 5% at end 2020\nReturns to shareholders:\nPost-tax return on tangible equity greater than 10% by 2018\n*Total noninterest expenses excluding restructuring and severance, litigation, impairment of goodwill and intangibles and policyholder benefits and claims\n\nJohn Cryan, Co-Chief Executive Officer, said: “In April, we announced Strategy 2020. Since joining the Management Board in July, I have been working together with my colleagues to draw up plans to stabilise the bank and to turn around its long-term performance. Now, it’s all about executing on our plans to build a better Deutsche Bank.”\nHe continued: “We have four strategic goals.\nFirst, to become simpler and more efficient by focusing on the markets, products, and clients where we are positioned to succeed, leading to greater client satisfaction and lower costs.\nSecond, to become less risky by modernising our outdated and fragmented technology and withdrawing from higher-risk relationships and locations.\nThird, to become better capitalised, so that we are no longer playing catch-up with regulation and market expectations.\nFinally, to run Deutsche Bank with greater discipline and purpose based on delegation of responsibility, personal accountability, and a reward system which is aligned to good performance and conduct.”\nHe concluded: “Sadly, this also means closing some of our branches and country locations, and reducing some of our front-office and infrastructure staff too. This is never an easy task, and we will not do so lightly. I promise that we will take great care in this process, moving forward together with our workers’ representatives.”\nJürgen Fitschen, Co-Chief Executive Officer, said: “Deutsche Bank’s country network is among its strongest credentials for clients. That network, however, has never been static. We adapt it over time, sometimes expanding the number of countries in which we operate and at other times consolidating. In either scenario, one aspect endures: our commitment to serving clients around the world as Germany’s global bank.”\nStrategic goals\nMaking Deutsche Bank simpler and more efficient\nThe Bank announced a series of measures to reduce complexity and costs. As part of the execution of Strategy 2020 the Bank aims to:\nClose onshore operations in 10 countries: Argentina, Chile, Mexico, Peru, Uruguay, Denmark, Finland, Norway, Malta, and New Zealand; move trading activities in Brazil to global and regional hubs; further centralise booking locations in global and regional hubs as part of the new Global Markets and Corporate & Investment Banking (CIB) structure;\nReduce its work force by approximately 9,000 net full-time equivalent (FTE) positions plus approximately 6,000 external contractor positions in its Global Technology & Operations infrastructure function;\nReduce the number of clients in Global Markets and CIB by approximately 50%, especially in higher operating risk countries, given that approximately 30% of clients produce 80% of the revenues in these business divisions;\nModernise its outdated and fragmented IT architecture, including by reducing operating systems and replacing the Bank’s end-of-life hardware and software applications;\nEliminate approximately 90 legal entities.\nImpact:\nCost measures are anticipated to produce gross cost savings of approximately EUR 3.8 billion, with associated restructuring and severance costs of approximately EUR 3.0-3.5 billion. In addition, the Bank plans to dispose of assets with a total cost base of approximately EUR 4 billion and 20,000 FTE over the next 24 months. Allowing for inflation, increased regulatory spending, software amortisation, and investments in business growth, the Bank targets adjusted costs* of below EUR 22 billion in 2018.\nLowering the Bank’s risk profile\nThe Bank announced a series of measures to lower its risk profile. As part of the execution of Strategy 2020, the Bank aims to:\nPrioritise investments in its Know-Your-Client (KYC) and Anti-Money-Laundering infrastructure;\nConduct a thorough review of risks in specific clients and countries, with a view to exiting relationships and locations with unacceptable risks.\nBecoming better capitalized\nThe Bank announced a series of measures aimed at significantly improving capitalisation by organic means, without raising further equity from shareholders. The Bank aims to:\nReduce Risk Weighted Assets (RWAs) by approximately EUR 90 billion to approximately EUR 320 billion, before inflation, due to changing regulatory requirements, by 2018. This is anticipated to offset anticipated RWA inflation related to regulation of approximately EUR 100 billion by 2020;\nReduce net CRD4 leverage exposures by approximately EUR 170 billion by 2018;\nConserve capital by suspending dividend payments for the fiscal years 2015 and 2016, while aspiring to deliver a competitive payout ratio from the fiscal year 2017;\nMaterially wind-down the Non-Core Operations Unit (NCOU) by the end of 2016.\nImpact:\nThe Bank aims to raise its Common Equity Tier 1 (CET1) ratio from 11.5% at the end of the third quarter 2015 to 12.5% by the end of 2018, and to raise its leverage ratio from 3.6% to at least 4.5% by the end of 2018 and at least 5.0% by the end of 2020. The Bank aims to reduce risk weighted assets to EUR 310 billion by 2020 before regulatory inflation which the Bank anticipates to be approximately EUR 100 billion in that period.\nThe Bank anticipates that the wind-down of NCOU will be accretive to the CET1 ratio and have an incremental negative P&L impact of between EUR 1.0 and EUR 2.0 billion.\nIncreasing discipline and accountability\nAs part of Strategy 2020, the Bank aims to reduce organisational layers that create complexity, increase levels of individual accountability, and reduce its reliance on committees. As part of Strategy 2020, the Bank:\nHas installed a single, fully accountable management team with all business divisions directly represented;\nHas announced the abolition of the Group Executive Committee (GEC);\nHas announced a reduction in its Management Board committee structure from 16 to six;\nWill redesign its reward system to align reward more closely with performance and conduct.\nStrategy 2020 in Deutsche Bank’s core business divisions\nThe Bank also announced a series of management actions in its individual business divisions. Specific measures announced today include:\nGlobal Markets\nThe Bank announced a series of measures to create a strong Global Markets business division with a more focused Fixed Income & Currencies platform. As part of the execution of Strategy 2020, the Bank aims to:\nExit certain products, including: market making in uncleared Credit Default Swaps, certain Legacy rates products, agency Residential Mortgage-Backed Securities trading, and higher risk-weight securitised trading;\nStreamline Rates, Securitisation and Emerging Market Debt hubbing;\nSelectively reinvest in less balance sheet intensive businesses including Credit Solutions, Client Lending, and Prime Brokerage;\nMaterially reduce the number of client relationships;\nSave costs by streamlining infrastructure and technology.\nImpact:\nFrom the re-allocation of resources in Corporate Banking & Securities (CB&S), primarily Global Markets, the Bank anticipates a net reduction of approximately EUR 70 billion in CRD4 leverage and of approximately EUR 28 billion in risk weighted assets.\nCorporate & Investment Banking (CIB)\nThe Bank announced a series of measures to continue to grow profitably in CIB by combining commercial banking, corporate finance, and transaction banking under common leadership. As part of the execution of Strategy 2020, the Bank aims to:\nDeepen relationships with priority clients, increasing cross-selling while moving away from single-product relationships;\nContinue to expand in transaction banking, notably in Germany and Asia-Pacific;\nExpand market share in Advisory and Equity Capital Markets;\nReduce and rationalise CIB’s country footprint;\nExtend capital allocation decisions to cover all CIB clients to improve efficiency.\nPrivate, Wealth & Commercial Clients\nThe Bank announced a series of measures to leverage the partnership between its Private & Business Clients business division and Wealth Management business, to improve client centricity and unlock cost synergies. As part of the execution of Strategy 2020, the Bank aims to:\nCreate “One Bank” in Germany by offering seamless client coverage across Private Clients, Wealth Management Clients and Commercial Clients;\nStrengthen its European presence through active client referrals and cross-selling across Private Banking and Wealth Management;\nSustain the growth of its High Net Worth and UHNW business in Asia and the Americas;\nAdopt an integrated approach to the attractive and growing entrepreneur segment in Germany and beyond;\nRealise synergies in digital investments, operations and overhead expenses, and support functions;\nMake significant cost reductions through the merging and closure of over 200 branches.\nImpact:\nAs a result of these measures, the Bank aims to reduce its cost base by approximately EUR 600 million by 2018 and reduce the business division’s cost income ratio by approximately 10 percentage points. This will be achieved by closing over 200 branches in Germany; reducing the number of products offered by approximately one third; and streamlining head office and operations.\nThe Bank expects to cut CRD4 leverage exposures by approximately EUR 140 billion and RWAs of approximately EUR 50 billion from portfolio measures including the disposal of Postbank, the sale of the Bank’s 19.99% stake in Hua Xia Bank in China, and other consumer finance portfolio measures in Europe.\nAsset Management\nThe Bank announced a series of measures to build on the strong growth momentum of its global fiduciary client franchise. As part of the execution of Strategy 2020, the Bank aims to:\nDevelop an innovative offering for retirement and Strategic Beta products;\nFurther enhance capabilities in Alternatives and Multi-Asset investment capabilities;\nFurther invest in client solutions capabilities in key areas such as pensions;\nDevelop Sustainability and Impact investing as a mainstream asset class;\nFully automate investment processes across front and back offices.\nUpgraded and accelerated financial targets\nAs part of the execution planning process, the original outline financial targets for Strategy 2020 have been upgraded and accelerated, with delivery on a number of targets anticipated for 2018. Financial targets now include:\nA CET1 ratio of at least 12.5% from the end of 2018;\nA leverage ratio of at least 4.5% at the end of 2018 and at least 5% at the end of 2020;\nPost-tax return on Tangible Equity (RoTE) greater than 10% by 2018;\nAdjusted costs* of less than EUR 22 billion by 2018;\nA cost-income ratio of approximately 70% in 2018 and approximately 65% in 2020;\nRisk Weighted Assets (RWA) before inflation due to changing regulation of approximately EUR 320 billion in 2018 and EUR 310 billion in 2020.\n*Total noninterest expenses excluding restructuring and severance, litigation, impairment of goodwill and intangibles and policyholder benefits and claims\nStrategy Day activities\nA press conference will be held at 9:00 a.m. CET on Thursday, 29 October 2015 at Deutsche Bank’s headquarters in Taunusanlage 12, Frankfurt am Main.\nAn investor meeting will be held on Thursday, 29 October 2015 at 4:00 p.m. GMT, 5:00 p.m. CET, at Deutsche Bank’s premises in Winchester House, 1 Great Winchester Street, London EC2N 2DB. This event can be followed by webcast. A presentation is available \nPDF\non the Deutsche Bank website.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}