{
    "url": "https://www.db.com/news/detail/20151029-a-message-from-john-cryan-on-strategy-2020-to-employees?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 29, 2015",
    "tags": [
        "Company"
    ],
    "title": "A Message from John Cryan on Strategy 2020 to employees",
    "body": "Dear Colleagues,\nToday we have published our progress report on Strategy 2020, giving further details on the implementation of the plan that the Management Board laid out in April. Later today, we will inform investors and the public about these details, but first I wanted to update you directly.\nAs I said on my first day as your colleague, our bank has a great many strengths but faces challenges too: our costs are too high; our technology needs modernizing; our capital position must be strengthened; and our processes are too complex. Additionally, we are still paying too high a price for instances of serious misconduct.\nSetting our strategic goals\nTo succeed in turning around Deutsche Bank, we need to unite around a common objective. I see four principal goals.\nFirst, we want to make Deutsche Bank simpler and more efficient. By focusing on where we can truly excel, we’ll be a better bank. That includes reducing the number of products and services we offer, deepening our relationships with the most promising clients, and bringing focus to the number of locations in which we operate.\nRegrettably, this does mean closing some of our branches both in Germany and elsewhere, to the point where we will be exiting a handful of countries altogether. Consequent upon this, we will sadly be forced to lay off approximately 9,000 employees net of some modest growth and redeployment, and approximately 6,000 of our colleagues who work for external vendors. This is never an easy task, nor is it a step we take lightly. We will take great care in this process, acting fairly, and proceeding all the way in close contact with our workers’ representatives.\nSecond, we want to lower the bank’s risk profile. This means turning down marginal business about which we may have doubts and which could eventually result in us facing a fine or a legal settlement. It also means investing in new technology to clean up the patchwork of systems we have built up over decades. Let’s recognise technology for what it can be: a competitive advantage to be nurtured by the business divisions.\nThird, we want to be better capitalized so that we are no longer playing catch-up with regulation and market expectations. We plan to take out about 20% of our risk-weighted assets between now and 2018. That will help us achieve a Core Tier 1 capital ratio of 12.5% by 2018, up from 11.5% today. It also means that we do not expect to be in a position where we will be recommending that we pay a dividend on our common shares for either of the years 2015 or 2016.\nFinally, we want to be a better run bank. For too long, and in too many circumstances, committees have replaced our managers accepting personal responsibility. Committees have made us bureaucratic, slow and less attractive as an employer. We now have one clear senior management team and six Management Board committees. Let’s eradicate bureaucracy and improve our working lives. We will all benefit and our clients will too.\nFixing our financial performance\nOver the summer and early autumn, my colleagues on the Management Board and I have been assessing how we best achieve these goals and developing detailed work plans for each of our business divisions, infrastructure functions, and regions. These plans, which are now being turned into scores of discrete tasks, will be assigned to individual managers in the bank for execution.\nIn refining and developing our plans, we had to reflect some changes that arose in the regulatory landscape. Since April, policymakers have significantly tightened the rules governing the capital required to back market risk, credit risk, and operational risk. As a consequence, we have had to intensify in particular the repositioning of our derivatives and securities trading operations, somewhat scaling back our ambitions.\nThis is because these regulatory changes increase the amount of regulatory capital we have to hold for a given market position, or a given loan or other credit we grant. As a result, the binding constraint on our capitalization is no longer the group consolidated leverage ratio, as we had assumed in April, but instead the risk-based measure called the Common Equity Tier 1 ratio. We now believe that we should set a target for this ratio for 2018 to be in excess of 12.5%.\nWe are disclosing today for the first time our targets for the financial year 2018. Some of you may ask why we are doing this. Well, first, it’s because this answers a call from the market in April for more detail and for interim performance targets. Second, 2018 will potentially be a pivotal year for us.\nWe expect 2016 and 2017 to be years of hard work, burdened by the cost of making much-needed investments to strengthen the bank’s controls and to improve its efficiency, focusing our country, product and client footprints and taking hard but necessary decisions on headcount reduction. We will also most likely incur further costs in resolving as many of our legacy litigation and regulatory matters as we can.\nBy 2018, a milestone year for us, we expect to see the benefits of our hard work and potentially be in the midst of a powerful turn-around. By then we expect to have executed the IPO of Postbank and sold down many of our remaining non-core positions, including our stake in Hua Xia Bank.\nWe also believe that we will be able to have brought down by then our non-interest expenses to below EUR 22 billion for the year. To achieve this aim, we plan to spend up to EUR 3.5 billion over the next three years. Some of this amount will be spent on severance; the remainder on other restructuring costs. This would leave us with a cost-income ratio of around 70%.\nIf we can achieve these financial goals, the market should reflect the improvement in our performance in the share price.\nThe way forward\nAs we accelerate the execution of Strategy 2020 in the coming weeks, the Management Board will set further milestones for progress reporting and completion. We will measure and manage progress, providing resources where required, but demanding accountability in return.\nYou can learn more about the details of Strategy 2020 and how it will impact your business division, infrastructure function, or region by reviewing the talking points, answers to frequently-asked questions, and client letter template available on the Deutsche Bank intranet. Over the coming days, each business division and infrastructure function will also host a town hall to share further details.\nYou have my commitment, and that of the new management team, to executing Strategy 2020 successfully. Let’s build a better Deutsche Bank together. I know we can.\nYours sincerely,\nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 14
}