{
    "url": "https://www.db.com/news/detail/20151028-deutsche-bank-announces-strategy-2020-financial-targets?language_id=1",
    "language": "EN",
    "article_type": "Ad-hoc Release",
    "publish_date": "October 28, 2015",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank announces Strategy 2020 financial targets",
    "body": "The Management Board of Deutsche Bank (XETRA: DBKGn.DE/NYSE: DB) today approved the implementation of the Bank's strategic plan, known as “Strategy 2020”. The plan includes the following financial targets:\nCET 1 ratio: at least 12.5% from the end of 2018\nLeverage ratio: at least 4.5% at the end of 2018 and at least 5.0% at the end of 2020\nReturn on Tangible Equity (RoTE): greater than 10% by 2018\nAdjusted Costs (total noninterest expenses excluding restructuring and severance, litigation, impairment of goodwill and intangibles and policyholder benefits and claims) of less than EUR 22.0 billion by 2018\nCost/income ratio (CIR) of approximately 70% in 2018 and of approximately 65% in 2020\nRisk Weighted Assets (RWA) (excluding regulatory inflation following regulatory changes expected to be at least EUR 100 billion by 2019/2020) of approximately EUR 320 billion at the end of 2018 and of approximately EUR 310 billion at the end of 2020.\nFurthermore, the plan is based on the elimination of the Deutsche Bank common share dividend for the fiscal years 2015 and 2016. The Management Board expects to recommend the payment of common share dividends commencing from fiscal year 2017 at a competitive payout ratio.\n\nIn its meeting today the Supervisory Board has been informed about the plans by the Management Board.\n\nThe details of how Deutsche Bank intends to achieve these targets will be announced on Thursday, October 29, at a press conference in Frankfurt at 8:00 a.m. London time and at an investor event in London at 4:00 p.m. London time.\n\nDeutsche Bank AG\nTaunusanlage 12\n60325 Frankfurt am Main\nGermany\nISIN: DE0005140008\nWKN: 514000\n\nListed: Regulated market in Berlin-Bremen, Duesseldorf, Frankfurt (Prime Standard), Hamburg, Hanover, Munich und Stuttgart; EUREX; NYSE\nThe International Securities Identification Numbers (ISINs) of further financial instruments issued by Deutsche Bank AG, and admitted to trading on a domestic organized market or for which such admission has been applied for, are listed in the attached PDFs.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}