{
    "url": "https://www.db.com/news/detail/20151018-media-release-deutsche-bank-announces-comprehensive-organizational-restructuring-and-reorganization-of-key-management-roles?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 18, 2015",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Deutsche Bank announces comprehensive organizational restructuring and reorganization of key management roles",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) will fundamentally change its group and leadership structure. At an extraordinary meeting today in Frankfurt, the Supervisory Board of Deutsche Bank resolved to restructure the Bank´s business divisions. This will be supplemented by a reorganization of executive committees and senior management changes.\n\nThe Supervisory Board’s guiding principle, in light of the Bank’s Strategy 2020, was to reduce complexity of the Bank’s management structure enabling it to better meet client demands and requirements of supervisory authorities.\n\nThe Corporate Banking & Securities (CB&S) business division is a main focus of the organizational restructuring and will be split into two business divisions. Effective January 1, 2016, a business division called Corporate & Investment Banking will be created by combining the Corporate Finance business in CB&S and Global Transaction Banking (GTB).\n\nCB&S’s sales and trading activities will be combined in a newly created business division called Global Markets. The name “CB&S” will cease to exist.\n\nAdditional changes will affect Deutsche Asset & Wealth Management. High net worth clients will be served by Private Wealth Management which will be run as an independent business unit within the Private & Business Clients business division. Deutsche Asset Management will become a stand-alone business division and focus exclusively on institutional clients and the funds business.\n\nTogether with the organizational restructuring there will be a broad-based change of key management roles. The Group Executive Committee (GEC) will be abolished, as will ten of the current 16 Management Board committees. Effective January 1, 2016, all four core business divisions will be represented directly on the Management Board. A ten-person Management Board will be supplemented by four Senior Group Directors (“Generalbevollmächtigte”).\n\nEffective January 1, 2016, Jeff Urwin, currently Co-Head of CB&S together with Colin Fan, will join the Management Board. Urwin will be responsible for Corporate & Investment Banking. As a result of this reorganization, Stefan Krause, a long-term Management Board member with responsibility for GTB and the Non-Core Operations Unit (NCOU), will step down from the Board effective October 31, 2015.\n\nWerner Steinmüller will remain Head of GTB, and will report to Urwin. He will be proposed for election to succeed Krause as Chairman of the Supervisory Board of Postbank AG.\n\nColin Fan, currently Co-Head of CB&S, will leave effective October 19, 2015. He will be succeeded by Garth Ritchie who will be responsible for Global Markets on the Management Board effective January 1, 2016. Ritchie is currently Head of Equities.\n\nQuintin Price, most recently Global Executive Committee member and Head of Alpha Strategies at BlackRock, will take on Management Board responsibility for Deutsche Asset Management, effective January 1, 2016. Michele Faissola, Head of Deutsche Asset & Wealth Management, will leave the Bank after a transition period.\n\nGoing forward, Christian Sewing, Head of Private & Business Clients, will also assume responsibility for high net worth clients on the Management Board. Fabrizio Campelli, currently Head of Group Strategy, will run this business and will report to Sewing.\n\nEffective October 31, 2015, Stephan Leithner has requested to resign as a member of the Management Board as he wants to assume a new role in the private equity industry next year. The Supervisory Board has accepted his request. Leithner is CEO Europe and is responsible for Human Resources, Government & Regulatory Affairs (GRAD), and Anti-Financial Crime on the Management Board.\n\nKrause and Leithner´s Management Board responsibilities will be divided as follows:\n\nSylvie Matherat, Head of Government & Regulatory Affairs at Deutsche Bank and a former Member of the Board of Directors of Banque de France, will become Chief Regulatory Officer and assume Management Board responsibility for Regulation, Compliance and Anti-Financial Crime. The Senior Group Director (“Generalbevollmächtigte”) Nadine Faruque, who is Global Head of Compliance, will report to Matherat.\n\nKarl von Rohr, currently Chief Operating Officer for global Regional Management will become Chief Administrative Officer and assume Management Board responsibility for Corporate Governance, Human Resources, and Legal. In his new position, he will also become Labour Relations Director (“Arbeitsdirektor”) of Deutsche Bank. Legal was represented on the Management Board by Co-Chief Executive Officer John Cryan.\n\nCryan will assume Management Board responsibility for the NCOU.\n\nSeparately, Kim Hammonds, currently Global Chief Information Officer and Co-Head of Group Technology & Operations at Deutsche Bank and formerly Chief Information Officer (CIO) of Boeing, will become Chief Operating Officer. She will oversee the re-engineering of the Bank’s information technology (IT) systems and operations. To acquire the relevant experience in credit assessment in accordance with the German Banking Act (KWG), Hammonds will start her role as Senior Group Director (“Generalbevollmächtigte”) at the beginning of next year. She is expected to join the Management Board in no later than one year.\n\nHenry Ritchotte, currently Chief Operating Officer, will leave the Management Board at year end and set up a new digital bank for Deutsche Bank. The Management Board will communicate further details about this project at a later point in time.\n\nIn addition to Faruque and Hammonds, Jacques Brand will become a Senior Group Director (“Generalbevollmächtigter”) reporting to the Co-CEOs John Cryan and Jürgen Fitschen, effective November 1, 2015. Brand is currently Chief Executive Officer for North America and will become Chairman of the newly created Intermediate Holding Company for the US business. Fitschen will remain responsible for global Regional Management.\n\nAs of April 1, 2016, Jörg Eigendorf, currently Head of the Investigative Team and member of the Editors Team (Mitglied der Chefredaktion) at media group Welt/N24 will become the new Head of Communications (“Konzernsprecher”) and Senior Group Director (“Generalbevollmächtigter”). He will report to the Co-CEOs John Cryan and Jürgen Fitschen. He will take over this function from Thorsten Strauss, currently Global Head of Communications, CSR & Public Affairs and member of the Management Committee Germany. Strauss will assume global responsibility for the Bank’s culture, art, and sports activities, including its extensive art collection. As a result, the 10-person Management Board will be supplemented by four Senior Group Directors (Generalbevollmächtigte). All appointments are subject to the required regulatory approvals.\n\nAt its meeting today the Supervisory Board acknowledged the contributions of the executives who will be leaving the Bank, who in some cases have worked at the Bank for decades, and who have delivered great service in their respective roles.\n\nPaul Achleitner, Chairman of the Supervisory Board, said:\n\n”Deutsche Bank rarely underwent such a fundamental reorganization in its history. This also requires tough decisions. I would like to stress that all parties involved have tried to achieve the best possible outcomes for Deutsche Bank, having set aside personal interests. For this, and for their contributions in the past years, we would like to thank those executives leaving the company.”\n\nAchleitner continued:\n\n“In his role as CFO from 2008 until 2015, Stefan Krause made a significant contribution to weathering the peak phase of the financial crisis. He also served the Bank well during the complex decision making processes which led to Strategy 2020.\n\nIn their roles as Head of Deutsche Asset & Wealth Management and Co-Head of Corporate Banking & Securities, Michele Faissola and Colin Fan have laid the foundations for the Bank’s successful future in those important business divisions.\n\nWe regret Stephan Leithner’s request to resign, but we accept that he wants to use his client and transaction know-how in the private equity industry.\n\nIn establishing a digital bank, Henry Ritchotte will assume a key role in refocusing Deutsche Bank.\n\nWith the newly established culture, art, and sports division, Thorsten Strauss will make a strong global impact.\n\nWe wish John Cryan and Juergen Fitschen´s newly created team every success. We are confident that this team will implement Strategy 2020 in a consistent and target-oriented way, and we look forward to working with them.”\n\nJohn Cryan, Co-Chief Executive Officer of Deutsche Bank, said: “We want to create a better controlled, lower cost, and more focused bank that delivers long-term value to shareholders and great experiences to clients. The new structure and management team are essential to getting this done. I am delighted to welcome six new members to the Management Board to form the team that together will build a better Deutsche Bank.”",
    "number_of_ratings": 10,
    "rating": 2.0,
    "likes": 15
}