{
    "url": "https://www.db.com/news/detail/20151008-deutsche-bank-becomes-a-direct-participating-bank-of-china-s-newly-launched-cips?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 8, 2015",
    "tags": [
        "Company",
        "Digitalisation"
    ],
    "title": "Deutsche Bank becomes a direct participating bank of China's newly launched CIPS",
    "body": "Deutsche Bank today announced that it has been selected as a direct participating bank in China’s newly launched Cross-Border Interbank Payment System (‘CIPS’), as part of the first batch of approved participants.\n\nInitiated by the People’s Bank of China (PBoC) and run by the CIPS Clearing Company, CIPS provides an independent cross-border payment and clearing system connecting both onshore and offshore clearing markets and participating banks. CIPS uses global payment standards and enables same day clearing across Asia, Oceania, Europe and other time zones through extended operating hours.\n\nCarl Wegner, Managing Director, Greater China Head of Global Transaction Banking at Deutsche Bank, said: “By integrating the existing Renminbi cross-border payment and settlement channels, CIPS will improve the efficiency of cross-border clearing to meet the increasing demand for Renminbi worldwide. CIPS will also enhance and facilitate the security of transactions, thereby benefitting the industry as well as our clients.”\n\nFeng Gao, Managing Director, Chief Country Officer of Deutsche Bank China, added: “We are proud to be one of the few foreign banks chosen to participate in CIPS. This new clearing system represents important additional financial market infrastructure for cross-border payments and bodes well for the ongoing internationalisation of the currency. We look forward to continuing to work with PBoC and our clients to facilitate Renminbi cross-border payments.”\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nAbout Deutsche Bank Global Transaction Banking\nThrough our wide range of cash management, trade finance, trust and securities services, our Global Transaction Banking business helps companies all over the world to focus on achieving their business goals. Every day, in multiple locations, we process and clear domestic and cross-border payments, facilitate transactions for global trade and act as trustee, agent and custodian for clients.\nIn transaction banking, the visibility we gain on our clients’ financial landscape puts us in a unique position to identify risks as well as opportunities for bottom line growth. By working in close partnership with the rest of the Bank, we help our clients optimise every opportunity. www.gtb.db.com.",
    "number_of_ratings": 2,
    "rating": 1.0,
    "likes": 1
}