{
    "url": "https://www.db.com/news/detail/20151007-deutsche-bank-announces-anticipated-charges-impacting-third-quarter-2015-results?language_id=1",
    "language": "EN",
    "article_type": "Ad-hoc Release",
    "publish_date": "October 7, 2015",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank announces anticipated charges impacting third quarter 2015 results",
    "body": "Frankfurt am Main, October 7, 2015 - Deutsche Bank (XETRA: DBKGn.DE/NYSE: DB) expects to incur charges that will materially impact third quarter 2015 results:\n- An impairment of all goodwill and certain intangibles in Corporate Banking & Securities (CB&S) and Private & Business Clients (PBC) of approximately EUR 5.8 billion. This is largely driven by the impact of expected higher regulatory capital requirements on the measurement of the value of these segments as well as current expectations regarding the disposal of Postbank.\n- An impairment of the carrying value of Deutsche Bank's 19.99% stake in Hua Xia Bank Co. Ltd. of approximately EUR 0.6 billion. This reflects an updated valuation triggered by a change of the intent of the holding as Deutsche Bank no longer considers this stake to be strategic.\n- Litigation provisions of approximately EUR 1.2 billion, the majority of which are not expected to be tax deductible. Final litigation provisions in the quarter may be affected by further events before we finalize and report third quarter results.\nThe impairment of goodwill and intangibles and of the Hua Xia investment will have no significant impact on Deutsche Bank's regulatory capital ratios. Deutsche Bank currently expects to report a fully-loaded CRR/CRD4 Common Equity Tier 1 ratio for the third quarter of approximately 11%, which includes the impact of European Banking Authority Regulatory Technical Standards (“Prudential Valuation”) that were adopted in the quarter.\nBased on these charges, Deutsche Bank expects to report a third quarter income before income taxes (IBIT) loss of approximately EUR 6.0 billion and a net loss of EUR 6.2 billion. Year-to-date results through the third quarter are expected to be an IBIT loss of approximately EUR 3.3 billion and a net loss of EUR 4.8 billion.\nExcluding the impact of the impairment of goodwill and intangibles, the third quarter IBIT loss would be approximately EUR 0.2 billion and the net loss would be approximately EUR 0.4 billion, largely reflecting the litigation provisions and Hua Xia impairment. On the same basis, Deutsche Bank expects to remain profitable year-to-date through the third quarter with IBIT of approximately EUR 2.5 billion and net income of approximately EUR 0.9 billion.\nAs part of the planning for the implementation of Strategy 2020, the Management Board will recommend a reduction or possible elimination of the Deutsche Bank common share dividend for the fiscal year of 2015.\nAll the aforementioned amounts are estimates. The final amounts will be determined in the coming weeks and will be disclosed in our announcement of third quarter results, together with details of the implementation of Strategy 2020, which is now scheduled to occur on October 29.\n  Deutsche Bank AG\nTaunusanlage 12\n60325 Frankfurt am Main\nGermany\nISIN: DE0005140008\nWKN: 514000\nListed: Regulated market in Berlin-Bremen, Duesseldorf, Frankfurt (Prime Standard), Hamburg, Hanover, Munich und Stuttgart; EUREX; NYSE\nThe International Securities Identification Numbers (ISINs) of further financial instruments issued by Deutsche Bank AG, and admitted to trading on a domestic organized market or for which such admission has been applied for, are listed in the attached PDFs.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}