{
    "url": "https://www.db.com/news/detail/20151007-deutsche-bank-to-launch-corax?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 7, 2015",
    "tags": [
        "Company",
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Deutsche Bank to launch CORAX",
    "body": "Deutsche Bank’s Research unit announced today that it is launching a new set of proprietary foreign exchange (FX) positioning indices called CORAX (Categorised ORderflow from Autobahn FX). With the largest global share in electronic currency trading, Deutsche Bank is positioned to offer its clients the most representative, timely and accurate FX positioning report available in the market.\n\nCORAX indices will help to answer commonly asked questions such as: Are investors long or short a given currency? What is the current positioning by client type? Is positioning “stretched” or just beginning to build?\nThe latest CORAX data shows that the main drivers behind this year’s dollar surge are asset managers, who have been buying close to record amounts of dollars. Hedge funds, in contrast, have been reducing dollar longs, suggesting that it is the behavior of real money, rather than hedge fund investors that will drive the next move in the dollar.\nDavid Folkerts-Landau, Chief Economist and Member of the Group Executive Committee at Deutsche Bank, said: “We are excited to be able to offer our clients the best foreign exchange positioning indices available anywhere. Including all G10 currencies and the most liquid currencies in emerging markets, CORAX is an example of the type of international market research that only a leading global bank can create.”\nNicholas Weng, an FX strategist at Deutsche Bank and the creator of CORAX, said: “CORAX will be published with a one working day lag and is more comprehensive than other available products. We have managed to leverage Deutsche Bank’s position in foreign exchange whilst ensuring client confidentiality by a strict index construction process.”\nThe unique combination of characteristics means CORAX positioning can supplement standard positioning metrics. The indices Pacific.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 0
}