{
    "url": "https://www.db.com/news/detail/20151007-message-from-john-cryan-to-employees?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 7, 2015",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "Third-quarter 2015 financial results",
    "body": "Dear Colleagues,\nToday we announced to the market some new important financial information.The news is not good, and I expect a number of you will be very disappointed by it. We expect to report a sizable loss for the third quarter. This expected loss is primarily driven by three items which together total approximately EUR 7.6 billion.\nBreakdown\nFirst, we have written down approximately EUR 5.8 billion in goodwill and other intangible assets in our Corporate Banking & Securities (CB&S) and Private & Business Clients (PBC) operating segments. These assets were booked in the past when we acquired businesses for more than the market value of their respective net assets. The relevant historical acquisitions include those of Bankers Trust in 1999 and Deutsche Postbank in 2010.\nAs we review our financial plans in preparation for the announcement of further details of Strategy 2020, which we plan to make on 29 October, we updated the valuations of our businesses that have goodwill and intangible assets. We found that the resulting valuations no longer support the carrying values on our balance sheet. As a consequence we have impaired all of the goodwill held in CB&S and PBC.\nSecond, we have revalued our 19.99% stake in the Chinese company Hua Xia Bank. The revaluation is driven by the decision no longer to consider this stake strategic for our group. This has led to an impairment in our carrying value by approximately EUR 0.6 billion.\nFinally, we currently expect provisions for regulatory and litigation matters of approximately EUR 1.2 billion for the third quarter. This cost may be affected by further events before we finalise the amount for our third quarter results on 29 October. Based on this, the total charge for litigation and related matters in 2015 to date is expected to be approximately EUR 4 billion. As I have mentioned to you before, I would expect litigation costs and charges to continue to burden us in future quarters.\nLooking forward\nBased on these items, Deutsche Bank expects to report a third quarter income before income taxes (IBIT) loss of approximately EUR 6.0 billion and a net loss of approximately EUR 6.2 billion. For the first nine months of 2015, the IBIT loss would be approximately EUR 3.3 billion and the net loss approximately EUR 4.8 billion.\nExcluding the impairment of goodwill and intangible assets, we expect a third quarter IBIT loss of approximately 0.2 billion and a net loss of approximately 0.4 billion, largely reflecting the litigation provisions and write-down related to Hua Xia Bank. However, on this basis we expect the bank to remain profitable for the first nine months of the year with approximately EUR 2.5 billion of IBIT and net income of approximately EUR 0.9 billion.\nThe write-downs related to goodwill, intangible assets, and Hua Xia do not significantly impact our regulatory capital ratios. We therefore expect to report a Common Equity Tier 1 (CET1) ratio for the third quarter of approximately 11%, notwithstanding the adoption in the quarter of some stricter rules relating to our regulatory capital known as Prudential Valuation.\nAlso, as part of the planning for the implementation of Strategy 2020, the Management Board will recommend a reduction or possible elimination of the Deutsche Bank common share dividend for the fiscal year 2015.\nDeutsche Bank employees\nThe write-downs and dividend recommendation that we announced today will, of course, have to be factored in some way into our upcoming decisions on variable compensation for the year. While compensation considerations are not based on this year’s financial results alone, our shareholders will rightly expect employees to share something of the burden.\nHaving said that, you have my personal commitment to try to achieve a fair balance between staff and shareholder interests. No decisions have been made on compensation and we will only make these once we have a better feel for the likely overall financial outcome for the bank for the full year.\nIn my letter to you on my first day in this role, I said that I would seek to improve our internal communication by speaking directly to you. I also did say that I was not expecting all would be sweetness and light in the coming months.\nAt the end of this month, when we plan to inform the market of further details of how we intend to implement the six key decisions of Strategy 2020, I will provide you with a thorough briefing on our plans. In the meantime, I thank you for your commitment and focus as we seek to build a better Deutsche Bank.\n\nYours sincerely,\nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}