{
    "url": "https://www.db.com/news/detail/20190830-endurance-china-s-phase-3-in-its-trade-war-strategy?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "August 30, 2019",
    "tags": [
        "Capital markets",
        "Investment Banking",
        "Research"
    ],
    "title": "Endurance – China's phase 3 in its trade war strategy",
    "body": "China appears to have changed its strategy towards the trade war, shifting from a focus on resolution to one of endurance, says China Economist Yi Xiong in a Deutsche Bank Research report.\nHere are key excerpts from the report explaining why:\n‘We think China is neither aiming to quickly reach a trade deal, nor trying to hit back at the US as hard as it can. Rather, China seems to have internalized the trade war as a given fact, and is trying to preserve China's economic resilience under rising tariffs.’\n‘We can think of two main reasons for this shift. First, China no longer sees resolving the trade war as the top issue in US-China relations. Over the past year, frictions between the US and China have gone far beyond trade, including on the fronts of technology barriers, security, geopolitical issues, and even China's sovereignty issues. Second, China may have judged the damage of the trade war as manageable.’\n‘China will still respond to US tariffs, but with smaller and targeted measures. The goal of retaliation is not to maximize the damage to the US, but to disincentivise further US tariffs. For the same reason, China is likely reluctant to take non-trade actions against the US, such as punishing US business interests in China. In fact, it may be just the opposite: Costco just opened its first store in China, and Tesla's Shanghai factory will be completed soon.’\n‘China will also accelerate its opening up to other countries. This will both help the Chinese economy and increase the cost for the US in a trade war. In the longer term, China will likely reduce its supply chains' reliance on the US.’\n‘The future course of the trade war will largely depend on the US's trade war strategy. Our baseline scenario is for prolonged trade tensions with some back and forth. Tension may escalate at times, while trade talks and perhaps partial agreements may help ease the tension at other times. We think the likelihood of a comprehensive trade deal is small. The main downside risk to this baseline is if US-China tensions escalate substantially on non-economic fronts.’",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}