{
    "url": "https://www.db.com/news/detail/20190827-deutsche-bank-reorganises-treasury-and-appoints-francois-jourdain-as-head-of-treasury-markets-and-investments?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "August 27, 2019",
    "tags": [
        "Company",
        "Management & Leadership",
        "Strategy"
    ],
    "title": "Deutsche Bank reorganises Treasury and appoints François Jourdain as Head of Treasury Markets and Investments",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today announced a reorganisation of its Treasury function, with the combination of market-facing and investment activities into an integrated Treasury Markets and Investments team. François Jourdain will join the bank as Head of Treasury Markets and Investments, reporting to Dixit Joshi, Group Treasurer.\nMr. Jourdain was formerly at Barclays Bank where he served on the Executive Committee of Barclays International. He held senior posts in Treasury, including Deputy Treasurer and Head of Treasury Funding and Investment. He also served as Chief Compliance Officer for Barclays International. Mr. Jourdain was most recently Chair of the Bank of England Risk Free Rate Benchmark Working Group.\nDixit Joshi, Deutsche Bank Group Treasurer, said: “This reorganisation enables us to become more effective and efficient as we work to deliver on Deutsche Bank’s recently-announced transformation strategy. Balance sheet efficiency is a core element of our strategic agenda and Treasury plays a significant role in this. We are delighted to have attracted a senior leader with François’s skills and experience to Deutsche Bank. This appointment reflects our determination to deliver on our strategic plans.”\nHe added: “Furthermore, Deutsche Bank is committed to supporting our clients, counterparties, regulatory authorities and other stakeholders as our industry transitions from IBORs to alternative Risk Free Rates. In this regard, François’s experience as Chair of the Bank of England Risk Free Rate Benchmark Working Group is highly valuable.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}