{
    "url": "https://www.db.com/news/detail/20190823-deutsche-bank-and-berliner-philharmoniker-extend-partnership?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "August 23, 2019",
    "tags": [
        "Company",
        "Corporate Citizenship",
        "Culture"
    ],
    "title": "Deutsche Bank and Berliner Philharmoniker extend partnership",
    "body": "Deutsche Bank and the Berliner Philharmoniker will continue their successful cooperation. On Friday, at the opening ceremony of the orchestra's season in Berlin, the two partners announced that their cooperation agreement will be extended for a further five years until 2025. The connection has existed since 1989, with this year marking the 30th anniversary.\nKarl von Rohr, Member of the Management Board and President of Deutsche Bank: \"Our partnership with the Berliner Philharmoniker is unique in the world. No other company has promoted a top orchestra so exclusively over such a long period of time, on all continents. We are proud to continue this cooperation. It symbolizes what we want to achieve for our customers: to be a reliable and first-class partner, both in Germany and internationally.”\nAndrea Zietzschmann, General Manager of the Berliner Philharmoniker: \"I am delighted that the partnership between the Berliner Philharmoniker and Deutsche Bank has been extended parallel to our new Chief Conductor Kirill Petrenko taking up his post. This will create a wonderful continuity enabling us to continue to launch new creative projects and to give broad sections of the population access to classical music. On behalf of the Berliner Philharmoniker, I would like to express my sincere thanks for 30 years of committed and trusting partnership and look forward to our future together.\"\nThe continuation of such a long-lasting partnership is a wonderful sign to all of us. I am looking forward to the many projects that Deutsche Bank's support will continue to make possible.\nKirill Petrenko, Chief Conductor of the Berliner Philharmoniker\nThorsten Strauss, Global Head of Art, Culture & Sports at Deutsche Bank: \"The partnership with the Berliner Philharmoniker fits perfectly into Deutsche Bank's international portfolio of art, culture, and sports. We are delighted to continue our successful work with this top orchestra over the next five years.\"\nAfter today's season opening concert celebrating the 30th anniversary of the partnership, the Berliner Philharmoniker will play tomorrow, Saturday, August 24, at the Brandenburg Gate. At the open-air concert, largely supported by Deutsche Bank, up to 32,000 visitors will welcome the orchestra’s new chief conductor Kirill Petrenko to the city.\nAs a committed sponsor, Deutsche Bank will continue to accompany the Berliner Philharmoniker on its concert tours in Germany and abroad in the coming years. Through the partners' education program founded in 2002, more than 50,000 children and young people have discovered classical music to date. Established in 2009 and made possible by Deutsche Bank, the Digital Concert Hall broadcasts concerts of the Berliner Philharmoniker on the Internet and now has over one million registered users.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}