{
    "url": "https://www.db.com/news/detail/20190823-creating-tomorrow-s-active-citizens-today?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "August 23, 2019",
    "tags": [
        "Corporate Citizenship",
        "Education"
    ],
    "title": "Creating tomorrow's active citizens today",
    "body": "Last weekend saw finalists in this year’s Youth Citizens Action Programme (YCAP) present their school and community projects in the National Championships at Gauteng, South Africa.\nOriginally a youth dialogue event supported by the Deutsche Bank South Africa Foundation, Empowervate’s Youth Citizens Action Programme is now exactly that: action, not talk.\nPart of Deutsche Bank’s Born to Be programme, YCAP encourages young people to address issues of concern and relevance within their school or wider community and to come up with solutions by applying project management skills from the YCAP toolkit.\nTen years on it is now so popular that all nine South African provinces want to take part.\nIn fact, 432 schools and over 4,000 participants competed in this year’s Provincial Competitions, with nine primary and nine secondary schools making it through to the National Championships.\nAnd the winners are…\nWinner of the Secondary Category is Floor High School. Their “Know your worth” project deals with the challenges of teenage suicide and drug abuse in their school.\nHaving identified self-esteem issues as the root cause of both suicide and addiction, participants from Floor High School created awareness campaigns and workshops with support from teachers and help from established national support groups.\nStephen Nkomo Primary took first place in the Primary Category with their project on disabilities, which was inspired by a fellow pupil who had lost two limbs.\nMbalenhle Mdhluli, who works at Deutsche Bank in Johannesburg has been supporting Empowervate’s YCAP as a mentor, workshop facilitator and event supporter. She says the depth and magnitude of issues that the schools select is what motivate her to volunteer. Topics include sanitation, food security, recycling, career choices, safety and security.\nCEO of Empowervate Amanda Blankfield-Kosseff spoke of the benefits of the programme: “Our founding partner and ten-year enabler, Deutsche Bank, gives youth and schools the opportunity to address pressing social needs in their schools and communities. We are creating tomorrow’s active citizens today.”\nAbout Born to Be\nBorn to Be is Deutsche Bank’s youth engagement programme, supporting efforts to enable children and young people to fulfil their potential and secure gainful and rewarding employment later on. Born to Be raises aspirations, attitudes and progression by developing technical, academic and employability skills, and by enabling access and pathways to education and employment.\nYCAP is one of Deutsche Bank South Africa Foundation’s 14 Born to Be project partners where the focus is on education through early interventions at two key stages: early childhood and high school.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 0
}