{
    "url": "https://www.db.com/news/detail/20190822-up-and-running-with-ottobock?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "August 22, 2019",
    "tags": [
        "Company",
        "Corporate Citizenship",
        "Sports"
    ],
    "title": "Up and running with Ottobock",
    "body": "Ottobock is a company founded exactly 100 years ago that has been family owned ever since. It is a quintessential German Mittelstand firm.\nThe medical technology maker started doing business in 1919 by providing orthopaedic products to war-disabled people in Berlin. To this day the firm’s primary goal is essentially unchanged: to enhance the mobility of people who have had to have an arm, leg, hand or foot amputated, enabling them to live life to the full.\nFor decades now, Deutsche Bank has been cultivating its client relationship with Ottobock, supporting the family firm’s growth, in both Germany and at its facilities abroad.\nOttobock’s biggest business area is prosthetics.\nThe family firm is the world market leader in this segment. 160,000 people all around the world are now equipped with a prosthesis made by Ottobock. The simple wooden prosthetic limbs of yesteryear have since been replaced by high-tech complex prosthetic solutions made of sturdy carbon.\nThe patented prosthetic leg for everyday use, the “C-Leg”, is equipped with smart microprocessor-driven controls. They enable the user to move dynamically and also safely thanks to an inbuilt stumble-prevention module. A smartphone app even allows the wearer to select different modes and to check battery levels.\nIt’s not only about enabling people with disabilities to gain problem-free mobility in their routine day-to-day lives: “We want to enable users to engage in sport and raise societal awareness of disabled sport,” explains Lisa Marx, an Ottobock employee. “That’s why we offer special running prosthetics such as the Runner and the Sprinter,” she adds. These sport prosthetics comprise a carbon spring foot that can be combined with a sport knee joint, if required. Deutsche Bank employee Oliver Stoisiek was able to try out the Runner last year.\nI wanted to run, but I just didn’t know how.\nOliver Stoisiek is used to moving around on a prosthetic limb. His thigh had to be amputated when he was still a toddler. He’d never had a problem with that; he can go for walks, ride a bicycle or motorcycle and even go swimming using his everyday prosthesis. Jogging, however, was a problem. “My prosthesis does have a running mode, but when I wanted to go jogging with my wife I realised I had no idea how to actually run,” said Stoisiek.\nSearching for a solution to his problem on the internet, he came across the “Running Clinic”. Founded by Ottobock and the Paralympics gold medallist Heinrich Popow, the clinic teaches amputees how to run with their prosthetic limbs.\nStoisiek applied and was invited to join a week-long course. Popow taught him and the 11 other participants from across Europe how to use the running prosthesis – how to stand on it, run with it and sprint with it. “The spring foot is much more unstable than a normal prosthesis,” says Stoisiek, “but it returns energy, which makes for a much more dynamic run,” he explains.\nIntensive sports sessions and emotional conversations\nThe training sessions were extremely intensive and, of course, very tiring. Besides the running exercises, Stoisiek also participated in numerous intensive conversations with other participants, for instance on how they deal with their disability. “If, unlike me, you didn’t grow up with a disability, then coming to terms with it can be hard,” Stoisiek says.\nHe noticed this was particularly pronounced in the case of one participant, who was initially wary. “But being with like-minded people quickly helped us to get over this; we supported and motivated each other during the sport sessions and, by the end, we all had a connection,” Stoisiek added. A lasting connection it would seem as all the participants are still in contact with one another today.\nEven Heinrich Popow gets in touch occasionally. Oliver Stoisiek was extremely impressed by Heinrich Popow: “He shares our fate, was really able to empathise with us and has had an amazing career as a professional athlete. Heinrich is really dedicated and motivated us the whole time,” Stoisiek said.\nIncreasing awareness of disability\nStoisiek says that he can see a positive trend in the way society treats disability. “This kind of disability tended to be covered up in the past but nowadays people are very much more open about it,” Stoisiek says. He believes that people should be confronted with disability even more, though, especially those who have a problem with their own disability and are ashamed of it. “That’s also an element of diversity,” he says.",
    "number_of_ratings": 4,
    "rating": 5.0,
    "likes": 51
}