{
    "url": "https://www.db.com/news/detail/20190822-new-survey-from-deutsche-bank-research-shows-great-opportunities-for-social-media-ecommerce?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "August 22, 2019",
    "tags": [
        "Research"
    ],
    "title": "New survey from Deutsche Bank Research shows great opportunities for social media eCommerce",
    "body": "“Our survey shows a strong willingness by consumers to conduct eCommerce transactions, including checking out directly on Instagram, and gives us greater conviction in the Instagram eCommerce opportunity of 10 billion dollars which we provided in an April report to clients,” said Lloyd Walmsley, Lead Internet Analyst, in reference to a new Deutsche Bank Research survey looking at eCommerce on social media.\nThe Deutsche Bank Research team led by Walmsley partnered with Primary Research, part of the Data Innovation Group in Research, to conduct a survey of 500 US Instagram users (aged 18+) who engage in the platform at least once a month. The goal of the survey was to quantify the potential opportunity for direct purchases through social media. The survey follows Deutsche Bank Research’s recent report on the Instagram Checkout feature, which facilitates purchases through the app, as well as on the initiation and recent upgrade of Pinterest.\n“We see a large opportunity for social platforms like Facebook, Instagram and WhatsApp, and utility platforms like Pinterest to reduce transaction friction (total direct and indirect costs associated with a purchase) and increasingly facilitate eCommerce more directly through their platforms,” added Walmsley.\nHere are some of the key takeaways:\nFacebook and Instagram lead in commercial usage. When asked about which platforms respondents have used to \"click on a post, sponsored link, or ad\", Facebook (70%) and Instagram (59%) rank the highest among platforms surveyed in terms of commercial intent. Pinterest ranks No. 3 in the survey, which makes sense given the intent users have when using the platform.\nClear intent to use Instagram Checkout. A significant proportion of those surveyed are inclined to complete purchases and repeat purchases on Checkout. 43% of respondents said they were either \"very likely\" (18%) or \"somewhat likely\" (25%) to purchase products on Instagram using the feature. Of those that had tried Checkout, 83% said they were either \"very likely\" (60%) or \"somewhat likely\" (23%) to try again in the next six months.\nEase of use remains the primary driver for Instagram Checkout; limited payment options is the key deterrent. 15% of users surveyed said they had purchased something via Instagram Checkout, but 74% said they had not used the feature. Of the users who had used Checkout, the primary reason was “ease of use” (39% of the users), followed by “it has the brands I like” at 24%. For those who had tried Checkout but not actually purchased, the main reasons included finding the item cheaper elsewhere (18%) and not wanting to give payment information to Instagram/Facebook (17%).\nUsers interact with ads. While users trust WhatsApp and Pinterest the most, Facebook and Instagram users follow the highest number of brands/products/companies. Our survey shows that in the past 12 months, 70% of Facebook users and 59% of Instagram users have clicked on a sponsored link/ad for a product.\nPromoted posts have been effective. In the past 12 months, 56% of the users surveyed who had clicked on a promoted post/ad actually followed through and purchased something via a promoted posting on Snapchat, versus 53% on Instagram and 54% and Facebook.\nPinterest is most relevant and most trusted platform. Ads are most relevant on Pinterest, with 36% of the users surveyed saying ads are very relevant, followed by Facebook at 34% and Instagram at 32%. Moreover, users trust the promoted products in the ads most on Pinterest (32%), followed by Facebook, Instagram, and Snapchat (all at 30%).\nRead more on Business Insider (subscription required).",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}