{
    "url": "https://www.db.com/news/detail/20190822-deutsche-bank-co-founds-initiative-to-transform-the-way-companies-are-valued?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "August 22, 2019",
    "tags": [
        "Company",
        "Sustainability"
    ],
    "title": "Deutsche Bank co-founds initiative to transform the way companies are valued",
    "body": "Deutsche Bank has joined seven other international companies to establish an alliance dedicated to creating and promoting a standard for measuring and disclosing the total value companies provide to society, to change business steering and accounting.\nTogether with multinationals including Bosch and SAP – and supported by the four largest global accounting firms (Big 4) - Deutsche Bank has founded the “value balancing alliance”. Its objective is to change the way the market looks at, measures and values company performance and total value.\nThrough collaboration with academics and the Organisation for Economic Co-operation and Development (OECD), the alliance aims to reform accounting standards and create a blueprint for companies to publish a transparent Integrated Profit and Loss account. This is an extension of the traditional Profit & Loss account which integrates the positive or negative value a company has created for its stakeholders and society.\nSince many multi-national companies already integrate certain non-financial factors into their accounts, the Frankfurt-based non-profit alliance aims to create a standardised and therefore easily comparable methodology.\nThe initiative is sponsored by CEO Christian Sewing and Berthold Fürst, Co-Head Corporate Finance for the German-speaking regions.\n“Capital markets still rate companies predominantly on the basis of traditional financial data,” says Fürst. “But sustainable entrepreneurship, which captures the value proposition of an economic activity not only from the point of view of the classic income statement, is increasing - both on capital markets and in the capital allocation decisions of the companies themselves. It is up to us to develop a common basis so that sustainability is accepted by capital markets and becomes the standard. This approach makes companies more transparent and comparable - for all stakeholders.”\nAs the Deutsche Bank centre of competence, Group Sustainability will provide input and advice to the initiative and lead an internal pilot programme.\nToday, international companies still manage their business based on accounting principles and concepts codified before the 1970s, when globalisation, digitalisation and artificial intelligence were in their infancy. Together with environmental and social challenges, the circumstances facing companies have changed radically.\nSince businesses play an important role in enabling sustainable development and inclusive value creation, Deutsche Bank believes this holistic view should be reflected in assessing a company’s value.\nThe value balancing alliance members are: Deutsche Bank, BASF, Bosch, LafargeHolcim, Novartis, Philip Morris International, SAP and SK\nIt will be supported by KPMG, PWC, Deloitte and, EY.\nVisit the value balancing website for more information.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}