{
    "url": "https://www.db.com/news/detail/20190820-deutsche-bank-celebrates-50-years-in-indonesia?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "August 20, 2019",
    "tags": [
        "Asia-Pacific",
        "Company",
        "History"
    ],
    "title": "Deutsche Bank celebrates 50 years in Indonesia",
    "body": "This week Deutsche Bank celebrates its 50th anniversary in Indonesia, and reaffirms its commitment to the strong partnerships built over half a century with clients, community partners, and other stakeholders.\nDeutsche Bank first opened its doors in Jakarta in 1969, and has since played an active role in the economic and financial liberalisation in Southeast Asia’s largest economy through its corporate and investment bank.\nDeutsche Bank Asia Pacific Chief Executive Officer and Member of the Management Board, Mr Werner Steinmueller said: “We are proud of what we have contributed to Indonesia over the past 50 years, and we are absolutely committed to this important and growing market.”\nIn the late 1990s Deutsche Bank was a key advisor on banking sector consolidation after the Asian currency crisis, and today it helps Indonesia corporates and institutions access international capital markets and connect with international investors. In 2002 the bank was instrumental in the Republic of Indonesia’s first public local currency bond issue and today it is one of the top primary dealers for government bonds.\nAs part of the bank’s 50th anniversary celebrations, twenty volunteers from Deutsche Bank offices around Asia Pacific recently visited Jakarta to volunteer with the community. The initiative was part of the bank’s corporate social responsibility Born to Be initiative, which uses education-led programmes to unlock the potential of the next generation.\nSix different nationalities from the bank’s branches across India, Hong Kong, Malaysia, Philippines, Singapore and Vietnam, joined their local colleagues in Jakarta for a volunteering experience, spending time with the Happy Hearts Indonesia Foundation (HHI), Yayasan Kampuas Diakoneia (KDM), and Yayasan Karya Salemba Empat (KSE).\nDeutsche Bank Indonesia’s Chief Country Officer Siantoro Goeyardi said: “Over decades we have built strong long-term partnerships in the business community, and made a significant positive impact in the wider community.\n“This volunteering trip celebrates the Jakarta community of which we are an active part, supporting our partners to help children become the person they were born to be,” Goeyardi said.\nOver three days, Deutsche Bank volunteers rolled up their sleeves to work with Happy Hearts Indonesia in the expansion of a special needs school and conducted a Special Olympics Games event, refurbished a children’s dormitory at KDM and accompanied children from KSE on an Amazing Race event at the National Library to discover the joy of reading.\nOne of Deutsche Bank’s regional volunteers Mercy Gandi said: “It’s inspiring to spend time with these amazing young people, and I’m very proud of the positive impact the bank has made in the community.”\nDeutsche Bank Asia Foundation (DBAF) is also funding 50 scholars through KSE’s higher education programme, as part of its 50th anniversary celebrations in Indonesia. Since 2004, DBAF has contributed more than €1.4 million to community programmes and relief efforts in Indonesia.\nDeutsche Bank’s Indonesia branch was established in 1969, and today operates as a corporate bank and investment bank where it ranks number one for institutional cash management for Euro clearing and number two for custody services.\nThe investment bank helps Indonesia clients access international markets, leading a number of landmark transactions across equity and debt capital markets. The bank led the Republic of Indonesia’s first Euro bond in 2014 and the first US SEC Registered bond in 2017, among others. As a frequent corporate debt arranger, the bank also led Indonesia’s first ever corporate green bond and first ever Komodo bond.\nFor further information, please contact:\nDeutsche Bank AG\nMedia Relations\nSarah Stabler\nPhone: +65 6423 8413\nEmail: sarah.stabler@db.com \nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nDeutsche Bank’s Born to Be CSR pillar uses education-led programmes to unlock the potential of the next generation. Through this programme, the bank aims to help young people develop what they need to succeed in life: skills, aspirations and opportunities.\nAbout Happy Hearts\nHappy Hearts Indonesia is a non-profit organization dedicated to rebuilding schools and restoring hope and opportunity in the lives of children in underprivileged areas and in the ones affected by natural disasters. Happy Hearts Indonesia has rebuilt more than 160 schools in Indonesia, impacting over 50,000 children. They also provide training programmes for both teachers and students.\nAbout Yayasan Kampus Diakoneia Modern (KDM)\nKDM cares for street children. The non-profit removes children from the streets and gives them shelter and an education. Each year, KDM helps more than 600 street children. Through its entrepreneurial programme, the children learn life skills and are given opportunities in traineeship in order to start a life on their own.\nAbout Yaysan Karya Salemba Empat (KSE)\nKSE is a non-profit that provides higher education scholarships to more than 10,000 students who requires financial assistance each year. KSE uniquely does not consider academic achievement as the only determining factor in awarding scholarships as they believe in the potential of the students. Once the burden of living expenses, including daily essential needs such as food and shelter, is taken off the students, they are able to soar to greater heights.\n\nThis press release has been approved and/or communicated by Deutsche Bank AG or by its subsidiaries and/or affiliates (“DB”). Deutsche Bank AG is authorised under German Banking Law (competent authority: BaFin - Federal Financial Supervisory Authority) and by the Prudential Regulation Authority and subject to limited regulation by the Financial Conduct Authority and Prudential Regulation Authority.\nDetails about the extent of our authorisation and regulation by the Prudential Regulation Authority, and regulation by the Financial Conduct Authority are available from us on request. Securities and investment banking activities in the United States are performed by Deutsche Bank Securities Inc., member NYSE, NASD and SIPC, and its broker-dealer affiliates.\nLending and other commercial banking activities in the United States are performed by Deutsche Bank AG, and its banking affiliates. Copyright © Deutsche Bank AG",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}