{
    "url": "https://www.db.com/news/detail/20190813-deutsche-bank-finances-the-construction-of-dr-felipe-lucini-maternity-hospital-in-cordoba-argentina?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "August 13, 2019",
    "tags": [
        "Company",
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Deutsche Bank finances the construction of Dr. Felipe Lucini maternity hospital in Córdoba, Argentina",
    "body": "Deutsche Bank Spain’s Structured Trade & Export Finance group, part of the Corporate Bank, has arranged financing for the construction of the Dr. Felipe Lucini maternity hospital in Córdoba, the capital of city of Córdoba Province, Argentina.\nThe loan, which will also finance the purchase of medical equipment for 12 provincial hospitals, was signed with the Province of Córdoba and is guaranteed by the Argentine Republic through the Ministry of Finance.\nThe fixed rate, long-term loan will finance 100 percent of the project, which will be managed by Eductrade, a Spanish company specialising in international projects in the health and education sectors.\nThe loan is backed by the Spanish Export Credit Insurance Company (CESCE), which acted as agent for the Spanish Government. The Government, through CESCE, offers support programmes for the internationalisation of Spanish companies through credit insurance coverage to financial institutions, as well as the possibility of setting long-term interest rates, which improves the competitiveness of technical, economic and financial offers of Spanish companies.\nThe new maternity hospital will be situated in the southeast area of Córdoba, serving an area with a population of more than 600,000. It is named for Raúl Felipe Lucini, a local doctor who also served as the 50th Governor of the Argentine province of Córdoba.\n\nSignature of the deal at the Deutsche Bank headquarters in Madrid.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}