{
    "url": "https://www.db.com/news/detail/20210728-deutsche-bank-reports-profit-before-tax-of-EUR-1-2-billion-in-the-second-quarter-of-2021?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "July 28, 2021",
    "tags": [
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank reports profit before tax of € 1.2 billion in the second quarter of 2021",
    "body": "Net income of € 828 million with post-tax return on tangible equity (RoTE)¹ of 5.5%\nTransformation drives second-quarter profit growth\nCore Bank: profit before tax rises 90% to € 1.4 billion\nPost-tax RoTE¹ of 7.8% with cost/income ratio¹ of 76%\nCapital Release Unit reduces quarterly loss before tax by 56% to € 258 million\nNet revenues of €6.2 billion, down 1% as markets normalise in second quarter\nFurther progress on costs in the quarter\nNoninterest expenses down 7% year on year to € 5.0 billion\nAdjusted costs ex-transformation charges¹ of € 4.6 billion, down 6%\nContinued capital, balance sheet and risk discipline\nCommon Equity Tier 1 (CET1) ratio of 13.2%, down from 13.7% quarter on quarter, reflecting anticipated regulatory effects on risk weighted assets (RWAs)\nProvision for credit losses of € 75 million, down 90% year on year\nCapital Release Unit further reduces RWAs to € 32 billion, in line with end-2022 target, and cuts leverage exposure by € 10 billion to € 71 billion\nBusiness growth includes record net inflows of € 27 billion into investment products\nAsset Management: record net inflows of € 20 billion help lift Assets under Management by € 39 billion to € 859 billion\nPrivate Bank: net new business volumes of € 14 billion include net inflows into investment products of € 7 billion\nSustainability: outperformance driven by a record quarter\nRecord quarterly ESG financing and investment volumes of € 27 billion\nCumulative volumes rise to € 99 billion, on path to end-2023 target of € 200+ billion\nFirst half-year 2021: progress toward 2022 ambitions\nNet revenues up 7% to € 13.5 billion year on year\nProvision for credit losses down 89% to € 144 million, or 7 basis points of loans\nAdjusted costs ex-transformation charges and reimbursable expenses related to Prime Finance1 down 4% to € 9.8 billion\nGroup profit before tax of € 2.8 billion, up seven-fold, with net profit of € 1.9 billion\nPost-tax RoTE¹ of 6.5% with cost/income ratio reduced to 78%Core Bank profit before tax of € 3.4 billion, up 99%\nPost-tax RoTE¹ of 9.3%, in line with 2022 target, and cost/income ratio of 73%\n¹ For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ on pp 17-25 of the second quarter 2021 Financial Data Supplement\nOur pre-tax profit of € 1.2 billion in the second quarter demonstrates that we’re well on the path toward our goal for a post-tax RoTE1 of 8% next year. All our businesses have contributed to the year-on-year profit growth, gained further relevance for our clients and continued to capture market share. Once again, our cost and risk management provided us with firm foundations. Our priority now is to continue with our disciplined execution of transformation, quarter by quarter.\nChristian Sewing, Chief Executive Officer\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today reported its best second quarter and best first half year since 2015. Significant year on year profit improvement across all businesses was driven by resilient revenues, sustained progress on cost reduction and substantial year on year improvements in provision for credit losses.\nAcross the board profit improvement\nGroup profit before tax was € 1.2 billion in the second quarter of 2021, versus € 158 million in the second quarter of 2020. Net profit was € 828 million, up from € 61 million in the prior year quarter. Post-tax return on average shareholders’ equity was 4.9% and post-tax RoTE1 was 5.5% in the quarter. The cost/income ratio was 80%, down from 85% in the prior year quarter.\nThe quarter reflected a negative impact on profit before tax of € 226 million from the ruling by the German Federal Court of Justice (Bundesgerichtshof or ‘BGH’) in April 2021 requiring active customer consent for pricing changes on current accounts (for more information on this ruling, please see the ‘Provisions’ section of the Interim Report).\nThis included an impact of € 96 million in foregone revenues, of which € 93 million was in the Private Bank Germany with the balance in the International Private Bank and Corporate Bank. The cost impact was € 130 million in litigation expenses, also predominantly in the Private Bank.\nFor the first six months of 2021, profit before tax was € 2.8 billion, up from € 364 million in the same period of 2020. Net profit was € 1.9 billion, up from € 126 million in the prior year period. Post-tax RoTE1 was 6.5%, and 7.6% if adjusted for transformation-related effects1 and specific revenue items. The cost/income ratio was 78%, down from 87% in the first six months of 2020.\nIn the Core Bank, which excludes the Capital Release Unit, second-quarter profit before tax rose 90% to € 1.4 billion. All four core businesses contributed to this year on year improvement in profitability. Post-tax RoTE1 was 7.8%, up from 3.4% in the prior year quarter, while the cost/income ratio was 76%. Adjusted profit before tax, which excludes specific revenue items, transformation charges, impairments of goodwill and intangibles and restructuring and severance, rose 72% to € 1.6 billion.\nFor the first six months, Core Bank profit before tax near-doubled to € 3.4 billion. Post-tax RoTE1 was 9.3%, in line with the Core Bank’s full-year 2022 target, and 10.5% if adjusted for transformation-related effects1 and specific revenue items. The cost/income ratio was 73%, down from 77% in the prior year period.\nCapital Release Unit: significant loss reduction\nThe Capital Release Unit reported a loss before tax of € 258 million in the quarter, down by 56% from a loss of € 591 million in the second quarter of 2020. The adjusted loss before tax was € 236 million, down 54% year on year. This improvement was driven primarily by cost reduction: noninterest expenses were down 48% year on year to € 259 million, while adjusted costs ex-transformation charges1 were down 45% to € 236 million. Net revenues were negative €24 million, an improvement versus negative € 66 million in the prior year quarter.\nThe Capital Release Unit further reduced RWAs and leverage exposure. RWAs were reduced from € 34 billion to € 32 billion during the quarter, in line with the Unit’s end-2022 target, and a reduction of 24% over the past twelve months. The Unit reduced leverage exposure by € 10 billion to € 71 billion during the quarter, and by 30% versus the end of the second quarter of 2020.\nFor the first six months, the Capital Release Unit reported a loss before tax of € 668 million, a reduction of more than half versus the € 1.4 billion loss before tax in the first six months of 2020. This improvement was driven largely by a 36% year on year reduction in noninterest expenses to € 757 million, while adjusted costs ex-transformation charges were reduced by 40% to € 658 million. Net revenues were € 57 million for the first six months, an improvement of € 180 million versus the first six months of 2020.\nRevenues: resilience despite market normalisation and specific effects\nGroup net revenues were € 6.2 billion, down 1% versus the second quarter of 2020. Revenue development in the quarter reflected the normalisation of financial markets compared to the prior year quarter, continued low interest rates, and the impact of foregone revenues due to the BGH ruling. Revenues in the Core Bank were € 6.3 billion, down 1%. \nFor the first six months, Group net revenues grew 7% to € 13.5 billion, while Core Bank net revenues grew 5% to € 13.4 billion.\nSecond quarter revenue development in Deutsche Bank’s core businesses was as follows:\nCorporate Bank net revenues were € 1.2 billion, down 8% year on year, or down 6% if adjusted for currency translation effects. Net revenues were essentially unchanged versus the prior year quarter if adjusted for episodic items, including recoveries related to credit protection and portfolio rebalancing actions, which were substantially lower than in the second quarter of 2020. Interest rate headwinds were offset by the positive effects of business growth and further progress on deposit re-pricing, which covered accounts with deposits of € 87 billion, up from € 83 billion at the end of the previous quarter and contributing € 85 million in quarterly net revenues. Deutsche Bank also recaptured the No. 1 position for German Corporate Banking in FINANCE-Magazin’s annual survey. For the first six months, net revenues were € 2.5 billion, down 5% year on year, reflecting the aforementioned factors impacting the second quarter.\nInvestment Bank net revenues were € 2.4 billion, down 11%. Revenues in Fixed Income & Currencies (FIC) were € 1.8 billion, down 11%. This development largely reflected the anticipated normalisation of financial market activity compared to the second quarter of 2020, which impacted revenues in Rates, Emerging Markets and FX. This was partly offset by strong year on year growth in Credit, both Trading and Financing. Origination & Advisory revenues were 2% higher at € 624 million. Advisory revenues were more than double the prior year quarter, driven by higher M&A activity, while lower levels of Investment Grade Debt issuance in normalising markets more than offset growth and market share gains (source: Dealogic) in Leveraged Debt Capital Markets. Deutsche Bank returned to the No. 1 position in Origination & Advisory in Germany in the quarter (source: Dealogic). For the first six months, Investment Bank net revenues were up 9% to € 5.5 billion.\nPrivate Bank net revenues were € 2.0 billion, up 3% versus the prior year quarter, and up 8% if adjusted for the impact of the BGH ruling. Continued business growth in improved market conditions more than offset pressure on deposit margins from low interest rates. New business volumes of € 14 billion in the quarter included € 4 billion in net new client loans and € 7 billion in net inflows of investment products, the sixth consecutive quarter of net inflows into investment products. Revenues in the Private Bank Germany were down 1%, and up 7% if adjusted for the € 93 million impact of the BGH ruling. Revenues in the International Private Bank grew by 9%, or 8% excluding specific items. For the first six months, Private Bank net revenues rose to € 4.2 billion, up 2% year on year or up 4% if adjusted for the € 94 million impact of the BGH ruling. This increase was supported by continued new business growth, with net new business volumes of € 29 billion in the first half of 2021 including net new client loans of € 9 billion and net inflows in investment products of € 16 billion.    \nAsset Management net revenues were € 626 million in the quarter, up 14%. Growth was driven primarily by 15% growth in management fees, as five consecutive quarters of client inflows and supportive market performance more than offset continued industry-wide margin pressure. Net inflows were a record € 20 billion in the quarter, driven by positive flows across asset classes in all regions, and including € 3.8 billion in Environmental, Social and Governance (ESG) assets. These record inflows and strong investment performance contributed to € 39 billion growth in Assets under Management to € 859 billion in the quarter, a new record level, and € 114 billion or 15% higher than at the end of the prior year quarter. For the first six months, net revenues grew 18% to € 1.3 billion, total net inflows were € 21 billion, and Assets under Management grew by € 67 billion.\nFurther cost reduction\nNoninterest expenses were reduced by 7% to € 5.0 billion in the quarter, despite pressure from several external factors including the aforementioned € 130 million in litigation provisions relating to the BGH ruling. Adjusted costs ex-transformation charges were reduced by 6% year on year to € 4.6 billion.\nThe workforce was reduced by an additional 592 full-time equivalents (FTEs) to 83,797 during the quarter, and by approximately 3,000 FTEs over the past twelve months. At the end of the quarter, Deutsche Bank had recognised 90% of the total transformation-related effects1 anticipated through the end of 2022.\nFor the first six months, noninterest expenses were down 4% to € 10.6 billion. Adjusted costs ex-transformation charges1 and reimbursable expenses related to Prime Finance were down 4% to € 9.8 billion, including € 547 million in bank levies.\nSustained year on year improvement in provision for credit losses\nProvision for credit losses was € 75 million in the quarter, equivalent to 7 basis points of average loans on an annualised basis, and down by 90% compared to € 761 million in the second quarter of 2020. Provisions for non-performing loans (Stage 3) were € 111 million in the quarter, down 33% on the previous quarter and down by 78% compared to the second quarter of 2020. Stage 3 provisions were offset by releases of € 36 million in provisions for performing loans (Stage 1 and 2) which reflected a positive macro-economic outlook.\nFor the first six months, provision for credit losses was € 144 million, or 7 basis points of average loans annualised, down from € 1.3 billion, or 57 basis points of average loans annualised, in the prior year period. \nConservative capital and balance sheet management\nThe Common Equity Tier 1 (CET1) capital ratio was 13.2% in the quarter, a decline of 55 basis points compared to 13.7% in the previous quarter. This development reflects a negative impact of approximately 70 basis points from the regulatory-driven increases in RWAs relating to the ECB’s Targeted Review of Internal Models (TRIM) and Capital Requirements Regulation (CRR) amendments taking effect in the quarter as expected.\nThe TRIM decisions reflected in the second quarter conclude the multi-year TRIM programme for Deutsche Bank. These factors were partly counterbalanced by a positive impact of 12 basis points from organic capital generation through net income, after deductions for dividends, of € 274 million, and for coupons for Additional Tier 1 (AT1) instruments in the quarter. As at June 30, Deutsche Bank had deducted € 575 million for dividends from first-half 2021 earnings.\nRisk Weighted Assets (RWAs) rose from € 330 billion to € 345 billion during the second quarter. This development was almost entirely due to the impact of the aforementioned TRIM decisions and CRR amendments. \nThe Leverage Ratio (fully-loaded) rose to 4.8% in the second quarter, up from 4.6% in the previous quarter. On a phase-in basis, the Leverage Ratio rose to 4.9%, from 4.7% in the previous quarter. These ratios exclude certain central bank balances under applicable rules. Including these balances, the fully-loaded Leverage Ratio would have been 4.3% in the quarter.\nLiquidity Reserves rose € 11 billion to € 254 billion during the quarter, including High Quality Liquid Assets of € 224 billion, up by € 4 billion during the quarter. The Liquidity Coverage Ratio was 143%, a surplus over regulatory requirements of € 67 billion.\n2022 ratio targets reaffirmed; guidance updated\nDeutsche Bank reaffirmed its 2022 ratio targets in the light of progress made in its transformation, namely: a post-tax RoTE1 of 8% at Group level and over 9% for the Core Bank; a cost/income ratio of 70%; a Common Equity Tier 1 capital ratio of at least 12.5% and a leverage ratio (fully-loaded) of approximately 4.5%. With Deutsche Bank’s transformation significantly advanced and having evidenced sustainable profitability in the first half of 2021, management is updating cost guidance to focus on the cost/income ratio.\nThis more accurately reflects the sustainable margin which the bank is targeting.  Accordingly, the bank will no longer disclose an absolute cost target, previously € 16.7 billion, for 2022.\nDeutsche Bank also provided updated guidance on the drivers of these target ratios as transformation advances. Management expects net revenues to be ahead of guidance provided at the Investor Deep Dive on December 9, 2020. The bank sees a substantial portion of its revenue growth in recent quarters as sustainable, as underpinned by strong business growth in 2021 to date and the expected gradual easing of interest rate headwinds in future quarters. Additionally, provision for credit losses is expected to be lower than previous guidance, in a range of around 20 basis points of average loans. \nThe bank expects these positive factors to counterbalance additional expenses due to unforeseen factors arising in 2021, including higher-than-expected contributions to the Single Resolution Fund and the German statutory deposit guarantee scheme. Management believes these items will exceed its initial plan by approximately € 400 million in total. The bank also foresees additional expenses arising from higher business volumes and investments in the control environment.\nIn line with its firm commitment to continued discipline on controllable cost items, management has initiated a series of incremental cost reduction measures to mitigate these additional cost pressures. For more information on the bank’s financial and regulatory targets, please see the ‘Strategy’ section of the Interim Report.\nSustainable finance: record quarterly volume underpins outperformance\nDeutsche Bank remains ahead of target in pursuit of its goal, of at least € 200 billion in cumulative Environmental, Social and Governance (ESG)-related financing and investments excluding DWS from the beginning of 2020 to the end of 2023. At the end of the second quarter, cumulative ESG financing and investments reached € 99 billion, close to the bank’s full-year interim goal of at least € 100 billion by end-2021.\nIn the second quarter, ESG financing and investment volumes were a record € 27 billion. Deutsche Bank’s businesses contributed to this total as follows:\nThe Corporate Bank added € 6 billion in sustainable financing, bringing its cumulative total to € 15 billion;\nIn the Investment Bank, sustainable financing and capital market issuance volumes were € 15 billion in the quarter, bringing the division’s cumulative total to € 56 billion;\nThe Private Bank added € 7 billion to reach a cumulative total of € 28 billion. During the quarter, investment volumes were € 6 billion, with an additional € 1 billion in new client loans. Cumulative total volumes now stand at € 19 billion for the Private Bank Germany and € 9 billion for the International Private Bank.\nDuring the quarter, Deutsche Bank joined the Net Zero Banking Alliance, committing to align its operational and attributable emissions from its loan portfolio with pathways to net zero by 2050. This supplements the bank’s signing of the Collective Commitment to Climate Action of the German financial sector and Deutsche Bank’s commitment to publish the carbon footprint of its € 445 billion loan portfolio by the end of 2022. The bank continued to refine its Climate Risk methodology and data strategy in alignment with other financial institutions and collaborative cross-industry bodies.\nIn May 2021, Deutsche Bank became the first bank to join the Ocean Risk and Resilience Action Alliance (ORRAA) as a full member and announced its support for the Monetary Authority of Singapore in establishing an ESG Center of Excellence which will focus on public and private ESG transactions, product development and advisory services. Asset Management was selected to advise and help drive the global Net Zero Asset Managers Initiative (NZAMI) and will form part of NZAMI’s newly formed advisory group.\nRead \nPDF\nthe full media release in the downloadable PDF.",
    "number_of_ratings": 3,
    "rating": 1.0,
    "likes": 139
}