{
    "url": "https://www.db.com/news/detail/20210723-notalone-in-italy-we-re-helping-young-people-by-joining-forces-with-our-partner-organization-save-the-children?language_id=1",
    "language": "EN",
    "article_type": "Nachricht News",
    "publish_date": "July 23, 2021",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "#NotAlone: in Italy we’re helping young people by joining forces with our partner organization Save the Children",
    "body": "In Italy the Covid-19 pandemic is dramatically altering the psychological, emotional and psychosocial condition of children and young people throughout the country. Suicide attempts and self-harm episodes have increased by 30% since October 2020, according to Bambino Gesù Pediatric Hospital in Rome, where more and more people accessing emergency care with psychiatric disorders are 12 to 18 year olds who have tried to take their own life.\nIn this framework, a very difficult task now falls on adults: to equip themselves to stand by children in the slow return to what they know as “normal”, to help them be aware of what they have experienced; and above all to help them build their future.\nFor this reason, we have chosen to support Save the Children Italy, which is developing a psychosocial repository, an online sharing place for in-depth studies aimed at adults (educators, caregivers, teachers, parents, etc.) to respond directly to young people’s needs. The repository will benefit from regularly updated inputs from a scientific committee specifically set up for this purpose.\n   “Anyone who has or knows school-aged children has a clear idea of what the #NotAlone campaign is about: lack of sleep, smartphone addiction, psychological blocks when it comes to going out, take any decisions or seeing friends. As parents, relatives, teachers or even friends, we clearly see these are calls for help. The psychological repository can be a precious resource for anyone wishing to respond in the best way – and we are grateful to Save the Children Italy for providing it”, commented Davide Barbavara, Executive Director of Fondazione Deutsche Bank Italia, the non-profit arm of the bank in Italy which has been supporting young people, disadvantaged groups and the local community since 2013.\nTo further support Save the Children, a Steps Challenge was launched on June 16 to double the donation if an ambitious target of 50 million steps was met. In 2 weeks, more than 550 Italian employees, equal to over 16% of the company population, took part in the challenge individually and in 9 teams, and totaled over 51 million steps. \"7 years ago I discovered running. From that moment on, I started to extend the length of my runs to discover my limits. I combined my passion for the mountains with running and I also started doing some races to test myself. I am happy I contributed to this initiative and hope there will be more in the future”, said the top stepper Paolo Gelosa, who joined Deutsche Bank in 2001 and, who totaled  500,340 steps.",
    "number_of_ratings": 17,
    "rating": 1.0,
    "likes": 71
}