{
    "url": "https://www.db.com/news/detail/20210709-notalone-wenn-jeder-schritt-zaehlt?language_id=1",
    "language": "EN",
    "article_type": "Nachricht News",
    "publish_date": "July 9, 2021",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "#NotAlone: Every step helps!",
    "body": "The pandemic has had a catastrophic impact on the lives of young people. In Germany too, the effects are clearly being felt: 40% of young Germans say their mental health has been affected by the pandemic. More than 50% of young people with existing mental health issues have had limited access to treatment and counselling. Now, more than ever, young people urgently need help. Charities, however, don’t always get the funding they deserve and often find themselves stretched to their limits.\nDeutsche Bank’s #NotAlone campaign is helping the next generation better manage the challenges that lie ahead by partnering with expert charities in more than 30 countries. The bank's employees are also getting involved. All over the world, they are taking part in the #NotAlone steps challenges and accumulating as many steps as possible – alone or in teams, for a good cause. Their message to the youngest in our society: You are not alone.\nAn incredible 528 million steps for youth mental health\nDeutsche Bank makes a positive impact and donates 150,000 euros to the children's foundation \"Die Arche\" that operates throughout Germany. Together 4,800 employees walked 528 million steps within two weeks. Thereby they exceeded the target of 300 million steps and thus increased Deutsche Bank's total donation by an additional 50,000 euros. \"I am very proud of the commitment of our employees, and I am very happy that we can support the children's foundation 'Die Arche', with which we have already been working for many years,\" says Karl von Rohr, President of Deutsche Bank.\nAs an additional incentive, the bank’s CSR team awarded those colleagues (female and male) with the most steps and the team with the best average a donation of 1,000 euros each to a charity of their choice. After having checked the submissions, we are happy to announce the winners in the respective categories:\nCarmen Herz from Bonn took first place among the female runners/walkers with an incredible 715,000-plus steps. How did she do it? “At the beginning of 2021, I decided to walk at least a million steps every month for a year. I divided every day into two to five stages, the last lap was often late in the evening between 9:00 and 11:00 p.m.”, explains Carmen Herz, who already made it into the top 3 of last year’s step challenge. “I took part because, on the one hand, I wanted to win and do something good for the charities close to my heart. On the other hand, I wanted to test my limits.” Her donation of 1,000 euros goes to Sterneninsel e.V., a hospice for children and young people, and the Harmonie Königsbach e.V. music association\nAmong the male runners/walkers, Steffen Syré can book the most extra miles on his account: he has accumulated more than 516,000 steps and his donation will go to the Amguri project in northeast India, the partner school of Taunusgymnasium/Königstein, which his daughter attends. \"I've been working from home since the beginning of the pandemic. As a result, I didn't have to commute every day, so I decided to use the time saved to do some physical exercise. Since then, I've been running an average of two hours a day”, says Steffen Syré. \"In summary, I am very satisfied with the result of having developed my mental and physical fitness and, above all, having supported a good cause with #NotAlone – an initiative that is very close to my heart as the father of two school-age children.\"\nRegina Göllnitz and Stefanie Weber from Berlin make up the team #MoVe #Prozesse #Qualität #Wir müssen zu (z)weit gehen, which took first place with an average number of steps of over 270,000. “#NotAlone is a really great and generous Deutsche Bank campaign! So we didn’t hesitate to run for a good cause again. The effects of the pandemic are not easy to cope with even for some adults. That’s why we consider it even more important to think now about the younger generation who find it even more difficult to get help for themselves”, explain Regina and Stefanie. \"Our donation will go to the Rolli-Kids of the Sportgemeinschaft Handicap Berlin e.V. A colleague recently gave a presentation about this wonderful project in our monthly meeting - that was like a sign for us in retrospect, because on that very same day we received the unexpected news that we had achieved first place.\"\n  Our positive impact\nWith the bank's donation of 150,000 euros, Die Arche is able to support 2,000 children who are particularly disadvantaged by the pandemic-related restrictions at its Germany-wide locations. Die Arche maintains close contact with the children, offering a wide range of leisure activities and access to online learning tools, and provides help in school and with learning. One urgently needed half-day educational position is to be created at each of ten Arche locations. Our colleagues have also collected additional funds via an online donation site. Every donation benefits the mental health of children. For 20 euros, a child can take part in a day-long trip to the swimming pool. For a donation of 50 euros, Die Arche can provide a parents' breakfast with educational input and dialogue. There was a strong willingness among Deutsche Bank to make donations. In a very short time an additional 6,000 euros were raised.\n“The damage caused by the pandemic will keep us occupied for a very long time. The consequences of the long lockdown are clearly visible in many children. They have lost their structured daily routine, many feel alone and abandoned, they have developed behavioural problems and are suffering from anxiety. All of this shows they have become very unsettled. We are very happy to be part of the #NotAlone campaign. Thanks to the support of Deutsche Bank, we are able to tackle the resulting deficits in learning and trauma with the children”, says Bernd Siggelkow, founder and CEO of Die Arche. .",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 10
}