{
    "url": "https://www.db.com/news/detail/20210706-notalone-campaign-is-supporting-more-than-1-500-families-in-spain?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 7, 2021",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "#NotAlone campaign is supporting more than 1,500 families in Spain",
    "body": "A year and a half has passed since COVID-19 forced all Spaniards into lockdown. A period of uncertainty, fear, bereavements, job losses and loneliness. This has dramatically affected the mental health of the Spanish population, especially teenagers from less privileged backgrounds.\nAccording to official figures, 30 percent of young people have suffered panic attacks in the last year, 24 percent have felt depressed and 38 percent are worried about the future. The Spanish Pediatric Association reports that the pandemic has quadrupled the number of children in hospital with mental health conditions, and that pediatric mental health emergencies have increased by 50 percent among teenagers. The rise in unemployment, fewer opportunities and no access to computers or similar devices for home schooling is causing people with lower incomes increased stress.\nAs part of the global #NotAlone campaign, Deutsche Bank has partnered with Save the Children Spain. The NGO supports more than 1,500 families in seven autonomous communities to enable quality education and to prevent social and mental health issues within less privileged families. Save the Children is providing technical tools to those in need; psychological support from social workers and over the phone – with a special focus on preventing domestic violence and enhancing family coexistence.\n \"We know there is a great need at this time and we need to take action before it is too late. Save the Children has proven expertise in helping children and teenagers in need. During the pandemic, the organisation has offered a lot of tools and programmes to solve all kind of problems associated with this crisis. We are pleased to partner with them to support young people in Spain,” says Juan Briz, Communications, Deutsche Bank Spain.\nCarolina Unzeta from Save the Children Spain explains: “To create awareness of the problem, it’s important that big companies such as Deutsche Bank talk about it. Vulnerable children from low-income families are suffering not only the physical health consequences of COVID-19 but financial consequences also, as well as the stress associated with it. This sometimes leads increased violence within families and in school. We are pleased to have a partner like Deutsche Bank to help reduce these issues.”\nClick here to learn more about our #NotAlone campaign.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}