{
    "url": "https://www.db.com/news/detail/20210707-deutsche-bank-launches-emerging-markets-fx-indices-to-track-21-em-currencies?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Singapore, July 7, 2021",
    "tags": [
        "Asia-Pacific",
        "Investment Banking",
        "Research"
    ],
    "title": "Deutsche Bank launches Emerging Markets FX indices to track 21 EM currencies",
    "body": "Deutsche Bank announced the launch of a new set of Foreign Exchange indices to track 21 Emerging Markets (EM) currencies, reflecting the growing importance of EM as an asset class.\nThe set of four new non-tradable foreign exchange indices were developed by Deutsche Bank’s EM research team to help investors more comprehensively track performance of emerging markets currencies.\nGlobal Head of EM Research, Sameer Goel said, “Asia’s economic growth, particularly China, is tipping the scales of economic influence and changing the investment landscape. In recent years, Emerging Markets fixed income assets (credit and currencies) have been growing in volume and prominence, therefore tracking EM FX performance has become more important than ever for investors in emerging markets.”\nThe Deutsche Bank research team highlight four key aspects of investment growth in emerging markets.\n1)   Significant shifts in the relative size of emerging markets from an economic and investment point of view. For example, the inclusion of China in various global bond indices, including the FTSE World Government Bond Index scheduled for later this year. Deutsche Bank strategists expect cumulative global investment inflows of just under USD600bn into China local currency fixed income in the next 5 years.\n2)   Issuance of a growing proportion of government debt in emerging markets in local currency. Total government debt issuance has more than doubled in the last decade, with the majority denominated in local currency.\n3)   Growth of benchmarks and passive investing in emerging market debt. The number of countries in benchmark bond indices has grown from 11 to 19 since 2002.[1] Foreign holdings of local currency government bonds in EM have increased from USD 800bn in 2004 to almost USD 2 trillion in 2019.[2] This has increased the need for investors to track EM FX to help with the decision on whether to hedge their currency exposure on underlying bond holdings.\n4)   Significant increase in the volume of transacted EM FX. The share of EM in OTC FX turnover has increased from 12% in 2007 to 25% today, particularly in derivatives.[3]\nDeutsche Bank EM strategist Oliver Harvey said, “The new indices track both spot and carry performance of 21 emerging market currencies, serving as a comprehensive set of barometers for EM investors tracking FX.”\n“We developed the new Deutsche Bank EM FX indices to better reflect the growth and development of EM fixed income. The indices capture a much wider currency universe, 21 currencies in total.  Indices also reflect transparent and dynamic weights, and both spot and carry performance, since carry is a significant trading strategy for EM investors,” Harvey said.\nAvailable on Bloomberg terminals, the non-tradeable indices were designed to track EM currency performance.  The indices build on existing EM FX indices in four ways: 1) reflect a wider universe (21 currencies); 2) apply relevant and transparent weights; 3) shift weight dynamically over time (3 years), and 4) capture both spot and total return performance.\nThe indices are:\nFor further information please contact:\nDeutsche Bank AG Media Relations\nSarah Stabler\nEmail: sarah.stabler@db.com\nPhone: +65 9116 9970\n\n[1] According to IMF\n[2] According to BIS Shrapnel\n[3] According to the BIS triennial survey",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}