{
    "url": "https://www.db.com/news/detail/20190930-deutsche-bank-features-viviane-sassen-at-frieze-in-london-capping-16th-year-as-global-lead-partner?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 30, 2019",
    "tags": [
        "Art",
        "Company",
        "Corporate Citizenship",
        "Corporate products",
        "Wealth"
    ],
    "title": "Deutsche Bank features Viviane Sassen at Frieze in London, capping 16th year as Global Lead Partner",
    "body": "Deutsche Bank marks the culmination of its 16th year as Global Lead Partner of Frieze worldwide with an installation by Viviane Sassen, one of the most influential fashion photographers working today, at its client lounges at Frieze in London this week.\nFrieze London 2019 brings together more than 160 galleries from 35 countries, its most international edition ever. It opens from Thursday, October 3, to Sunday, October 6, in The Regent’s Park alongside Frieze Sculpture and Frieze Masters.\n\"Venus and Mercury\", the immersive installation by Amsterdam-based Sassen at the Deutsche Bank Wealth Management lounges at Frieze London and Frieze Masters, draws from a recent video she made for a project at Versailles, using artefacts and architecture of the palace to allude to its hidden histories.\nDeutsche Bank has been supporting the work of cutting-edge, international artists and their galleries for nearly 40 years and has distinguished itself as a global leader in corporate art initiatives. The Deutsche Bank Collection, part of the bank’s Art, Culture & Sports programme, has included works by Sassen since 2015.\nFrieze held its inaugural edition in Los Angeles at the Paramount Picture Studios in February this year as well as its well-established fair in New York in May.\nThe Deutsche Bank Wealth Management lounges at Frieze have become noted exhibition spaces in their own right, featuring collaborations with leading contemporary artists from around the world such as John Akomfrah, Tracey Emin, Sarnath Banerjee, Valeska Soares and Victoria Fu.\n\nViviane Sassen, Secret Letter / Blue from the series ‘Venus & Mercury’ 2019, Photograph © the artist and courtesy Stevenson, Cape Town and Johannesburg.\nAll sculptures belong to the Musée du Louvre and Château de Versailles.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}