{
    "url": "https://www.db.com/news/detail/20190930-deutsche-bank-is-the-first-bank-to-join-the-asia-pacific-central-securities-depository-group?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 30, 2019",
    "tags": [
        "Company",
        "Corporate products"
    ],
    "title": "Deutsche Bank is the first bank to join the Asia-Pacific Central Securities Depository Group",
    "body": "Deutsche Bank has joined the Asia-Pacific Central Securities Depository Group (ACG) as its first bank associate member to help develop the securities markets in Asia Pacific. Formed in 1997, the ACG is an informal international organisation to facilitate the exchange of information and to promote mutual assistance among member securities depositories and clearing organisations in the Asia-Pacific region.\nDeutsche Bank’s Securities Services operates as an onshore custodian across 12 markets in Asia Pacific. Membership of the ACG gives Deutsche Bank the opportunity to work closer with other members on key common topics such as international best practices, cybersecurity, account structures, new technology adoption, and laws and regulatory developments.\nFor clients, our associate membership is a clear demonstration of our commitment to remain as close to an important source of market change and development as possible, and to act as a solid timely bridge between the clients, the financial market infrastructures and the markets.\n“The CSD community is an important source of market development and dynamism, and a pillar of asset and investor protection that operates together with custodians like us. Our ACG membership is a milestone to Deutsche Bank’s longstanding relationships with CSDs to create value and solve common issues. By closely collaborating with the CSDs on forward-looking topics, we aim to contribute to our markets’ attraction in more ways,” said Anand Rengarajan, Head of Securities Services Asia Pacific.\nBoon-Hiong Chan, Head of Market Advocacy, will represent Deutsche Bank in the ACG.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}