{
    "url": "https://www.db.com/news/detail/20190925-italy-cco-flavio-valeri-the-bank-of-the-future-a-customer-centred-open-digital-platform?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 25, 2019",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "The bank of the future: client-centric, open, digital",
    "body": "In an extensive\nFILE\ninterview with the main Italian newspaper, Il Corriere della Sera, Italy’s Chief Country Officer Flavio Valeri explains how digitization is structurally changing the business models of many companies, including banks.\nStarting with the situation in Italy, Valeri said: “Over the past five years, monthly customer visits at branches have fallen by over 40 percent and the proportion of customers using online banking has more than doubled.”\nBut even if the country is a little late in joining the digital revolution, the structure of the market, mainly made of retail customers and SMEs, means there is scope for widespread digitalisation, he said. In the future, the banking sector will become a world of platforms offering a wide range of products and services. This “open product model” will be based on three technologies: API (Application Programming Interface), Artificial Intelligence and Blockchain.\nThe customer will be the real winner in this radical transformation, with banks becoming open digital platforms to serve them. This is the main challenge for the future of banks, which are still investing significant energy and resource. In its strategy update in July, Deutsche Bank allocated 13 billion euros for technology improvements.\nIl Corriere della Sera, 15 Sept. 2019. Interviewer: Federico De Rosa\nThe bank of the future? It will be on digital platforms\nThe problem is known: \"In Italy we are still not very digital: Flavio Valeri begins by sharing an investigation by the “Corriere\" showing that even today only one Italian out of three uses the Internet. The issue however is not digitalisation, but to understand when the great leap will take place”. According to the Chief Country Officer of Deutsche Bank in Italy \"it won’t be long.\nNow is the time to decide when, how much, how and where to invest \". Technology is changing the world of banks. The advancement of Fintech, Gafa (Google, Apple, Facebook, Amazon) and Bat (Baidu, Alibaba, Tencent, the Chinese over-the-top) and the continuous growth of start-ups in financial services is impetuous and the risk of being gradually forced to give in to them pieces of business is concrete.\n\"Digitization is structurally changing the business models of companies and this is happening also in the banks, explains Valeri. Over the past 5 years, monthly customer visits at the branches have fallen by over 40% and the proportion of customers using home banking today has more than doubled”.\nWe follow or we are still only observers of what others are doing ...\nFlavio Valeri: “Unfortunately Italy is a little late, we have little digital aptitude and in Europe we are the laggard. But I am not pessimistic about the future”.\nDo you see an acceleration making it possible for Italy to catch up?\n“The Italian market is mainly made up of retail customers and small and medium-sized businesses, a structure that typically leads to a widespread digitalisation process, a bit like what happened with mobile phones 15 years ago: in Italy only a few people had mobiles, then in just a few years we became the world's first in terms of number of terminals per capita”.\nDon't you think that one of the factors that has slowed down digitalisation in banks is also the fear of losing other jobs among banks?\n\"The employment problem is there, but the risks are not only those that many perceive. I read an interview with the general secretary of Fabi (the main banking union, ed), Lando Sileoni, and I agree with him when he says that this transformation, which will be fast and disruptive, must be managed. However, a plan is needed to increase technical skills, retrain staff and bring to the bank new professionals, such as data scientists and programming engineers. This is certainly not an easy objective”.\nWhat will the bank of the future look like?\n“Digitization will transform the banking world into a world of platforms offering all products. An open product model that will be based on three technologies: Api (Application programming interface, ed), a technology that simplifies third-party access to bank data and is essential to create open proprietary platforms; artificial intelligence through which, for example, customers will be profiled or it will be offered advice on asset management (robo-advisor). Finally, the Blockchain, allowing to safely create and manage huge databases distributed. The use of these three technologies will structurally transform banks into platforms”.\nAnd what are the impacts for customers?\n“The customer is the big winner. It will be up to us banks to restructure and become open digital platforms to his service”.\nHow many investments do we talk about?\n“A huge amount. Today, in general, banks invest about 10% of revenues in IT, of which 2/3 are destined for current systems and 1/3 for new technologies. In the three-year plan Deutsche Bank has allocated 13 billion euros only for IT systems. It is the main challenge for our future”.\nThere is, however, the risk that the so-called \"Over the top\" will take you away from customers, even more so after the PSD2 directive, which obliges banks to provide data to third parties. The enemy has entered the house …\n“There is no doubt that the Bat and Gafa problem exists: after having taught the world to buy online services and goods they are now thinking of entering the financial sector. They already have the best and most used distribution platforms in the world. I believe that the ideal solution is to sit around the table and find between us, the banks, a form of collaboration that is to develop shared platforms and catch up. The pan-European banking platforms could bring in a market of 300/400 million consumers”.\nAnd in Italy?\n“Italian banks have had important priorities to manage to date: the first was the management of the NPLs, then the reduction of operating costs and eventually the investments in IT. These were not residual, but Italian banks so far could only allocate limited resources. The delay is also due to this. And the issue of digital platform security, cybersecurity, must still be addressed”.\nOther investments to make ...\n“Inevitable and potentially more expensive than those related to digitization. A bank alone certainly cannot make it. But infrastructure security is a national issue, not just a company one”.\nSo who should take care of it?\n“Cybersecurity requires very significant investments and I think it is appropriate to take the matter to a European level. The collaboration and support from national and European security agencies is clearly a high priority”.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}