{
    "url": "https://www.db.com/news/detail/20190925-christian-sewing-at-sibos-collaboration-and-innovation-will-drive-transactions-banking-success?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 25, 2019",
    "tags": [
        "Company"
    ],
    "title": "Christian Sewing at SIBOS: \"Collaboration and innovation will drive transactions banking success\"",
    "body": "The transaction banking business is changing rapidly and Deutsche Bank must join peers and other industry players to find common solutions that will help keep it relevant to clients, Christian Sewing told the SIBOS 2019 conference in London this morning.\nIn the first keynote address to SIBOS by a Deutsche Bank CEO, Sewing said he was “very optimistic for the transaction banking business”, which is a cornerstone of the new Corporate Bank division that is at the heart of Deutsche Bank.\nHe also highlighted challenges and opportunities for the wider transaction banking industry, which, building on a strong 2018, continued to grow revenues in the first half of 2019, according to Coalition.\nPivotal times ahead\nBut Sewing cautioned the flagship conference for transaction banking: “Whether it is technological disruption, regulatory developments or new players entering the market and challenging existing business models, these are pivotal times for all of us.”\n“Our job now is to make sure we stay relevant for our clients and to capture the opportunities as this dynamic, exciting and innovative business evolves.”\nThis will not always be straightforward for individual institutions including Deutsche Bank to do on their own, Sewing said, so further industry collaboration is essential.\nHow to evaluate and incorporate Blockchain technology into transaction banking processes is one area that needs a joined up approach, which is why last week Deutsche Bank became the latest member of the Blockchain-focused Interbank Information Network.\nAnother challenge facing an industry in flux is whether to develop products and technology in-house, or to partner with the often more nimble and specialist fintechs that are transforming transaction banking and beyond.\n“The answer is often a mixture”, Sewing said, highlighting Deutsche Bank’s acquisition of stakes in ModoPayments and just last week, Deposit Solutions, as examples of where partnerships with start-ups can inject new thinking into Deutsche Bank.\nPlatforms and regulation\nWide-reaching regulation is also revolutionising the transaction banking industry, Sewing said, citing the EU’s Payment Services Directive (PSD2) as a catalyst for platform business models, including those moving aggressively into financial services.\n“Names like Google, Amazon, Facebook and Alipay, with their vast potential client bases, market capitalisations and data analytics capabilities, are already taking market share from banks, not only in the retail area.”\nWith the commercialisation of customer and client data fundamental to the platform model’s success, Sewing said the banking industry, “needs to catch-up in terms utilising our vast stores of client data – this is a priority for us at Deutsche Bank as it certainly is for many of our peers.”\nAlthough often perceived as a threat to traditional banks, PSD2 also brings opportunities. Recently Deutsche Bank started our cooperation with the International Air Transport Association (IATA), to create IATA Pay, a new payment option that connects the customer’s bank account directly to the airline, avoiding credit card fees.\nDespite these innovations and pressures, banks still retain the majority of consumer accounts across the spectrum of financial services, the CEO said, putting them in a strong positions to remain a trusted partner to corporate and institutional clients.\n“Change is coming but if we embrace technology, work together and keep clients at the centre of everything we do, I believe transaction banks have a bright future,” he said.\nMacroeconomic risks\nDiscussing Deutsche Bank’s July strategy update, Sewing said the Corporate Bank, with its “combination of a strong client focus with an innovation-driven business model”, was key to making the Group “weatherproof”.\nThis is more important than ever “against a backdrop of global macroeconomic risks, low interest rates and a fragmenting Europe.”\nDeutsche Bank at SIBOS\nDeutsche Bank has a strong presence at SIBOS 2019 including several speakers covering subjects including instant payments and digital transformation. This will be supported by the Deutsche Bank stand, meeting rooms, client events and Deutsche Bank’s ‘Innovation Pod’.\nSIBOS is the global financial services networking event organised by SWIFT. The annual conference and exhibition connects more than 8,000 executives, decision makers and thought leaders from across the industry.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}