{
    "url": "https://www.db.com/news/detail/20190923-deutsche-bank-helps-open-doors-of-financial-markets-for-university-women-in-brazil?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 23, 2019",
    "tags": [
        "Company",
        "Diversity",
        "Research"
    ],
    "title": "Deutsche Bank helps open doors of financial markets for university women in Brazil",
    "body": "Last year, Maite Leite, Chief Country Officer for Deutsche Bank Brazil, sat down with three other bankers representing Goldman Sachs, UBS and BNP Paribas to discuss why women have been largely under-represented in the country’s financial services sector.\nThose discussions resulted in the launch of Dn’A Women — Develop and Achieve, a four-month program designed to attract women to the banking industry by providing workshops and leadership training for university students who are set to graduate in 2020 or 2021.\n“I believe the initiative has the potential to increase access to opportunities and open the doors of financial markets for young, committed women,” said Leite.\nThe program, which received more than 1,300 applicants across Sao Paulo for only 60 spots, is now well under way. Most of the participants are from families with lower incomes and attend public university majoring in Business, Engineering, Law and Accounting. More than 40% are students of color.\nLeite is one of the sponsors of the program, along with Maria Silvia Bastos Marques, chair of the Brazilian Advisory Board of Goldman Sachs Brazil, Sandrine Ferdane, chief executive officer and country head of BNP Paribas in Brazil and Sylvia Coutinho, head of UBS Wealth Management LatAm and country head of UBS Brazil.\nThe Dn’A Women program consists of workshops, individual mentoring, group coaching and a lunch with the sponsoring chief executive officers. Participants meet on Saturday mornings for three hours and cover topics such as personal finance, self-knowledge, financial markets, leadership and communication. The program also had 30 Deutsche Bank employees mentor each participant.\nSelection for the Dn’A Women program consisted of a five-part process including a profile mapping, a problem-solving test, an English online test and an in-person group dynamics observation and interview. The goal is that by the end of the program – which concludes in December – participants will be eligible to apply for the internship programs of the partnering banks.\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nTracy McNamara\nTel.: +1 212-250-0940\nEmail: tracy.mcnamara@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}