{
    "url": "https://www.db.com/news/detail/20190922-deutsche-bank-commits-to-the-united-nations-principles-for-responsible-banking?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "September 22, 2019",
    "tags": [
        "Company",
        "Sustainability"
    ],
    "title": "Deutsche Bank commits to the United Nations Principles for Responsible Banking",
    "body": "Deutsche Bank has signed the Principles for Responsible Banking formulated by the UN Environment Programme Finance Initiative (UNEP FI). The Principles provide a framework for the sustainable banking system of the future.\nThe purpose of the Principles is for the banking industry to play a leading role in supporting the UN Sustainable Development Goals (SDGs) and the Paris Climate Agreement. The Principles will be officially signed and launched on September 22 during the United Nations General Assembly.\nChristian Sewing, CEO, Deutsche Bank: “Deutsche Bank is committed to acting responsibly and to supporting the global sustainable development agenda. Climate protection must be a priority for us – in the way we extend credit, through the products we offer and the policies we implement. The Principles for Responsible Banking reflect this commitment very well. As a longstanding member of the UNEP Finance Initiative, we are pleased to be one of the founding signatories and contribute to establishing a common understanding of responsible banking practice worldwide.”\nThe Principles help Deutsche Bank to create value for clients by supporting them in the transition to a low-carbon, sustainable economy. They provide an independent benchmark that validates our social impact efforts. At the same time, a new generation of clients and society are becoming increasingly aware of the responsibilities that come with increasing wealth and prosperity in developed countries. Deutsche Bank seeks to promote sustainable business across all its divisions.\nFor Deutsche Bank, a member and signatory of UNEP FI Declaration of Sustainable Development from 1992 and a supporter of the Paris Climate Agreement from 2015, it was natural to be a founding signatory of this prominent banking initiative for a sustainable future.\n“The UN Principles for Responsible Banking are a guide for the global banking industry to respond to, drive and benefit from a sustainable development economy. The Principles create the accountability that can realize responsibility, and the ambition that can drive action.” said UN Secretary-General António Guterres at the launch event, attended by the 130 Founding Signatories and over 45 of their CEOs.\nFor further information please contact\nDeutsche Bank AG\nMedia Relations\nTim-Oliver Ambrosius                                  Christine Peters\nTel. +49 69 910 42648                                Tel. +49 69 910 62303\nE-Mail: tim-oliver.ambrosius@db.com        E-Mail: christine.peters@db.com\n  About Deutsche Bank\nDeutsche Bank provides retail and private banking, corporate and transaction banking, lending, asset and wealth management products and services as well as focused investment banking to private individuals, small and medium-sized companies, corporations, governments and institutional investors. Deutsche Bank is the leading bank in Germany with strong European roots and a global network.\nForward-looking statements\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 22 March 2019 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 2
}