{
    "url": "https://www.db.com/news/detail/20190918-deutsche-bank-research-launches-new-insights-for-corporate-clients?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 18, 2019",
    "tags": [
        "Research"
    ],
    "title": "Deutsche Bank Research launches new insights for corporate clients",
    "body": "Deutsche Bank Research is today launching a new research product suite catering for the clients of the Corporate Bank.\nThe Corporate Bank was created as part of Deutsche Bank's transformation announced on July 7, creating a hub for corporate and commercial clients of Deutsche Bank and Postbank. The new division aims to understand clients’ needs, anticipate what they want in the future and rapidly evolve their service to meet changing demands. To help support this growing business, DB Research is launching a new group that will look at important themes and issues that corporates are facing and provide original insight into the opportunities and challenges these bring.\nThe first report, published today, focuses on climate change. Companies are dragging their heels on climate change because many managers believe that for the planet to win, profits must fall. This report argues the opposite using evidence from the stock market and Deutsche Bank’s primary research into an unexpected shift in customer purchase habits over the last 12 months.\nTo analyse the stock impact, we programed our artificial intelligence platform, α-Dig, to read the 5 million pages of company announcements released by the 1,600 companies in the MSCI World index over the last two decades, along with every Dow Jones news article written over the period (something that would take a human over a century to complete!)\nAfter mapping the positive and negative climate change news (most of which were small references, not major scandals) against company share prices, the results were startling. Companies that experienced positive press on climate change saw share price outperformance of 1.4 percentage points per year over the MSCI World index – outperformance of 26 percent. Conversely, companies with negative press saw underperformance. Furthermore, it was not the usual energy, materials, and utilities sectors that were affected the most.\nThe second half of the report explains why the historic ‘gap’ between the green purchase intentions of customers, and their actual purchase behaviour, has suddenly shrunk. Our primary research shows that over the last 12 months, twice as many customers in the UK have actively purchased more products from companies that address climate change compared with those who have not. A similar (but more polarised) trend exists in the US.\nJim Reid, head of the new research group, said: “Research has traditionally been focused towards institutional clients and while that focus will remain we saw the realignment of the bank as an opportunity to create a new group to look at things slightly differently and to serve a different audience.”\nDavid Folkerts-Landau, Global Head of Research and Chief Economist, added: “Corporate clients are integral to Deutsche Bank and we are excited to be launching a new Research offering to serve this important client base.”\nDon’t miss a report. Subscribe here",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}