{
    "url": "https://www.db.com/news/detail/20170727-deutsche-bank-reports-net-income-of-EUR-466-million-for-the-second-quarter-of-2017?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 27, 2017",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank reports net income of € 466 million for the second quarter of 2017",
    "body": "John Cryan, Chief Executive Officer, said: “Our second-quarter results give a good summary of where we stand today. Profitability is significantly better than a year ago. We made good progress in bringing costs down and continued to attract net money inflows from clients.”\n“Despite the significant improvement, this level of profitability falls short of our longer term aspirations. Revenues were not as universally strong as we would have liked, in large measure because of muted client activity in many of the capital markets. As we modernise our bank we are turning our focus onto building profitable growth.”\nPre-tax profit of € 822 million vs. € 408 million in the second quarter of 2016\n— Operating performance before debt valuation adjustments (DVA), the valuation of own debt, restructuring/severance, litigations and impairments of € 1.1 billion\n— Net income of € 466 million, up from € 20 million in the prior year period\nRevenues of € 6.6 billion, down 10% year-on-year\n— Negative impact of more than € 340 million from the tightening of spreads on own debt and losses on sales of businesses\n— Non-recurrence of one-time gain of € 192 million on sale of stake in VISA Europe in the prior year period\nProvision for credit losses of € 79 million, down 70% year-on-year\n— Releases and a benign credit environment among private and commercial clients\n— Broad-based improvement in corporate portfolios\nNoninterest expenses of € 5.7 billion, down 15% year-on-year\n— Adjusted costs down 6% year-on-year, or € 391 million, to € 5.6 billion\no Savings from the wind-down of the Non-Core Operations Unit (NCOU)\no Progress on restructuring and disposals of non-core businesses\n— Non-recurrence of a € 285 million goodwill impairment in the prior year period\n— Lower restructuring and litigation charges\nHeadcount down by 4,656 full-time equivalents (FTE) vs. end of second quarter 2016\n— Headcount down 1,525 to 96,652 FTE during the second quarter\n— Despite approximately 100 further net hires in Anti-Financial Crime / Compliance during the quarter\nFully loaded Common Equity Tier 1 (CET1) ratio at 14.1% at quarter end, pro forma for capital raise\n— Reflecting net proceeds of capital raise in April\n— Risk Weighted Assets (fully loaded) of € 355 billion, down € 3 billion during the quarter, driven by negative FX impact of € 6 billion\n— Fully loaded leverage ratio of 3.8% in the quarter, pro forma for capital raise\nPositive net money inflows\n— Net new money of € 9 billion during the quarter with inflows in the Private & Commercial Bank, including Wealth Management, and in Deutsche Asset Management\nThe first half year of 2017 in summary:\nPre-tax profit of € 1.7 billion, up 72% year-on-year\nNet income of € 1.0 billion, versus € 256 million in the first half of 2016\nRevenues of € 14.0 billion, down 10% or € 1.5 billion\nIncluding negative impact of € 1.0 billion predominantly from debt valuation adjustments, tightening of spreads on own debt and business disposals\nProvision for credit losses of € 212 million, down 62%\nNoninterest expenses of € 12.0 billion, down 13% or € 1.9 billion\nIncluding adjusted costs likewise of € 12.0 billion, down 6% or € 724 million\nFully-loaded CET 1 ratio of 14.1%, pro forma, versus 10.8% as at June 30, 2016\nNet money inflows of € 16 billion, versus net outflows of € 28 billion in the first half of 2016\nThe complete media release is\nPDF\navailable as PDF.\nFor further information please contact:\nDeutsche Bank AG\nPress & Media Relations\nMichael Golden +44 20 7545 6469\nMonika Schaller +49 69 910 48098\ndb.presse@db.com       \nInvestor Relations:\ndb.ir@db.com\n+49 69 910 35395 (Frankfurt)\n+44 20 754 50279 (London)\nAn analyst call to discuss second-quarter 2017 financial results will take place today at 13.00 CEST. This conference call will be transmitted via internet.\nA Fixed Income investor call will take place on Wednesday, August 2, 2017 at 15.00 CEST. This conference call will be transmitted via internet.\nA Financial Data Supplement (FDS), presentation and audio-webcast for the analyst conference call are available at: www.db.com/quarterly-results\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 20 March 2017 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.\nThis document contains non-IFRS financial measures. For a reconciliation to directly comparable figures under IFRS, to the extent not provided herein, please refer to the Financial Data Supplement.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}