{
    "url": "https://www.db.com/news/detail/20170727-management-board-members-voluntarily-waive-38-4-million-euro-in-outstanding-bonus-payments?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 27, 2017",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Management Board members voluntarily waive 38.4 million Euro in outstanding bonus Payments",
    "body": "Eleven members of the Management Board of Deutsche Bank AG (XETRA: DBKGn.DE/NYSE: DB) who served during financial crisis and thereafter have voluntarily waived a large part of their unpaid remuneration. In the course of an agreement with the Supervisory Board of the bank, they agreed that of the 69.8 million Euro still owed to them by the bank, only 31.4 million Euro would be paid out.\nFor several years, the Supervisory Board had suspended a significant portion of the variable remuneration owed to the Management Board members. The reason was that Deutsche Bank saw itself confronted with a number of supervisory investigations and regulatory penalties, whose causes originated from the period before the 2007 financial crisis in some cases. Pursuant to aspects of German corporate law, the Supervisory Board is obliged to examine whether the bank can hold Management Board members personally liable who were in office during that time.\nThe Supervisory Board, on the basis of extensive investigations by several leading law firms and forensic advisors, and taking into account the findings of regulators and supervisory authorities in relation to the matters themselves, has decided not to hold the Management Board members personally liable. According to the findings of these investigations, there is insufficient factual and legal basis for actionable damages claims against the officiating Management Board members of that time.\nDespite the fact that the Management Board members are of the opinion that they always administered their office with due care and that they cannot be accused of any breach of duty, they have nonetheless voluntarily waived their entitlement to a total of 38.4 million Euro as an act of solidarity with Deutsche Bank.\nDeutsche Bank acknowledges this voluntary act of the Management Board members, in addition to previous waivers of bonuses, as a further contribution toward overcoming problems resulting from the past.\n“The Supervisory Board appreciates the fact that with the additional waiver of bonuses, the Management Board members in office at that time are making a further personal contribution to closing this chapter,” said the Chairman of the Supervisory Board Paul Achleitner. “This helps us to look forward toward the future again.\"",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}