{
    "url": "https://www.db.com/news/detail/20170725-deutsche-bank-recognized-for-leadership-in-addressing-youth-homelessness-in-new-york?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 25, 2017",
    "tags": [
        "Corporate Citizenship",
        "Sustainability"
    ],
    "title": "Deutsche Bank recognized for leadership in addressing youth homelessness in New York",
    "body": "At the First National Symposium on Solutions to End Youth Homelessness on June 19, lead organizer Point Source Youth presented Deutsche Bank with an award in recognition of the bank’s leadership in working to end youth homelessness. The symposium was held at New York University and attended by 350 youth, nonprofit, government, academic and philanthropic leaders from across the US, Canada, and the UK.\nAt the symposium, Deutsche Bank announced that it will be supporting the creation of a new position in City Hall that will serve as the Special Assistant for Ending Youth Homelessness reporting to Office the Deputy Mayor for Health and Human Services. The model of having a government leader tasked solely with ending homeless within a specific population was particularly successful in addressing veteran homelessness, helping New York City place over 3,000 homeless veterans into permanent housing and leading the federal government to declare an end to chronic veteran homelessness in New York City.\nDeutsche Bank, and its partners among New York City’s youth homelessness coalition, believe this model can be successfully replicated to end homelessness among the over 4,000 young people between ages 18-24, approximately 40% of whom identify as LGBT, who are experiencing homeless in New York City.\nDeutsche Bank, which has invested over $2.5 billion in low-income communities in the US through its Community Development Finance Group, has in recent years expanded its role as a mainstay provider of capital for affordable housing to lead the private sector in tackling the crisis of homelessness in New York City.\nBuilding on its widely acclaimed DB SHARE program, which has helped build over 7,000 units of housing with on-site services for formerly homeless New Yorkers, and with another 1,500 units in the pipeline, Deutsche Bank has launched a series of innovative philanthropic initiatives aimed at expanding services to homeless New Yorkers while simultaneously driving policy and systems change to stop managing the crisis and instead work to end it.\nThese include grants to four organizations working to end homelessness among veterans, domestic violence survivors, LGBT youth, and formerly incarcerated individuals, as well as grants to Point Source Youth to pilot new housing interventions for homeless youth and to Enterprise Community Partners to convene a task force on ending family homelessness.\nDeutsche Bank is also currently supporting organizations assisting New York City public school students who are experiencing homelessness, with a focus on improving educational outcomes and providing other supportive services to those students and their families. In New York City, 1 in 13 students are homeless.\nAs part of Born to Be, the global youth engagement program, Deutsche Bank’s philanthropic partners are delivering critical academic and social-emotional development resources to this group of students, who are among the most vulnerable and inadequately supported. Through a grants strategy that braids applied research and high-quality services, this innovative education philanthropic initiative is working to address the structural and system barriers for this growing, yet largely invisible, student population.\nTo learn more about Deutsche Bank’s work to address homelessness, please contact John Kimble.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}