{
    "url": "https://www.db.com/news/detail/20170718-deutsche-bank-foundation-supports-relief-projects-in-somalia-with-EUR440-000?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 18, 2017",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank Foundation supports relief projects in Somalia with €440,000",
    "body": "Today, Deutsche Bank Foundation handed over a donation of around 437,000 euros to German Red Cross (DRK) to combat hunger in Somalia. In April, the foundation had posted an appeal on Deutsche Bank’s “Plus You” donation portal. Deutsche Bank Foundation did not only match the 37,000 euros donated by individuals, but made the full 400,000 euros of the matching fund available.\nKristina Hasenpflug, Managing Director of the foundation located in Frankfurt and Berlin, presented the cheque to Christian Reuter, Secretary General of German Red Cross. “With the matching fund, the foundation not only collected donations for people suffering from the famine in Somalia, but also raised public awareness of this acute problem. More than 400 donors and their positive feedback prove that our efforts were successful”, stated Hasenpflug.\n“All those who donated and Deutsche Bank Foundation help us to help those in need. We are very grateful for this impressive donation which enables us to significantly expand our efforts to help people in Somalia”, said Reuter.\nGerman Red Cross has been working in Somalia, one of the poorest countries in the world, for around 15 years. The East African country has been hit by severe droughts. Around half of its population – 6.2 million people – is in need of humanitarian aid, 2.9 million people are facing famine and 363,000 children are already severely malnourished.\nTogether with its sister organisation, Somali Red Crescent, German Red Cross provides emergency aid to people affected by drought and hunger.\nDeutsche Bank Foundation has a long-standing social commitment and regularly supports international disaster relief efforts. In Germany, the foundation’s educational projects focus on helping young people to develop their skills and achieve their potential. Deutsche Bank Foundation has initiated numerous projects to foster social inclusion of immigrants, promotes equal opportunities for the disadvantaged and is committed to enriching the cultural landscape.\nMore information on Deutsche Bank Foundation on www.deutsche-bank-stiftung.de.\n  About Deutsche Bank, the donor of Deutsche Bank Foundation\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}