{
    "url": "https://www.db.com/news/detail/20170712-born-to-be-projects-teachers-continue-learning-over-the-summer-break?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 12, 2017",
    "tags": [
        "Corporate Citizenship",
        "Education"
    ],
    "title": "Born to Be projects: teachers continue learning over the summer break",
    "body": "Another successful school year comes to a close: students from all over the world again benefitted from Deutsche Bank initiatives and those of its foundations. The Born to Be projects – ‘Strive for College’ in the US, ‘sporteducate’ in the UK or ‘Studienkompass’ in Germany, to name just a few – empower young people and give them access to higher education. With the summer break just around the corner, it is now the teachers’ turn to learn and gain new experiences.\nFor participants of the Transatlantic Outreach Program (TOP), that means exploring Germany. Every year, TOP gives 100 teachers from the US and Canada the opportunity to visit German schools and companies, learn more about vocational training, get in touch with Germans and foreigners and travel to historical and political sites. Some of the groups also come to Deutsche Bank’s headquarters in Frankfurt where they visit the ‘Brand Space’ and learn about the bank’s global CSR initiatives and educational initiatives. They bring their insights back to the classroom the following school year and foster cultural exchange and understanding.\nSparrow Schools, another Born to Be project, offers a teacher training programme for early childhood development. The curriculum provides students with both academic and business skills so that they can open their own kindergarten or primary schools upon graduation.\nMillicent and Guguletha Boa did just that:\nafter graduating from Sparrow Schools, they founded their own preschool in Soweto Township, Johannesburg. Today, the school has over 50 students and there is even a waiting list. The sisters have a clear vision: “We want to change the lives of children and to help parents to know their child’s milestones and development phases”. \nThere are currently 32 teachers in training at Sparrow Schools. With their knowledge and skills, they help to offer new opportunities to children in their communities.\n“As a general education teacher, it was amazing to see what we don't know about others. TOP did a great job of connecting people and knowledge.\" - A TOP participant",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}