{
    "url": "https://www.db.com/news/detail/20170706-deutsche-bank-kunsthalle-presents-artist-and-landscape-architect-roberto-burle-marx?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 6, 2017",
    "tags": [
        "Art",
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank KunstHalle presents Roberto Burle Marx",
    "body": "From July 7 to October 3, 2017, the Deutsche Bank KunstHalle, in cooperation with The Jewish Museum in New York, is presenting: Roberto Burle Marx: Brazilian Modernist the first comprehensive survey exhibition in Germany of the Brazilian artist and landscape architect Roberto Burle Marx.\nIn his native Brazil, Roberto Burle Marx (1909-1994), along with the architects Oscar Niemeyer and Lúcio Costa, is revered as a pioneer of Modernism. His garden designs for the capital Brasília and, above all, his works in Rio de Janeiro have had a lasting impact on the face of these cities. Burle Marx’s revolutionary landscape architecture, which is oriented to abstract painting, has an international reputation even today.\nDuring his over sixty-year career, he designed more than 2,000 gardens around the world. Among his most important are the gardens of the Ministry of Education and Health built by Niemeyer, Costa and Le Corbusier (1938), Flamengo Park (1961), and the wavelike paving of Avenida Atlântica (1970) in Copacabana.\nRoberto Burle Marx: Brazilian Modernist, which had its premiere at The Jewish Museum, New York, in 2016, illustrates the full range of his artistic production, seen in Germany for the first time, and erases boundaries between the different media and disciplines. Burle Marx was not only a landscape architect, but also a sculptor, set designer, designer, and environmental activist.\nHis universal way of thinking is still inspiring generations today. In the show, his art enters into dialogue with works by international contemporary artists, including Juan Araujo, Paloma Bosquê, Dominique Gonzalez-Foerster, Veronika Kellndorfer, Luisa Lambri, Arto Lindsay, Nick Mauss, and Beatriz Milhazes.\nThe exhibition, curated by Jens Hoffmann, Director of Special Exhibitions and Public Programs, and Claudia J. Nahson, Morris and Eva Feld Curator (both at The Jewish Museum, New York), highlights Roberto Burle Marx’s profound humanism and spirituality – the idea of a modern Garden of Eden that inspired him throughout his life.\nThe exhibition was organized by The Jewish Museum, New York, and was made possible, in part by Deutsche Bank, The Emanuel and Riane Gruss Charitable Foundation, as well as other generous supporters.\nThe Jewish Museum and Yale University Press co-published the catalogue Roberto Burle Marx: Brazilian Modernist with contributions by Jens Hoffmann and Claudia J. Nahson.\nPhotographic material on Roberto Burle Marx: Brazilian Modernist can be downloaded for free at photo-files.de/deutschebankkunsthalle.\n#RobertoBurleMarx #dbKunstHalle\n\nFor further information, please contact:\nDeutsche Bank AG\nMedia contact:\nKlaus Winker\nPhone: +49 (0)69 910 32249\nEmail: klaus.winker@db.com\nDeutsche Bank KunstHalle\nSara Bernshausen\nPhone: +49 (030) 20 20 93 14\nEmail: sara.bernshausen@db.com\nAbout Deutsche Bank, Art, Culture & Sports\nDeutsche Bank’s commitment to art is reflected by the Bank’s new Art, Culture & Sports department. The new unit bundles the Bank’s support programs and develops them further in conceptual terms.\nTogether with its divisions, Deutsche Bank wants to provide its customers with new access to the art, culture, and sports worlds. With its involvement in contemporary art Deutsche Bank is setting standards worldwide, be it with the Deutsche Bank Collection, one of the world’s most important collections of contemporary artworks on paper and photography, with international exhibitions, or with the Deutsche Bank KunstHalle in Berlin.\nAnd for many years the Bank has had a presence at selected art fairs such as Frieze London and New York.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}