{
    "url": "https://www.db.com/news/detail/20170704-enjoy-investing-deutsche-asset-management-adds-first-partner-to-wise-robo-platform?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 4, 2017",
    "tags": [
        "Corporate products",
        "Digitalisation",
        "Entrepreneurship",
        "Private products",
        "Research"
    ],
    "title": "Deutsche Asset Management adds first partner to WISE Robo platform",
    "body": "Digitalisation is changing the world in big and small ways. We see this trend at work in the Asset Management industry as well.\nAs part of its broader digitalisation strategy, Deutsche Asset Management (Deutsche AM) has launched its Robo technology WISE – a white-label Robo platform offering discretionary portfolio management.\nThe insurance company Basler Versicherung is the first of Deutsche AM’s distribution partners to use WISE under the label Monviso and to offer it to private clients via the www.monviso.de website.\nNicolas Moreau, Head of Deutsche AM, commented on the investment Robo: “WISE is a fantastic technology. It allows us to make our outstanding investment opportunities even more accessible by virtue of being digital – and we meet our clients exactly where they are: in the digital world. WISE is a quantum leap for Deutsche AM and Deutsche Bank.”\nOur digitalisation strategy continues to bear fruit – WISE is one of the most innovative solutions anywhere in asset management at the moment.\nDeutsche Bank Group Chief Operating Officer Kim Hammonds\nWISE is radically different to other offerings on the market. The technology does not build portfolios based on algorithms but rather on the combined knowledge and research by over 600 fund managers and analysts at Deutsche AM.\nThe Multi Asset team at Deutsche AM constructs sample portfolios based on the prevailing CIO View, Deutsche AM’s house view on the markets. As such, it is a human process that underpins the different portfolio solutions and the portfolio management – with a successful track record spanning more than 60 years.\nSelecting an appropriate and suitable portfolio depends on the risk profile, which means the willingness to take risk and especially the investor’s risk-bearing capability as well as their knowledge and experience in financial investment.\nA special feature of WISE is its flexibility: the Investment-Robo applies a customisable, modular approach with a flexible fund universe and hence, can offer a tailored version for each distribution partner.\nWhoever uses WISE is, at the end of the day, investing in the CIO View and will receive professional asset management that allows for a highly individual strategy.\nNew investors, who must make a minimum investment of 400 euros or regular monthly savings of 50 euros, need their ID, tax number, bank account details and their mobile phone. In less than 15 minutes, you can have the investment Robo working for you.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}