{
    "url": "https://www.db.com/news/detail/20180108-what-is-basel-iv?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 8, 2018",
    "tags": [
        "Corporate products",
        "Investment Banking"
    ],
    "title": "What is Basel IV?",
    "body": "In December 2017 the Basel Committee on Banking Supervision (BCBS) published a package of proposed reforms for the global regulatory framework of our industry which is frequently referred to as ‘Basel IV’. The Committee’s aim is to make the capital framework more robust and to improve confidence in the system. Here, Dixit Joshi, Group Treasurer, and Steve Morris, Head of Group Finance, discuss the Basel IV framework in general, what happens next, and potential implications for Deutsche Bank.\nWhat is Basel IV?\nThe Basel Committee on Banking Supervision or BCBS has proposed reforms which are designed to make banks more resilient and increase confidence in the banking system. The proposals announced recently, referred to as 'Basel IV', include updates to the ways banks calculate their capital requirements with the aim of making outcomes more comparable across banks globally.\nMore specifically, what is being proposed?\nOne principal feature is the way banks calculate risk weighted assets or RWAs. The BCBS proposes that a calculation of a bank's RWAs using internal models should not fall below 72.5% of the calculation using standardised models. This lower limit is known as an \"output floor\". In addition, when computing RWAs based on internal models, input parameters must not fall below certain minimum levels, so called “input floors”.\nWhat happens now?\nThe framework will now be considered by lawmakers in national jurisdictions and at the EU level. As part of this process, national or EU authorities must decide on the use of a limited number of alternative calculations allowed under the BCBS proposal, so called “national options and discretions”.\nIn practice, what sort of ‘national options and discretions’ might apply?\nAn example would be operational risk RWA which, under the proposed framework, may solely be based on a bank’s revenues or also reflect a bank’s individual loss history. Such national discretions (and potential other modifications) will apply when the framework eventually comes into force in any given jurisdiction\nWhat's the timeline?\nThe BCBS proposes a nine-year implementation timetable, which allows considerable time for preparation. A five-year 'phase-in' period would commence on January 1 2022, with full implementation foreseen from January 1 2027.\nWhat's the impact on Deutsche Bank?\nSeveral factors make it difficult to speculate at this stage on the ultimate impact on Deutsche Bank. First, it is not possible now to predict the impact of 'national discretions' on the framework when it ultimately comes into effect in any given jurisdiction, notably the EU. Additionally, the composition of our balance sheet may change significantly over the next nine years; furthermore, over this period we may generate and retain capital to support our risk weighted assets.",
    "number_of_ratings": 3,
    "rating": 3.3,
    "likes": 0
}