{
    "url": "https://www.db.com/news/detail/20180105-media-release-deutsche-bank-estimates-the-impacts-of-u-s-tax-reforms-and-updates-on-fourth-quarter-2017-results?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "January 5, 2018",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank estimates the impacts of U.S. tax reforms and updates on fourth quarter 2017 results",
    "body": "As a result of the recent enactment of the Tax Cuts and Jobs Act (TCJA), Deutsche Bank AG (XETRA: DBKGn.DE/ NYSE: DB) expects to recognize an approximate €1.5 billion non-cash tax charge in the Group’s consolidated IFRS financial results for the fourth quarter 2017 from a valuation adjustment to its U.S. Deferred Tax Assets (DTA). This adjustment reflects an estimate of the impact of reducing the federal tax rate applicable to Deutsche Bank's U.S. operations to 21% from 35% previously.\nAs a result, Deutsche Bank expects to record a small full-year after-tax loss on an IFRS basis. The revaluation of U.S. DTA is expected to reduce the fully-loaded Common Equity Tier 1 ratio by approximately 10 bps and is not expected to impact Deutsche Bank’s ability to make scheduled payments on its Additional Tier 1 securities.\nEffective January 1, 2018, the reduction in the U.S. federal tax rate to 21% is expected to reduce Deutsche Bank Group’s effective tax rate on average to the lower end of its previously communicated 30-35% range, based on the current mix of taxable income.\nThe TCJA also introduced the U.S. Base Erosion and Anti-Abuse Tax (BEAT). While Deutsche Bank will require additional detailed analysis in order to assess its impact, and further interpretive guidance and clarifications are anticipated, Deutsche Bank does not currently anticipate any significant long-term impact from BEAT on its tax rate.\nDeutsche Bank also announced that trading conditions in the fourth quarter 2017 were characterized by low volatility in financial markets and low levels of client activity in key businesses. Combined fourth quarter 2017 Fixed Income (FIC) Sales & Trading, Equity Sales & Trading and Financing revenues are expected to be approximately 22% below the prior year period, excluding the impact of Debt Valuation Adjustments in both periods.\nAlthough Deutsche Bank expects to report positive IBIT for the full year, it expects to report negative IBIT for the fourth quarter before taking into account combined restructuring and severance costs and litigation charges that are currently anticipated to be approximately €0.5 billion in the quarter. This reflects the weak revenue environment, elevated adjusted costs [1] currently anticipated to be broadly in line with the prior year period, and a loss on sale from the recently announced disposal of the Polish Private & Commercial Bank business.\nDeutsche Bank will report preliminary fourth quarter and full year results on February 2, 2018.\n[1] Deutsche Bank defines “adjusted costs” as noninterest expenses excluding the impairment of goodwill and other intangible assets, litigation and restructuring and severance. For further information, please refer to “Other Information: Non-GAAP Financial Measures” in the Interim Report as of September 30, 2017.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}