{
    "url": "https://www.db.com/news/detail/20180104-deutsche-bank-publishes-2018-srep-requirements?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "January 4, 2018",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank publishes 2018 SREP requirements",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) has been informed by the European Central Bank (ECB) of its decision regarding prudential capital requirements to be maintained from January 1, 2018 onwards, following the results of the 2017 Supervisory Review and Evaluation Process (SREP). The decision requires Deutsche Bank, on a consolidated basis, to maintain a phase-in Common Equity Tier 1 (CET 1) ratio of at least 10.65% for 2018. This CET 1 capital requirement includes: the minimum Pillar 1 requirement (4.50%); the Pillar 2 requirement (2.75%); the capital conservation buffer (1.875%); the countercyclical buffer (currently 0.02%); and the requirement deriving from Deutsche Bank’s designation as global systemically important bank (1.50%).\nThe new CET 1 capital ratio requirement of 10.65% for 2018 is above Deutsche Bank’s 2017 SREP requirement of 9.52%, reflecting the further phase-in of the capital conservation buffer and the G-SIB buffer. It sets the level below which Deutsche Bank would be required to calculate the Maximum Distributable Amount (MDA). The MDA is used to determine restrictions on distributions in the form of dividends on CET 1 capital, new variable remuneration and coupon payments to holders of Additional Tier 1 instruments.\nCorresponding 2018 requirements are set for Deutsche Bank’s Tier 1 capital ratio (12.15%) and Total capital ratio (14.15%). All requirements are articulated on a phase-in basis. In comparison, Deutsche Bank’s last reported consolidated capital ratios on a phase-in basis were 14.58% CET 1 capital, 17.00% Tier 1 capital and 18.70% Total capital, all as of 30 September 2017.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}