{
    "url": "https://www.db.com/news/detail/20180103-how-automatic-text-analysis-and-artificial-intelligence-lead-to-new-investment-products?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 3, 2018",
    "tags": [
        "Capital markets",
        "Digitalisation",
        "Investment Banking",
        "Research"
    ],
    "title": "How automatic text analysis and artificial intelligence lead to new investment products",
    "body": "Can you predict election results from Twitter posts? To what extent does a social media storm impact a company’s stock price? And how can you combine completely different asset classes to hedge against unforeseen events like these? Questions like these are daily business for Deutsche Bank’s quant experts – a business in which they are one of the leading players worldwide.\nTheir leading role was proven when the bank’s 20-strong Global Quantitative Strategy team won a series of awards in recent months. The most recent was the Quant Research House of the Year 2018 award from Risk Magazine. Further awards include the top rank in Europe in the influential Institutional Investor Survey for the third consecutive year.\nData science is an important emerging area with one recent paper examining how natural language processing - or text mining techniques - can be used to analyse Twitter posts to make return forecasts on US equities. Another paper from the Quantitative Strategy team in Asia looks at leveraging artificial intelligence techniques for constructing portfolios.\nAchieving portfolio diversification in a cost-effective way\nBut the team is attracting particular attention among institutional investors because it brings its research to life by using it to underpin a suite of off-the-shelf as well as bespoke quantitative investment solutions. These strategies are based on an increasingly popular investment style called “risk premia” or “factor investing”, which endorses investing in risk and return drivers that permeate asset class definitions.\nOne such strategy – or risk premium – is Equity Value, which uses the team’s research to create a portfolio that gives the upside of investing in relatively undervalued equities without the broader exposure to the equity market a standard equity portfolio carries.\nThe portfolios employ all major asset classes – equities, rates, FX and commodities – and many investors combine them while also using derivatives, swaps and other instruments.\nWith backgrounds in engineering, computer science and natural language processing, alongside finance and economics, the team has created a number of strategies and portfolios that are designed to address different objectives set by pension funds, sovereign wealth funds, asset managers, and bank treasurers alike.\nMoreover, the team develops overarching portfolio allocation frameworks in which risk premia and other portfolio solutions, can be deployed. As Spyros Mesomeris, Global Head of Quantitative Strategy and Quantitative Investment Solutions Research, points out: “Importantly, we also have significant buy side experience in the team, which gives us unique insights into our clients’ investment process.”\nThe financial crisis made risk premia more attractive\nBy combining the team’s risk premia strategies investors can achieve diversification for a relatively low cost and use them to supplement – or in some cases replace – more expensive active fund managers. While there are no official figures, the market is growing fast and Deutsche Bank estimates that total funds deployed in risk premia are between 150 and 200 billion dollars.\nThe risk premia concept has been around for many years, Mesomeris says, but it came into sharper focus after the crash of 2008. \"Investors had added alternative asset classes like private equity, hedge funds and property to their portfolios prior to 2008, believing this would give them more diversity than a straight equity/bond mix. But when liquidity was removed from the system, suddenly there was a jump in correlations – and all assets classes were moving together.\"\nTo make its diversification theories a reality, the Quantitative Strategy team partners with Quantitative Investment Solutions (QIS) Structuring in the Corporate & Investment Bank, which package and distribute the strategies to a wide range of Deutsche Bank clients.\nThis year, that partnership led to the Quantitative Investment Solutions team being named winner of the Institutional Investment Product of the Year Award from Risk Magazine.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}