{
    "url": "https://www.db.com/news/detail/20180228-why-markets-could-be-in-for-an-italian-surprise?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 28, 2018",
    "tags": [
        "Capital markets",
        "Investment Banking"
    ],
    "title": "Why markets could be in for an Italian surprise",
    "body": "This week, many investors will be keeping a close eye on Italy when on March 4, the southern European country elects a new parliament. However, any investor whose short-term performance depends on the election would be well advised not to rely on polls. Research by Deutsche Asset Management, published under the title “An Italian muddle”, reveals that the election could take the markets by surprise.\n“In recent weeks, investors have been very relaxed about the situation in Italy”, says Johannes Müller, Head of Macro Research. “But if a party opposed to the European Union wins the election, Italian government bonds and various Italian stocks could suffer.”\nAccording to the polls, the centre-right coalition currently leads the race. It includes former prime minister Silvio Berlusconi’s “Forza Nazionale” party as well as the far-right “Lega Nord”. But Italian polls have been unusually unreliable in recent elections, Müller argues. And accuracy is bound to deteriorate further given the current political climate.\nCurrently, the anti-establishment “Five-star movement” is at the root of a lot of uncertainty. Recently polling between 25 and 30 percent, the movement is just short of being able to block a pro-European government. Marginal methodological errors could prove decisive.\nMüller’s claims are substantiated by the results of the Italian constitutional referendum of 2016. Then prime minister Matteo Renzi of the centre-left wanted to amend the constitution and restructure the senate, one of the Italian parliament’s two chambers. Nearly 60 percent of the voters rejected the far-reaching changes, which turned out to be three times higher than the unadjusted polling average in the weeks leading up to the vote.\nSome of our favoured forecasting rules of thumb might not be applicable in the context of Italy.\nJohannes Müller, Head of Macro Research\nUnder the new electoral system, small differences in the regional distribution of the vote can have a major impact. Even in the US, where there is comparable historic data, forecasters failed to predict the composition of the electoral colleges correctly. Also, the favoured Italian coalitions are composed of several different parties, each with the potential to sway approval ratings on their own.\nAccording to research carried out by Deutsche Asset Management, Italy’s volatile social situation might also factor into an election surprise. In particular, young voters influenced by high youth unemployment in southern Europe and the ongoing refugee predicament could cause major upsets.\nFor this reason, Müller would like to see Berlusconi’s “Forza Nazionale” party splitting from its right-wing allies and entering into a coalition with Renzi’s “Democratic Party”. This scenario is viewed as the only option that could facilitate structural reform and economic recovery.\nDespite the uncertainty, Deutsche Asset Management clients should not be overly concerned, Müller says: “Some of our investors will be disappointed on Monday, but over the long term, not much will change for investors in the Italian market.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}