{
    "url": "https://www.db.com/news/detail/20180221-deutsche-bank-engages-with-clients-on-global-booking-hub?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 21, 2018",
    "tags": [
        "Company",
        "Corporate products",
        "Investment Banking",
        "Strategy"
    ],
    "title": "Deutsche Bank Engages With Clients On Global Booking Hub",
    "body": "Last year, Deutsche Bank announced that it will make Frankfurt rather than London the primary global booking hub for its Corporate and Investment Bank (CIB) clients.\nThis will simplify the bank’s operations by bringing capital, liquidity and risk into one place. It will also ensure Deutsche Bank can continue serving clients after Brexit even if the UK loses its passporting rights and trades for EU clients can no longer be booked in London. Work on the development of the necessary infrastructure in Frankfurt began last year and is now well underway.\nWe have today begun to engage with clients regarding the global booking hub. We believe it is prudent to begin this process now given less than 14 months remain until the UK is scheduled to leave the European Union and we must give our clients and our staff time to discuss and implement the required changes.\nOur current intention is to move trade booking to Frankfurt over the course of this year in the absence of a political agreement between the EU and UK. If a transition period is agreed before then, we will naturally review this timing. We are monitoring the situation carefully to ensure decisions are taken at the appropriate time.\nWe trust that clients will welcome our decision to provide clarity on our approach to this important industry-wide issue. Clients will continue to face the same legal entity – since the London operation we currently use as our primary booking hub is a branch of Deutsche Bank AG. For network businesses such as transaction banking, we will continue to offer solutions from a location that services our clients’ business needs appropriately.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}