{
    "url": "https://www.db.com/news/detail/20180221-deutsche-bank-lands-no-1-spots-in-institutional-investor-s-all-europe-fixed-income-survey?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 21, 2018",
    "tags": [
        "Investment Banking"
    ],
    "title": "Deutsche Bank lands No.1 spots in Institutional Investor's All-Europe Fixed Income survey",
    "body": "Asset managers have voted three Deutsche Bank analysts No. 1 in their respective fields. Jim Reid was rated No.1 in four categories (Economics, Fixed Income Strategy, Investment Grade Strategy and High Yield Strategy), while Caio Natividade received the top spot for Quantitative Strategy and Richard Phelan for Basic Materials-High Yield.\nThe three analysts give Deutsche Bank a combined six No.1 spots in the survey’s Analyst View, the first time it has published rankings on individual analysts.\nIn the regular Team View rankings, the bank also secured six No.1 spots.\nThe survey takes input from 680 bond and credit specialists at 381 asset management firms representing 6.2 trillion dollars in European fixed income assets. Deutsche Bank ranked 3rd overall in the team rankings with 12 positions on the team leader board.\nRanking second in the individual analyst categories were Conor O’Toole (ABS), Vivek Khanna (Technology, Media & Telecommunications-HY), and Richard Phelan (Manufacturing/General Industries-HY). Individual analysts ranked 3rd were Spyros Mesomeris (Quantitative Strategy), Ronan Clarke (Retail Consumer Products-HY), and Bernd Volk (Covered Bonds).\nReid is Global Head of the Fundamental Credit Strategy Group and the Thematic Research Group and has now held 20 No. 1 positions in the last seven years. He joined Deutsche Bank in 2004. His Early Morning Reid note, which provides an overview of cross-asset market activity each business day, has been running for 13 years and has the most subscribers of any Deutsche Bank research publication globally. Reid attributes the consistent successes to the stability of his team and the quality and longevity of the products they produce in an industry associated with constant change.\n“The core of my team has been stable for over a decade and we produce a contrasting combination of regular market sensitive work with comprehensive, shelf-like annual studies – such as our default study and our thematic, long-term asset return piece – which have a large following amongst clients.”\nAs an economic historian – he has a BA Degree in Economics and Economic History from Warwick University – Jim enjoys delving into the past to understand today’s market movements and where they may be heading. However, with regards to quantitative easing, he believes we may have reached a point where there are few reliable patterns to guide us.\n“The amount of liquidity central banks have provided in recent years is unprecedented, and they are now starting to take that away.” Reid thinks that this will eventually lead to higher yields and more volatility in financial markets. “The Goldilocks period of low inflation, yields and volatility of 2017 is likely behind us.”\nTo learn about subscribing to Deutsche Bank Research, please click this link.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}