{
    "url": "https://www.db.com/news/detail/20180216-cash-still-king-during-lunar-new-year?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 16, 2018",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Cash still king ... during Lunar New Year",
    "body": "Red packets, hongbao (Mandarin), lai see (Cantonese), ang pow (Hokkien). There are numerous names for the red envelopes packed with cash that are exchanged in many countries as part of Lunar New Year celebrations. The customs and quantities vary, but red envelopes are typically gifted from adults to children, married couples to single people, employers to staff, and between relatives and friends, during the first two weeks of the New Year. The red colour of the envelopes symbolises good luck, and tradition dictates that brand new banknotes are used, usually in even numbers.\nRMB, USD, HKD, SGD, TWD, MYR – the currency matters less than the crispness of the bills. Fresh notes are preferred for maximum luck. In some countries, it is not uncommon to see long queues at banks during the period before Lunar New Year, as people exchange their old notes for newly printed ones to prepare the red envelopes they plan to give.\nLocal and multinational banks around the region therefore face special operational requirements during this time of year. For instance, many companies typically create branded red envelopes with new designs corresponding to the year’s zodiac animal for customers and employees to use. Deutsche Bank red envelopes are printed and distributed locally in many markets including China, Hong Kong, Taiwan, Singapore, and Malaysia. Each year Deutsche Bank’s Singapore and Hong Kong branches help provide more than 150,000 crisp new notes of varying denominations for clients and staff to use during the season.\nBut as the region races ahead towards a cashless society, what will the future of red envelope gifting look like? Several of China’s leading mobile payments companies have introduced digital red envelopes, with just one of these platforms estimating nearly 50 billion of these electronic gifts sent during the 2017 Lunar New Year. There are even reports of some cryptocurrency platforms exploring red envelope services. In 2018 though, for most red envelope recipients, good old cash is still king.\nHere are some more interesting facts about the Lunar New Year:\nLunar New Year is family time. The movement of people travelling home to celebrate with their families is described as one of the biggest annual migrations of people in the world.\nMass production in China usually stops for a month. This has global impact given China’s role in global manufacturing. There are public holidays in most countries which celebrate the new year.\nEach year of the Lunar New Year calendar is named after an animal. Your zodiac animal, as per Chinese astrology, is determined by what year you were born.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}