{
    "url": "https://www.db.com/news/detail/20180208-what-does-the-stock-market-rout-mean-for-volatility-related-products?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 8, 2018",
    "tags": [
        "Capital markets",
        "Investment Banking"
    ],
    "title": "What does the stock market rout mean for volatility-related products?",
    "body": "The global stock market rout showed signs of easing Wednesday with European (DAX +1.7%, FTSE 100 +1.9%) and US (S&P 500 +0.6%) markets gaining and the VIX volatility index falling 7 points to 22.9. One type of investment product which saw particularly strong losses were exchange-traded products (ETPs) which track volatility. In the past few years, as markets were relatively calm and volatility levels correspondingly low, these products were more profitable.\nThese products rely on the CBOE Volatility Index (VIX), which is a measure of the stock market’s expectation of volatility launched by the Chicago Board of Options Exchange in 1993. As the VIX increased on February 2 and 5, many people tried to exit their trades and had to take losses. To put the scale of losses in perspective, short volatility ETPs had 3.7 billion dollars of assets under management at market close on Friday, February 2 and only 325 million dollars of assets under management at market close on Monday, February 5. Two of the largest ETPs saw their assets under management drop by 96 percent.\nWith the VIX falling on Wednesday, what is the outlook for equity market volatility?\nJim Reid, Deutsche Bank’s Global Head of Fundamental Credit Strategy Group, believes that markets are behaving largely as would be expected after one of the largest VIX spikes ever seen.\nReid analysed what happened one week, one month and three months after the 10 largest VIX spikes in history. He explains: “Basically the VIX usually rallies over all subsequent periods but equities tend to be higher the week after but on average fall three months later. The reverse is true for bonds.”\nSimon Carter, European Head of Equity Derivative Research at Deutsche Bank, believes that more evidence is needed. “I think what we’ve seen is a volatility spike and we need a lot more days like we saw earlier this week before we’ve made a regime shift into a materially higher volatility world in Europe.”\nReal-economy factors will also impact further developments in market volatility according to Reid. He points out that investors may remain sensitive to inflation-related data over the course of upcoming weeks and months, highlighting the next release of Consumer Price Index data in the United States on February 14.\nAlthough the importance of one number should be downplayed in theory, in reality it’s fair to say that this will be an incredibly closely watched number for global markets. A higher than expected figure will likely extend the volatility.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}