{
    "url": "https://www.db.com/news/detail/20180207-deutsche-bank-takes-next-step-in-open-source-journey?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "February 7, 2018",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "Deutsche Bank takes next step in open source journey",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) has made software code publically available that helps firms better understand their IT environments, allowing them to manage their technology more effectively. The move underpins the bank’s goal to become a leader in the open source community following the successful release of Plexus Interop late last year.\nThe solution known as ‘Waltz’ allows organisations to gather information about their IT estate from multiple sources across the firm, including information on applications, infrastructure, data, processes and costs. Waltz pulls the information together intelligently and displays it in a powerful, easy to use interface. The result is an unprecedented level of transparency for decision makers over their complex IT environments. This enables smarter, faster and better decisions on technology investments and allows organisations to optimise their IT architecture to meet business growth and development goals.\nThe work is a continuation of the bank’s strategy to modernise, simplify and standardise its technology. Because the code is publically available, programmers can suggest improvements, develop new features and find innovative new uses for the software. This is fed back into the open source community making the application even more useful for everyone.\nRussell Green, Head of Group Architecture at Deutsche Bank, said: “This is an exciting step which showcases the high level of innovation within the firm. We look forward to working with the open source community to share ideas, drive consistency across the industry and continually improve the software.”\nThe code can be accessed via the GitHub platform.\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Contact\nSen Shanmugasivam\nPhone: +44 20 754-72838\nEmail: senthuran.shanmugasivam@db.com ",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 0
}