{
    "url": "https://www.db.com/news/detail/20220729-indian-prime-minister-modi-inaugurates-deutsche-bank-s-ifsc-banking-unit-in-gift-city-gujarat?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "India, July 29, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Indian Prime Minister Modi launches Deutsche Bank's IFSC Banking Unit in Gift City, Gujarat",
    "body": "The Honourable Prime Minister, Shri Narendra Modi, today launched the IFSC Banking Unit (IBU) of Deutsche Bank AG at Gift City, Gujarat.\nThe IBU will provide all approved international financing products, to Deutsche Bank's clients in India and overseas, thereby facilitating easy access to innovative solutions that help improve business efficiencies.\nDeutsche Bank proposes to commence its business in Gift City with credit facilities for corporate clients and will provide a suite of products across Trade Finance, Fixed Income & Currencies initially. In addition, within the framework of extant guidelines, it will facilitate cash pooling and other deposit propositions for Indian and international clients.\n\"We are privileged that our IBU was inaugurated under the aegis of Shri Narendra Modi, the honourable Prime Minister of India. Deutsche Bank has been in Asia Pacific for 150 years and in India for 42 years, and our presence at Gift City only underscores our strong commitment to this country. The IBU will help provide our clients in India and overseas with access to the best suite of financial solutions and services that India has to offer,\" said Alexander von zur Mühlen, CEO of Deutsche Bank, Asia Pacific and Member of the Management Board. “Congratulations to the Indian Government for conceptualising and establishing GIFT City, and we look forward to a fruitful association for many decades to come.”\nDeutsche Bank’s IBU, will also facilitate external commercial borrowing (ECB) financing for its prime customers, offer products such as factoring and bank guarantees, all of which is expected to help global clients increase efficiencies across their supply chain and reduce their financing costs. Additionally, the Securities Services proposition will provide support to all asset classes, from equities, to fixed income, commodities and derivatives, and further help grow investment flows. For the Micro, Small and Medium Enterprises (MSME’s), Deutsche Bank proposes to offer trade finance solutions, that will enable them to expand beyond borders.\n\"With the rising number of multinational corporations in India, we will witness an increase in the demand for cross-border banking services from hedging to financing. Our IBU will help us bridge this gap for our clients, opening new avenues of growth for them,” said Kaushik Shaparia, Chief Executive Officer, Deutsche Bank Group, India. “The government’s focus on the International Financial Services Centre is a promising move not only for the financial sector, but also for the country as it helps cement India’s position as a world-class economy,” he added.\nIndia’s maiden IFSC at GIFT City, has witnessed significant increase in banking sector activity. A competitive tax regime, conducive regulatory framework, and ease of doing business, has provided an impetus to the financial centre.\nThe GIFT City IBU will enable the bank provide liquidity in INR on a 24*7 basis, to international investors and overseas corporates with exposures in India.",
    "number_of_ratings": 30,
    "rating": 4.8,
    "likes": 34
}