{
    "url": "https://www.db.com/news/detail/20220726-deutsche-bank-partners-with-iit-bombay-to-advance-digital-innovation?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "Mumbai, July 26, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank partners with IIT Bombay to advance digital innovation",
    "body": "Deutsche Bank announced a partnership as Associate Member of the IIT Bombay Research Park Foundation. The Memorandum of Understanding, which will further research & development and innovation within the organisation, was signed in Mumbai on June 28, 2022. With this, Deutsche Bank has become the first bank to enter this partnership with the foundation.\nAs part of the arrangement, the foundation will bring together academics and students from IIT Bombay, along with financial experts and start-ups to facilitate research projects initiated by the bank. Speaking at the signing, Srikanth Gopalkrishnan, Head of the India Technology Centres said, “This partnership is a great opportunity for us to bring together the bank’s financial expertise with cutting-edge research provided by the country’s premiere technology institute. Working closely with the academia, we can fast-track the development of innovative technology solutions for our clients.”\nProf. Subhasis Chaudhuri, Director, IIT Bombay, said, “We are delighted to welcome Deutsche Bank, the first company in the finance sector to partner with IIT Bombay Research Park. We look forward to this collaboration bringing forth further innovations in banking technology and igniting our students' imagination to build resilient technologies. Our collective aim is to make financial services easily accessible to all.\"\nOver the last couple of years, Deutsche Bank has been actively involved with various IITs in India. In 2020, Bernd Leukert, the bank’s Chief Data, Technology and Innovation Officer, was keynote speaker at Eureka, which is one of Asia’s largest business model competition, organised by IIT Bombay. The bank has also partnered with the institute’s campuses in other cities. Last year, over 20 students from IIT have completed their internship at the India Technology Centre and have also joined as graduate trainees. A similar number is expected to join this year.",
    "number_of_ratings": 4,
    "rating": 5.0,
    "likes": 5
}