{
    "url": "https://www.db.com/news/detail/20220708-deutsche-bank-partners-with-swades-foundation-to-plant-90-000-fruit-bearing-trees-in-rural-maharashtra-india?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 8, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank partners with Swades Foundation to plant 90,000 fruit-bearing trees in rural Maharashtra, India",
    "body": "Deutsche Bank continues to partner with Swades Foundation to plant fruit-bearing trees to augment the income of over 3,000 farmers in rural Maharashtra, India. On Saturday, June 25, 140 of the bank’s volunteers planted almost 500 trees — a part of the bank’s commitment to grow 50,000 fruit bearing trees in Raigad and Igatpuri, Maharashtra. This is in addition to 40,000 trees that were planted as part of the bank’s 40th India anniversary celebrations in 2020. \nIn recent years factors such as unpredictable weather conditions, deforestation and unsustainable farming practices have severely affected crop production. This has created a financial burden on farmers and compelled them to migrate in search of work. Through its CSR In the Community programme, the bank has partnered with Swades Foundation to support people in rural parts of the state by providing sustainable means of livelihood.\nThese trees, which include the likes of mango, coconut, sapodilla, cashew and guava, will augment the income of farmers in these regions. Planted in areas where farming is not possible, each tree is expected to provide farmers with an additional income of 1,500 to 2,000 rupees (~18 to ~24 euros) per tree in the next four years.\nRitesh Singh, one of the bank’s volunteers for the tree planting said, “It was truly wonderful being part of the tree plantation project. I am happy that we were able to plant almost 500 trees which will not only benefit the farmers here, but also the environment. We are glad and grateful to have contributed our bit, though small, to this massive cause.”\nExpressing their gratitude for Deutsche Bank’s support, Tushar Sud, Director – Partnerships, Swades Foundation said, “It was heart-warming to see the enthusiastic volunteers put in the effort to make our plantation drive a success. It is because of your willingness and support that we are able to make a lasting difference to rural communities in Maharashtra.”\nDeutsche Bank and Swades Foundation have been working towards rural transformation since 2016. Through the partnership’s flagship programme, more than 11,500 households now have access to safe drinking water and over 1,000 rural households have adequate water for irrigation.",
    "number_of_ratings": 3,
    "rating": 3.3,
    "likes": 3
}