{
    "url": "https://www.db.com/news/detail/20150930-deutsche-bank-sets-gender-quota-targets-for-the-management-board-and-top-two-management-levels-under-the-new-german-gender-quota-legislation?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 30, 2015",
    "tags": [
        "Careers",
        "Company",
        "Diversity",
        "Management & Leadership"
    ],
    "title": "Deutsche Bank sets gender quota targets for the Management Board and top two management levels under the new German gender quota legislation",
    "body": "In order to foster an inclusive culture that values the diverse mix of its employees, Deutsche Bank signed, concurrent with the other DAX companies, a voluntary declaration in 2011 to increase the proportion of female managers substantially by the end of 2018. Deutsche Bank reports annually on progress in gender diversity in its Annual and HR Reports. Following this voluntary commitment to the German Federal Government, the Bank will continue its efforts toward the advancement of women in the workplace under the new gender quota law.\nThe percentage of women on Deutsche Bank AG's Supervisory Board currently stands at 35%, which means that it already fulfils the new statutory requirement of 30% for listed and co-determined companies. For the supervisory boards of all other Group legal entities that are within scope of the new law, which are not necessarily listed or co-determined, the target of 30% female supervisory board members has been set for these legal entities as well – i.e. also for all those entities where this is not a legal requirement.\nFor the Management Board of Deutsche Bank AG, the Supervisory Board has set a target of at least one female Management Board member by June 30, 2017. This target remains unchanged for December 31, 2020. There are no female executives on the Management Board of Deutsche Bank at present.\nFor the management boards or management committees of the other Group companies in scope of the gender quota law, the Bank has set the same target of at least one female management board or management committee member to the extent legally permissible in the respective jurisdiction.\nFor the top two management levels below the Management Board, Deutsche Bank AG has determined, to the extent legally permissible in the respective jurisdiction, a quota target of 17% for the first level and 21% for the second level by June 30, 2017. These targets increase to 20% and 25% respectively for December 31, 2020.\nFor the other legal entities in scope of the new law, the targets for the top two management levels have been set, to the extent legally permissible in the respective jurisdiction, as follows:\nBetween at least 15% and at least 30% by June 30, 2017, depending on the current status and taking into consideration the legal requirement that targets must not be lower than the status quo, if that status represents a proportion of women below 30%.\nA 30% target across all those legal entities for December 31, 2020.\n“Deutsche Bank is convinced that mixed teams have the potential to generate better ideas and take more balanced decisions – at all levels of an organisation. Equal opportunities are important to us, and for a number of years we have been promoting equal participation of women and men as part of our culture of inclusion. We see this is a prerequisite for more diversity generally and to increase the proportion of women in senior management specifically. In implementing the new gender quota legislation, we have set ourselves targets and deadlines which make the demand for women in senior positions transparent, and which will help us drive and ensure sustainable change for equal participation.” said Stephan Leithner, member of the Management Board with responsibility for HR and Diversity & Inclusion",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}