{
    "url": "https://www.db.com/news/detail/20150924-stephen-a-ross-receives-deutsche-bank-prize-in-financial-economics-2015?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 24, 2015",
    "tags": [
        "Corporate Citizenship",
        "Research"
    ],
    "title": "Stephen A. Ross receives Deutsche Bank Prize in Financial Economics 2015",
    "body": "Center for Financial Studies honors laureate with high level academic symposium entitled “What Market Prices Tell Us”\nNobel Laureates Eugene F. Fama and Robert C. Merton amongst the distinguished speakers\nJürgen Fitschen, Co-Chief Executive Officer Deutsche Bank AG, and Jan P. Krahnen, Jury Chairman and CFS Director, present the award\nLaudation by Professor Philip H. Dybvig\nThe Center for Financial Studies (CFS) today honors Stephen A. Ross, laureate of the Deutsche Bank Prize in Financial Economics 2015, with a symposium entitled “What Market Prices Tell Us”. Leading financial economists will discuss Ross’s work, its relevance and its contribution to the global financial industry and academic world.\nPlenary lectures about “Term Structure of Interest Rates” and “Historical Asset Prices” will be held by Nobel Laureate and Jury member Robert C. Merton and by K. Geert Rouwenhorst, Professor of Corporate Finance at Yale University. A panel of renowned economists will subsequently discuss the topic “Understanding Efficient Markets: Limits of Policy Influence”.\nThe panel will include Eugene F. Fama, winner of the Deutsche Bank Prize 2005 and Nobel Laureate 2013, Martin F. Hellwig, Director of the Max Planck Institute for Research on Collective Goods, and Josef Zechner, CFS Jury member 2005 and Professor of Finance and Investments at WU Vienna University of Economics and Business.\nStephen A. Ross was announced as laureate in March 2015. Jürgen Fitschen, Co-Chief Executive Officer of Deutsche Bank AG, and Jan P. Krahnen, Jury Chairman and CFS Director, will present the award to Ross during a ceremony prior to the symposium. Philip H. Dybvig, Professor of Banking and Finance at Washington University, will give the laudation.\nAs one of the most influential financial economists of our time, Stephen A. Ross is a very deserving award winner of the Deutsche Bank Prize in Financial Economics. The models developed by him have not only profoundly shaped economic theory but also influenced financial practice and policy during the past 25 years.\nJürgen Fitschen, Co-CEO\nJan P. Krahnen points out: “We feel privileged to have gathered some of the world’s most distinguished researchers for our symposium in honor of Stephen A. Ross. This underlines Ross’s fundamental contributions to the analytical development of financial economics and attests to the international reputation of the award.”\n“I feel honored that such a high-profile Jury has awarded me with the renowned Deutsche Bank Prize in Financial Economics,” says Stephen A. Ross. “I would also like to thank my much-respected academic colleagues for participating in the symposium organized by the Center for Financial Studies. In the light of the growing complexity of financial markets, an exchange of ideas and approaches is crucial to advance the understanding of market mechanisms.”\nBroad themes\nStephen A. Ross’s wide range of research interests include the economics of uncertainty, corporate finance, decision theory, and financial econometrics. He is the inventor of the Arbitrage Pricing Theory, the Theory of Agency, and the Recovery Theory. He is further the co-creator of Risk-Neutral Pricing and of the Binomial Model for Pricing Derivatives. Ross’s work has been central to the modern analysis of term structure models and his theories provide standards for pricing in major securities trading firms, useful for retirement accounts and for new financial products that may allow households to insure a wider range of risks.\nStephen A. Ross is the Franco Modigliani Professor of Financial Economics at the MIT (Massachusetts Institute of Technology) Sloan School of Management and has held academic appointments at other renowned universities such as Yale University and the University of Pennsylvania (Wharton School). Ross has not only pursued a distinguished university career, but has also advised the financial sector, major corporations, and government departments. Ross holds a PhD in Economics from Harvard University.\nWhile being a globally recognized academic and a widely published author in finance and economics Stephen A. Ross is a member of the American Academy of Arts and Sciences. Moreover, in 1988 he led the American Finance Association as its president. Ross currently also serves as an associate editor of several economics and finance journals. He is the author of more than 100 articles in economics and finance and the co-author of the best-selling textbook “Corporate Finance”.\nStephen A. Ross was elected by a Jury of internationally renowned experts in financial research and practice. Members of the Jury, alongside the Chairman Jan Pieter Krahnen, are the professors Guillermo Calvo (Columbia University), David Folkerts-Landau (Chief Economist at Deutsche Bank), Michael Haliassos (CFS Director), Otmar Issing (CFS President), Nobuhiro Kiyotaki (Princeton University), Holger Kraft (Goethe University Frankfurt, Director of Finance Department), Robert C. Merton (Nobel Laureate, Massachusetts Institute of Technology), René M. Stulz (Ohio State University, Fisher College of Business), Uwe Walz (CFS Director), and Mirko Wiederholt (Goethe University Frankfurt, Director of the Money and Macroeconomics Department).\nAbout the Deutsche Bank Prize in Financial Economics\nThe academic Deutsche Bank Prize in Financial Economics is sponsored by the Deutsche Bank Donation Fund and carries an endowment of €50,000. The CFS awards the prize biannually in partnership with Goethe University Frankfurt. The Deutsche Bank Prize in Financial Economics honors internationally renowned economic researchers whose work has a marked influence on research concerning questions of financial economics and macroeconomics, and has led to fundamental advances in economic theory and practice.\nThe prize was awarded for the first time in 2005 to Eugene F. Fama, Nobel Laureate (2013) and Professor of Finance at the University of Chicago, for researching the concept of individual rationality in financial market behavior. In 2007 Michael Woodford, Professor of Political Economy at Columbia University, received the prize for his groundbreaking redefinition of monetary analysis. In 2009 Robert J. Shiller, Nobel Laureate (2013) and Professor of Economics at Yale University and Professor of Finance at Yale School of Management, received the prize for his constructive challenge of rationality and promotion of behavioral considerations.\nKenneth Rogoff, Professor of Economics and Professor of Public Policy at Harvard University in Cambridge, USA, received the prize in 2011 for his analysis of financial crises. In 2013 the prize went to Raghuram Rajan, Governor of the Reserve Bank of India (RBI) and former Chief Economist at the International Monetary Fund (IMF), for his highly influential contributions in a remarkably broad range of areas in financial economics most important to the development of economies worldwide.\n___________________________________________________________\nAbout the Center for Financial Studies\nThe Center for Financial Studies (CFS) is a non-profit research institute which conducts independent and internationally oriented research in important areas of financial and monetary economics, ranging from monetary policy and financial stability, household finance and retail banking to corporate finance and financial markets.\nIt serves as a forum for dialogue between academia, policy-making institutions, and the financial industry. The CFS offers a platform for top-level fundamental research as well as applied research relevant for the financial sector in Europe. President of the CFS is Prof. Dr. Dr. h.c. mult. Otmar Issing. Chairman of the supporting association is Dr. Rolf-E. Breuer. The overall management of the institute is conducted by the directors Prof. Michael Haliassos, Ph.D., Prof. Dr. Jan Pieter Krahnen, and Prof. Dr. Uwe Walz.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}