{
    "url": "https://www.db.com/news/detail/20150922-american-banker-recognizes-two-deutsche-bank-americas-executives-in-annual-rankings?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 22, 2015",
    "tags": [
        "Awards",
        "Careers",
        "Company"
    ],
    "title": "American Banker recognizes two Deutsche Bank Americas executives in annual rankings",
    "body": "American Banker has named Fiona Bassett, Head of Passive, Americas, Deutsche Asset & Wealth Management (Deutsche AWM) to its list of “25 Most Powerful Women in Finance” and Susan Skerritt, Regional Head Americas, Global Transaction Banking (GTB) to its list of “25 Women to Watch.”\nWe are thrilled that American Banker is recognizing them for their accomplishments\nJacques Brand, Chief Executive Officer of Deutsche Bank North America\nBassett joined the Bank in 2004 and has more than 15 years of experience in the financial industry developing and managing new investment products, such as open-ended funds, ETFs, closed-end funds, special purpose vehicles and structured notes. Since assuming her current role, Bassett has helped to grow the Deutsche AWM US X-trackers platform to USD 20 billion assets under management from USD 1 billion assets under management, solidifying Deutsche AWM as a top-10 ETF provider in the US.\nSkerritt has been named to the “25 Women to Watch” list for the second consecutive year. She joined the Bank in 2013 and is responsible for driving the growth of Deutsche Bank’s GTB business in the Americas, encompassing Cash Management, Trade Finance and Institutional Cash & Securities Services.\nWith more than 30 years of experience in transaction banking, Skerritt has demonstrated her industry and client expertise by identifying and fostering strategic partnership opportunities between GTB and other Bank business divisions. Her cross-selling initiative has directly promoted new business relationships between regions, divisions and within the GTB division to enhance GTB Americas financial contribution to the Bank.\n“Susan and Fiona are innovative and collaborative leaders who have a tremendously positive impact on our business and culture at Deutsche Bank,” said Jacques Brand, Chief Executive Officer of Deutsche Bank North America. “We are thrilled that American Banker is recognizing them for their accomplishments.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}