{
    "url": "https://www.db.com/news/detail/20150918-deutsche-bank-to-streamline-operations-in-russia?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 18, 2015",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank to streamline operations in Russia",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) today announced the closure of its onshore Corporate Banking & Securities business (CB&S) presence in Russia as part of an ongoing review of its global footprint.\nThis decision has been made in order to reduce complexity, costs, risks, and capital consumption.\nDeutsche Bank’s Russian Corporate Finance and Markets businesses will now operate from international hubs. The Bank will continue to offer prices in Russian securities to clients, using third parties for local execution, as well as banking services to core Russian clients.\nAn implementation plan has been put in place to ensure the orderly transfer of client services over the coming months. The transition and the closure of the onshore CB&S operations is expected to be substantially completed by year end 2015.\nDeutsche Bank’s Global Transaction Banking (GTB) business will continue to provide Trade Finance, Cash Management, Working Capital Financing and FX services and will remain onshore, building on strong momentum and historic ties to the local market spanning 134 years. GTB’s Institutional Cash business and Issuer Services business will also continue to service Russian clients through offshore global hubs. GTB’s local custody business will be discontinued in close dialogue with clients.\n\nThe Bank will also continue to serve Wealth Management clients but will consolidate administration and booking offshore.\nFor further information please contact:\nDeutsche Bank AG\nPress & Media Relations\nMark Arena +44 20 754 11647\nAnke Veil +49 69 910 42846\ndb.presse@db.com\nInvestor Relations\n+49 69 910 35395 (Frankfurt)\n+44 20 754 50279 (London)\ndb.ir@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}