{
    "url": "https://www.db.com/news/detail/20190529-deutsche-bank-wealth-management-ramps-up-commitment-to-uk-with-regulated-mortgages-launch?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "May 29, 2019",
    "tags": [
        "Corporate products",
        "Wealth"
    ],
    "title": "Deutsche Bank Wealth Management ramps up commitment to UK with regulated mortgages launch",
    "body": "London, May 29, 2019 – Deutsche Bank Wealth Management, one of the largest wealth managers worldwide, has today announced the launch of a service to offer regulated mortgages to private-banking clients in the UK. This marks the latest step for the firm in extending its market-leading European footprint into the UK.\nThe new offering is available to clients who want to borrow £3 million or more at competitive loan-to-value and interest rates, typically to buy houses initially in the UK and imminently in nine other jurisdictions including France, Italy and Spain.\nThe new offering will also cover mortgage refinancing and equity release, as well as being prepared to “dry lend”, offering large mortgages without requiring assets under management for clients wishing to build a wider wealth management relationship.\nMichael Morley, Head of Deutsche Bank Wealth Management in the UK, said: “This offering is a game-changer for Deutsche Bank Wealth Management in the UK and demonstrates our commitment to this market.\nMorley continued: “Our sophisticated clients are increasingly coming to us looking for higher value borrowing for principal private residences, high value buy-to-let properties and commercial buildings here. We’ll now be able to meet the full spectrum of their needs in the UK, putting our deep international experience and investment banking capabilities to work on their behalf.”\nThe move follows a series of recent high-calibre hires in London to build up Deutsche Bank Wealth Management’s capabilities in mortgage lending. This is both regulated, usually secured on the land and used for private homes, and unregulated, which typically applies to commercial borrowers and properties, frequently arranged in coordination with Deutsche Bank’s leading international Corporate & Investment Bank.\nThese hires include Saydam Salaheddin, previously at Credit Suisse, who has taken on the role of Head of Real Estate for Europe, and James Lockyer, previously at SG Kleinwort Hambros, who will be reporting to Salaheddin as Head of UK Regulated Mortgages.\nNew arrivals also include Justin Minien, formerly at Metro, who will support Matthew Spencer, Head of Intermediaries, in working with mortgage brokers.\nBalaji Prasanna, Global Head of Lending & Deposits for Deutsche Bank Wealth Management, said: “Our strength in providing lending and liquidity solutions is a key differentiator for our business and I am confident that this decisive step into real-estate lending will give us another significant way to engage with our clients and provide market-leading solutions that few competitors can match.”\nAbout Deutsche Bank Wealth Management\nWith client assets of approximately 300 billion euros (as at March 31, 2019), Deutsche Bank Wealth Management is one of the largest wealth managers worldwide. It offers wealthy clients a broad range of traditional and alternative investment solutions, as well as comprehensive advice on all aspects of Wealth Management. Its goal is to create lasting value as a trusted partner to wealthy individuals and entrepreneurs, family offices and foundations around the world. It aims to bring a unique perspective as both a European and a truly global institution; to offer bespoke solutions that others do not; to offer expert advice to its clients, their families and their business; and to connect them to a world-class capital markets institution.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}