{
    "url": "https://www.db.com/news/detail/20190527-europe-has-voted-five-takeaways-from-kevin-koerner-deutsche-bank-research?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "May 27, 2019",
    "tags": [
        "Research"
    ],
    "title": "Europe has voted!",
    "body": "The first provisional results for the European Parliament elections came in Sunday night. First a positive surprise: with a provisional estimate of 51% - the strongest result in 25 years - electoral turnout broke the downward trend of the last decades towards a record low of less than 43% in 2014. This could be interpreted as an indicator that Europe managed to mobilise its citizens after all as has also been suggested by the increased interest in this year's elections expressed in survey of the previous months. However, differences in turnout across the EU have been substantial, with particularly low participation rates among Eastern members and the UK.\nThe elections were overshadowed in the UK by the announced resignation of PM Theresa May for June 7 as well as accusations that EU citizens in the UK were partly denied access to the ballots. Altogether, the provisional Sunday results are relatively close to our poll-based projections (with some exceptions). In some member countries the outcome managed to surprise (such as the victory of the socialists in the Netherlands and the even stronger-than-expected gains of the German Greens). Final official results should be available later today. Based on Sunday's results, here are our five key takeaways.\nThe \"grand coalition\" of conservatives (EPP) and social democrats (S&D) has lost its traditional absolute majority in the next European Parliament. Together with the liberals and greens, pro-European groups will still hold a clear majority of two-thirds of the seats in the next EP. But policymaking for them will likely become more complex and require broader cross-party agreements and discipline.\nWith above 30% of seats, Eurosceptic and anti-establishment groups and (nonaligned) parties are estimated to have increased their weight in EU policy making over next five years. But we remain doubtful that these groups will manage to permanently overcome their (many) differences and use their leverage to promote their own coherent policy agenda.\nBalance in the next EP will also depend on group formation over the next few weeks. Big questions remain e.g. regarding the planned joint group between the liberal ALDE and French President Macron's Renaissance as well as the composition of Italian Deputy PM Matteo Salvini's new far-right Eurosceptic alliance and the efforts of Five Star Movement to create a new (also Eurosceptic) anti-establishment group, potentially to be joined by Nigel Farage's Brexit Party from the UK.\nThe increased fragmentation on the next EP will make the appointment of the next Commission President a potentially lengthy procedure. None of the EP's \"lead candidates\" will find it easy to secure support of a majority of the MEPs and the Council might see this as a reason to deviate from the \"lead candidate\" procedure altogether.\nA lengthy standoff between Council and Parliament as well as intense negotiations on the top jobs between leaders could push the appointment of the next Commission beyond October. This would reflect badly on the EU's prospective ability for constructive policy making and joint decisions and could thus impact market's confidence and trust in the single currency.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}