{
    "url": "https://www.db.com/news/detail/20190524-statement-on-exiting-the-financing-of-oil-gas-and-coal-mining-industries?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "May 24, 2019",
    "tags": [
        "Sustainability"
    ],
    "title": "Statement on exiting the financing of oil, gas and coal-mining industries",
    "body": "The climate activist Luisa Neubauer, a prominent member of the #FridaysForFuture school strike movement, criticised Deutsche Bank at this year's General Meeting. What is your exit plan with regard to the financing of coal, oil and gas? This was the essence of her question. Christian Sewing answered her as follows:\n“Ms Neubauer,\nYou asked about our plan for exiting the financing of oil, gas and coal-mining industries.\nBefore I answer your question, I would like to thank you for coming here today. As a father and the CEO of Deutsche Bank I welcome the current debate about tackling climate change and I welcome the “Fridays for Future” initiative.\nYou are absolutely right when you say that it’s all our futures that are at stake. And I made it very clear in my speech that Deutsche Bank needs to be an integral part of society. And for me this includes a clear commitment to tackling climate change: this is not only the most pressing topic for your generation, we must all make it our primary concern to leave behind a viable planet for the next generations.\nHowever, Ms Neubauer, your criticism of us is somewhat harsh. Even though there is still much to do, we have already achieved a great deal.\nWe at Deutsche Bank made an early public commitment to contribute to the overall targets set by the Paris Agreement on Climate Change.\nWe have already withdrawn from certain businesses, for example from financing new coal-fired power stations. Our exposure to coal mining groups is negligible. We have long since achieved the target for 2020 that we set ourselves at our General Meeting in 2017.\nHowever, it is clear that the entire economy is undergoing extensive transformation. One of our operating principles is to support our clients through every stage of their business. So we believe it makes good sense to assist in this transformation process and not to exit entire industries or abandon long-standing client relationships. We have to support our clients as they transform their businesses.\nIn my speech I also stated quite clearly that we aim to finance fewer projects with fossil-fuel energy suppliers and we’re working on targets to support that. For instance, we lowered the overall industry concentration thresholds for the oil and gas and utilities sectors in 2018. But we have even more ambitious plans for this area.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}