{
    "url": "https://www.db.com/news/detail/20190523-message-from-christian-sewing-to-colleagues-on-the-2019-annual-general-meeting?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "May 23, 2019",
    "tags": [
        "Company"
    ],
    "title": "Message from Christian Sewing to colleagues on the 2019 Annual General Meeting",
    "body": "Dear Colleagues,\nOur Annual General Meeting here in the Frankfurt Festhalle will attract a great deal of media attention today. My fellow Management Board members and I, together with our Supervisory Board, will conduct a dialogue with shareholders. Almost 8,500 of them have said they will attend. The topics will include the past financial year, our profitability, our growth strategy, but also the ratification of the acts of management of the Supervisory Board and the Management Board.\nOf course, we know our shareholders will be critical. Nevertheless, we should not lose sight of our achievements over the last 12 months. In 2018 we returned to profitability, achieved all our objectives and laid the foundations for our bank to become sustainably profitable once again. We proved once again that we possess impressive resilience, despite powerful headwinds. That was thanks to your tireless dedication and loyalty. We can all be proud of this.\nDespite all the progress we’ve made, we know we’re not yet nearly as profitable as our shareholders expect us to be, nor as strong as we expect ourselves to be. Last year, it was vital that we established firm foundations. But that was just the beginning. Our Deutsche Bank needs a sharper focus. We need to be a bank that is fully focused on the needs of clients, less volatile, and more sustainably profitable.\nWe have stabilised the bank. Now, we must follow that with a phase of transformation. The main lines of our transformation are unmistakeable: we aim to generate a post tax return on tangible equity of 10 percent. To achieve that we must continue to reduce expenses, further develop our technology, boost innovation – and finally, set our core businesses back on the path to growth.\nWhat does that mean in concrete terms?\nOn the cost side, we must train our focus on the infrastructure functions. In future they must be more closely aligned to what the business divisions and their clients need, and simultaneously guarantee effective and efficient controls. For that, we must change our structures. A first example: we will combine parts of Compliance and our Anti-Financial Crime unit with Non-Financial Risk Management. That will enable us to substantially cut costs without compromising on controls.\nAt the same time we aim to grow again, worldwide. We strive to be a bank with an even higher share of stable or, rather, recurring income. That will require further adjustments to our business divisions. And all businesses will get clear return targets, which they’ll need to hit. No ifs, no buts.\nIn respect of profitability, in the Private & Commercial Bank we’re further along than many people give us credit for. However, we need to change more quickly and more radically. That’s why we merged our two building societies, ahead of schedule, just last week. Now, we’ll fast-track further projects – for example the integration of the two corporate centres.\nAfter the outflows of last year, DWS once again attracted net inflows in the first quarter of this year. We can feel the energy which the change of leadership at DWS has unleashed. Our goal must be to build one of the world’s top 10 asset managers. We can do that if we maintain our organic growth and, at the same time, are open for other strategic options if they arise.\nWe will continue to re-focus the Corporate & Investment Bank around its strengths. We already started on that process last year. When we talk about strengths, we mean that at least one of two conditions need to be met. On the one hand we’re talking about segments that open doors for other businesses with key clients - for example, our Origination & Advisory business. On the other, we’ll focus more on businesses that are profitable in their own right and meet our return targets even before taking account of synergies with other businesses – for example, our world-leading foreign exchange platform.\nOur Global Transaction Bank (GTB) has a strong position that we now aim to build on. We’ll give GTB the freedom and resources to fulfil its potential, for example in many Asian markets. We can do much more to leverage GTB’s network and the close connectivity with clients for the benefit of the whole bank. For example, right now we’re connecting GTB much more closely with our foreign exchange, rates and credit businesses.\nWe will analyse very closely where to focus our resources. We’ll be just as disciplined and uncompromising with this as we are with costs. We’ll be more rigorous in our capital allocation and implement our hurdle rates group-wide.\nDear colleagues, I am acutely aware that the transformation phase will demand a lot from us all. The pace, and the demands, will be high. But it’s the only way we’ll become more sustainably profitable and remain competitive.\nBut let’s not forget: there is incredible potential in our bank. We have so much talent in our own ranks, that every day we can positively surprise clients and ourselves. All we have to do is create the conditions that will enable us to do that, and clear the obstacles in our way. We’ll only do that with inspirational leadership.\nWe’re on the right path and we’re totally determined to accelerate our transformation. With all our energy and with absolute focus. With modesty and with pride.\nBest regards\nChristian Sewing",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}