{
    "url": "https://www.db.com/news/detail/20190523-paul-achleitner-s-speech-at-the-deutsche-bank-annual-general-meeting-2019?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "May 23, 2019",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Paul Achleitner's speech at the Deutsche Bank Annual General Meeting 2019",
    "body": "Paul Achleitner\nChairman of the Supervisory Board\nDeutsche Bank AG\nAnnual General Meeting\nFrankfurt am Main, 23 May 2019\nDear Shareholders,\nWhether you are here in person in Frankfurt or watching from the comfort of home or on a mobile device,\nI warmly welcome you to our Annual General Meeting, which I now declare open.\nLast year I brought along a footballing photo that I had taken myself. Eintracht Frankfurt had just won the German Cup Final. At the end of this season the football club didn’t have quite as much reason to celebrate as last year – so today I don’t have a photo to show you.\nBasically, Eintracht enjoyed a great season, fought really well, registered a number of real achievements and played their way into many people’s affections. Nevertheless the coaching staff, the team and the fans had been hoping to do better.\nIt was a similar story at Deutsche Bank: we fought successfully and achieved all our financial targets for 2018. And yet, the share price is currently below 7 euros.\nHow can that be? Why isn’t the progress made over recent months reflected in the share price?\nWe’re familiar with the criticism levelled at Deutsche Bank. We take it very seriously. And we’re working flat out to deliver solutions. We hear what the analysts are saying. We hear what the journalists are saying. We hear the criticism and the questions from you, our shareholders.\nYou’re disappointed by:\n• falling revenues instead of growth;\n• the work that still needs to be done on systems and processes;\n• numerous boardroom changes;\n• the disconnect between employee remuneration and shareholder dividends;\n• and you have doubts about the business model.\nWe will address these matters today. We greatly appreciate the opportunity to discuss them with you. And we want to give you a full picture.\nOver the past few years, we have made considerable progress, such as\n• we have trimmed the balance sheet by one third – or by more than 600 billion euros – since 2012.\n• our Common Equity Tier 1 ratio of 13.7 percent is one of the highest among our global peers.\n• we have significantly reduced our legal risks and extended our control systems in the past three years.\n• in 2018 the Management Board significantly reduced costs for the first time and returned the bank to profitability.\nBut that’s not enough, of course. We need to restructure even faster and more radically. Our CEO Christian Sewing will talk about this in a minute – and we will discuss it.\nLadies and gentlemen, this year in particular we remember Alfred Herrhausen. He was assassinated nearly 30 years ago on November 30, 1989.\nThere were few people who identified more closely with corporate social responsibility than our former Management Board Spokesman. It is just as important to us now as it was then. This is illustrated by the work that the Alfred Herrhausen Gesellschaft does today.\nAlfred Herrhausen was also a visionary during a period of pervasive upheaval. It wasn’t just the banking industry that was undergoing radical change in his era; it was the whole world. Deutsche Bank has faced these kind of challenges time and again during its almost 150-year existence. And it has proven two things over time: its ability to change and its resilience.\nNow, once again, we are facing substantial upheaval. In actual fact, it’s happening all around us. This is true of both global politics and the financial sector. Our sector is currently being shaped by two megatrends: one is regulation; the second is digitisation.\nOur regulators require us to be stable, robust. And whenever we change, they require us to minimise the risks we take.\nDigitisation requires us to be agile in the way we work and tackle disruptive change.\nSo how can we combine the two? How can we remain stable and assume fewer risks while subject to stricter controls but at the same time be agile in our response to disruption? How can we reconcile making our business fit for the future with fulfilling these contrasting requirements?\nThe best way is for us to reflect on those qualities that helped Deutsche Bank to overcome difficult times in the past. And I see four traits that our bank has always had: its stability, its global business, its ability to innovate and to change.\nThat’s what is important nowadays:\n• Our bank has to remain stable. It has to keep its balance sheet robust and its risk management systems first class. And it doesn’t need any new scandals.\n• We have to remain a global bank. Germany’s internationally connected economy needs a strong bank with an international network.\n• It goes without saying that we have to be innovative. That’s certainly truer than ever, now that the Tencents and Amazons of this world are becoming competitors to traditional banks.\n• We have to be prepared to change, prepared to reinvent ourselves again and again without cutting our roots. I mean, we have to continually examine our business model. Our traditional values and strengths are our anchor. But with the world progressing at breakneck speed, the one strategy that is certainly wrong is to stand still.\nLadies and gentlemen,\nI spoke with Christian Sewing about these trends and our possible responses to them before we appointed him as CEO last April. It was quite clear that radical change is looming. It was also clear that this change will bring opportunities – opportunities that we plan to identify and exploit.\nWe both agreed that we have to transform our bank, adapting it gradually to the new world. We also agreed that we have to maintain our stability and our client relationships.\nYes, we will change. And we’ll make sure we shape this change with care and for the long term.\nDespite all the difficulties, I believe we’re on the right track.\nJust a year ago, we were discussing right here whether, what must have at least seemed like an abrupt change in management, was really a good idea.\nToday the consensus is happily quite clear: Christian Sewing is the right choice.\nHe took on the leadership role in our bank – and he got things done. The Management Board set itself three goals for 2018 and achieved all three. First, the Management Board managed to cut costs; second: to reduce headcount and third: to maintain the bank’s capital strength. And you’re about to hear the clear vision Christian Sewing has for Deutsche Bank.\nLadies and gentlemen, to dispel any doubts before they are raised: Christian Sewing has the full support and backing of the Supervisory Board for his plans – the concept which he and the Management Board plan to implement to guide the bank towards a better future.\nThe past year was also a year fraught with setbacks. Suspicions in connection with the Estonian subsidiary of Danske Bank, for instance, and the Frankfurt Public Prosecutor's Office search of our premises in November.\nThese events once again undermined the trust in us of our clients, of the public – and also of numerous shareholders.\nAnd these events showed us how much trust we still need to rebuild, so that people no longer believe there is nothing we wouldn’t be prepared to do.\nOn the other hand, these kind of situations also show how resilient our bank is. It overcame these setbacks – something that deserves recognition. And all those employees whose hard work and dedication helped make this happen also deserve our warm thanks.\nLadies and gentlemen, after our offices were searched, people – especially those outside Germany – started asking whether we have lost support in our home country. The answer is: quite the opposite. The German government has once again started to focus much more squarely on the needs of Germany as a financial location and, as such, we feel we have excellent support from the government – without feeling like we are being told what to do.\nAt this point, I’d like to make a clear statement and I do so knowing full well that anything that is said at the Annual General Meeting is legally binding: in connection with the potential merger with Commerzbank, there was never any pressure on the Supervisory Board from any political party or individual. Nor did the Supervisory Board (or I personally,) ever exert any pressure on the Management Board to agree to the merger.\nIt was the Management Board’s decision to enter into negotiations. And it was the Management Board’s decision to end them. Both the Management Board and the Supervisory Board were in agreement that, first and foremost, any deal must make economic sense for Deutsche Bank. In order to establish whether this was the case, the Management Board and ultimately also the Supervisory Board had to weigh up the options very carefully and make a detailed analysis. Opinions are formed quickly, but a well-founded decision requires a sound knowledge of the facts.\nThe Management Board examined the facts and we on the Supervisory Board understood why the Management Board came to the decision it did – and we also believe it is the right one. The risks of such a transaction would have outweighed the opportunities for our investors, our clients and our employees.\nSo what does this decision mean for our future?\nWell, if we’re not going to grow through merging, then we’ll do it organically – nationally as well as internationally. We will focus on our bank’s strengths and on creating innovative products for our clients. We are financially robust, have a keen eye on our costs and our risks are under control: that’s what is important, now and in the future.\nThis is the right moment to hand you over to Christian Sewing. He’s going to tell you how we're going to embark on this journey. It’s the CEO who is responsible for our business strategy.\nWe on the Supervisory Board examine the Management Board’s strategic plans, give advice and lend support in its implementation. I’ll be back to tell you exactly how we did this in 2018 once Christian Sewing has spoken.\nThank you very much.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}