{
    "url": "https://www.db.com/news/detail/20190523-christian-sewing-s-speech-at-the-annual-general-meeting-2019?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "May 23, 2019",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "Christian Sewing's speech at the Annual General Meeting 2019",
    "body": "Dear Shareholders,\nIt is also my pleasure to welcome you here in Frankfurt at the Festhalle.\nToday we can look back on another year that proved exceptionally intensive for your – and our – bank, for our employees in 60 countries, and for all of us here on stage. After a year like that, it is especially important to me to be able to talk directly with you.\nIn the meantime, I also completed my first year as Chief Executive Officer and\nI would like to start by looking back on a personal note.\nTo put it rather simplistically – being the CEO of our bank is the full package. It’s challenging and demanding; it’s full of surprises; now and then it’s highly emotional and sometimes also quite exhausting. However, at the same time it is also extremely fulfilling and gives me a sense of purpose.\nIt is this sense of purpose that helps me come to work happy and energised every day: I feel that I’m leading a bank that is undoubtedly going through a challenging period. But it is also a special institution that’s worth fighting for.\nWhy?\nBecause this bank, our Deutsche Bank, constantly proves that it possesses remarkable resilience and inner strength. Resilience and strength which many people underestimate.\nLadies and Gentlemen, it may not seem so at first glance but we achieved a lot in 2018. And that was despite some strong headwinds - starting with the US stress test, followed by critical ratings assessments, and culminating in a much-publicised search of our premises in Frankfurt which hit TV screens across the world and which was severely damaging for us.\nIn spite of all these events, we returned Deutsche Bank to profitability. We achieved all our objectives and laid the foundations for becoming a sustainably profitable bank.\nFor this I would like to thank first and foremost our employees worldwide – for their tireless commitment, their loyalty, and for the way they identify with our bank. It’s this commitment, and this sense of identity, which ensure we remain successful during tough times. Our employees are Deutsche Bank.\nBut of course it is also worth giving one’s all for our bank because it is so important not just for Germany’s economy, but also for Europe’s. And because Deutsche Bank is needed – that’s what clients worldwide confirm to me every day.\nLet me try to put this into a few numbers:\nWith more than 20 million private and commercial clients we are the biggest asset manager and lender in this country. Our German clients trust us with more than 300 billion euros of client assets. In our Private & Commercial Bank we increased the volume of real estate, consumer and commercial loans to almost 270 billion euros last year.\nBut we’re also one of the leading banks for corporates in Europe. There’s hardly any other bank which has such a global network. A core part of our Corporate & Investment Bank is our global transaction banking unit, which is the number one clearer of euro payments globally. We settle more than five percent of global foreign exchange transactions. (Sources: Euromoney; Swift)\nAnd our asset manager DWS has a total of over 700 billion euros of client assets under management, and ranks among the top five in Europe.\nThose are just a few facts and figures which demonstrate that the work we do has a visible positive impact. We boost the economy and foster growth. We help companies create jobs.\nWhy am I starting my speech with such a basic point?\nBecause today we will be involved in lengthy discussions and, understandably, we’ll also hear a lot of criticism. We will talk about falling revenues and cost programmes, about our controls and about a disappointing share price – and no one’s more disappointed with our stock market performance than I am.\nAnd I’m aware that seems contradictory – we achieved our goals, restored the bank to profitability … and still the share price is close to its all-time low. For me, that’s a motivator. I won’t let up – I will work with all my strength to boost our share price.\nHowever, we mustn’t lose sight of the big picture – the role we play for our clients, the economy and society as a whole. That’s the foundation on which we can build sustainable success.\nAnd we know the way to deliver sustainably higher profitability.\nReview of 2018\nFirst, let’s look back. In 2018 our task was to stabilise the bank and return it to profitability, after reporting a loss for three years in succession. Another priority was to lay the foundations for the next phase that began at the end of 2018. In ‘phase two’, it’s about transformation and growth.\nIf we look back at last year we can say, with confidence and also some pride, that we have achieved all the objectives that we set out for you here one year ago. That wasn’t a given. In the years following the financial crisis, from 2008 until April last year, Deutsche Bank hardly achieved any of its publicly stated objectives.\nThat is why it was clear to me from the beginning that we have to win back your trust. We commit to our objectives and we’re doing everything in our power to meet them. We presented a programme to you at last year's Annual General Meeting – and since then we have been implementing it rigorously. Day by day, week by week, month by month. We had and have a clear agenda that you can use to track our progress.\nSo what did we achieve in 2018?\nAs promised, we strengthened our more stable businesses. By that we mean our Private & Commercial Bank, our Global Transaction Banking business and our asset manager DWS. In the first quarter of 2019 they contributed 63 percent of revenues. That’s four percentage points more than in the prior year quarter.\nAs promised, we focused our Corporate & Investment Bank more closely around its core strengths. That means we have scaled back those activities where we don’t see ourselves as leaders. We deliberately cut the balance sheet of our Corporate & Investment Bank by more than 130 billion euros. This meant that by year-end 2018, we had already achieved our target for end-2019.\nIn our other two business divisions we have also reached our targets: we successfully floated our asset management business DWS on the stock exchange and we merged the Private & Commercial Clients businesses of Deutsche Bank and Postbank in our home market into a single legal entity.\nAs promised, we were rigorous in cutting costs. That confounded the sceptics. We reduced our adjusted costs by more than one billion euros in 2018. At 22.8 billion euros we even beat our target of 23 billion euros. And we maintained this trend into the start of 2019. Adjusted for annual bank levies, our adjusted costs have now fallen for five consecutive quarters.\nOne prerequisite for this was that we cut the number of full-time equivalents in the Deutsche Bank Group by nearly 6,000 to 91,700. With that, we clearly achieved our target of below 93,000. The full effect on costs will only be seen this year. That’s one reason we’re well on track to achieve the even more demanding cost target we have set ourselves: to reduce adjusted costs to 21.8 billion euros this year.\nAt the same time, we didn’t just maintain our financial strength, we actually improved it further. Our Common Equity Tier 1 ratio of 13.7 percent at the end of the first quarter of 2019 is consistent with our target of above 13 percent. We are among the best in our peer group. Our provision for credit losses and market risk levels have rarely been so low.\nAnd we have significant liquidity reserves – nearly 70 billion euros more than regulators require. We’re now deploying this surplus to support additional client business, or to invest in low-risk but better-yielding securities to boost revenues. And we’re reducing our reliance on market-based funding.\nLadies and Gentlemen, as a risk manager of many years’ experience I can assure you: our balance sheet has rarely been of such high quality. That’s a firm foundation for us to grow our client business again.\nControls / Litigation matters\nWe managed to achieve all this in a very difficult year. Especially towards year-end, the market environment was tough. As I said, it hit us hard when the Public Prosecutor’s Office searched our offices in November.\nJust to avoid any misunderstanding. It is, of course, a criminal investigator’s duty to conduct a thorough examination of any suspicious circumstances. However, it’s possible to have diverging views on the manner in which it happened in November.\nEven now, months later, we still have no concrete evidence that would support the allegations against us or any of our employees.\nOf course, we continue to cooperate with the Public Prosecutor's Office – as we did last week when the authorities requested further documents on private clients.\nOverall, we have reduced litigation risks considerably. Of the 20 cases which accounted for 90 percent of our provisions for litigation risk at the beginning of 2016, 19 have now been partially or completely resolved.\nHowever, the public reaction to the investigations by the Public Prosecutor's Office has once again demonstrated one point clearly. We must further strengthen our controls. I want us to be exemplary in this area. That’s why we’re investing consistently in this area. Meanwhile, regulators worldwide acknowledge that we are making faster progress than in earlier years.\nBut this isn’t just about controls. It’s about our values and beliefs, too. We will only achieve long-term success for our clients if we act with integrity and discipline. Each and every one of us has to live this, every day. And that’s the course we have set for our bank.\nLadies and Gentlemen, we recovered from the events of the autumn – thanks to the resilience and discipline of our employees, and thanks to close relationships with our clients.\nBy year end, we reported the first net profit since 2014 - generating net income of 341 million euros for the full year 2018. We were also able to improve our pre-tax profit slightly compared to 2017.\nThat profit was hugely important for our employees – for their sense of themselves and, yes, for their pride. I talked about this last year, Ladies and Gentlemen. I want to bring back the pride people feel in working for Deutsche Bank. This is crucial for motivation. Don’t mistake pride for arrogance. There’s never any place for that.\nLadies and Gentlemen: we have cleaned up the bank. It is now profitable again.\nAnd we remain on track this year: In the first quarter of 2019 we performed despite a difficult market environment. We improved our net income to 201 million euros –that’s up 67 percent.\nOur performance in the first quarter strengthens our resolve not to revise our target for the full year of a return on tangible equity above 4%. Yes, we will need supportive markets to achieve it, but given our operating strength in the first quarter, we remain committed to managing toward our target.\nThese results show the progress we’ve made. Of course, we’re not yet delivering what you – and we ourselves – expect from our bank. Naturally, we want to be in a position to pay you a higher dividend than the 11 cents per share that we’re once again proposing today.\nCommerzbank discussions\nOur top priority is to add value for you, our shareholders. That’s the reason we recently decided against a merger with Commerzbank.\nYou might be asking yourselves now, why we even entered into discussions on that subject?\nBecause any other course would have been negligent. I’m firmly convinced of that. I have often stressed that the European banking landscape is too fragmented, and there is much to be said in favour of consolidation. If the opportunity arises to merge with the number two bank in Germany, then it’s an opportunity we must investigate.\nEntering into these talks was the right thing to do. Right from the beginning, though, we were clear that we would only entertain this option if it made economic sense; if, by merging, we could generate higher and more sustainable returns for our shareholders and improve our offering to our clients. After a thorough analysis, it became clear that our own plan is the better option.\n\nStrategy\nSince the end of talks with Commerzbank we’ve been asked repeatedly: what’s Plan B or Plan C? My answer is: everything we have done so far was just the beginning. But a quite deliberate beginning. A bank is a sensitive structure. For that reason, it was important to lay essential, rock-solid foundations – and that’s what we’ve done.\nBut it was just the start. Our Deutsche Bank needs a clear focus – it needs to be a bank that is completely focused on the needs of clients and at the same time whose performance is less volatile. This requires further changes – indeed, far-reaching changes.\nNow, we must follow the stabilisation phase with a phase of transformation. And the broad outline of our transformation is unmistakeable:\nWe aim for a bank with an even higher share of stable, or rather recurring revenues. That will require further adjustments to our business divisions\n It’s about a bank whose business divisions have clear return targets. No ifs, no buts. This applies for all of them.\nIt’s about a bank which seizes the opportunities offered by technology and innovation to become more modern and efficient. To get there, our infrastructure will need to change significantly.\nIt’s about a bank with its roots in Germany and Europe, a global network and a strong presence in the USA and Asia.\nAnd it’s also about a bank, Ladies and Gentlemen, that puts people, both clients and employees, back at the centre of what it does and helps them navigate a fast-changing world. A bank which positions itself in the midst of society and is closely connected to the real economy. That’s the basis for long-term success.\nLadies and Gentlemen, in the mid-term we aim to generate a 10 percent post-tax return on tangible equity. To achieve this we must continue to reduce expenses, refine our technology, boost innovation – and, finally, grow again in our core businesses. You, our shareholders, should profit from this.\nCosts\nLet’s start with costs. Following last year’s achievements we have to be even more thorough in our reorganisation efforts. We must focus on those activities that are not client facing – namely, infrastructure functions.\nFor this, we need a new operating model. We need to look at costs with new eyes. The question is: how can the infrastructure functions satisfy all regulatory requirements, while at the same time providing better support to the businesses and boosting efficiency?\nAfter all, one thing is clear: the business divisions can only unlock their entrepreneurial potential if they’re backed up by excellent and efficient infrastructure. Infrastructure that is aligned to what the business divisions and their clients need, and which guarantees effective and efficient controls.\nCosts that we cannot directly allocate to specific client services are still too high. This is precisely what we are working on, to be able to manage our bank better.\nFor that, we must change our structures. A first example: we will combine parts of our Compliance area and our Anti-Financial Crime unit with Non-Financial Risk Management. That will enable us to cut out duplication, save costs substantially and simultaneously improve controls.\nWe must execute the transformation of our infrastructure in a co-ordinated manner. This co-ordination will be the responsibility of a colleague whose knowledge of Deutsche Bank Group and its infrastructure is second to none: Chief Operating Officer Frank Kuhnke. He’s been with Deutsche Bank for 33 years and has been on the Management Board since January this year.\nTechnology\nAt the same time our infrastructure functions need agile, reliable and cost-efficient technology. That is the backbone of our bank.\nTo achieve this we have to automate a lot more. That will enable us to process much more data and many more transactions in a scalable and efficient way.\nTechnology is, of course, not only key for our efficiency but also for new client solutions. The way we interact with private and corporate clients is currently going through fundamental change.\nI am convinced that the banking business of the future will consist of two core functions:\nFirst, clients will need much more guidance in financial matters in an uncertain, complex and fast-paced world. Therefore I continue to rely on our outstanding network of financial advisors who are also risk managers for their clients – whether they’re buying a home or financing global trade flows.\nSecondly, a large proportion of everyday financial transactions will have to be fully automated. If we want to avoid becoming an easily replaceable provider in this area, we have to create platforms ourselves which are attractive to other providers as well. With more than 20 million clients we already have a critical mass today. But in the not-too-distant future, large platforms in banking will serve 50 or 100 million customers. That’s exactly what we have to aim for.\nThat means we have to digitise all processes rigorously. And fast. At the same time, it’s about unlocking new markets.\nInnovation\nThat said, our more recent track record on innovations makes me feel confident:\nWe have created a dedicated unit for digital business models within the Private & Commercial Bank. We call it “Digital Ventures”. Here, entrepreneurial thinking can develop far more freely. The first venture has already been launched: with our Yunar app we have created a new platform, aimed primarily at young clients. In its initial phase Yunar combines various customer cards. We’ve seen 400,000 downloads since end of January. Yunar will now be developed gradually and be transformed step by step into a digital wallet.\nYunar shows that we not only repel attackers, but that we go on the attack ourselves. This also applies to our transaction bank’s new payment system that we are developing for IATA, the airline association – which means customers no longer have to use expensive credit cards to pay for flights booked online.\nGrowth\nTechnology and innovation are not just the key to more efficiency. They’re the key to more growth.\nWe are now addressing the topic of growth from a much more fundamental angle. In doing so we are starting by tapping the potential that costs nothing: by getting our business divisions to work much more closely together. We have to be “one Deutsche Bank” and act as one in front of our clients. After all, that’s why we are a universal bank.\nLadies and Gentlemen, why am I saying this? When I joined Deutsche Bank 30 years ago in Bielefeld, the thing that impressed me the most was the energy with which we delivered the whole bank to our clients. We wanted to be successful together with our clients.\nAnd over time, some in our bank have forgotten this. This is precisely where we’re now turning things around. And it begins right at the top of the house.\nHere, we have set up a forum exclusively dedicated to growth projects. It’s made up of all Management Board members and representatives from key business areas. We regularly, and exclusively, discuss new business opportunities which span all our businesses. As one team, as one unit, and as one Deutsche Bank.\nBy doing this, we can build on the individual strengths of all our business divisions. Let’s start with our…\n...Private & Commercial Bank (PCB)\nWe still have so much potential in this area.\nIn terms of profitability we are better on track than many people give us credit for. However, we’re not where we want to be. We need to change more quickly and more radically.\nIn PCB we achieved a 5 percent post-tax return on tangible equity last year. We see growth potential in key areas such as deposits, loans and assets under management. Return on equity was already 6.4 percent in the first quarter. Our aim is at least 12 percent by 2021.\nThe first step on that road is the integration of Deutsche Bank and Postbank. We planned on achieving 900 million euros in synergies by 2022. Here we have to move things along faster. Here’s a first example: in recent weeks we merged the two building societies, earlier than planned. Now, we’ll fast-track further projects – for example the integration of the two corporate centres.\nAt the same time we are already launching our growth initiatives in our private client business in Germany, but also in our Wealth Management business.\nHere, assets under management are growing, as they are in our….\n...asset manager, DWS.\nAfter the outflows of recent years, we once again attracted net inflows in the first quarter. You can clearly feel the energy its new CEO Asoka Wöhrmann has unleashed.\nAnd DWS’s growth initiatives are starting to bear fruit:\nStrategic partnerships with DVAG, Generali, Nippon Life, Tikehau Capital and Zurich Insurance, brought in net new money of more than three billion euros in the first quarter of 2019 alone.\nIn the US, we have the largest exchange-traded fund for environmental, social and governance (ESG) investments to date. DWS is one of the pioneers in the segment for funds which invest according to ESG criteria.\nWe still have big plans for DWS. Our aim must be to turn it into one of the world’s top 10 asset managers. Ladies and Gentlemen, that goal is within reach if we continue to grow organically and if we remain open to other strategic options as and when they present themselves. The IPO has provided us with the necessary acquisition currency for that.\nLast year our asset management business achieved a return on tangible equity or ‘RoTE’ of almost 18%. Not least because of this, DWS is part of our plan to boost profitability at Group level.\n\nThere is another business which is already delivering double-digit returns today: our…\n…Global Transaction Banking (GTB) business.\nThis is a core part of Deutsche Bank. Settling international payments for corporates, funding their international trade and providing them with the financial infrastructure to do their business – that’s what our bank was about when it was founded in 1870, and that’s precisely what the transaction bank is all about to this day.\nTo this day we still have a very strong position in this business. For example, we’re the number one worldwide in euro payments. We want to expand on that position. It’s precisely for this business that we have our global network, we’re represented in some 60 countries – and we don’t intend to change that. And no other business creates such broad connectivity with our clients, with treasurers or CFOs of corporations and with the owners of small and medium-sized enterprises.\nHowever, we have to be self-critical. We have to admit that within the Corporate & Investment Bank we frequently paid too little attention to the transaction bank and its growth opportunities.\nWe’re changing this now. Under Stefan Hoops’s leadership, the transaction bank will be given the freedom and the resources to fully exploit its potential – for example in many Asian markets.\nWe can leverage GTB’s network and the close links to clients far better for many other business activities as well. We are currently linking our transaction bank much more closely with the foreign exchange, rates and loan businesses.\n\nWe have also very promising potential in a number of other areas in our…\n…Corporate & Investment Bank (CIB).\nAs I’ve already said, already last year we started to re-focus this business division around its strengths. What exactly do we mean by that?\nWell, we talk about strengths when we meet at least one out of two criteria:\n Firstly, the segment benefits other businesses significantly. One example is our Origination & Advisory, or Corporate Finance, business. It helps us build and retain relationships on the c-suite of our corporate clients. And we have been successful recently. Although revenues fell throughout the sector in the first quarter we managed to grow our global market share as much as hardly any other bank did. We improved our performance relative to our peers in six out of seven industry segments. We also gained market share in the investment grade bond issuance segment and arranged 14 of the 20 biggest bonds in the first three months of this year. (Source: Dealogic)\nSecondly, the business is profitable on its own, without including any revenue synergies with other areas. That’s true, for example, of our foreign exchange platform, which is a top-four provider worldwide, our global credit trading or US commercial real estate. Every one of these businesses delivers an appropriate return on equity.\nLadies and Gentlemen, we will analyse this very closely and will be just as disciplined and uncompromising with this as we are with costs. This means that we will further tighten our capital allocation and implement our hurdle rates rigorously group-wide. That benefits our shareholders.\nSo I can assure you: we’re prepared to make tough cutbacks.\nWe will accelerate transformation by rigorously focusing our bank on profitable and growing businesses which are particularly relevant for our clients. That is my pledge, and you can be sure of that.\n\nLadies and Gentlemen, if we apply these principles to all of our business divisions will make your Deutsche Bank sustainably profitable again. If we continue to focus on our strengths we have great potential to increase revenues in these areas. Simultaneously, we’ll continue to reduce costs – we will not let up on our cost discipline.\nI am convinced that we can achieve a 10 percent return on tangible equity – consistent with our aspiration. We have already surpassed this level with DWS and with our transaction banking unit; we’re well on track to do that in our Private & Commercial Bank. And in the Corporate & Investment Bank, we’re highly profitable and stable in many areas.\nLast year, these strong and stable businesses together contributed 21 billion euros in relatively stable, recurring revenues. That’s around 85% of total revenues. And if we now closely scrutinise our other businesses as part of our transformation process, and take action in consequence, we can grow profits substantially across the bank as a whole. I have no doubt about that.\nLadies and Gentlemen, this potential is not reflected in the share price today. We’re going to do everything we can to change that.\nEntrepreneurial culture\nBut our success in transforming the bank will not only depend on clear objectives for revenues, costs and returns on equity. We have to fundamentally change the way we think and work. Too often in our bank it was still the conservatives, not the innovators, who had the upper hand – those who administer the old rather than seizing opportunities. That’s what we’re going to tackle now.\nHow will we do that?\nBy changing our attitude, by embracing and harnessing change. By adopting more of a founder’s mentality. By putting people at the centre of what we do – both clients and employees. If we follow this path, we will be much more successful.\nWe have also taken the first steps in this regard. Last year, for example, we launched the “Intrapreneur” initiative, which enables our employees to develop and execute business ideas like entrepreneurs. And after just six months, it has already unleashed potential in our bank that I wouldn’t have thought possible. The first round produced 13 entrepreneurial ideas, and we’re now implementing three of those. By year-end, we expect these will produce additional revenues.\nLadies and Gentlemen, we have so much potential in this bank, we have so much talent within our ranks that we can surprise our clients and ourselves every day. We just have to provide the necessary tools and clear away the obstacles. Besides integrity and teamwork, there is another attribute we have to rediscover that has made this bank great: entrepreneurial spirit.\nThis also requires inspirational leaders who set a good example and are open to new ideas. That is what I expect of my Management Board team. We are the ones who must drive this change and identify with this change. This must be what we aspire to. Only those who embody this leadership style belong with us.\nSustainability\nLadies and Gentlemen, I’ve now set out specifically how we intend to position your and our Deutsche Bank and the principles which will guide us in our transformation. We want to be a bank that is entirely client-centric, we want to be the employer of choice for ambitious individuals and we want to have a positive impact on society – a bank our employees can once again be proud of.\nFor that, one thing is essential: we must act in a sustainable way – from the perspective of the environment and the communities we operate in.\nHaving a sustainable business strategy is not just window dressing to gain positive publicity. It’s a prerequisite to make sure we retain our licence to operate.\nFor that reason, we as Deutsche Bank must also play our part in climate protection and sustainable development – in the way we extend credit, through the products we offer, and through the principles and policies we live by.\nI consider it my personal responsibility as CEO to focus on this. For this reason, I have decided to now assume the role of Chairman of our Sustainability Council, which has been taking action in a number of directions since last spring. We are introducing more stringent internal policies and we are embedding sustainability into our business across Deutsche Bank Group. In future, we aim to finance fewer projects with fossil-fuel energy suppliers and we’re working on targets to support that. And by year-end we aim to decide on a plan to increase our sustainable product and service offering.\nConclusion\nLadies and Gentlemen, I am firmly convinced that every company plays a role in society which reaches beyond pure economics. Today, on this very day, the Federal Republic of Germany is 70 years old. And during this time Deutsche Bank has played an important role in building our country and helping it grow. This legacy is a duty for us: we want to play our part in addressing important economic, political and social issues. And we want to play our part in shaping a positive future for this country.\nWe’ll have to work hard if we want to remain competitive on the world stage. This task is one that society as a whole must embrace, one that citizens, the state and the economy can only master together.\nAnd we as Deutsche Bank want to make our positive impact. Our economic success is the key to this – as a global, but focused bank that is deeply rooted in Germany and Europe but with a worldwide network.\nLast year this Management Board proved one thing: we keep our promises. Your bank, Deutsche Bank, is robust, more client-centric and has its costs under control. But this is only the beginning. We must, and will, go further. We are on the right track. And we are determined to accelerate the transformation now with all our energy and absolute focus. With modesty and with pride.\nAnd that is exactly what I am asking you to support.\nMany thanks.\n\nAnnual General Meeting 2019",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 1
}