{
    "url": "https://www.db.com/news/detail/20190520-fresh-off-the-press-mapping-the-world-s-prices-2019?language_id=1",
    "language": "DE",
    "article_type": "Research",
    "publish_date": "May 20, 2019",
    "tags": [
        "Research"
    ],
    "title": "Fresh off the press: Mapping the World's Prices 2019",
    "body": "Play\nVideo\nThe 8th annual survey of global prices and living standards from various countries and cities around the world is out! In this year’s report Deutsche Bank Research highlights the cities that have seen the biggest change not only over the last year but also over the last five years.\nZurich no longer pays the highest salaries…\nThe long-standing dominance of Zurich as the city with the highest salaries and disposable incomes (after rent) is over. Taking its place is San Francisco. The US city has climbed a stunning seven and 21 places on these two measures over the last five years. And it’s climbed seven places in the same period in our quality of life index.\nSan Francisco is not the only US city to climb the league tables: New York, Boston and Chicago have all entered the top five spots in terms of salaries and disposable incomes – a far cry from the cities we surveyed back in 2012 where we found salaries there were competing to be in the top 10, not dominating the top five as they do today.\n…but it’s back in at the top in terms of quality of life\nEdging Wellington back into second place in terms of quality of life, Zurich is now back at the top, followed by Copenhagen in third place. Major European cities seems to falling down this list; Frankfurt has fallen four places this year (now number 13) from the number one spot five years ago. Find out why on our dedicated microsite.\nYou’ll also find out where (not) to go for an expensive weekend break, which cities are the most expensive for smokers, where a haircut will set you back the most or where you should go if you want a cheap new iPhone.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}