{
    "url": "https://www.db.com/news/detail/20200930-deutsche-bank-sets-parmesan-production-on-a-roll?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 30, 2020",
    "tags": [
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Deutsche Bank sets parmesan production on a roll",
    "body": "Deutsche Bank, together with Italy’s Banco BPM and other syndicate banks, on Monday announced a loan of 27.5 million euros to Brescia Group’s Ambrosi SpA, a leading Italian company which specialises in the production and ageing of Grana Padano and Parmigiano Reggiano DOP cheeses.\nIn a first for Deutsche Bank in Italy, the 5-year loan is secured by Ambrosi SpA’s own inventory of parmesan cheese, which today in Italy has become a more “liquid asset” than property.\nAfter a maturing process that lasts at least two years, premium Italian cheeses such as the Grana Padano and Parmigiano Reggiano DOP fetch prices of between 550 and 740 euros per wheel on the open market.\nThe proceeds of the loan will be utilised to enhance Ambrosi SpA’s ability to export world class, Italian made cheeses around the world, starting from the new facility built to hold a total of 120,000 cheese wheels, increasing the company’s cheese production capacity by 20 percent.\nFounded in 1942, with its headquarters in the Lombardy province of Brescia, Ambrosi SpA is one of the leading Italian producers and distributors of premium traditional Italian cheeses. In 2019, the company reported consolidated revenues of 440 million euros, with a 46 percent share of the total export market. Ambrosi products are marketed in 60 countries worldwide.\nGermany is the first and largest market after Italy for the group, which also has direct branches in the US, France and the United Kingdom. In the first six months of 2020, despite the restrictions on catering activities due to Covid-19, the group recorded a 10 percent increase in turnover, thanks above all to sales in supermarkets.\nAs the largest foreign bank in Italy, Deutsche Bank has a close relationship with many medium-sized companies in Italy with strong exports. Especially during the current coronavirus crisis, the bank in Italy aims to help customers secure and expand their business.\nThis week’s announcement provides further proof of Deutsche Bank's commitment to some of the most dynamic exporting companies in Italy, a commitment that has not faltered even in the most complicated and difficult phases of the Covid-19 emergency.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}