{
    "url": "https://www.db.com/news/detail/20200930-deutsche-bank-gives-esg-investors-greater-choice?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 30, 2020",
    "tags": [
        "Asset Management",
        "Corporate products",
        "Research",
        "Sustainability"
    ],
    "title": "Deutsche Bank gives ESG investors greater choice",
    "body": "A new credit derivatives benchmark designed to encourage ESG investing has now started clearing though the London Stock Exchange’s LCH CDSClear service, with Deutsche Bank executing and clearing the first ever trade. The client on this transaction was Union Investment, a leading German fund manager.\nThe iTraxx MSCI ESG Screened Europe index allows a broad range of investors, including fund managers, pension funds, banks, insurance companies and hedge funds, to invest in bonds issued by European companies, screened by their ESG credentials. The index is based on the iTraxx Europe index series and tracks some of the most liquid parts of the European credit default swaps market. It then filters out entities that do not meet certain strict ESG criteria.\nOffering clearing for trades in this index helps investors manage counterparty risk better and increases liquidity, thereby helping the industry increase its focus on sustainability-linked products.\nThe index launched in June this year, with Deutsche Bank one of the first banks to make markets in derivatives linked to it.\nCommenting on the trade, Deutsche Bank’s Head of OTC Clearing, Florian Peter, said: “Facilitating clearing access to this new ESG index series at CDSClear supports our commitment to sustainable investment and demonstrates our ability to respond quickly to our clients’ priorities. CDSClear’s offering will provide significant margin and operational benefits.”\nSylvain Lebre, Head of European Credit Derivatives Trading at Deutsche Bank, said: “This new, innovative product matches a number of the evolving investment requirements of our client base. CDSClear will bring additional liquidity to this product.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}