{
    "url": "https://www.db.com/news/detail/20200914-deutsche-bank-provides-usd43-million-structured-trade-finance-facility-to-cntic-for-electricity-generation-project-in-rural-myanmar?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 14, 2020",
    "tags": [
        "Corporate products"
    ],
    "title": "Deutsche Bank provides USD43 million structured trade finance facility to CNTIC for electricity generation project in rural Myanmar",
    "body": "Deutsche Bank (China) Co., Ltd today announced that it has provided a USD43 million Account Receivable Purchase facility to China National Technical Import & Export Corporation (‘CNTIC’) for the construction of a gas-fired power generation project in Myanmar.\nBacked by China Export & Credit Insurance Corporation, the mid-tenor facility is supporting a 90 megawatt plant located in Myingyan township, in the Mandalay region. The power plant is developed and operated by Hong Kong-based VPower under a 5-year power purchase agreement with Electric Power Generation Enterprise (EPGE) of Myanmar.\nMyanmar has been facing the challenges of electricity deficit due to its increasing demand and the underperformance of traditional hydropower generation caused by unfavorable weather conditions.\nVPower is a leading owner and operator of distributed power stations in Myanmar, aiming at producing reliable and stable electricity to enhance the basic standard of living of Myanmar people.\nFor this project, VPower spearheaded initiatives to improve the quality of life within the local community, such as creating job opportunities and repairing of community infrastructure.\nCNTIC has been appointed as Engineering, Procurement and Construction (EPC) Contractor for this project, which entered into commercial operations in February 2019 and will generate a minimum of 630 gigawatt hours of electricity per year.\nCNTIC, a large-scale state-owned enterprise and a wholly-owned subsidiary of China General Technology (Group) Holding Ltd. (‘Genertec’), has been developing and constructing power infrastructure projects in the countries covered by the Belt and Road Initiative. Through a long-term partnership, CNTIC and VPower have established a solid track record in executing power projects on an expedited basis.\nMs. Hu Ping, Project Manager of this project at CNTIC, said: “We are proud to be working on this important initiative in Myanmar and pleased to be partnering with Deutsche Bank for this trade finance facility. The bank’s track record in managing complex structures, combined with their focus on understanding our needs was a key differentiator in our choice of banking partner.”\nMr. David Lynne, APAC Head of Corporate Bank at Deutsche Bank, said: “We are proud to be involved in financing this project, which represents essential electricity supply to the electricity-challenged state of Myingyan. We look forward to continuing to work with CNTIC and VPower and to helping more corporations in this sector.”\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\n\nThis press release has been approved and/or communicated by Deutsche Bank AG or by its subsidiaries and/or affiliates (“DB”). Deutsche Bank AG is authorized under German Banking Law (competent authority: BaFin - Federal Financial Supervisory Authority) and by the Prudential Regulation Authority and subject to limited regulation by the Financial Conduct Authority and Prudential Regulation Authority.\nDetails about the extent of our authorization and regulation by the Prudential Regulation Authority, and regulation by the Financial Conduct Authority are available from us on request. Securities and investment banking activities in the United States are performed by Deutsche Bank Securities Inc., member NYSE, NASD and SIPC, and its broker-dealer affiliates. Lending and other commercial banking activities in the United States are performed by Deutsche Bank AG, and its banking affiliates. Copyright (C) 2020 Deutsche Bank AG",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}