{
    "url": "https://www.db.com/news/detail/20200911-deutsche-bank-recognised-for-exceptional-client-service-and-innovative-risk-management-in-asia-including-crisis-response-of-the-year?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 11, 2020",
    "tags": [
        "Awards",
        "Capital markets",
        "Company",
        "Investment Banking"
    ],
    "title": "Deutsche Bank recognised for exceptional client service and innovative risk management in Asia, including crisis response of the year",
    "body": "Deutsche Bank’s Investment Bank in Asia has topped UK trade publication Risk.Net’s Asia Risk awards this year with three house awards, winning the coveted titles Crisis Response of the Year, Market Maker of the Year and Deal of the Year.\nCrisis Response of the Year\nDescribing the bank’s response to the Covid-19 crisis, Asia Risk Asia bureau chief Blake Evans-Pritchard credited Deutsche Bank for “displaying a very high level of commitment to customers, being one of the few banks that was able to continue providing 24-hour liquidity on Asian products.”\nDeutsche Bank’s APAC Chief Operating Officer for Investment and Corporate Banks Michael Connolly said: “We are extremely proud to win these awards which are testament to the resilience and stability of our bank’s platform and our ability to remain client-focused during unprecedented times. We rose to the challenge of Covid-19, providing continual market liquidity and innovation. It is terrific to be recognised as a standout among peers during this extraordinary period in history,” he said.\nAsia Risk also recognised the bank’s technology and culture of good communication during the pandemic.\nMarket Maker of the Year\nThe bank’s stability and continual liquidity provision during the extremely volatile days of Covid-19 also won Deutsche Bank the title Market Maker of the Year.\nHead of Asia Local Markets Trading within the bank’s Global Emerging Markets business, Ashok Das said: “During the height of volatility, we continued providing clients with prices and to make markets, even when some markets closed without notice. We provided 24x5 prices for all our clients even on traditionally illiquid products like synthetic notes or structured products. That won us a lot of respect and market share.”\nAsia Risk said Deutsche Bank’s ability to capture market share in stressed conditions was a validation of investment in our trading architecture over previous years – combined with an obviously high level of resilience from front to back office, which helped the bank and its clients navigate the choppy waters of the Covid-19 crisis.\nDeal of the Year\nAsia Global Emerging Markets’ innovative solutions won Deal of the Year for the second year in a row.\nAsia Risk was impressed by our execution of a sustainability-linked FX forward, which broke new ground for ESG finance in the Asia region. The deal showed how financial derivatives that meet clients’ hedging needs can be linked to a client’s performance against a set of sustainability targets, paving the way for the launch of a wider range of sustainability-linked derivative products in the future.\nAsia Head of Sustainability and Special Situations. Rahul Jain said: “This award recognises how financial innovations can help drive sustainability by supporting the social, governance, and environmental efforts of clients.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}