{
    "url": "https://www.db.com/news/detail/20200910-deutsche-bank-wins-world-s-best-bank-transformation-in-prestigious-euromoney-awards?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 10, 2020",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Deutsche Bank wins \"World's Best Bank Transformation\" in prestigious Euromoney awards",
    "body": "Deutsche Bank has won a prestigious Euromoney award for “World's Best Bank Transformation” for the progress it has made in the strategic transformation it launched last year to become stronger, more efficient and better positioned for the future.\n“It’s clear that Deutsche Bank has resisted the distractions in market conditions that might have grabbed all its attention in the past,” the editorial team of the leading industry publication wrote in announcing the award today. “Its transformation is still a work in progress, but its achievements so far deserve recognition.”\nDeutsche Bank’s “compete to win” strategy, announced in July last year, was to refocus on its core strengths, to do so within its own, existing capital resources, and to become sustainably profitable. It aimed to become more stable, innovative, trustworthy, excellent – and relevant, to its clients, to its investors, and to society as a whole.\n“Hard work pays off,” said Christian Sewing, Chief Executive Officer in a note to employees, thanking them for their “passion and contribution”. “Our transformation is gaining traction, not just in financial terms but also in tonality and recognition from all of the bank’s stakeholders”, he said.\nThe bank set clear short-term and mid-term targets and accountabilities for financial and non-financial objectives through to 2022 and has achieved all of its major objectives since then.\nIt completed business exits, including cash equities trading and equity derivatives, agreed on the transfer of Global Prime Finance and has been reshaping businesses, including Rates. It has significantly reduced Risk Weighted Assets through the Capital Release Unit; is delivering significant cost reductions on target; and, despite the challenges of the coronavirus crisis, has maintained a strong capital ratio above the threshold.\nRecent landmarks have included launching the International Private Bank; merging the German legal entities; reorganising DWS; integrating the Corporate Bank in Germany; and creating a holistic Chief Risk Office function.\n“Deutsche Bank is changing for the better,” said Fabrizio Campelli, Management Board member and Chief Transformation Officer, who made the formal pitch for the award. “This is a different bank that is building a genuinely client-driven strategy.”\nThe Chief Transformation Office was created last November to drive and support the transformation, partnering across the organisation on initiatives such as the move to a cloud platform; Fixed Income and Currencies (FIC) transformation; acceleration of the Corporate Bank’s growth strategy; and infrastructure projects, including data strategy and front-to-back process reengineering.\nEuromoney’s Awards for Excellence have been running since 1992 and last year attracted almost 1,500 submissions from around the world. This year’s awards took into account how the winners have responded to the coronavirus crisis through their “ability to adapt their business to changing circumstances, provide solutions to clients, keep markets and funding channels open and protect all their stakeholders,” Euromoney said.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 20
}