{
    "url": "https://www.db.com/news/detail/20240119-deutsche-bank-hires-dino-siason-to-be-chief-country-officer-for-the-philippines?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "January 19, 2024",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank hires Dino Siason to be Chief Country Officer for the Philippines",
    "body": "Deutsche Bank today announced it has hired Rodolfo ML Siason (Dino) to be Chief Country Officer and Head of Corporate Bank for the Philippines, effective April 1, 2024, subject to necessary regulatory approvals.\nSiason will lead Deutsche Bank’s 1,500 strong platform in the Philippines. He will be responsible for the Corporate Bank and Investment Bank, along with one of the bank’s two key service hubs in Asia Pacific, serving critical back and middle office functions globally. Siason will replace Michael Chua, who is retiring after working in the banking industry for nearly 30 years.\nUnder Chua’s leadership as CCO, Deutsche Bank’s Philippines business achieved significant revenue growth and successfully executed a number of landmark transactions.\nSiason will report to Burkhard Ziegenhorn, Head of Corporate Bank for Southeast Asia and Australia and Kaushik Shaparia, CEO, Emerging Asia and Chief Country Officer of India.\nSiason brings more than 20 years of financial institutions experience to this role and spent nearly 18 years with Citibank in the Philippines, Singapore and the Czech Republic. Most recently, he was Citi’s Head of Treasury and Trade Solutions for the Central Europe Cluster, based in Prague. Throughout his career, he has held a wide range of roles across credit, client coverage and franchise management, with a strong focus on enabling clients to become more global. Siason will relocate to Manila.\nBurkhard Ziegenhorn said: “Dino will play a leadership role in taking our Corporate Bank in the Philippines to the next level. His global client coverage and product expertise combined with his deep local market knowledge, will help further differentiate Deutsche Bank in the Philippines/ We are thankful to Mike for his dedicated leadership with the bank; he hands over a strong platform poised for further success. We have built many trusted and valued relationships here over past decades, and I am confident that Dino will significantly enhance and grow these over the years to come.”\nKaushik Shaparia commented: “We are proud of our 48-year history in the Philippines and committed to growing in this increasingly important market. We’re delighted that our strong platform has attracted high quality talent like Dino, and look forward to him leading our franchise from strength to strength in the Philippines.”\nDeutsche Bank first launched its presence in Manila in 1977 and obtained its full commercial banking license in 1995. In 2023, Deutsche Bank Philippines was recognized by Euromoney as ‘Best Trade Finance Service Provider’ for the sixth consecutive year and ‘Best Cash Management Service Provider for Corporates’. The Asset also awarded the bank ‘Best Domestic Custodian’ for the sixth consecutive year and ‘Best in Treasury and Working Capital Multinational Company’.",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 43
}