{
    "url": "https://www.db.com/news/detail/20250318-deutsche-bank-and-dws-launch-private-credit-cooperation?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "March 18, 2025",
    "tags": [
        "Asset Management",
        "Investment Banking"
    ],
    "title": "Deutsche Bank and DWS launch private credit cooperation",
    "body": "Deutsche Bank and DWS to cooperate in private credit to leverage respective strengths in origination and investment management\nCooperation agreed with Deutsche Bank as DWS seeks to accelerate growth in its Alternatives franchise\nDeutsche Bank and DWS today announced the launch of a strategic cooperation to develop private credit origination and investment opportunities for DWS clients across the private credit space. As part of the cooperation, DWS will have preferred access to certain asset-based finance and direct lending opportunities originated by Deutsche Bank.\nThis strategic cooperation brings together Deutsche Bank’s market leadership in Fixed Income market access, liquidity provision, and financing capabilities, and the investment heritage and expertise offered by DWS’s EUR 110bn (as of 31 Dec 2024) alternatives platform. The cooperation enables DWS to leverage Deutsche Bank’s extensive sourcing and origination capabilities to provide additional private credit investment opportunities to its global client base.\nAt the same time, Patrick Connors will move to DWS from his current role as the European Head of the Global Credit Financing and Solutions business at Deutsche Bank to become Global Head of Private Credit at DWS. He will report to CEO Stefan Hoops. Patrick has over 20 years of experience in the private financing and credit markets and has a very broad range of expertise across all areas of the private credit market particularly in Asset-Based Finance. \nStefan Hoops, CEO at DWS, said: “Private Credit is a key offering for our clients who are looking for exposure to real-economy investments. Origination is the main differentiator for Alternative Asset Managers, especially for asset-based finance which requires very different origination channels than direct lending. Combining Deutsche Bank’s extensive and established origination expertise and wide range of real economy relationships, with DWS’s 50 years of experience in managing Alternatives is a logical step. We are excited to cooperate with Deutsche Bank across the spectrum of Private Credit and to significantly enhance our alternative credit capabilities.”\nRam Nayak, Co-Head of Investment Banking & Global Head of Fixed Income & Currencies at Deutsche Bank, added: “We are pleased to be partnering with DWS to develop private credit investment opportunities for investors. Investor demand for private credit assets is strong and we have a market leading financing business with a long track record in private credit origination across all asset classes going back more than two decades. With over EUR 1 trillion of assets under management and a global distribution network, as well as close ties to Deutsche Bank, DWS is the ideal partner to leverage our expertise, delivering our offering to their clients.”\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nCharlie Olivier\nPhone: +44 (0) 20 754 57866\nEmail: charlie.olivier@db.com\n  DWS\nNick Bone\nPhone: +44 (0) 20 754 72603\nEmail: nick.bone@dws.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}