{
    "url": "https://www.db.com/news/detail/20250307-deutsche-bank-launches-flagship-podcast-this-is-deutsche-bank?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "March 7, 2025",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank launches flagship podcast – This is Deutsche Bank",
    "body": "                                 CEO Christian Sewing speaks to host Michael Steen, Head of External Communications and Newsroom\nTune in today to “This is Deutsche Bank”, a new podcast all about the news and trends shaping the world of banking and finance.  \nIn the launch episode, CEO Christian Sewing speaks to host Michael Steen, Head of External Communications and Newsroom, about the fall-out from Germany’s Federal election, reforming the country’s debt brake, and how Europe should react to shifts in the transatlantic relationship. \n“We need a government which is stable, clear about its reforms and very much driven by the geopolitical challenges we have in the world. We need clear answers. And that cannot only be a German answer - it needs to be a European answer.” \nThe CEO also talks about the role of banks in this increasingly volatile environment and what’s next for Deutsche Bank. \n“If you want to have direction and clear strategies in this world, it is good to have a bank which is active in around 60 countries with local expertise and local stakeholder knowledge. That's what we can do. That's where we are.”\nChristian Sewing, CEO\nThe world is changing at an ever-increasing pace. With the help of the bank’s leaders and experts, This is Deutsche Bank’s regular episodes will look at what these changes mean for the banking industry through stories, ideas, and developments from our work across the world.  \nThis is Deutsche Bank is also available as a video podcast on YouTube and on all major podcast platforms, such as Apple Podcasts and Spotify. Subscribe today to receive new episodes.",
    "number_of_ratings": 4,
    "rating": 5.0,
    "likes": 9
}