{
    "url": "https://www.db.com/news/detail/20240531-best-custody-services-provider-in-emerging-markets?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "May 31, 2024",
    "tags": [
        "Asia-Pacific",
        "Corporate products"
    ],
    "title": "Best Custody Services provider in Emerging Markets",
    "body": "Deutsche Bank’s Securities Services business won several accolades including Best Custody Provider in Emerging Markets at Global Custodian’s Leaders in Custody Awards held across London and Singapore. These awards highlight Deutsche Bank's dedication to delivering a seamless custody experience for clients.\nThe bank won the following awards:\nVoted by Network Managers - Best Provider - Emerging Markets Overall\nVoted by Network Managers - Best in Emerging Markets Asia\n Agent Bank of the Year – Emerging Markets Overall\nBest in Class for custody services – Overall, Asset Servicing – Asia\nEditors’ Choice award, Asset Servicing Partnership of the Year – in partnership with CIMB Islamic Bank\nEditors’ Choice award, Innovation in AI technology – Project Aggie in partnership Kodex AI \nThe innovation award for Project Aggie demonstrates the Securities Services team’s focus on embracing new technology and innovation. The solution uses a large language model (LLM) prototype to analyse regulatory texts in local market language, while providing a fully referenced summary output or impact analysis in English helping clients navigate the regulatory landscape. \nThe awards are a further endorsement of Deutsche Bank’s sustained performance in emerging markets and its Global Hausbank strategy of serving its clients’ evolving needs by offering a comprehensive suite of solutions across all its businesses.\nWe are immensely proud of our success at the Global Custodian awards in Singapore and London recently and in particular our success in the ‘Best Custody Provider in Emerging Markets’ category. This accolade is particularly important because it was voted on by Network Managers globally, our clients.\nPaul Maley, Head of Securities Services\n“We are also delighted to receive the Editor’s Choice for Innovation in AI technology for Project Aggie in partnership with Kodex AI, a LLM prototype to analyse regulatory texts in local market language, while being accessible and searchable in English,” Paul added.\n“And a hearty congratulations must also go to our partners at CIMB Islamic Bank with whom we shared the Editors’ Choice award for Asset Servicing Partnership of the Year, based on our new Shariah-compliant domestic custody offering in Malaysia. We are very proud on behalf of all our colleagues that contributed to this success.”",
    "number_of_ratings": 11,
    "rating": 5.0,
    "likes": 12
}