{
    "url": "https://www.db.com/news/detail/20240523-deutsche-bank-returns-to-the-japanese-yen-market-with-multi-tranche-bond-issuance?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "May 23, 2024",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank returns to the Japanese Yen market with multi tranche bond issuance",
    "body": "Deutsche Bank announced today that it has successfully issued Euro-Yen-denominated bonds of 64.3 billion Japanese Yen (JPY) in a multi-tranche offering. This is Deutsche Bank’s first access to financing in the JPY market in 9 years since 2015, taking into account investor needs, where interest rates remain low even after the end of the negative interest rate policy in Japan.\nDeutsche Bank’s re-entry into the JPY market represents the strength of its transformation. It follows upgrades from all major rating agencies and recent successful issuances in the Panda bond and Singaporean dollar markets in Asia Pacific earlier this year.\nThomas Rueckert, Deutsche Bank Treasury, said: “As a Global Hausbank, Deutsche Bank always aims to broaden and diversify its investor base targeting all markets where the bank is active. The Japanese Yen market has always been a key market for Deutsche Bank and offers attractive opportunities to fulfil our annual funding plan at attractive conditions.”\nThis issuance reflects our strong commitment to the Japanese market and the confidence investors have in Deutsche Bank’s strategy and financial health. \nTamio Honma, Deutsche Bank’s Chief Executive Officer for Japan and APAC Head of Institutional Client Group\nDeutsche Bank has expanded its presence in Japan to enhance its competitive edge and cater the specific needs of Japanese or global clients. Deutsche Bank Japan’s bottom line for its securities business grew in 2023 to the highest in at least six years.\nDeutsche Bank AG                                       \nMedia Relations                                           \nTokyo\nPhone: +81 3-5156-7709\nEmail: tokyo.communications@db.com\nMia Popplewell\nPhone: +61 439528842\nEmail: mia.popplewell@db.com  \n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 3
}