{
    "url": "https://www.db.com/news/detail/20240517-european-investment-bank-and-deutsche-bank-launch-mortgage-programme-for-climate-friendly-housing-and-energy-efficient-home-modernisation-in-germany?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt / Luxembourg, May 17, 2024",
    "tags": [
        "Germany",
        "Capital markets",
        "Company",
        "Private products",
        "Sustainability"
    ],
    "title": "European Investment Bank and Deutsche Bank launch mortgage programme for climate-friendly housing and energy-efficient home modernisation in Germany",
    "body": "The programme will grant discounted mortgages totalling more than 600 million euros to individuals in Germany looking to build climate-friendly houses or to make their homes more energy-efficient.\nThe European Investment Bank supports the programme by guaranteeing a 150-million-euro mezzanine tranche in a consumer loan securitization with Deutsche Bank.\nDeutsche Bank passes on the resulting advantage to its clients.Deutsche Bank’s Private Bank has started offering discounted mortgages through Deutsche Bank and DSL Bank. Corresponding products from BHW Bausparkasse are expected to follow at the beginning of June.\n  Deutsche Bank and the European Investment Bank Group, consisting of the European Investment Bank and the European Investment Fund, have signed an agreement to promote climate-friendly new builds and energy-efficient home modernisation in Germany. The aim is to support private individuals in Germany by granting them low-interest loans when building new, climate-friendly houses or when modernising their houses to make them more climate-friendly with a focus on energy efficiency. \nThe European Investment Bank (EIB) Group is making the more favourable conditions possible through a synthetic securitisation of consumer loans. The transaction frees up regulatory capital for Deutsche Bank who passes on the associated advantages with the transaction to clients in the form of discounted mortgages. The securitisation falls under the framework for simple, transparent and standardised securitisations (STS) of the European Secruitisation Regulation.\nDeutsche Bank will grant the discounted loans in its Private Bank through Deutsche Bank, DSL Bank and, expected from the beginning of June, BHW Bausparkasse. The interest rate advantage currently amounts to 0.2 percentage points p.a. compared to the standard condition for the entire first fixed interest rate term, provided this is at least five years.\nTo be granted a mortgage, borrowers must meet particularly demanding sustainability criteria.  For example, individuals looking to finance a modernisation are required to reduce the property’s primary energy demand by at least 30 percent.\nThe overall intended outcome of the cooperation is to provide more than 600 million euros worth of low-interest mortgages to help individuals in Germany build climate-friendly houses.\n“Climate-friendly housing is a top priority for people because it helps them reduce energy costs and enhances their comfort and well-being,” said EIB Vice-President Nicola Beer, who is responsible for operations in Germany. “Our cooperation with Deutsche Bank will enable thousands of households in Germany to construct green homes or improve the climate footprint of existing houses.”\n“We are always looking for opportunities to accelerate the green transition,” said EIF Chief Executive Marjut Falkstedt. “Our transaction with Deutsche Bank is an excellent example. It will free-up financing for people who would like to enhance the sustainability of the apartments and houses they live in or are planning to build. This is good news for them and for Germany.”\nAchim Kuhn, Head of Product Management at Deutsche Bank, added: \"The important cooperation with the EIB Group enables us to expand our mortgage financing business and offer clients additional financing options. By offering favourable conditions for mortgages, we can specifically help individuals who want to invest in energy-efficient housing. As a reliable partner to our clients, we are taking a big step forward together in reducing energy consumption and CO2 emissions and protecting the environment.\"\n\nFor further information please contact:\nDeutsche Bank\nOliver Rittmaier\nE-mail: oliver.rittmaier@db.com\nPhone: +49 228 920-12126, Mobile: +49 170 3358979\nEIB\nDonata Riedel\nE-mail: d.riedel@eib.org\nPhone: +49 30 590047-90, Mobile: +49 151 14659021",
    "number_of_ratings": 3,
    "rating": 5.0,
    "likes": 3
}