{
    "url": "https://www.db.com/news/detail/20240516-number-1-transaction-bank-in-asia-pacific?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "May 16, 2024",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Number 1 Transaction Bank in Asia Pacific",
    "body": "Deutsche Bank was recognised as the Best Transaction Bank in Asia Pacific at The Asset’ Triple A Treasurise Awards this week This recognition was given for the bank's strong commitment to assisting clients in achieving success in global trade corridors. \nThe bank received multiple awards from The Asset last month for its success in providing clients with its Global Hausbank offering, including recognition for Best Structured Trade Finance, Best New Economy, and Best NBFI Bank in APAC. \nDeutsche Bank won a total of 84 awards at The Asset awards this year, including 13 in-country bank, 45 best client solutions, two client leadership and 19 individual achievement awards. \n “Deutsche Bank has been a steadfast partner for many CFOs and treasurers determined to transform their respective treasury functions. Over the course of the review period, the bank demonstrated the ability to craft complex and bespoke solutions for clients in multiple sectors, whether it be improving cross-border liquidity or helping companies find off-balance sheet financing solutions,” The Asset commented.\nThe publication also noted that the bank received positive feedback from its clients, including leading corporates and emerging new-economy companies, through one-on-one interviews and Asset Benchmark Research's Treasury Review 2024. Clients praised the bank's thorough understanding of local regulations, which helped them streamline their operations effectively.\nDeutsche Bank has committed substantial resources to improving its technology stack, including ramping up efforts in instant payments adoption and AI usage for fraud detection. The bank’s workflow FX solution has been a game changer for clients, allowing for hedging activities in 130 currencies.\nThe Asset\n“We are deeply dedicated to our clients’ success in the region and across the world. This award is testimony to our client-centric approach and coherent regional strategy,” said Global Head of Cash Management and Corporate Bank for APAC and MEA, Ole Matthiessen. “It reflects our ability to understand our clients’ needs and empower them in their strategic treasury evolution. And it showcases the exceptional dedication and world-class expertise of our team and infrastructure partners, who I hope feel as proud of this award as I do.”\nThe Asset’s rigorous evaluation process includes client feedback from the publication’s Annual Benchmark Survey, in-depth client interviews, and detailed awards pitches.  ",
    "number_of_ratings": 3,
    "rating": 5.0,
    "likes": 4
}