{
    "url": "https://www.db.com/news/detail/20150316-deutsche-bank-closes-usd-50-million-essential-capital-consortium-fund?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "March 16, 2015",
    "tags": [
        "Capital markets",
        "Company",
        "Investment Banking"
    ],
    "title": "Deutsche Bank closes USD 50 million Essential Capital Consortium fund",
    "body": "Deutsche Bank’s Global Social Finance Group today announced the closing of the Essential Capital Consortium (ECC), a five-year USD 50 million social enterprise fund, which is part of its family of social impact funds first launched in 2005.\nWith a list of investors including Church Pension Fund, MetLife, Inc., Agence Française de Développement (the French Development Agency), Deutsche Bank, Calvert Foundation, Prudential Financial, Inc., the Multilateral Investment Fund, member of the Inter-American Development Bank Group, Left Hand Foundation, IBM International Foundation, Tikehau Capital, Salvepar, Cisco Foundation and the Posner-Wallace Foundation, the ECC will provide debt financing to social enterprises in the energy, health and Base of the Pyramid financial services sectors. The Swedish International Development Cooperation Agency (Sida) is also providing ECC with crucial credit enhancement support.\nThe ECC, which will finance 25 social enterprises including microfinance institutions (MFIs) expanding their offerings of financial products, has made its first round of loans to three organizations: Sproxil, a developer of a patented text message-based drug authentication system; Tiaxa, a provider of “nanocredits” to poor consumers in developing countries via mobile phones using big data analytics; and Arvand, a Tajikistan-based MFI providing innovative “green loans” to finance solar panels, clean cookstoves and other energy efficient products.\n“The Essential Capital Consortium is a pioneering fund that aims to finance the growth of social enterprises as vehicles to achieve measureable benefits in improving the lives of the poor, bringing together well-respected and similarly motivated investors to fill an existing capital gap,” said Gary Hattem, Head of the Global Social Finance Group at Deutsche Bank. “As part of Deutsche Bank’s ongoing commitment to microfinance and the impact industry, the ECC provides responsive debt capital to support the next generation of social entrepreneurs globally who are redefining a market approach to addressing fundamental humanitarian challenges.”\nDeutsche Bank was the first global bank to establish a socially motivated microfinance fund in 1997, managed by its Global Social Finance Group. Since then, the Bank has partnered with more than 130 MFIs in more than 50 countries, benefitting as many as 3.8 million low-income entrepreneurs through USD 1.67 billion in financing.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}