{
    "url": "https://www.db.com/news/detail/20150311-deutsche-bank-statement-regarding-the-federal-reserve-s-2015-dfast-and-ccar-results?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "March 11, 2015",
    "tags": [
        "Financial Results"
    ],
    "title": "Deutsche Bank statement regarding the Federal Reserve's 2015 DFAST and CCAR results",
    "body": "Deutsche Bank Bank (XETRA: DBKGn.DE / NYSE: DB) today responded to the announcement by the Board of Governors of the Federal Reserve (the Fed) of the 2015 results of the Dodd Frank Act Stress Test (DFAST) and Comprehensive Capital Analysis and Review (CCAR) processes. Deutsche Bank Trust Corporation (DBTC), a unit of Deutsche Bank AG that accounts for less than 5% of the Bank’s global assets, was the only first-time participant in the processes.\nDFAST\nOn March 5, the Fed announced that DBTC would maintain capital ratios well above the required minimum levels during times of economic and financial stress based on CCAR parameters. Even in a severely adverse economic scenario, DBTC’s projected Common Equity Tier 1 ratio would exceed the regulatory minimum level and would not fall below 28.6% over the nine-quarter planning horizon, while DBTC’s Tier 1 Leverage ratio would also exceed the regulatory minimum and would not fall below 11.0%.\nCCAR\nToday, the Fed announced that it objected to the DBTC capital plan for qualitative reasons, which did not include any planned dividend or share repurchases. Deutsche Bank is committed to strengthening and enhancing its capital planning process.\nDeutsche Bank has hired 1,300 employees dedicated to ensuring that its systems and controls are best in class and has hired over 500 employees across its various control functions in the US. These hires are part of a previously announced EUR 1 billion investment to support a sustainable long-term strategic architecture.\nDBTC’s disclosures related to DFAST and CCAR results may be found at: https://www.db.com/ir/en/reports-and-events.htm\nThe public disclosure of the Federal Reserve’s CCAR results for DBTC and all other participating companies is available on the Federal Reserve’s website.\n\nFor further information, please contact:\nDeutsche Bank AG\nPress Relations\nMichele Allison\nPhone: +1(212) 250-4735\nmichele.allison@db.com\nRenee Calabro\nPhone: +1(212) 250-5525\nrenee.calabro@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 55
}