{
    "url": "https://www.db.com/news/detail/20150303-stephen-a-ross-receives-the-deutsche-bank-prize-in-financial-economics-2015?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "March 3, 2015",
    "tags": [
        "Awards",
        "Company"
    ],
    "title": "Stephen A. Ross receives the Deutsche Bank Prize in Financial Economics 2015",
    "body": "Jury Chairman and CFS Director Jan Pieter Krahnen explained the decision of the international Jury: “The Jury has chosen Professor Ross for his groundwork and fundamental contributions to the analytical development of financial economics. For more than 25 years major models developed by him have marked the economic world. His models relate to the theory of asset pricing, the analysis of the term structure of interest rates, understanding option prices, and the basic structure of the principal-agent problem. The work of Stephen a. Ross has shaped today’s thinking in financial innovation, practice and policy.”\nDeutsche Bank Prize in Financial Economics: an award for exceptional achievements in macroeconomics\nThe academic prize is sponsored by the Deutsche Bank Donation Fund and carries an endowment of €50,000. The CFS awards the prize biannually in partnership with Goethe University Frankfurt. It will be presented to Stephen A. Ross as part of an academic symposium in Frankfurt on 24 September 2015. The Deutsche Bank Prize in Financial Economics honors internationally renowned economic researchers whose work has a marked influence on research concerning questions of financial economics and macroeconomics, and has led to fundamental advances in economic theory and practice.\nStephen A. Ross is the Franco Modigliani Professor of Financial Economics at the MIT (Massachusetts Institute of Technology) Sloan School of Management and has held academic appointments at other renowned universities such as Yale University and the University of Pennsylvania (Wharton School). Aside from pursuing a distinguished university career, Stephen A. Ross, he holds a PhD in Economics from Harvard, has worked as an advisor to the financial sector, major corporations, and government departments. \nAbout Stephen A. Ross\nStephen A. Ross is the Franco Modigliani Professor of Financial Economics at the MIT (Massachusetts Institute of Technology) Sloan School of Management and has held academic appointments at other renowned universities such as Yale University and the University of Pennsylvania (Wharton School). Aside from pursuing a distinguished university career, Stephen A. Ross, he holds a PhD in Economics from Harvard, has worked as an advisor to the financial sector, major corporations, and government departments.\nAs well as a globally recognized academic and a widely published author in finance and economics, Stephen A. Ross is a member of the American Academy of Arts and Sciences. In 1988, he led the American Finance Association as its President. Stephen A. Ross currently also serves as an associate editor of several economics and finance journals. He is the author of more than 100 articles in economics and finance and co-author of the best-selling textbook Corporate Finance.\n  If you have any questions about the Deutsche Bank Prize in Financial Economics, please contact our colleagues per e-mail at:\ncorporate.responsibility@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}