{
    "url": "https://www.db.com/news/detail/20150303-deutsche-bank-releases-annual-alternative-investment-survey-highlighting-hedge-fund-sentiment-and-allocation-trends-for-2015?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "March 3, 2015",
    "tags": [
        "Capital markets",
        "Company",
        "Investment Banking",
        "Strategy"
    ],
    "title": "Deutsche Bank releases annual Alternative Investment Survey highlighting hedge fund sentiment and allocation trends for 2015",
    "body": "Deutsche Bank today released its 13th annual Alternative Investment Survey, one of the industry’s largest and longest standing hedge fund investor surveys. This year, 435 hedge fund investors, representing over USD 1.8 trillion in hedge fund assets under management (AUM), shared insights into their sentiment and allocation plans for 2015.\n“As institutional investors’ needs continue to evolve, they are increasingly looking to work with larger hedge fund managers and intermediaries who can meet their appetite for comprehensive portfolio solutions,” said Barry Bausano, Co-head of Global Prime Finance at Deutsche Bank. “More and more, we’re seeing today’s hedge fund assets concentrated among the largest managers.”\n“Hedge fund managers who continue to focus on alignment of interests with the allocator community will have an increasingly competitive advantage as our industry grows and evolves,” said Murray Roos, Co-head of Global Prime Finance at Deutsche Bank. “Reward for alpha generation and co-investment opportunities will be key factors in building strong partnerships between limited partnerships and general partnerships.”\nHighlights of Deutsche Bank’s 13th annual Alternative Investment Survey:\nHedge fund industry assets set to surpass USD 3 trillion\nHedge funds are expected to surpass USD 3 trillion by year end 2015, growing a further 7%. Institutional investment in hedge funds is set to increase, with 39% of these investors planning to increase their allocation to hedge funds in 2015.\nAsset growth continues to be concentrated among the largest managers\nSince 2008, assets managed by firms with more than USD 5 billion AUM have grown 141%, compared to 53% for firms with less than USD 5 billion. Today, it is estimated that less than 200 hedge fund firms account for more than two thirds of industry assets.\nAccessing skilled managers is ever more critical\nManager selection is becoming increasingly important, as the gap between outperforming and underperforming hedge funds widens. While the average hedge fund returned 3.33% in 2014, the top 5th percentile generated returns greater than 22%.\nInvestors are looking for steady and predictable risk-adjusted returns\nInvestors risk/return expectations for traditional hedge fund products continues to come down in favor of steady and predictable performance: only 14% of respondents still target returns of more than 10% for the hedge fund portfolio, compared to 37% last year.\nWith this in mind, however, 40% of respondents now co-invest with hedge fund managers as a way to increase exposure to a manager’s best ideas and enhance returns. 72% of these investors plan to increase their allocation in 2015.\nQuantitative strategies are gaining in popularity\nFollowing a strong year of performance, at least one in every three respondents are planning to increase their allocation to quantitative strategies in 2015.\nThree of the most sought after quantitative strategies include commodity trading advisor (CTA), quant equity market neutral and quant equity.\nInvestors see increasing opportunity in Asia\n30% of hedge fund respondents by AUM plan to increase investment in Asian managers over the next 12 months, up from 19% last year. Even more noteworthy is the growing percentage of investors who see opportunity in China, up to 25% from 11% by AUM, year-on-year.\nIndia is expected to be a key beneficiary of flows, with 26% of investors by AUM planning to increase exposure to the region, whereas only 4% said the same last year.\nLargest intermediaries play an increasingly important role\nThe current intermediary landscape is dominated by large, well-resourced players that are seeing strong demand from institutional investors. For example, 13% of fund of funds respondents manage 55% of total fund of funds assets in the survey, while 28% of investment consultants account for 89% of total hedge fund assets managed and/or advised on by this investor segment.\nAbout the Alternative Investment Survey:\nConducted by Deutsche Bank’s Global Prime Finance business, the survey identifies trends amongst a growing and evolving hedge fund investor base. Respondents include asset managers, public and private pensions, endowments and foundations, insurance companies, fund of funds, private banks, investment consultants and family offices.\nAllocators from 26 different countries completed the survey. Approximately half of responding investors manage more than USD 1 billion in AUM, and 20% manage over USD 5 billion.\n\nFor further information, please contact:\nDeutsche Bank AG\nPress & Media Relations\nOksana Poltavets\nPhone: +1 (212) 250 0072\nE-mail: oksana.poltavets@db.com\nGael Gunubu\nPhone: +44 (20) 754 51374\nE-mail: gael.gunubu@db.com\nCandice Sun\nPhone: +852 2203 7077\nE-mail: candice.sun@db.com\n  About Deutsche Bank\nDeutsche Bank is a leading client-centric global universal bank serving 28 million clients worldwide. Deutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nDisclaimer:\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 20 March 2014 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir\nThis advertisement has been approved and/or communicated by Deutsche Bank AG or by its subsidiaries and/ or affiliates (“DB”) and appears as a matter of record only. Deutsche Bank AG is authorised under German Banking Law (competent authority: European Central Bank) and, in the United Kingdom, by the Prudential Regulation Authority. It is subject to supervision by the European Central Bank and by BaFin, Germany’s Federal Financial Supervisory Authority, and is subject to limited regulation in the United Kingdom by the Prudential Regulation Authority and Financial Conduct Authority.\nDetails about the extent of our authorisation and regulation by the Prudential Regulation Authority and regulation by the Financial Conduct Authority are available on request. Securities and investment banking activities in the United States are performed by Deutsche Bank Securities Inc., member NYSE, NASD and SIPC, and its broker-dealer affiliates. Lending and other commercial banking activities in the United States are performed by Deutsche Bank AG, and its banking affiliates.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}