{
    "url": "https://www.db.com/news/detail/20170725-deutsche-bank-singapore-wins-at-enabling-employers-awards?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 25, 2017",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "Deutsche Bank Singapore wins at Enabling Employers Awards",
    "body": "Deutsche Bank Singapore’s efforts to increase participation in the workplace by people with disabilities was commended by Singapore’s SGEnable, a government agency dedicated to enabling people with disabilities.\nThe bank won the Achievement Award – Innovative Project at the 4th Enabling Employers Awards held in Singapore. The Enabling Employers Awards is a nationally recognised award that acknowledges the efforts of employers in hiring and retaining employees with disabilities.\nThe bank won the award for its unique 10-week Work Placement Programme and for playing a leadership role in the formation of the Singapore Business Network on DisAbility Both programmes were led by dbEnable Singapore, the bank’s disability focussed diversity pillar.\nThe Work Placement Programme was launched in 2014 for talented graduates with disabilities to encourage them to apply for roles at the bank. The programme helped more than 10 undergraduates to gain experience and explore a career in banking, where in the past they had often feared that they would not be considered due to their disability.\n“It is important that we reach out to a latent talent pool which is so easily overlooked,” commented Bernd Starke, Head of Non-Bank Financial Institutions CBC Asia, Corporate & Investment Bank. and dbEnable lead for Singapore. “To create an inclusive bank that reflects society’s diversity, we need to find ways to employ more people with disabilities,” he added.\nDeutsche Bank took the lead in bringing together a community of businesses in Singapore under the banner of Singapore Business Network on DisAbility. “This opened up new opportunities for businesses to engage with a latent talent pool, as well as providing greater opportunity for people with disabilities to access employment that recognises their potential,” explained Starke.\n“Disability is an issue that has personal implications for all of us,” said Philip Lee, Chief Country Officer for Singapore. “We want to find the best possible talent to make up the next generation of Deutsche Bank people – and that means recruiting according to talent and ability, without taking notice of matters which don’t impact a candidate’s ability to do their job.”\nSingapore’s Jaishankar Srinivasan and Bernd Starke receive Achievement Award for Innovation for a programme to enable people with disabilities into the workplace\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}