{
    "url": "https://www.db.com/news/detail/20170719-ten-investment-themes-for-2017-revisited?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 19, 2017",
    "tags": [
        "Corporate products",
        "Wealth"
    ],
    "title": "Ten investment themes for 2017 revisited",
    "body": "Christian Nolting takes a fresh look at his 10 key investment themes for the year. In the latest edition of his quarterly publication, “CIO Insights – The perils of patterns”, Christian Nolting, Chief Investment Officer for Deutsche Bank Wealth Management, likens a market outlook to looking through a kaleidoscope that throws up attractive patterns depending on which way it is turned.\nThe conclusion of his analysis: the 10 themes remain highly topical for investors. The economy is in a late cycle environment with stretched valuations regarding both equity and credit. He sees the US dollar returning to 1.10 against the euro by mid-2018, 10-year US Treasury yields at 2.6 percent and the price for a barrel of WTI crude oil at USD 50.\nNolting advises investors to distinguish between what looks good now and what is likely to keep looking good in the future. For instance, he paints a favourable picture for European and Japanese stocks and continues to keep a positive view of emerging markets: “We expect Europe and the emerging market countries to pick up the baton from the USA as drivers of earnings growth.” However, selectivity is important in the case of emerging market equities. Nolting has a preference for Asia over Latin America due to better fundamentals and less exposure to the oil price.\nIn addition, investors are well advised to keep an eye on long-term growth topics, which Nolting expressed at the beginning of the year under the title “tomorrow’s themes today”. “In this context, we are focusing particularly on technology and healthcare. These two sectors still hold much potential and we expect this to be reflected in corporate earnings over the next few quarters.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}