{
    "url": "https://www.db.com/news/detail/20170714-dedication-to-diversity-a-real-success-story?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 14, 2017",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "Dedication to diversity – a real success story",
    "body": "Deutsche Bank is advancing the causes of different social groups and initiatives on a global scale. “As a global organisation, Deutsche Bank is committed to an inclusive culture that respects and embraces the diversity of employees, clients and communities,” the bank's latest\nPDF\nHuman Resources report says.\nFor many years, employees have been promoting the interests of men and women; young and old; lesbian, gay, transgender and intersexed (LGBTI) individuals; and disabled colleagues. For its efforts, Deutsche Bank was awarded the highest score of 100 in the annual Human Rights Campaign’s Corporate Equality Index 2016 – for the 14th year in a row.\nGernot Sendowski, an expert in the bank for Diversity & Inclusion, is proud that Deutsche Bank is taking part in activities related to Christopher Street Day (CSD) once again this year. Last Sunday, for instance, colleagues, customers and family members had their own float at the CSD parade in Cologne. A total of 30,000 people paraded through the downtown area and literally let their flags fly in a city where approximately one million people celebrated ColognePride. Other cities marking the occasion were New York, Dublin and Manila.\nIn Berlin, 500,000 people are expected to follow the BerlinPride parade on July 22 where the bank will have its own float. “Marriage equality is definitely a huge positive topic at this year's CSD,” Sendowski said. Germany’s Parliament and the Federal Council that represents the country's states on national issues recently passed a law giving same-sex marriages the same rights as heterosexual couples.\nIn Germany, roughly 94,000 homosexual couples live together, according to the most recent 2015 micro-census. Of these couples, 43,000 are registered partnerships, a form of relationship granted some of the same rights enjoyed by heterosexual couples.\nUnder the new law, same-sex couples may now marry and adopt children.\nSendowski is particularly happy that the movement for equal rights has now found its footing in Germany. “Being equal under the law, regardless of sexual identity, is a very important form of acceptance and respect,” he says. “Our bank also stands for these fundamental rights. In doing so, it makes an important and positive impact on society.”\nFor decades, Deutsche Bank has promoted equality under the law for LGBTI individuals. “Diversity, inclusion and mutual respect are essential elements of who we are. These principles define the working environment we strive to create - an environment where everyone at Deutsche Bank can bring their whole self to work every day,” Chief Risk Officer Stuart Lewis said in mid-May to mark the International Day Against Homophobia, Transphobia and Biphobia (IDAHOT).\nThe progress made at Deutsche Bank in terms of equal opportunity and the recognition of an individual's personal situation is clear. For instance, Deutsche Bank actively supports its employees during various stages of the careers: from help with child care to time-off to care for relatives. It also fosters a dialogue and knowledge transfer between younger and older generations – including through a tandem program of the generation network. It also offers flexible working.\nIn Germany, the bank was re-elected to its position on the Board of Directors of the Diversity Charter (Charta der Vielfalt) – a business initiative co-founded by the bank that promotes diversity in German businesses under the patronage of German Chancellor Angela Merkel.\nIn addition, employees in Germany have set up the Fathers@DB employee resource group that helps working fathers to achieve a healthy work/life balance.\nIn the United States, the bank co-sponsored the virtual hiring event “Veterans on Wall Street” for the sixth time last year. This programme is designed to help US military veterans find jobs.\nThe bank also helped the British organisation Autistica to develop a prototype of an app for individuals with autism that enables them to better manage everyday challenges.\n“The spectrum of our employee resource groups is large and very diverse,” Sendowski says. “It has been growing for decades now – and we can be very proud of our work.”\nContact: christine.peters@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}