{
    "url": "https://www.db.com/news/detail/20170706-deutsche-bank-publishes-prior-periods-pro-forma-results-for-new-corporate-divisions?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "July 6, 2017",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank publishes prior periods' pro-forma results for new corporate divisions",
    "body": "Today Deutsche Bank (XETRA: DBKGn.DE/ NYSE: DB) published a Financial Data Supplement (“FDS”) which presents the view of the Bank’s 2015, 2016 and 1Q2017 financial results in the new 2Q2017 segmental structure. Deutsche Bank business operations have been organized under a new structure as announced on 5 March 2017 with the following segments:\n• Corporate & Investment Bank,\n• Private & Commercial Bank,\n• Deutsche Asset Management,\nIt is intended to report along the new segment structure as part of the bank’s 2Q2017 interim financial statements on 27 July 2017.\nThe key changes compared to Deutsche Bank’s previously reported segmental information are outlined below.\nCorporate & Investment Banking (CIB)\nThe new corporate division “Corporate & Investment Bank” combines the former segments “Global Markets” and “Corporate & Investment Banking”. It comprises the bank’s Corporate Finance, Global Markets and Global Transaction Banking businesses.\nPrivate & Commercial Bank\nThe corporate division “Private & Commercial Bank” combines the businesses with private and commercial clients of Deutsche Bank and Postbank, which formerly had been reported separately, and the wealth management activities for wealthy clients, foundations and family offices.\nDeutsche Asset Management\nThe corporate division Deutsche Asset Management remains materially unchanged and contains the asset management activities of Deutsche Bank. It focuses on providing investment solutions to individual investors and institutions that serve them.\nAccess to the restated Financial Data Supplement: www.db.com/quarterly-results",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}