{
    "url": "https://www.db.com/news/detail/20170705-95-prozent-of-deutsche-bank-wealth-management-strategies-generated-positive-absolute-returns-in-first-half?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "July 5, 2017",
    "tags": [
        "Wealth"
    ],
    "title": "95% of Deutsche Bank Wealth Management strategies generated positive absolute returns in first half",
    "body": "Deutsche Bank Wealth Management today announced that it generated positive absolute returns in over 95% of wealth discretionary strategies in the first half of 2017.\nEquity-heavy wealth discretionary strategies continued to benefit from continued rises in global equity markets with many delivering gross returns of well over 10% year-to-date. Bond-based strategies also generally delivered strong positive absolute returns year-to-date, with close to 90% of all strategies outperforming their benchmarks in the first half. For the “cautious”, “unconstrained” and “key client” strategy risk categories, the outperformance ratio was even higher. All non-benchmark unconstrained strategies beat their “cash plus” targets in the first half of 2017.\nOur Wealth Discretionary Service shows how multi-asset strategies can work for clients in good times and bad. Second-quarter portfolio performance built on a solid first-quarter performance and weathered recent market volatility well. In particular, it’s very encouraging that our new non-benchmarked strategies delivered good results too, returning above 8% gross of fees since inception in 2015.\nChristian Nolting, Global Chief Investment Officer and Global Head of Wealth Discretionary\nNolting added: “We expect market gains to lose some momentum in the second half of 2017 as political and policy challenges remain and temporary setbacks are possible. However, with global growth continuing and the corporate earnings outlook positive, we remain constructive about the longer-term outlook for equities and most risky assets.”\nDeutsche Bank Wealth Management’s Wealth Discretionary service manages approximately 20,000 accounts around the world. While the current investment process has been refined over the past decade, Deutsche Bank’s multi asset experience dates back to 1968.\n“We are proud that we have the ability to tailor our strategies to our clients’ needs and can offer them direct access to their own portfolio manager,” Nolting said. “In fact, we see ourselves as more of a risk manager than a pure performance manager. This is a key part of our well-established investment process.”\nHe added: “Our philosophy remains to deliver sustained high risk-adjusted returns to clients, underpinned by transparency and clear pricing. So a strong short-term performance is complemented by sustained longer-term returns: on a three- and five-year basis a clear majority of Deutsche Bank Wealth Management’s strategies have outperformed their benchmark.”\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Contact\nAdrian Cox\nPhone: +44 20 7541 7775\nE-mail: adrian.cox@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}