{
    "url": "https://www.db.com/news/detail/20151026-born-to-be-first-employee-funded-scholarship-goes-to-young-iraqi-student?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 26, 2015",
    "tags": [
        "Corporate Citizenship",
        "Education",
        "Employee engagement"
    ],
    "title": "Born to Be: First employee-funded scholarship goes to young Iraqi student",
    "body": "Talented young people are the future of our society. Bastherman M., a young Iraqi student living in Germany, was recently admitted to the STUDIENKOMPASS programme at Deutsche Bank offices in Cologne. Her scholarship is co-funded by more than 4,000 employees who take part in the Bank’s RestCent initiative. “This is a recognition of your remarkable achievements, your motivation and your determination”, said Martin Renker, Deutsche Bank Regional Head West.\nMore than 2,900 young people have already benefitted from STUDIENKOMPASS\nReceiving her certificate for the three-year scholarship programme, Bastherman replied: “I’m excited about the new prospects and the new opportunities that STUDIENKOMPASS opens up for me.” When she finishes high school in two years’ time, the young woman would like to study medicine to help people in need. She is particularly inspired by the work of Médecins Sans Frontières. In her spare time, the 18-year-old volunteers with refugees in her home town of Cologne, collecting donations and clothing, interpreting for doctors and authorities, and generally helping people to find their feet.\nBastherman also has first-hand knowledge of what it means to be a refugee. She was still a young child when she arrived in Germany from Iraq with her parents and five siblings. Her father, a Yazidi lawyer, could no longer practice his profession in Iraq as the family was subjected to constant persecution under the regime of Saddam Hussein.\n“Even though I was very young when we had to flee, those events had a formative influence on me,” said Bastherman.\nLast year, when she was visiting some relatives in her home country, she had the chance to convince herself of the scale of devastation and the current living conditions in Iraq and witnessed several flows of Yazidi refugees fleeing from the Sinjar Mountains. Touched by the disastrous events, she now wants to help new refugees to find their feet, to serve as a role model for others and motivate them to raise their aspirations.\nBastherman’s participation in the three-year programme is funded through the RestCent initiative launched by Deutsche Bank in May 2015 that enables employees to donate the “cents” of their net salary to support CSR programmes in Germany. 2015, donations are dedicated to Born to Be, the Bank’s youth engagement programme, and will be matched by Deutsche Bank.\nIf you would like to make a contribution, please direct your donations to:\nRecipient: Deutsche Bank Foundation\nIBAN DE54 5007 0010 0015 6000 08\nPurpose: Refugee relief\nIn other regions, Deutsche Bank and its foundations also support young people to reach their full potential.\n\nMore about STUDIENKOMPASS\nHigh school and then what? After finishing school, many young people face the difficult question of what to do in the future. Many struggle to decide whether to pursue a university education or vocational training and would appreciate support with their studies or training. STUDIENKOMPASS (Compass of Studies) helps young people to plan their future and supports them on their way to a university education.\nYoung people from non-academic family backgrounds often lack sufficient confidence to pursue a university education in spite of their undeniable abilities or they are uncertain about financing their studies. STUDIENKOMPASS accompanies participants over a three-year period, offering individual support and encouragement. It starts two years before finishing high-school. Once admitted to university, the young adults continue to receive support during the first two semesters to ensure their successful start in the academic world.\nSTUDIENKOMPASS, which was initiated in 2007 by the Deutsche Bank Foundation together with Foundation of German Business (Stiftung der deutschen Wirtschaft) and the Accenture Foundation, is one of Germany’s largest educational programs. In 2015, about 1,500 students participate in the programme in 30 locations – and 2,900 young people have already been part of this programme so far.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}