{
    "url": "https://www.db.com/news/detail/20151020-deutsche-bank-enters-new-partnership-addressing-sustainable-development-goals?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 20, 2015",
    "tags": [
        "Sustainability"
    ],
    "title": "Deutsche Bank enters new partnership addressing Sustainable Development Goals",
    "body": "The United Nations General Assembly recently approved 17 Sustainable Development Goals that apply to all countries. The UN estimates that meeting these goals will require USD 3.9 trillion per year, while only USD 1.4 trillion is currently being invested. Closing this gap will require increased levels of public-private cooperation in areas such as access to clean energy, health care and financial services. Ways to meet these goals were discussed at numerous events in New York, including through the Pope’s speeches and meetings. USD 3.9 trillion will be required per year to meet these goals, the UN estimates.\nAt USAID’s Signature Event held on Sunday, September 27, 2015, Deutsche Bank announced that the USAID’s Office of Development Credit, Global Development Lab, Asia Bureau and the US State Department will join forces to provide a USD 25 million loan portfolio guarantee to Deutsche Bank’s Global Social Finance team’s newest fund: the Essential Capital Consortium. This new partnership will contribute to addressing the new Sustainable Development Goals.\nSupporting Social Enterprises\nFor over 20 years, the Deutsche Bank Global Social Finance group has provided innovative capital solutions to address underserved populations around the world. In late 2014, GSF launched a USD 50 million debt investment fund that provides loans to social enterprises that serve low-income communities around the world in the financial services, energy and health sectors.\nThis fund, known as the Essential Capital Consortium (ECC), targets a protected risk-adjusted financial and social return to investors, while providing competitive financing terms to social enterprises. These social enterprises provide life enhancing goods and services to the world’s poorest populations, but are often very early stage and have difficulty accessing finance to grow.\nUSAID’s Development Credit Authority loan portfolio guarantee will allow ECC companies access a 50% pari-passu principal guarantee for its ECC loan. This risk sharing partnership will allow ECC to broaden its investment horizon, unlocking catalytic capital to support new innovations in off-grid energy, unique financial solutions and affordable healthcare for Base of the Pyramid populations.\nMobilizing public and private capital\nIn addition to this new partnership, Deutsche Asset and Wealth Management is a supporting partner to the Sustainable Development Investment Partnership along with the World Economic Forum, the OECD, the governments of Canada, Denmark, the Netherlands, Norway, Sweden, UK and the US plus many other key public and private players.\nThese organizations are working collectively to mobilize USD 100 billion in private financing over the next five years. Deutsche Bank believes that these types of partnerships are critical to the development of the global economy and believes that as a global economy, we have a greater chance of achieving the SDGs if we partner to mobilize both public and private capital aligned with our shared goals.\n“We believe this partnership will elevate our ability to invest in social entrepreneurs globally who are redefining a market approach to addressing fundamental humanitarian challenges,” said Gary Hattem, head of Global Social Finance and President of the Deutsche Bank Americas Foundation.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}