{
    "url": "https://www.db.com/news/detail/20220429-securitisation-deutsche-bank-wins-three-awards?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 29, 2022",
    "tags": [
        "Europe",
        "Awards",
        "Investment Banking"
    ],
    "title": "Securitisation: Deutsche Bank wins three awards",
    "body": "Three deals arranged by Deutsche Bank have won awards at the Global Capital European Securitisation Awards 2021. The bank acted as:\nsole arranger and initial purchaser on the ESG/SRI Deal of the Year, given to North Westerly VII ESG Collateralised Loan Obligation (CLO):\nOn 30 April 2021, Deutsche Bank priced a 458.9 million euros North Westerly VII ESG CLO for NIBC. The eligibility criteria prohibit the purchase of underlying loans that do not meet certain ESG criteria. Deutsche Bank acted as sole arranger and initial purchaser; and also provided 350 million euros of senior warehouse financing for the transaction aimed at helping NIBC accumulate assets prior to the settlement date of the CLO,\nsole arranger and initial purchaser on the CLO Deal of the Year, given to CVC Cordatus Loan Fund XXII DAC:\nOn 1 November 2021, CVC Cordatus Loan Fund XXII for CVC Credit Partners was upsized to 440 million euros. Deutsche Bank acted as sole arranger and initial purchaser and also provided 360 million euros of senior warehouse financing for the transaction aimed at helping CVC accumulate assets prior to the settlement date of the CLO, and as\nsole arranger and senior lender on the Private Securitization Deal of the Year, given to PPC Zeus DAC:\nOn 30 June 2021, PPC Zeus DAC was the first ever securitisation of non-performing utility bills in Europe. The landmark programme allowed PPC to extract 325 million euros funding against its stock of unpaid electricity bills and strengthen its liquidity position. Deutsche Bank, which has a longstanding relationship of more than 15 years with PPC, acted as sole arranger and provided part of the financing.\nAwards were judged as a result of a comprehensive process of market research including an online poll and pitches.\nNikunj Gupta, Head of European CLO New Issue, said: “Deutsche Bank is one of the leading arranging banks for European CLOs and these awards are a testament to Deutsche Bank’s strength in originating, structuring and syndicating European CLOs.\nNorth Westerly 7 is one of the few ESG CLOs issued to date and we continue to explore more ESG securitisation transactions, leveraging off Deutsche Bank’s strengths in the space.”\nMauricio Suarez Rodriguez, Co-head of European Global Financing and Credit Trading Structuring, said: “We are proud of this recognition following a standout year for the ABS franchise. Deutsche Bank differentiated itself from the competition by bringing to market transactions across 10 jurisdictions over the course of the year (and CLO collateral across a further eight), offering our clients a full suite of solutions to address their needs in terms of funding, capital and non-performing asset disposals.”",
    "number_of_ratings": 5,
    "rating": 1.0,
    "likes": 52
}