{
    "url": "https://www.db.com/news/detail/20220422-50-seconds-on-apac-asia-pacific-credit-markets?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 22, 2022",
    "tags": [
        "Asia-Pacific",
        "Capital markets",
        "Investment Banking"
    ],
    "title": "150 seconds on APAC: Asia Pacific Credit Markets",
    "body": "Renewable and technology are sectors that are most attractive to international investors in Asia Pacific’s credit market, according to Vishal Goenka. Deutsche Bank’s APAC Head of Credit Sales discusses key trends for the region’s credit market in our latest “150 Seconds on APAC” video.\nYou can read the full transcript of the video below:\n\"A lot of large global funds or asset managers are actually setting up base here in Singapore, Hong Kong and Australia which tells us they are looking to deploy millions of dollars in this region as a major growth story with a growth in GDP across countries for many years to come.\nQ: Which sectors are attractive to international investors?\nA: The most important is renewables. As we see even with the geo-political situation each country strives to be energy self-sufficient. The second sector is the technology sector in other growth counties apart from China. We’re seeing a lot of demand for financing not only the private equity capital but now credit capital which would help fund these technological innovation companies into the next stage of growth.\nQ: What risks remain for investors in Asia Pacific?\nA: The western world has not seen inflation which is at a forty year high. Now this could have unintended consequences in lots of the smaller countries. China is again the biggest sector in the entire credit investment universe which is going through a lot of disruption in the property and tech sectors. How does this sector pan out, its roughly about 175 billion US dollar credit outstanding. How does it pan out, what are the recovery values that people derive in the year or years to come will determine the risk factors for this region.\nQ: What are the biggest opportunities?\nA: In more developed markets like Japan and Australia we’re seeing this trend of large private equity acquisitions and LBO or leveraged financing that is taking shape. The other country which is exciting is India. Due to regulations that domestic capital cannot invest in certain growth companies and we see a little marriage of domestic capital and foreign capital that is addressing these concerns.\nChina remains a big country with a big focus currently disrupted with what has happened in the property sector. But again a new set of capital which specialises in distressed or special situations are seeing a myriad of opportunities out there.\"",
    "number_of_ratings": 5,
    "rating": 1.0,
    "likes": 3
}