{
    "url": "https://www.db.com/news/detail/20220413-deutsche-bank-ranked-number-1-for-financing-and-credit-trading-in-asia-pacific?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 13, 2022",
    "tags": [
        "Asia-Pacific",
        "Awards",
        "Investment Banking"
    ],
    "title": "Deutsche Bank ranked number 1 for Financing and Credit Trading in Asia Pacific",
    "body": "Deutsche Bank has once again cemented its position as a financing and credit trading powerhouse, ranking number one in Asia Pacific for Financing and Credit Trading for 2021, according to Coalition*.\nDeutsche Bank regained the top position in Financing, capturing a significant share across its peer set. This ranking reflects the best-in-class approach to risk management over many years and the business growth achieved across all of Asia Pacific in 2021. This has been driven by increased collaboration across the bank, greater share of financial sponsors business, expansion of the corporate client base and demonstrating leadership in providing ESG financing solutions.\nDeutsche Bank continued to play a key role in widening access to the market, by leading transactions for 25% of new borrowers in the region. Deutsche Bank was also mandated in a sole capacity for over 40% of its transactions throughout the year, evidencing client confidence in the bank’s expertise and its strength in execution.\nWe continue to help our issuer and investor clients access the full credit spectrum while innovating with ground-breaking structures and importantly adding socio-economic value to the region through leadership in sustainable finance.\nAmit Khattar, Head of Investment Bank and Co-Head of Global Financing & Credit Trading for Asia Pacific\nIn Credit Trading, Deutsche Bank has been the leading investment bank for over a decade and maintained its #1 ranking in 2021. The bank’s model covers the full range of issuer risk from investment grade through to distressed debt across corporate and Asset-Backed Securities (ABS) risk. Deutsche Bank has been the dominant Distressed Trading & Special Situations participant in the region for many years and has recently played a key role in developing a secondary market for Indian distressed debt.\nWe continue to focus on intensifying our client engagement and are seeing positive momentum in trading volumes as a result. We have an important role to play in supporting our clients to provide liquidity given the challenging macro environment.  \nBeaux Pontak, Co-Head of Global Financing & Credit Trading for Asia Pacific \n “Our leadership in Financing and Credit Trading in this region shows that our momentum is not only sustainable, but it continues to build” Khattar concluded.\n*Coalition Greenwich Competitor Analytics: analysis based upon Deutsche Bank taxonomy and internal revenues in the Coalition Index of the 12 largest global investment banks. This ranking is for full year 2021.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 15
}