{
    "url": "https://www.db.com/news/detail/20220407-our-support-for-ukraine?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 7, 2022",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Our support for Ukraine",
    "body": "Global donation campaign\nDeutsche Bank has made a 1 million euro donation to support relief efforts in Ukraine. And as many of our colleagues were looking for ways to contribute, we launched a global fundraising drive, which received an overwhelming response. Employees have donated more than 500,000 euros so far, bringing Deutsche Bank’s overall support to more than 1.5 million euros to date.\nAll donations raised will go to Red Cross and other organisations working on the ground. This funding provides valuable aid as the situation in Ukraine and the refugee crisis on the borders of Poland, Hungary and other neighbouring countries deteriorates.\nDonations from US-based employees will go to the International Medical Corps, which is providing access to medical and mental health services in Ukraine, Poland, Moldova and Romania.\nOver the next six months, Deutsche Bank will also direct all funds from our German RestCent payroll giving scheme to wellcome, a charity active at 230 locations across Germany. wellcome has launched a donation fund to help Ukrainian mothers and their young children fleeing to Germany.\nHelp for Ukrainian refugees\nIn light of the emergency and paramount humanitarian needs of refugees from Ukraine, our colleagues in Poland, Romania, Hungary, Germany and other countries have quickly mobilised to provide support.\nColleagues in Poland have been busy arranging transportation and other assistance, including collections of clothing and food, donating funds, and physically helping to organise shipments or care for families. Deutsche Bank Polska is currently providing direct assistance to 54 people from Ukraine, including colleagues from our Kyiv office and their families.\nIn Hungary and Romania, colleagues donate funds and collect essential goods. In Romania, the support granted to Deutsche Bank Ukraine colleagues and their family members – around 30 people – ranges from border pick-up, accommodation, mobile phones and other IT equipment as well as guidance on the available banking and medical services.\nIn Germany, our employees are organising and participating in local relief projects such as donation drives for essential goods. One initiative saw 260 boxes of donations collected for the Ukrainian Association Frankfurt. They will benefit refugees in Frankfurt, but especially in the western Ukrainian city of Lviv.\nColleagues are also opening their homes to host refugees from Ukraine. In Germany, we are working with pme, a family service that runs an online platform where employees can offer vacant apartments or rooms for impacted colleagues, their family members and other refugees.\nIn close cooperation with our non-profit partners, we also match employees who speak Ukrainian or Russian with refugees to support them with administrative procedures or translations.\nFree basic account for refugees\nFor refugees from Ukraine, one pressing issue on arrival in Germany is opening and using a bank account. Deutsche Bank and Postbank are stepping in with an effective solution, enabling refugees to open current accounts at their branches. In agreement with the Federal government, this is possible via a simplified form, with only a Ukrainian ID card required to open a basic account. There is no need for the proof of official registration usually required; applicants can simply provide a postal address such as their emergency accommodation.\nIn addition, the monthly fee will be waived for these accounts. The banks will also assist with private money transfers to people in Ukraine. For instance, Deutsche Bank and Postbank offers reimbursements of the regular transaction fee if refugees or even volunteers want to help people in Ukraine by transferring cash.\nJob search site launched for Ukrainian refugees\nJobAidUkraine is a free-to-use website that encourages companies to post available jobs and matches them with Ukrainian refugees. After establishing the website with basic functionality, JobAidUkraine and Deutsche Bank joined forces to accelerate the effort over the coming weeks.\nThis included mobilising global volunteers with coding experience within 24 hours from Deutsche Bank’s Technology, Data and Innovation division to support the development of the website. Further to this, Deutsche Bank was one of the first companies to publish open roles on the platform.\nBuilding bridges with art and culture\nWithin the framework of the #OurSpacetoHelp initiative, Berlin cultural institutions came together at the beginning of March to support the integration of refugees in the city. Deutsche Bank’s PalaisPopulaire, as part of this initiative, is continuing this commitment and has added events such as readings and film screenings by Ukrainian cultural artists to its cultural offer. Admission proceeds go to the “Be an Angel” initiative and the PalaisPopulaire also calls on visitors to support the association, which helps transport refugees from the Ukrainian border regions, among other things.\nBased on the PalaisPopulaire’s well-founded school and education program and experiences from the refugee crisis in 2015-16, the museum is supplementing its contribution with a wide-ranging offer for welcome classes for children and young people.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 25
}