{
    "url": "https://www.db.com/news/detail/20150928-asoka-woehrmann-and-stefan-bender-to-become-the-new-heads-of-private-and-commercial-banking-at-deutsche-bank?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "September 28, 2015",
    "tags": [
        "Company"
    ],
    "title": "Asoka Wöhrmann and Stefan Bender to become the new Heads of Private and Commercial Banking at Deutsche Bank",
    "body": "As part of the realignment of retail and commercial banking operations in Germany, Asoka Wöhrmann and Stefan Bender will be the new heads of Deutsche Bank’s Private and Commercial Banking in Germany. They have been appointed to succeed Peter Schedl and Wilhelm von Haller, who resigned from their offices effective September 30, 2015. Stefan Bender will assume his new role over the course of October, and Asoka Wöhrmann as of December 1, 2015. In their new functions, Wöhrmann and Bender will take on responsibility for Deutsche Bank’s 8 million+ private, commercial and corporate clients in Germany.\nWithin the Private and Commercial Banking management team, Asoka Wöhrmann will be head of retail banking and Stefan Bender will be head of commercial banking. They will both report to Christian Sewing, member of the Management Board of Deutsche Bank and Head of its Private & Business Clients (PBC) Corporate Division. Regarding the new appointments, Christian Sewing said:\n“In Asoka Wöhrmann and Stefan Bender, we have gained two renowned and successful managers from within our own Bank for the realignment of our domestic Private and Commercial Banking business. This realignment will involve significantly strengthening our advisory banking business with private clients, further expanding our business with small and medium-sized enterprises, Germany’s ‘Mittelstand’, and closely networking our branches with our rapidly growing digital banking service.”\nBoth of them have worked for Deutsche Bank for many years: Wöhrmann joined Deutsche Bank in 1998 and has most recently been Chief Investment Officer in Deutsche Asset & Wealth Management. Stefan Bender has been with Deutsche Bank since 1997. Until he takes up his new functions, Bender is Head of Global Transaction Banking in Germany (GTB, Trade Finance and Payments) and Co-Head of Corporate Finance in Germany. In his new role, Bender will remain head of Global Transaction Banking in Germany and will continue building on GTB’s strong ties with commercial banking.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}