{
    "url": "https://www.db.com/news/detail/20150918-deutsche-bank-signs-up-for-mystandards-readiness-portal?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "September 18, 2015",
    "tags": [
        "Company",
        "Digitalisation"
    ],
    "title": "Deutsche Bank signs up for MyStandards Readiness Portal",
    "body": "Deutsche Bank is simplifying its technical client onboarding processes by introducing the Readiness Portal to its MyStandards offering.\n\nSWIFT MyStandards is a web-based application providing clients with direct access to standardised and structured documentation of financial messages, such as ISO 20022 XML and SWIFT MT messages. Since the launch of SWIFT MyStandards within Deutsche Bank´s Autobahn App Market at end of last year, the MyStandards App has consistently been among the most commonly-used apps.\n\nAs a next step, Deutsche Bank and SWIFT will make the add-on module “Readiness Portal” available to Deutsche Bank´s clients in the near future. The Readiness Portal complements the MyStandards offering by providing clients with an on-demand capability to validate financial messages in accordance with Deutsche Bank guidelines.\n\nDavid Watson, Global Head of Global Transaction Banking Cross-Product Components and Regional Head of Product Management Americas at Deutsche Bank said, “Deutsche Bank is committed to further invest in its MyStandards offering. Effective onboarding has long been a priority for us and is a key element in the client experience. With the Readiness Portal we are pleased to be able to bring these tangible improvements to our clients as we work with SWIFT to make technical onboarding easier and more timely.”\n\nClients can quickly run format validations through the portal and immediately receive comprehensive test results of the entire test message. Any error is directly highlighted within the message with a clear description shown on the screen. The format verification process between bank and client can therefore be significantly streamlined.\nMarc Delbaere, Head of MyStandards at SWIFT said, “This is an important milestone in our continued collaboration with Deutsche Bank. With the successful early integration of MyStandards in Deutsche Bank´s Autobahn App Market, the Readiness Portal is the last piece of the puzzle to provide a fully streamlined onboarding experience to their corporate customers. This also paves the way for other financial institutions to further integrate MyStandards and the Readiness Portal in their customer web platforms.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}