{
    "url": "https://www.db.com/news/detail/20150914-richard-meddings-nominated-to-deutsche-bank-s-supervisory-board?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "September 14, 2015",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Richard Meddings nominated to Deutsche Bank's Supervisory Board",
    "body": "Deutsche Bank’s (XETRA: DBKGn.DE/NYSE: DB) Supervisory Board has nominated Richard Meddings (57) for appointment to the Supervisory Board. He is to succeed John Cryan (54), who stepped down from the Supervisory Board to become Co-CEO effective July 1, 2015. Richard Meddings is also expected to assume John Cryan’s previous role as Audit Committee Chairman.\nIn line with the recommendation of the German Corporate Governance Code, Richard Meddings’s court appointment is to be for the period until the next General Meeting, when he will stand for election by the shareholders. Today the relevant application with the court for Richard Meddings’s appointment to the Bank’s Supervisory Board has been filed.\nPaul Achleitner, Supervisory Board Chairman, said: “The entire Board and I are delighted that we have gained a new highly qualified colleague in Richard. Having worked as Group Finance Director of one of the leading global financial services companies for many years, he brings with him a wealth of international experience and also expertise in finance, treasury and risk as well as in corporate governance and strategy.”\nRichard Meddings, a British citizen, has more than thirty years of executive experience in the financial sector. A chartered accountant, he has worked in various positions in Finance, Risk, Governance and Corporate Finance including at Barclays and Credit Suisse and from 2002 until 2014 as an Executive Director on the Board of Standard Chartered where he was the Group Finance Director for eight years.\nHe is currently a non-executive director of Her Majesty’s Treasury, where he chairs the Audit Committee for HM Treasury and for the “Whole of Government Accounts”, and is a non-executive director of the insurance and asset management company Legal & General, where he chairs the Risk Committee and is also a member of the Audit and Remuneration Committees. He also served on the Board of the private equity group 3i for six years until 2014, where he was the Senior Independent Director and chair of the Audit Committee.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}