{
    "url": "https://www.db.com/news/detail/20171026-one-bank-two-brands-deutsche-bank-and-postbank-are-creating-a-new-private-und-commercial-bank?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 26, 2017",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Deutsche Bank and Postbank are creating a new Private & Commercial Bank",
    "body": "Deutsche Postbank AG and Deutsche Bank Privat- und Geschäftskunden AG are to combine forces to become the market leader with more than 20 million clients in their home market\nMerger will form a single legal entity while maintaining the two distinct brands\nAnnual synergies of roughly 900 million euros from 2022 onwards; total investments of 1.9 billion euros\nNew digital bank aimed primarily at younger clients to be launched at end of 2018\nSal. Oppenheim will be integrated into Deutsche Bank\nTogether, Deutsche Bank and Postbank are realigning their business with private and commercial clients, creating a market leader with more than 20 million clients and 325 billion euros in client business volume.\nTo this end, Deutsche Postbank AG and Deutsche Bank Privat- und Geschäftskunden AG will be merged into one single legal entity by the end of the second quarter of 2018. The entity – Deutsche Privat- und Firmenkundenbank – will have a joint head office and continue to operate under both brands. A new digital bank will also be launched. In addition, Sal. Oppenheim will be integrated into Deutsche Bank.\nThe reorganisation will provide substantial synergies, gradually rising to about 900 million euros annually by 2022. The amount of 1.9 billion euros will be incurred in restructuring expenses and other investments, primarily in IT. Furthermore, the cost-income ratio for this business is to be reduced to below 65 percent by 2022.\nThe Deutsche Bank and Postbank brands are to be further enhanced for private and commercial clients. While Deutsche Bank is focusing on its role as partner and risk manager providing intensive advisory services to its clients, Postbank will cover day-to-day banking needs.\nWe are creating one bank, but with our two established brands, we are continuing to meet the differing needs of our clients. In terms of innovation, investments and service, the combined businesses of Postbank and Deutsche Bank give us the maximum strength to achieve profitable and sustainable growth.\nChristian Sewing, President and Co-Head of Private & Commercial Bank at Deutsche Bank\nMoreover, at the end of 2018, Deutsche Privat- und Firmenkundenbank will launch a new digital bank, aimed primarily at younger, digitally savvy clients. By additionally using the norisbank platform, it will make full use of the strengths of Deutsche Privat- und Firmenkundenbank. The range of products will be centred around a free account offering fast and straightforward access to digital marketplaces.\n“We appeal to all clients, regardless of their income or age”, says Frank Strauß, CEO of Postbank and Co-Head of Private & Commercial Bank at Deutsche Bank: “We are combining the strengths of Deutsche Bank and Postbank. There is no other private banking group in Germany today with as many online clients as Deutsche Bank und Postbank combined. Together, we can expand our lead in digital transformation even more quickly.”\nOf Deutsche Privat- und Firmenkundenbank’s more than 20 million retail clients, over 10 million are already using both banks’ online and mobile channels. The new unit will continue to maintain around 10,000 cash points all over Germany. Deutsche Privat- und Firmenkundenbank will start off with 30,000 employees and more than 1,500 branches.\nFrom the end of 2022 onwards, Deutsche Bank will benefit from annual synergies of roughly 900 million euros. The lion’s share of this will come from cost synergies attributable to the fact that the two banks are merging to form one legal entity, their branch networks and product ranges are being aligned, IT and processes are being pooled and standardised.\nDeutsche Bank will also benefit from lower financing costs across the group. In addition, the merger will lead to growth prospects in selected areas of the private and commercial banking business, for example, in investment advisory or in the lending business.\nTo ensure a smooth implementation of the strategy, management has already reached an upfront agreement in principle with trade union representatives in the company. At the core is the commitment to socially responsible job reductions as well as a pledge to participate constructively in the integration process.\n“The agreement reached with our social partners creates a predictable environment for the employees of our bank”, says Strauss. “It also gives us the flexibility to commence the merger promptly, carry out the necessary adjustments, and consequently, create something new.\nChristian Sewing added: “We have already demonstrated in the past that profound change is possible by mutual agreement.”\nAn important component of the strategy is the long-term partnership with Deutsche Post, which has now been extended in an amended form for five years.\nThis enables us to continue developing our branch network as before in line with our clients’ needs and with what makes sense for our business.\nFrank Strauß, CEO of Postbank and Co-Head of Private & Commercial Bank at Deutsche Bank\nEfficiency gains will also be achieved by having a single head office going forward. Joint teams under a combined management will steer the business for both brands and will be located at Centres of Expertise in both Bonn and Frankfurt. Overlaps and costs that might, for example, result from relocating employees or rehiring will be avoided. Deutsche Privat- und Firmenkundenbank’s product development and service functions, including information technology are also to be pooled. Furthermore, BHW Bausparkasse and DB Bauspar, the building society units of Postbank and Deutsche Bank, will also be combined.\nDeutsche Bank’s Wealth Management unit in Germany will also be realigned. Consequently, in the course of 2018, Sal. Oppenheim’s Wealth Management business will be absorbed by Deutsche Bank's Wealth Management. This will give clients better access to regional advisory services, combined with the global investment and capital market expertise of an international universal bank. Sal. Oppenheim’s asset management operations and comprehensive quantitative investment expertise will be transferred to the Deutsche Asset Management corporate division in the first quarter of 2018. The Sal. Oppenheim brand will not be maintained.\n\nFor further information, please contact:\nDeutsche Bank AG\nPress and Media Relations Department\nMonika Schaller\nTelephone: +49 69 910 48098\nE-Mail: monika.schaller@db.com\nAnke Hallmann\nTelephone: +49 69 910 14546\nE-Mail: anke.hallmann@db.com\nDeutsche Postbank AG\nPress Office\nJoachim Strunk\nTelephone: +49 228 920 12000\nE-Mail: joachim.strunk@postbank.de\n  About Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\n  About Postbank\nWith a balance sheet total amounting to €144 billion and 18,000 employees Postbank Group is one of Germany's largest financial service providers. It focuses on business with private customers and with small and medium-sized companies.\nPostbank offers its private customers simple, low-cost products for their daily needs. The products offered range from payment transactions and deposit and lending business to bonds, investment funds, insurance policies and home savings contracts. In online and telephone banking, Postbank boasts a leading position in Germany.\n  Disclaimer:\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them.\nThese statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 20 March 2017 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}