{
    "url": "https://www.db.com/news/detail/20171026-deutsche-bank-reports-net-income-of-eur-649-million-for-the-third-quarter-of-2017?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 26, 2017",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank reports net income of EUR 649 million for the third quarter of 2017",
    "body": "John Cryan, Chief Executive Officer, said: “While the revenue environment remained challenging, we have made significant progress on our key initiatives such as the planned merger of Deutsche Bank and Postbank in Germany as well as the preparation for the IPO of our asset management business. We are convinced that the benefits of our efforts will step by step become more apparent in the coming quarters and years.”\nDeutsche Bank’s profits increased significantly both in the quarter and in the first nine months of 2017. For the third quarter, income before income taxes was up by 51% to EUR 933 million, while net income more than doubled to EUR 649 million. For the first nine months of 2017, income before income taxes was up 64% to EUR 2.6 billion while net income more than tripled to EUR 1.7 billion.\nRevenues were negatively impacted by a market and interest rate environment which remained challenging. For the third quarter of 2017, net revenues were EUR 6.8 billion, down by 10% year-on-year, or 7% if adjusted for exchange rate movements. Client activity was subdued compared to a strong prior year quarter, while volatility and interest rates remained low.\nCost reductions boosted profit growth. Noninterest expenses were EUR 5.7 billion in the quarter, down by 14%, or 11% if adjusted for exchange rate movements. Restructuring and severance expenses were significantly lower, as were litigation charges, despite the bank successfully resolving a number of litigation matters, largely within existing provisions. Adjusted costs were down 6%, or 3% if adjusted for exchange rate movements, largely reflecting the absence of the Non-Core Operating Unit that was closed last year, and lower professional services fees. Accruals for current-year variable compensation were higher year-on-year. Total headcount fell approximately 4,000 (Full-time equivalent basis) year-on-year.\nCredit quality remained high. Provision for credit losses was EUR 184 million, down by 44% versus the prior year quarter, reflecting a broad-based improvement in the Corporate & Investment Bank and continued strong credit quality in the Private & Commercial Bank.\nOur capital ratio remains strong. The Common Equity Tier (CET1) ratio (CRR/CRD 4 fully loaded) was 13.8% for the quarter on a fully loaded basis, versus 14.1% in the second quarter. The positive impact of net income on CET1 capital was offset by a required dividend deduction, exchange rate movements and other effects. The leverage ratio (CRR/CRD 4 fully loaded) was 3.8%, stable compared to the previous quarter.\nThe first nine months of 2017\nRevenues for the first nine months were EUR 20.7 billion, down 10%, or 5.5% if adjusted for the impact of debt valuation adjustments and spreads on Deutsche Bank’s own debt. Noninterest expenses were EUR 17.7 billion, a reduction of EUR 2.7 billion or 13%, or 12% if adjusted for exchange rate movements. Adjusted costs were EUR 17.5 billion, down 6%, or 4% on an exchange rate-adjusted basis.\nProvision for credit losses was EUR 396 million, down by EUR 495 million or 56% versus the first nine months of 2016. The CET1 ratio (CRR/CRD 4 fully loaded) of 13.8% compares with 11.1% at the end of the third quarter of 2016, while the leverage ratio (CRR/CRD 4 fully loaded) improved from 3.5% to 3.8% over the same period.\nThird-quarter revenue development in Deutsche Bank’s businesses\nCorporate & Investment Bank (CIB): Revenues were EUR 3.5 billion, down 23%, or 21% adjusted for exchange rate movements, reflecting muted client activity and low volatility versus the prior year quarter which saw high levels of client activity post-Brexit.\nFixed Income & Currencies (FIC) revenues were down 36%; if reported on the basis of previous segmental reporting, including the relevant revenues now reported in the Financing segment, the year-on-year decline in FIC would have been 24%. Revenues in Equity Sales & Trading and in Origination and Advisory were lower year-on-year, while revenues in Global Transaction Banking (GTB) were lower year-on-year but stable versus the second quarter.\nGTB’s year-on-year revenue development partly reflected strategic reductions in the business perimeter. CIB has made substantial progress in the repositioning announced earlier in 2017.\nPrivate & Commercial Bank (PCB): Revenues were up 3% year-on-year at EUR 2.6 billion, driven in part by a one-time gain from the sale of shares in Concardis GmbH which was partly offset by the non-recurrence of revenues from the Private Client Services unit, sold in 2016. Adjusting for these items, revenues were stable year-on-year, as growth in fee income mitigated the impact of low interest rates.\nThe merger of Deutsche Postbank AG and Deutsche Bank Privat- und Geschäftskunden AG in the home market is proceeding on schedule, and will create a market leader with approximately 20 million clients and two distinct brands. As announced in March, Deutsche Bank anticipates annual synergies of roughly EUR 900 million from 2022 onwards. The Sal. Oppenheim business will be fully integrated into Deutsche Bank. (For further details relating to the merger of Deutsche Postbank AG and Deutsche Bank Privat- und Geschäftskunden AG please see separate release.)\nDeutsche Asset Management: Revenues were EUR 628 million (Adjusted for Abbey Life gross-up), stable year-on-year, partly reflecting a one-off item related to a real estate fund, offset by non-recurring Abbey Life revenues and lower performance and transaction fees. Net new money inflows for the quarter were EUR 4 billion, bringing the total in the first nine months of 2017 to EUR 14 billion. Invested assets were EUR 711 billion, up by EUR 5 billion in the year to date, as exchange rate movements largely offset the positive impact of favourable market developments and positive net money inflows.\nThe partial IPO of Deutsche Asset Management is proceeding on track and is anticipated to take place within the stated 24-month timeframe. Pre-IPO alignment measures are progressing well.\nPlease find the full media release as\nPDF\nPDF for download.\nAn analyst call to discuss third-quarter 2017 financial results will take place today at 14.00 CEST. This conference call will be transmitted via internet: www.db.com/quarterly-results\nA Fixed Income investor call will take place on Thursday, November 2, 2017 at 15.00 CET. This conference call will be transmitted via internet.\nA Financial Data Supplement (FDS), presentation and audio-webcast for the analyst conference call are available at: www.db.com/quarterly-results\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}