{
    "url": "https://www.db.com/news/detail/20171023-supervisory-board-deputy-chairman-rudschaefski-steps-down-as-chairman-of-group-works-council-and-general-works-council?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 23, 2017",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Supervisory Board Deputy Chairman Rudschäfski steps down as Chairman of Group Works Council and General Works Council",
    "body": "Stefan Rudschäfski has decided to reduce the number of his responsibilities. Today he informed the members of the Group Works Council and the General Works Council of his intention to step down as the Chairman of both councils for health reasons. “A chairman has to be 100% committed and available at all times. I will still be a member of both councils and play an active and constructive part in their work”, said Rudschäfski.\nThe Group Works Council and General Works Council will both elect a successor at their November meetings. Rudschäfski will continue as Deputy Chairman of Deutsche Bank’s Supervisory Board and as an active member of the Group Works Council, the General Works Council as well as Deutsche Bank’s regional Works Council in Hamburg.\nRudschäfski has served more than ten years as Chairman of the Group Works Council and was Chairman of the General Works Council for almost seven years. “I want to reduce my workload and focus on my role as Deputy Chairman of Deutsche Bank’s Supervisory Board. Deutsche Bank is now on the right track and I want to continue supporting that”, said Rudschäfski.\nThe Group Works Council includes representatives from all Deutsche Bank Group entities. The General Works Council consists of members from regional works councils as well as the Corporate Center works councils of Deutsche Bank AG and Deutsche Bank Privat- und Geschäftskunden AG.\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Contact\nChristine Peters\nPhone: 069 910 62303\nEmail: christine.peters@db.com\nFrankfurt am Main\nOctober 23, 2017\n\nHerausgeber: Gesamt- und Konzernbetriebsrat\nder Deutsche Bank AG\nTaunusanlage 12, 60325 Frankfurt am Main\nTelefon (069) 910 - 30237, Fax (069) 910 - 30213\nInternet: db.com/de\nE-Mail: patricia.spiegel@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}