{
    "url": "https://www.db.com/news/detail/20171019-deutsche-bank-kunsthalle-presents-the-pioneering-modernist-fahrelnissa-zeid?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 19, 2017",
    "tags": [
        "Art",
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank KunstHalle Presents the Pioneering Modernist Fahrelnissa Zeid",
    "body": "From October 20, 2017, to March 25, 2018, the Deutsche Bank KunstHalle is showing Germany’s first retrospective of Fahrelnissa Zeid (b. 1901, Istanbul, d. 1991, Amman) in Germany and the third presentation resulting from the cooperation between the KunstHalle and Tate Modern in London.\nFahrelnissa Zeid was a pioneering artist best known for her large-scale colorful canvases—some over five meters wide—which reveal her unique vision and distinctive abstract style. This major exhibition brings together paintings, drawings and sculptures spanning over 40 years—from expressionist works made in Istanbul in the early 1940s, to immersive abstract canvases exhibited in London, Paris and New York in the 1950s and 1960s, finishing with her return to portraiture later in life. Celebrating her extraordinary career, the exhibition presents Zeid as an important figure in the international story of abstract art.\nZeid was one of the first women to receive formal training as an artist in Istanbul, continuing her studies in Paris in the late 1920s. The show begins with her breakthrough moment in the early 1940s, when she championed experimental approaches to painting and began to exhibit with the avant-garde d Group in Turkey.\nThe works from the early part of Zeid’s career demonstrate her affinities with and divergence from international art movements, blending European painting traditions with Oriental themes. In 1946 Zeid and her husband, Prince Zeid Al-Hussein of the Hashemite royal family, moved to the UK where he had been posted as Iraqi Ambassador.\nDividing her time between London and Paris, Zeid’s exhibitions were well received by critics and artists alike, cementing her position as one of the great female artists working in the post-war period. Key paintings from her 1954 show at the ICA in London feature in this exhibition, such as My Hell 1951 and The Octopus of Triton 1953, representing the artist at the height of her career as well as the complex range of influences and life experiences she drew upon.\nWhen the Hashemite royal family was assassinated in a military coup in Iraq in 1958, Zeid and her husband were forced to vacate the embassy—and her studio —in London. In response to the coup, and perhaps in recognition of her own mortality, Zeid made a return to figurative painting.\nFor the last 20 years of her career she painted portraits of her friends and family with exaggerated features that aim to capture the ‘spirit’ of the sitter. The artist also began experimenting with painting on turkey and chicken bones, which she later cast in polyester resin panels evocative of stained-glass windows. Zeid died in 1991, aged 89, in Amman, Jordan, having exhibited across Europe, the USA, and the Middle East. She left behind a remarkable visual legacy of her extraordinary life as well as a significant contribution to the global history of modernism.\nFahrelnissa Zeid is curated by Kerryn Greenberg, Curator (International Art) and Vassilis Oikonomopoulos, Assistant Curator, Tate Modern. The exhibition is accompanied by a fully illustrated catalogue from Tate Publishing. It is available at the ArtShop of the KunstHalle with an insert in German. A program of talks and events are in the gallery.\nAfter the premiere at Tate Modern this summer and the presentation at the Deutsche Bank KunstHalle in Berlin, the exhibition will be on view at the Sursock Museum in Beirut in April 2018.\nIn cooperation with Tate Modern\nPhotographic material on Fahrelnissa Zeid can be downloaded for free at photo-files.de/deutschebankkunsthalle.\n#FahrelnissaZeid #dbKunstHalle\nFor further information, please contact:\nDeutsche Bank KunstHalle\nSara Bernshausen\nPhone: 030 / 20 20 93 14\nE-Mail: sara.bernshausen@db.com\n  About Deutsche Bank, Art, Culture & Sports\nDeutsche Bank’s commitment to art is reflected by the Bank’s new Art, Culture & Sports department. The new unit bundles the Bank’s support programs and develops them further in conceptual terms. Together with its divisions, Deutsche Bank wants to provide its customers with new access to the art, culture, and sports worlds.\nWith its involvement in contemporary art Deutsche Bank is setting standards worldwide, be it with the Deutsche Bank Collection, one of the world’s most important collections of contemporary artworks on paper and photography, with international exhibitions, or with the Deutsche Bank KunstHalle in Berlin. And for many years the Bank has had a presence at selected art fairs such as Frieze London and New York.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}