{
    "url": "https://www.db.com/news/detail/20171013-innovation-and-renovation-the-india-opportunity?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 13, 2017",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "Innovation and renovation – the India opportunity",
    "body": "India is home to multi-billion dollar revenue technology firms and household names. Combined with a burgeoning fintech network, the country provides multiple opportunities to continue transforming Deutsche Bank into a technology-led company alongside improving operational efficiency.\nGiven the bank’s large presence, significant vendor relationships and growing client base, Kim Hammonds, Group Chief Operating Officer, visited the offices in Pune and Bangalore to meet all three groups. With over 8,500 employees located across the four Indian cities of Bangalore, Jaipur, Mumbai and Pune, these centres support all the bank’s divisions and infrastructure functions.\nApart from being a key regional market, India also plays an important role in Deutsche Bank’s global technology strategy, which continues to make significant progress. This includes reducing operating systems by 25 percent and moving over 30 percent of applications to an internal private cloud. The bank has also made significant technology investments in its businesses, including the multi-award winning Mobile App; launching a robo advisor platform, WISE, within Asset Management; and Autobahn, the electronic service offering that is now the access point for thousands of counterparties\nTo support the technology ambitions of the bank, the Technology Centre in Pune is part of a global network that helps develop IT solutions for the bank. During her visit, Hammonds inaugurated a Tech Lab that will provide experimentation and training on cutting-edge technology. In the Lab, staff can work alongside colleagues in the business to solve problems together.\nWhile in Bangalore, Hammonds was shown the power of such partnerships. One example, built on the award winning Cockpit solution, helps monitor and manage exceptions for European trade settlements. This enhances control by providing real-time visibility into trade exceptions and has improved operational efficiency. Once it is scaled-up for use across sales and trading, it is expected to generate further cost savings.\n“India contributes significantly to our global COO strategy. It is a country with fantastic values such as diligence, respectfulness and authenticity – and our centres reflect that,” said Kim. “Our people here are not just making the bank more efficient, they are working with our businesses to improve the client experience.”\nDeutsche Bank’s roots in India can be traced back to 1980. The India Near and Offshore Centres were established in 2006 to harness India’s talented workforce at a competitive cost.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}