{
    "url": "https://www.db.com/news/detail/20171011-deutsche-bank-ranked-no-2-in-the-global-custodian-prime-brokerage-survey?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 11, 2017",
    "tags": [
        "Awards",
        "Company"
    ],
    "title": "Deutsche Bank ranked No. 2 in the Global Custodian Prime Brokerage Survey",
    "body": "Deutsche Bank today announced that its Global Prime Finance business, which provides a range of services to hedge funds, has been ranked a top 2 provider globally by clients in the 2017 Global Custodian Prime Brokerage Survey of investment banks, up from third place in 2016.\nNearly 2,000 hedge funds took part in the survey, making it the most comprehensive of the industry. Survey respondents rate the services provided to them by prime brokers across ten areas such as client service, operations, financing and margining, securities lending and reporting. Deutsche Bank excelled in a range of categories, particularly client service, financing and margining, and value delivered; scores for these exceeded 6.00, the threshold for “Very Good”.\nThis is a good result for Deutsche Bank, which demonstrates the positive momentum in our prime broking business and the growing strength of our client franchise after a challenging second half of 2016. We continue to seek new ways to enhance our offering to clients and look forward to building on our success in the year ahead.\nAshley Wilson, Co-Head of Global Prime Finance and Head of Trading EMEA Equities at Deutsche Bank\nDeutsche Bank’s client service was regarded as outstanding by many of the survey’s respondents. “Deutsche Bank consistently exceeds expectations and goes above and beyond,” commented one client, while another identified “very strong capabilities in the corporate actions space.”\nGreg Bunn, Co-Head of Global Prime Finance at Deutsche Bank, said: “This survey reinforces the strong progress our Prime Finance business is making. The business continues to be an investment area for the bank as we seek to capture further market share in 2018 and beyond. We thank our customers who are constantly encouraging us to expand our capabilities.”\nDeutsche Bank recorded increases in some 60% of scores for the ten categories. The most improved was for overall satisfaction with financing and margining, one of the top priorities for respondents this year.\nFor further information please contact:\nAurelie Leonard\nPhone: +44(20)754-14209\nEmail: Aurelie.leonard@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}