{
    "url": "https://www.db.com/news/detail/20171011-girl-power?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 11, 2017",
    "tags": [
        "Corporate Citizenship",
        "Education"
    ],
    "title": "Girl Power",
    "body": "Since 2012, October 11 has been marked by the United Nations as the International Day of the Girl to highlight the challenges and rights of girls and young women. According to the UN, the education and quality of life of girls have been enhanced significantly over the last 15 years: there are not only more girls attending school than 15 years ago, they also receive better medical care. Nevertheless, there is a lot left to do.\nThrough its Born to Be youth engagement programme, Deutsche Bank supports educational initiatives that enable young people to reach their full potential. Many of the Born to Be projects aim to empower girls and improve their prospects.\nIn the UK, Student to STEMette aims to inspire and nurture young women into STEM (science, technology, engineering, maths) careers by connecting them with women in industry and foreshadowing career pathways. Women make up just 14.4% of the UK’s science, technology, engineering and maths workforce. The aim of Deutsche Bank is to increase that figure. As part of four months of intensive mentoring students are paired with female Deutsche Bank employees with STEM backgrounds. The students explore different ways they can use their STEM skills within the banking industry and are introduced to STEM networks. To date, over 200 young women have accessed the programme. They have received over 1,100 hours of mentoring and gained more than 500 hours of work experience.\n\nIn India, promoting STEM education is also on the agenda of Deutsche Bank: in cooperation with Agastya International Foundation, the bank brings science education to rural villages. Likewise, Deutsche Bank staff assist Be!Fund, India’s first non-profit venture fund, on the Going to School project, which aims to reduce school dropout rates, especially among girls. This initiative has been producing high-quality textbooks for more than 10 years designed to help children develop entrepreneurial skills using a play-based approach. With so-called Be!Books, schoolchildren learn how important education is for their subsequent working lives and what they need to have to launch their own enterprises.\n\nThe UK-based organisation SPRING offers a pioneering programme based on the belief that by stimulating innovation in emerging markets, businesses can transform the lives of adolescent girls. SPRING works with businesses across many different sectors, including energy, agriculture, education and health, and helps to develop sustainable products and services. Currently eight Deutsche Bank employees are working with organisations across South Asia and East Africa on projects that are specifically aimed at raising the quality of life for girls. Tariq Aziz, Deutsche Bank London, is one of them. He worked with Drinkwell in Dhaka on building out and maintaining the company’s cash flow model. Drinkwell is a water technology company that uses a micro-franchise model to provide access to clean water.\n\nIn the US, Deutsche Bank supports the Sadie Nash Leadership Project which engages low-income girls and young women aged between 11 and 22 in a range of programmes that grow their capacity to envision and create change in their lives and their communities. The bank’s employee resource group Women on Wall Street (WOWS) has partnered with Sadie Nash in offering job-shadowing and will continue its engagement efforts in the upcoming year.\n\nSince 2008, Deutsche Bank has been a partner of the Mädchenbüro (Girls’ Office) in Frankfurt – a youth centre that offers midday meals, tutoring and help with homework as well as extracurricular activities. Deutsche Bank funds a monthly excursion for up to 40 girls with disadvantaged backgrounds. Deutsche Bank employees join them on visits to theatres and museums and provide the girls with careers advice and help with job applications.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}