{
    "url": "https://www.db.com/news/detail/20171004-frieze-art-fair-london-2017?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 4, 2017",
    "tags": [
        "Art",
        "Corporate Citizenship"
    ],
    "title": "Frieze Art Fair London 2017",
    "body": "For the 14th consecutive year, Deutsche Bank is the main sponsor of Frieze Art Fair being held in London from October 5 to 8, 2017, with a Preview Day on Wednesday, October 4.\nLocated in London’s Regent’s Park, the fair has provided a platform for Deutsche Bank to present works from its substantial collection and to bring together artists, clients and the communities in which the bank does business. Deutsche Bank has also supported Frieze Masters London and Frieze New York since their inception in 2013.\nThis year, Deutsche Bank Wealth Management will have a lounge at both Frieze London and Frieze Masters.\nFabrizio Campelli, Global Head of Deutsche Bank Wealth Management, said: “We’re very proud to be working with Frieze once again to help bring outstanding contemporary art to a wide audience of clients, employees and the public. Our support for art is one of the distinguishing characteristics of Deutsche Bank so we are delighted to find ways to share that and make a positive impact in a city where we have such deep roots.”\nIn the lounge at Frieze London, Deutsche Bank will be exhibiting works by prominent film-maker and photographer John Akomfrah (born 1957), who lives and works in London.\nHis exhibition, entitled “Thresholds To Another Time”, will showcase new photographic works as well as his award-winning film Auto Da Fé, for which he won the Artes Mundi prize in 2016.\nAkomfrah’s artistic practice will also be showing a new six-screen groundbreaking film work Purple at London’s Barbican “Curve” Gallery from October 5. The work is characterised by investigations into memory and post-colonialism, as well as exploring the real, imagined and historical lives of the global migrant experience.\nThe Deutsche Bank lounge at Frieze Masters will show works by British painter and print-maker Ken Kiff (1935-2011), under the title “Unfolding”.\nKiff’s vibrant artworks sprang directly from his imagination and emerged organically from the painting and print-making processes themselves. His work is often lyrical but can also be menacing and is equally dependent on colour and his own, very personal iconography.\nAs well as working as an artist, Kiff had a 30-year career teaching at Chelsea School of Art and the Royal College where he influenced a generation of students and was elected to the Royal Academy in 1991.\nDuring the years that Deutsche Bank has been the global lead sponsor of Frieze London, the art fair has evolved into one of the main events in the international art calendar for London and New York.\nThorsten Strauss, Global Head of Deutsche Bank Art, Culture & Sports, said: “Our longstanding association with Frieze London, Masters and New York underlines our strong commitment to new and contemporary art. Our aim is to provide clients, staff and the public with programmes and platforms to interact with and experience aspects of today's art, culture and sports.”\nOver three decades, Deutsche Bank has built an art collection that looks to the future and promotes new talent. Representing more than 5,000 artists from over 40 countries, the Deutsche Bank Collection is one of the world’s most important collections of contemporary artworks on paper and photography.\nThe bank’s art collection in London consists of over 4,000 contemporary works on paper, as well as major paintings and sculptures by artists such as Damien Hirst, Anish Kapoor, Tony Cragg and Keith Tyson.\nThe bank works together with museums, art fairs and other cultural institutions. The Deutsche Bank ‘Artist of the Year’ programme has helped provide a platform for artists such as Caline Aoun, Wangechi Mutu, Yto Barrada and Imran Qureshi. Through its KunstHalle in Berlin and touring exhibitions, Deutsche Bank enables thousands of people every year to appreciate contemporary art and gain an insight into the international art scene.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}