{
    "url": "https://www.db.com/news/detail/20210311-frank-witter-nominated-for-election-to-deutsche-bank-s-supervisory-board?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 11, 2021",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Frank Witter nominated for election to Deutsche Bank's Supervisory Board",
    "body": "Frank Witter, Group Chief Financial Officer at Volkswagen AG, has been nominated to become a member of the Supervisory Board of Deutsche Bank AG. At the Annual General Meeting on May 27, 2021, Deutsche Bank’s Supervisory Board will submit a proposal for the election of Witter as successor to Gerd Alexander Schütz, Chairman of the Management Board of C-Quadrat Investment AG, who informed Deutsche Bank that he will resign from his mandate on the Supervisory Board at the 2021 Annual General Meeting.\n“We are delighted to be able to nominate Frank Witter, a proven financial expert and a representative of a leading German industrial firm, for election to the Supervisory Board,” said Supervisory Board Chairman Paul Achleitner. “The Nomination Committee has thereby attracted a candidate to us who would further enhance the Supervisory Board with his knowledge of the demands of corporate clients and his many years of experience in banking.”\nFrank Witter was born in 1959 in Hanover. He is an economist who began his career as an apprentice in banking and has worked for Volkswagen since 1992. After holding several management positions in finance and treasury Witter became Chief Executive Officer of Volkswagen Financial Services AG, a VW subsidiary with its own banking licence, in 2008. He joined the Group Board of Management in 2015 and serves as Chief Financial Officer. Last year Witter announced he would retire from Volkswagen end of June 2021.\nPaul Achleitner thanked departing Supervisory Board member Mr. Schütz for his collaboration and his dedication to the bank: “Mr. Schütz has been a member of our Supervisory Board for four years and has made important contributions during this period. We thank him for his work and wish him well.”\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations \nSebastian Krämer-Bach \n+49 69 910-43330 \nEmail: sebastian.kraemer-bach@db.com\nChristian Streckert\n+49 69 910- 38079\nEmail: christian.streckert@db.com\nInvestor Relations\n+49 800 910-8000\nEmail: db.ir@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 3
}