{
    "url": "https://www.db.com/news/detail/20210304-deutsche-bank-and-deutsche-sporthilfe-extend-their-partnership-until-at-least-2023?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, March 4, 2021",
    "tags": [
        "Company",
        "Sports"
    ],
    "title": "Deutsche Bank and Deutsche Sporthilfe extend their partnership until at least 2023",
    "body": "The partnership between Deutsche Bank and Deutsche Sporthilfe (German Sports Aid Foundation), which has existed for 20 years, will continue. Both sides have reaffirmed their successful cooperation and extended the contract for another three years. Deutsche Bank has been a partner of the foundation since 2001 and one of its five national sponsors since 2008. \n“We are delighted to continue to stand alongside the Sports Aid Foundation and the Olympic and Paralympic athletes. It is impressive what top student athletes achieve every day. They are role models for us and for society. That’s why we want to keep on giving special support to top athletes who combine competitive sports with their studies,” says Christian Sewing, Chief Executive Officer of Deutsche Bank.\n“By extending the partnership, Deutsche Bank is sending an important signal in challenging times. We are very grateful that the athletes can continue to count on this strong support from the business world in their efforts to master the difficult balancing act between top-class sports, their studies, and career entry,\" explains Thomas Berlemann, Chairman of the Board of Deutsche Sporthilfe.\nThe Deutsche Bank Sports Scholarship remains at the heart of the partnership. With this program, Deutsche Bank supports up to 300 top student athletes, enabling them to cope with the dual burden of sports and studies and encouraging them to continue their dual careers. To date, 2,128 athletes have benefited from the sports scholarship amounting to 300 euros a month. Together, the athletes aided by the program have won gold 818 times at the Olympic Games, Paralympics, and World and European Championships.\nDeutsche Bank draws attention to the special challenges posed by the double responsibility of sports and studies as part of its #reachmygoals social media campaign featuring top student athletes. Scholarship holders such as Malaika Mihambo, world champion in the long jump and Sports Scholarship Holder of the Year 2014, are also involved in the bank’s advertising campaigns. \nIn addition, a “Sports Scholarship Holder of the Year” has been chosen from among the recipients of the Deutsche Bank Sports Scholarship since 2013. The prize-winners have included Olympic javelin champion Thomas Röhler (2018), long jump world champion Malaika Mihambo (2014), and Olympic field hockey champion Martin Häner (2013). In 2020, wheelchair basketball player and psychology student Annabel Breuer was the first Paralympic athlete to win the award.\nContact:\nDeutsche Sporthilfe\nFabian Müller\nTel.: +49 69 7803 - 514\nEmail: fabian.mueller@sporthilfe.de\nInternet: www.sporthilfe.de\nDeutsche Bank\nKlaus Winker\nTel.: +49 173 291 4884\nEmail: klaus.winker@db.com\nInternet: www.db.com",
    "number_of_ratings": 17,
    "rating": 1.0,
    "likes": 23
}