{
    "url": "https://www.db.com/news/detail/20210302-empowering-women-in-apac-to-choosetochallenge?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 2, 2021",
    "tags": [
        "Corporate Citizenship",
        "Diversity"
    ],
    "title": "Empowering women in APAC to #ChoosetoChallenge",
    "body": "Across Asia Pacific, Deutsche Bank’s CSR programmes support female social entrepreneurs and charities solving problems in their community and helping to change the lives of thousands through grass-roots initiatives\nSupporting women in China’s rural villages achieve financial independence\nWomen in rural communities tend to spend much more time on childcare and household work than their urban counterparts, facing persistent structural restraints to equality, including more limited access to higher education and paid work. Deutsche Bank is partnering with the China Women's Development Foundation as part of its CSR Made for Good entrepreneurship initiative. The bank is supporting a project designed to alleviate the poverty faced by these women by helping them establish business plans and market their skills online. The in-person training courses include teaching participants how to live-stream on e-commerce platforms to sell goods that they make.\nCapacity building programme for female social entrepreneurs in Asia to drive environmental sustainability\nPartnering again with global social enterprise-enabler Ashoka, Deutsche Bank is sponsoring a capacity building programme for 10 female social entrepreneurs determined to drive environmental sustainability in the region. On March 8, budding entrepreneurs can apply to join the programme. The capacity building programme is specially tailored for female change makers to address some of the gender barrier issues faced by women social entrepreneurs. Staff mentors will be inducted into the programme to further coach these entrepreneurs. Following the completion of the programme, these social entrepreneurs will be invited to pitch their business plans. Deutsche Bank’s sponsorship of the programme, part of its CSR Made for Good initiative, includes providing a grant prize for the top two social enterprises, helping the female entrepreneurs to succeed in their start-ups.\nRe-thinking food waste in Australia by delivering meals to vulnerable groups\nWhen female founder Ronni Kahn started food rescue organisation OzHarvest she had one objective in mind: to stop huge volumes of unwanted food from Australia’s supermarkets, restaurants, cafes and hotels being thrown out and making sure it was delivered to vulnerable and food-poor groups. Through funding and volunteering, Deutsche Bank has supported OzHarvest since its inception in 2004, backing Khan in her aspiration to halve food waste in Australia by 2030.\nHelping protect women and children in Japan\nLights for Children in Tokyo worked with the Tokyo Social Welfare Association for Mother and Child to provide funding to four maternal and child living support homes in the Kanto area of Tokyo in December 2020 to procure essential items for the women in their care. According to Japan’s National Police Agency data, cases of domestic violence reached record levels last year – a trend reported by many countries globally during the pandemic. With Deutsche Bank’s In the Community focus, it continues to support these women in other ways, including a business suits donation drive, where staff can contribute pre-loved suits to allow these women to have a higher rate of success at job interviews and start an independent life.",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 3
}