{
    "url": "https://www.db.com/news/detail/20210428-bank-reports-EUR-1-6-billion-profit-before-tax-in-the-first-quarter-of-2021?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 28, 2021",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank reports € 1.6 billion profit before tax in the first quarter of 2021",
    "body": "Highest quarterly Group profit for seven years\nProfit before tax of € 1.6 billion with net profit of € 1.0 billion\nGroup post-tax Return on Tangible Equity (RoTE)¹ of 7.4%\nCore Bank profit before tax of € 2.0 billion, more than double the prior year quarter, driven by significant profit growth across all core businesses\nCorporate Bank: up 90% to € 229 million\nInvestment Bank: up 134% to € 1.5 billion\nPrivate Bank: up 92% to € 274 million\nAsset Management: up 66% to € 183 million\nCore Bank post-tax RoTE¹ of 10.9%, versus 4.9% in the prior year quarter\nCapital Release Unit reduces quarterly pre-tax loss by 46% year on year with further RWA reduction\nPositive net revenues of € 81 million\n28% year on year reduction in noninterest expenses\nNet revenue growth of 14% to € 7.2 billion\nHighest Group quarterly net revenues since 1st quarter 2017 despite business exits\nCore Bank net revenues grew 12% to € 7.2 billion\nFurther year on year reduction in costs\nNoninterest expenses of € 5.6 billion, down 1%\nAdjusted costs ex-transformation charges¹ down 2% to € 5.3 billion including bank levy charges of € 571 million\n13 successive quarters of year on year reductions in quarterly adjusted costs ex-transformation charges and bank levies¹\nCapital, risk and balance sheet strength maintained in the quarter\nCommon Equity Tier 1 (CET1) capital ratio rises to 13.7%\nProvision for credit losses of € 69 million, down 86% year on year, representing 6 basis points of average loans annualised\nLiquidity reserves stable versus previous quarter at € 243 billion\n¹ For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ on pp 17-25 of the 1st quarter 2021 Financial Data Supplement\nOur first quarter is further evidence that Deutsche Bank is on the right path in all four core businesses, and is building sustainable profitability. In addition to substantial revenue growth over an already-strong prior year quarter, we demonstrated cost and risk discipline. We achieved a post-tax return on tangible equity of above 7%, and returns in the Core Bank are already ahead of our ambition for next year. These results give us confidence that we’ll reach our 2022 targets. \nChristian Sewing, Chief Executive Officer\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today reported its best quarterly profit since the first quarter of 2014. This result was driven by revenue growth, a substantial reduction in provision for credit losses, and lower adjusted costs¹ year on year.\nSignificant profit growth across all businesses\nProfit before tax was € 1.6 billion for the first quarter of 2021, up from € 206 million in the first quarter of 2020. Net profit was € 1.0 billion, compared to € 66 million in the prior year quarter. The Group delivered post-tax RoTE¹ of 7.4% in the quarter, versus a negative 0.3% in the prior year period, with a cost/income ratio of 77%. First-quarter profit includes the impact of € 571 million in bank levies in respect of the full year.\nIn the Core Bank, which excludes the Capital Release Unit, profit before tax more than doubled year on year to € 2.0 billion. This was driven by significant year on year profit growth across all four businesses. Core Bank post-tax RoTE¹ was 10.9%, up from 4.9% in the prior year quarter, while the cost/income ratio improved to 71%, versus 77% in the prior year period.\nAdjusted profit before tax¹, which excludes specific revenue items, transformation charges, impairments of goodwill and intangibles and restructuring and severance, was € 2.2 billion, also more than double the prior year quarter, and adjusted post-tax RoTE¹ was 11.9%. For the Core Bank results at a glance, please refer to the table on page 7.\nLosses in the Capital Release Unit reduced by nearly half\nThe Capital Release Unit reported a loss before tax of € 410 million in the quarter, versus a loss before tax of € 765 million in the first quarter of 2020. This improvement was partly driven by net revenues of € 81 million in the quarter, compared to negative € 57 million in the prior year quarter. De-risking costs in the current quarter were offset by positive revenues from gains on asset sales and reserve releases, reflecting market conditions, and positive operating income.\nNoninterest expenses in the Capital Release Unit declined by 28% year on year to € 498 million. This was driven predominantly by a 36% reduction in adjusted costs ex-transformation charges¹ to € 422 million, reflecting year on year reductions in service cost allocations, bank levy allocations and compensation costs.\nThe Capital Release Unit further reduced risk weighted assets (RWAs) which stood at € 34 billion at quarter-end, down by 24% from € 44 billion in the prior year quarter. De-risking of € 1.5 billion in the quarter was offset by model impacts and higher credit valuation adjustments (CVA). RWAs include € 23 billion in Operational Risk RWAs. Leverage exposure was € 81 billion at quarter-end, versus € 118 billion in the prior year quarter and € 72 billion in the fourth quarter of 2020.\nThe quarter on quarter increase primarily reflected an incremental allocation of central liquidity reserves discussed at the Investor Deep Dive in December 2020. This, together with higher Prime Finance leverage, more than offset leverage exposure reductions from continued de-risking, maturities, market movements and other effects.\nRevenues: financing and advising clients in supportive markets\nGroup net revenues were € 7.2 billion, up 14% year on year, the highest quarterly revenues since the first quarter of 2017 despite exits from non-strategic businesses as part of transformation. The year on year growth was driven primarily by 12% growth in Core Bank revenues to € 7.2 billion.\nNet revenue development in Deutsche Bank’s core businesses was as follows:\nCorporate Bank net revenues were € 1.3 billion, down 1% year on year, and up 2% if adjusted for currency translation effects. Interest rate headwinds were offset by positive impacts from further progress on deposit re-pricing, which covered a total of € 83 billion in deposits at the end of the quarter, and the ECB’s current Targeted Long-Term Refinancing Operation (TLTRO III) programme, as the bank met the additional loan growth requirement. Corporate Treasury Services revenues were down 1%, but up 2% adjusted for currency impacts, due partly to TLTRO III, deposit repricing and portfolio rebalancing measures. Institutional Client Services revenues were down 3%, while on a currency-adjusted basis revenues grew 3% as fee income growth in Trust and Agency Services more than offset a decline in Securities Services driven by lower interest rates. Business Banking revenues were up 1% year on year, despite interest rate headwinds.  \nInvestment Bank net revenues were € 3.1 billion in the quarter, up 32%. Revenues in Fixed Income & Currencies (FIC) rose 34% to € 2.5 billion, driven by strong year on year growth in Credit Trading and Financing. This more than offset a normalisation of revenues in Rates, Foreign Exchange and Emerging Markets from the exceptional levels of the prior year period. Revenues in Origination & Advisory rose 40% to € 644 million. Significant growth in Equity Origination was driven by strength across the franchise, including high levels of activity in Special Purpose Acquisition Companies (SPACs), while a rebound in Leveraged Debt Capital Markets contributed to growth in Debt Origination. Deutsche Bank grew market share in Origination & Advisory by 30 basis points year on year (source: Dealogic). Revenue growth was achieved with continued resource discipline: RWAs were down 4% year on year and the cost/income ratio was 52%, down from 63% in the prior year period.\nPrivate Bank net revenues were € 2.2 billion, flat year on year. Continued deposit margin compression from interest rate headwinds was mitigated by continued business growth, with record net new business volumes of € 15 billion in the quarter. This included net inflows of investment products of € 9 billion and net new client loans of € 4 billion. In the Private Bank in Germany, revenues were up 1%, while in the International Private Bank, revenues were down 1% year on year but up 1% if adjusted for specific items and currency translation effects. The current quarter also benefited from the TLTRO III programme and higher fee income from insurance products. Assets under Management rose by € 26 billion to € 519 billion during the quarter, exceeding half a trillion euros for the first time since 2017, reflecting five consecutive quarters of net inflows in investment products and positive effects from market performance and currency translation. \nAsset Management net revenues rose by 23% to € 637 million in the quarter. Management fees were essentially stable year on year, as four consecutive quarters of client inflows and supportive market conditions offset industry-wide pressure on margins. Revenues were positively impacted by a favourable change in the fair value of guarantees, and performance and transaction fees more than doubled versus the prior year quarter. Assets under Management rose by € 28 billion in the quarter to € 820 billion, a record level, reflecting supportive markets and currency movements. Net inflows were € 1 billion during the quarter; inflows in Passive and Alternatives were largely offset by outflows from low-margin cash products as investors returned to risk assets.\nCosts remain in line with transformation targets\nNoninterest expenses were € 5.6 billion in the quarter, down 1% versus the prior year quarter. These included bank levies of € 571 million, up by 13% year on year, and transformation charges of € 116 million, up 38%. Adjusted costs ex-transformation charges¹, bank levies and reimbursable expenses related to Prime Finance were € 4.7 billion, down 4%.\nThis was the thirteenth consecutive quarter of year on year reductions in adjusted costs on this basis. The internal workforce was 84,389 full-time equivalents (FTEs) at the end of the quarter, a reduction of 2,278 FTEs since the first quarter of 2020.\nSignificant improvement in provision for credit losses\nProvision for credit losses was € 69 million in the quarter, down 86% from € 506 million in the first quarter of 2020, and 6 basis points (bps) of average loans on an annualised basis. Provisions for non-performing loans (Stage 3) were reduced by 40% versus the prior year quarter, due partly to fewer impairment events and partly to releases on specific exposures. Provisions were further reduced by releases of provisions for performing loans (Stage 1 and 2), which reflected an improved macro-economic outlook.\nContinued conservative management of capital and balance sheet\nThe Common Equity Tier 1 (CET1) ratio rose to 13.7% during the quarter. CET1 capital was positively impacted by net income, partly offset by a dividend accrual of € 300 million, equity compensation and other effects.\nRisk weighted assets (RWAs) rose slightly from € 329 billion to € 330 billion during the quarter, largely reflecting currency translation effects. An increase in RWAs of € 4 billion due to the European Central Bank’s Targeted Review of Internal Models (TRIM) materialised as expected in the first quarter. The bank expects approximately 80 basis points of additional CET1 ratio burden from final TRIM decisions and other regulatory RWA inflation expected in the second quarter of 2021.   \nThe Leverage Ratio was 4.6% (fully loaded) in the first quarter, down by 8 basis points from the end of the previous quarter and excluding certain central bank deposit balances. Including these balances, the ratio would have been 4.2%, down by 12 basis points versus the previous quarter. This development reflects growth in leverage exposure of 2% during the quarter, predominantly driven by currency translation effects, together with trading volumes and net loan growth. On a phase-in basis, the Leverage Ratio was 4.7%, down by 8 basis points quarter on quarter.\nLiquidity reserves were € 243 billion at the end of the first quarter, stable versus the fourth quarter of 2020. The Liquidity Coverage Ratio was 146% and the surplus over regulatory requirements was € 70 billion.\nContinued progress on sustainable financing and investment\nDeutsche Bank continued to make progress in growing sustainable financing and investment volumes during the quarter. Volumes rose by € 25 billion, the highest quarterly volume to date, to a cumulative total of € 71 billion, up from € 46 billion at the end of the fourth quarter of 2020. First quarter 2021 milestones included:\nDeutsche Bank’s second green bond, a US dollar-denominated senior preferred debt instrument with a five-year tenor, raised 800 million US dollars. The proceeds enable Deutsche Bank to refinance projects such as energy-efficient commercial real estate.\nWorking with the New Development Bank in Shanghai to issue the first emerging markets panda bond, a renminbi-denominated issuance with a coupon of 3.22%. This aims to finance sustainable activities to support all 17 UN Sustainable Development Goals. The bond was issued with reference to the UNDP Sustainable Development Goals Impact Standards for bonds and raised 5 billion renminbi in China’s onshore bond market.\nRaising 750 million US dollars through a senior non-preferred bond issuance in New York, working in partnership with additional underwriters owned and led by management teams consisting of women, minorities, and service-disabled veterans. This transaction reflects Deutsche Bank’s commitment to diversity and inclusion within the financial community.\nLaunching green deposits for clients of the Corporate Bank and International Private Bank. These offer cash management solutions in the form of term deposits which finance an equivalent sum in the bank’s green asset pool, thereby linking clients’ liquidity requirements with their sustainability goals. Eligibility criteria for companies include certain levels of ESG ratings.\nDeutsche Bank will host a Sustainability Deep Dive on May 20, 2021.\nRead \nPDF\nthe full media release in the downloadable PDF.",
    "number_of_ratings": 2,
    "rating": 1.0,
    "likes": 36
}