{
    "url": "https://www.db.com/news/detail/20210419-get-a-fresh-perspective-with-chief-investment-office-podcasts-now-on-apple-and-spotify?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 19, 2021",
    "tags": [
        "Wealth"
    ],
    "title": "Get a fresh perspective with Chief Investment Office podcasts, now on Apple and Spotify",
    "body": "You can now get a fresh perspective on economic and market themes with regular, easily digestible podcasts from the Chief Investment Office (CIO) of the International Private Bank (IPB) on Apple and Spotify.\nThe CIO Weekly Investment Outlook, available every Monday morning, and Future Fundamentals podcast, out every couple of months, enable you to hear directly from experts including Global Chief Investment Officer Christian Nolting on the drivers for key events in the coming days and the long term investing implications of today’s issues in the years to come respectively.\nIn this week’s episode of the Weekly Investment Outlook: Earnings gains and growth hopes, Global Chief Investment Strategist Gerit Heinz explains the driving forces behind better-than-expected Q1 corporate earnings reports and U.S. and Chinese economic recoveries. He also looks at the European Central Bank’s policy options at its April 22 meeting as the Eurozone struggles for lift-off. To hear it, subscribe with Apple or Spotify, or listen on deutschewealth.com.\nIn the latest Future Fundamentals podcast, Nolting speaks with Constantin Coussios, a professor at the University of Oxford and medical device innovator, about how digitalisation and demographics are converging to improve lives and create investment opportunities. To hear it, visit deutschewealth.com.\nTo find all of the CIO podcasts in one place, visit Spotify or Apple Podcasts.\nYou can read CIO reports and other IPB news and information at deutschewealth.com or by following Deutsche Bank International Private Bank’s LinkedIn page.\n(Your capital may be at risk.)",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 3
}