{
    "url": "https://www.db.com/news/detail/20210408-deutsche-bank-annual-general-meeting-2021-to-be-held-virtually-again?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, April 8, 2021",
    "tags": [
        "Financial Results"
    ],
    "title": "Deutsche Bank Annual General Meeting 2021 to be held virtually again",
    "body": "For the first time the entire General Meeting including the general debate and voting will be publicly broadcast live through the Internet\n\nSpeeches of Paul Achleitner and CEO Christian Sewing will be published on the bank's website on May 19, 2021\n\nNew interactive dialogue facilities to be introduced for shareholders \nDue to the ongoing pandemic, Deutsche Bank’s (XETRA: DBKGn.DB / NYSE: DB) Annual General Meeting (AGM) will once again take place as a virtual meeting. Aligned with the Supervisory Board, the Management Board invited all shareholders of the bank to join on May 27, 2021.\n\"Dialogue with our shareholders is of utmost importance to us”, says Supervisory Board Chairman Paul Achleitner.  “After one year of hosting and attending digital events, we want to use our manifold experience to ensure an even more interactive and shareholder-friendly second virtual Annual General Meeting.\"\nFor the first time the entire General Meeting including the general debate and voting will be publicly broadcast live through the Internet. Furthermore shareholders who have submitted their questions in time will have the opportunity to raise follow-up questions regarding the topics of their own original questions live during the General Meeting. “We will also give shareholders the opportunity to speak during the live video broadcast of the General Meeting in order to further increase interaction between shareholders and management of the bank\", says Stefan Simon, Chief Administrative Officer and management board member.\nThe Agenda, which comprises thirteen items in total, was published in the German Bundesanzeiger and on Deutsche Bank's website (https://agm.db.com/) on April 8. Consistent with the announcement made as part of the strategic transformation in July 2019, no common equity dividend will be proposed for the 2020 financial year. Deutsche Bank intends to resume capital returns from 2022 for the fiscal year 2021 subject to successful strategy execution and regulatory approvals.\n Details on interactive dialogue facilities\n The format provides ample opportunities for shareholders to exercise their rights.\nTo allow shareholders enough time to prepare questions, the speeches of Paul Achleitner and CEO Christian Sewing will be published on the bank's website on May 19, 2021.\n\nThe Management and Supervisory Boards will answer questions from shareholders as usual. Questions can be submitted in advance via the Shareholders Portal by May 25, 2021 (24:00 CEST).\n\nThere will be a forum for shareholders’ statements on the topics of our General Meeting. Statements that are properly submitted to the company by May 21, 2021 (12:00 CEST) will be published on the bank’s website.\n\nShareholders who have submitted their questions in time may be given the limited opportunity to raise follow-up questions regarding the topics of their own original questions during the General Meeting. Deutsche Bank also intends to grant shareholders the possibility to speak during the live audio and video broadcast of the General Meeting. Both are subject to securing that the General Meeting can be concluded within a reasonable timeframe on the same day.\nShareholders will be able to exercise their voting rights once registered. Shareholders may vote electronically via the Shareholder Portal, via postal vote or by issuing a power of attorney to the company's proxies or third parties. Registered shareholders will have the opportunity until the end of the question-and-answer session at the virtual AGM to change their voting intentions. \nFurther details of how shareholders can exercise their shareholder rights are set out in the notes for shareholders on the agenda of the meeting.\n  For further information please contact:\nDeutsche Bank AG\nMedia Relations                                          \nSebastian Krämer-Bach\nPhone: +49 69 910 43330\nEmail: sebastian.kraemer-bach@db.com             \nChristian Streckert\nPhone: +49 69 910 38079\nEmail: christian.streckert@db.com                                                           \nInvestor Relations\n+49 800 910-8000\nEmail: db.ir@db.com\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 11
}