{
    "url": "https://www.db.com/news/detail/20201030-2020-female-fintech-competition-winner-announced?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 30, 2020",
    "tags": [
        "Awards",
        "Company",
        "Corporate products",
        "Digitalisation",
        "Entrepreneurship",
        "Research"
    ],
    "title": "2020 Female FinTech Competition winner announced",
    "body": "After two months, 43 applications, six finalists and one virtual pitch: Nuggets has emerged as the winner of the 2020 Female FinTech Competition.\nThe UK-based e-commerce payments and ID platform allows users to store their personal and payment details securely in the blockchain, so it is never shared online. According to Nuggets: “That means no more data breaches – because companies don’t have to store your data. So you can use services and make payments without worrying about your privacy and security.”\nThe competition, run by Deutsche Bank, Atos, Google Cloud and TechQuartier, invites FinTechs with a female founder or female(s) in the top management groups to pitch their business case. The winner earns a place on Atos’ FinTech programme, while the remaining finalists are able to access and benefit from Deutsche Bank and Google Innovation resources.\nDeutsche Bank judge Luc Mériochaud said: “All six finalists delivered really compelling pitches, and we had a tough time judging. In the end, we had to agree on which one had the strongest business case at this moment in time, but I am looking forward to seeing how they all develop as I am convinced each has the potential to succeed.”\nThe competition aims to promote gender diversity in the FinTech space. A recent study from Deloitte found that only 7% of finance-based startup founders were women, and that this group is still being denied equal access to opportunities. The same study found that just 1.3% of the funding raised in 2019 by FinTechs went to companies founded only by women.\nMériochaud added: “Gender diversity is much-needed in the FinTech sector. Not only are women severely under-represented relative to the population, there is also plenty of evidence that greater gender diversity results in more successful new ideas, products and services. My hope is that this competition showcases the talent in the market and creates role models to inspire women at all levels.”\nThe full list of finalists and judges can be found below:\nFinalists\nFranca Perin – IMPACTIN (France)\nIwona Pawlak – Smart Forest (Poland)\nSeema Khinda Johnson – Nuggets (UK)\nSerena Torielli – Virtual B (Italy)\nAnnie Guo – Silkpay (France)\nNerissa Naidu– Axil (USA)\nJudges\nLuc Mériochaud, Global Head of Innovation Network and Corporate Venture Capital, Deutsche Bank\nOzlum Yavus, HRD for AtoS Central Europe and Germany, Atos\nAnnette Maier, MD, Google Cloud Germany\nLucas Schmitt, Head of Innovation Products, Tech Quartier\nAbout Deutsche Bank\nDeutsche Bank provides retail and private banking, corporate and transaction banking, lending, asset and wealth management products and services as well as focused investment banking to private individuals, small and medium-sized companies, corporations, governments and institutional investors. Deutsche Bank is the leading bank in Germany with strong European roots and a global network.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 3
}