{
    "url": "https://www.db.com/news/detail/20201028-deutsche-bank-surged-into-second-place-for-green-bonds?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 28, 2020",
    "tags": [
        "Company",
        "Financial Results",
        "Sustainability"
    ],
    "title": "Deutsche Bank surged into second place for green bonds",
    "body": "It is only five months since Deutsche Bank announced its ambitious and quantifiable target to reach at least 200 billion euros of sustainable financing and investments by the end of 2025.The target is only one facet of our commitment, however. Reaching it means embedding sustainability firmly into our processes.\nIn this context, we have made great progress, also in the third quarter of this year: we published our Sustainable Finance Framework, announced that we would end business activities in coal mining by 2025 and issued our first Climate Statement. At the same time we saw a big push for ESG related products in all business areas, with outstanding results in the field of green bond issuance in particular.\n“The momentum being generated throughout the bank is unparalleled”, says Viktoriya Brand, Head of Group Sustainability. “Our institution is undergoing an irreversible behavioural and cultural shift towards embedding climate protection and sustainability across all areas of the bank. The achievements in 2020 demonstrate our commitment to integrate sustainability holistically across our entire business and become a leader in this field.”\nBut what qualifies as sustainable financing and what makes an investment product sustainable? With the publication of our Sustainable Finance Framework we now have transparent criteria to consistently classify transactions as sustainable. It is a key prerequisite to achieve our target of 200 billion euros in sustainable financing.\nAt the same time we are stating clearly what kind of business we will not do in future because it contradicts our view on sustainability. That is why we announced in July that we will stop financing coal mining by 2025 and also have a new Fossil Fuels Policy with regard to business activities involving oil, gas and coal worldwide. We will analyse the portfolio over the coming months together with the businesses and devise a roadmap for how we can reduce our activities throughout the next few years.\nBy signing the Equator Principles for assessing environmental and social risk in July we made another clear commitment to supporting a more sustainable economy going forward. These principles ensure that major infrastructure projects are developed in accordance with robust environmental and social standards.\nOur general stance on climate protection and which measures we undertake to fight climate change is summarized in our Climate Statement which we issued in August. It encompasses sustainable finance, our own climate footprint and the commitment of our employees.\n3Q2020 Business Achievements in Sustainable Finance and ESG Products and Assets\nWe are convinced that supporting a more sustainable economy is a very worthwhile goal in and of itself. But as CEO Christian Sewing repeatedly highlighted in recent months, we also strongly believe that there is a huge business opportunity for those banks who assist clients in the transformation of the economy.\nThe third quarter provided considerable evidence to support this:\nOur Debt Capital Markets business led 29 transactions and helped our clients raise more than 27 billion euros in sustainable financing, with underwriting volume of 4 billion euros – almost as much as in the full year 2019. Deutsche Bank ranked second by fees and third by volume in Green Bond underwriting, up from 14th by volume in the fourth quarter of 2019 (source for all rankings: Dealogic).\nOur achievements include the issuance of Germany’s first green federal security, where our Debt Capital Markets team acted as joint marketing advisor and book runner, as well as key roles in arranging the inaugural green and sustainability bonds for Egypt and Luxembourg respectively.\nIn the financial space, we acted as joint book runner on a highly successful transaction for MunichRe – the first green bond by a German (re-)insurance company. Outside the EMEA region, we managed inaugural Green Bonds for Visa for example. In the first nine months of 2020, Deutsche Bank led 59 transactions and helped clients raise more than 46 billion euros in sustainable financing, versus 13 billion euros in the prior year period.\nThe Private Bank successfully executed the public offering of the bank’s first self-issued retail green bond in Belgium. Recently we integrated environmental, social and governance aspects (ESG) into our Chief Investment Office platform of the International Private Bank. Clients benefit from the offer of an integrated portfolio management strategy, as ESG portfolio strategies have outperformed non-ESG strategies in the past.\nIn Germany, we are piloting three “green branches” where we provide clients with information on sustainability and ESG-linked investment, insurance and mortgage products. On the product side, for example, we converted VarioInvest, an insurance product for retirement, into an ESG investment concept.\nIn Asset Management cumulative year-to-date net flows were 17 billion euros, of which more than one-third were in environmental, social & governance (ESG) assets. In the third quarter FTSE Russell confirmed that DWS is among the companies listed in its FTSE4Good Index Series – a leading market tool designed to help investors looking to invest in companies that demonstrate good sustainability practices measured against globally recognized standards. Furthermore, for the third year in a row, DWS has received the highest possible A+ rating for Strategy & Governance in the UN’s Principles for Responsible Investment (PRI) annual assessment.",
    "number_of_ratings": 1,
    "rating": 3.0,
    "likes": 33
}