{
    "url": "https://www.db.com/news/detail/20201028-a-message-from-christian-sewing-on-q3-results?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 28, 2020",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "A message from Christian Sewing on Q3 results",
    "body": "The following message from CEO Christian Sewing was sent to all staff of Deutsche Bank\nDear Colleagues,\nDespite the coronavirus pandemic, our third quarter results were well ahead of our internal plans. We achieved a pre-tax profit of almost half a billion euros, translating into a profit after tax of 309 million euros, in spite of still elevated provisions for credit losses, extremely low interest rates and persistently difficult working conditions.\nThat means that we were profitable in each of the first three quarters in a year which has been characterised by an unprecedented economic slump. Given our nine month profit before tax of 846 million euros, we continue to be confident that we will achieve a positive pre-tax result for the full year.\nThis is something that only a team that is constantly prepared to give its very best day after day would have been able to achieve during such a fundamental transformation. I’d like to thank you all most warmly on behalf of the Management Board and the Group Management Committee.\nThis performance was down to progress on both revenues and costs in almost equal measure. In the third quarter we grew Group revenues by 13 percent year-on-year and at the same time reduced our noninterest expenses by 10 percent. This puts us on a good path to the target we set for our return on tangible equity in 2022.\nSo once again, we proved that, first, we are implementing the transformation of our bank with unrelenting discipline, and second, we have the operational strength to counter the headwinds afflicting the economy and the financial sector.\nOur performance in the third quarter shows us that our decision to refocus the Investment Bank was the right one. With businesses in market-leading positions, we are now better positioned to support clients and benefit from the improved conditions that we have seen in the industry.\nIn Fixed Income & Currencies Sales & Trading we posted double-digit year-on-year revenue growth in each of the last four quarters. In the third quarter we outperformed the market as revenues grew by 47 percent. In Origination & Advisory we even achieved our highest market share in six quarters. In the first nine months of the year we helped clients raise debt financing worth almost 1.5 trillion euros, already an increase of 21 percent over the whole of the previous year.\nAnd as a global green bond arranger, we have climbed to third place, up from 14th in the fourth quarter of 2019. Last week we supported the European Union as one of the lead managers for the largest ever social bond. All of this convinces us that the revenue performance in the Investment Bank is not just cyclical, but to a large degree sustainable.\nBoth the Corporate Bank and the Private Bank were affected by extremely low interest rates. We have found ways to offset the majority of the lost interest income. In the Private Bank, we extended net new client loans of 5 billion euros in the third quarter, taking our year-to-date total to 9 billion euros. We also booked 3 billion euros of inflows in investment products, bringing our total since the beginning of the year to 12 billion euros.\nWe completed the creation of our International Private Bank and continue to reap the synergies from merging our legal entities in Germany. Moreover, we are making faster progress than we planned in realigning our branch network in our home market to our clients’ preferences. The coronavirus pandemic has caused a surge in demand for video advice and digital offerings. We are investing to engage with clients the way they want us to.\nIn the Corporate Bank deposit repricing already generated additional revenues of 125 million euros in the first nine months of this year. In the third quarter our transaction bank performed in line with or even better than our peers and we were able to slightly increase revenues in Commercial Banking. Areas where we expect to grow further include our 800,000 business clients in Germany: we have bundled our offering for the Deutsche Bank, Postbank and Fyrst brands under the umbrella of “Deutsche BizBanking” on a joint technology platform.\nDWS continued to grow despite the turbulence caused by the pandemic. Our Asset Management business increased revenues in the third quarter by 4 percent. Net inflows reached 11 billion euros; inflows since the beginning of this year total 17 billion euros. More than one-third of this growth is in sustainable investments.\nHere too, it is clear how strongly positioned we are in a vital growth area. At the same time, DWS significantly cut costs: for the first nine months of the year, its adjusted cost-income ratio was already down to 64 percent, reaching the target level for 2021.\nAt Group level we also continued our rigorous focus on cost discipline, another indicator of our operational strength. For the eleventh quarter in a row, we achieved a year-on-year reduction in our adjusted costs excluding transformation charges and bank levies. This puts us well on track to meet our 2020 target of 19.5 billion euros, which will represent a reduction of 3.3 billion euros in two years.\nMoreover, costs related to our transformation are now also set to diminish: after five quarters we have already put 81 percent of the transformation-related effects we anticipated through 2022 behind us.\nWe have put to rest concerns about our capital strength. Our Common Equity Tier 1 (CET1) capital ratio remains unchanged at 13.3 percent, well above regulatory requirements, partly because our Capital Release Unit continues to manage down its balance sheet as planned. Our liquidity reserves are up to 253 billion euros.\nIn line with the guidance we gave as early as in April, loan loss provisions dropped in the third quarter, to 273 million euros. This speaks to the quality of our risk management and means that we are in a good position to support our clients and take advantage of new business opportunities.\nFive quarters have passed since we announced our new strategy. In all of these five quarters, we performed either in line with or ahead of our plan. We have delivered on all of our major milestones. While we see further challenges arising from higher COVID-19 infection rates and the economic and financial market conditions, we are confident that we will remain on track – thanks to your support.\nLet me offer you heartfelt thanks for all your hard work.\nBest wishes,\nChristian Sewing",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}