{
    "url": "https://www.db.com/news/detail/20201022-deutsche-bank-retains-no-1-ranking-for-international-trade-finance-and-global-clearing-eur-and-usd-in-asia-pacific?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 22, 2020",
    "tags": [
        "Awards",
        "Company",
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Deutsche Bank retains No.1 ranking for International Trade Finance and Global Clearing (EUR and USD) in Asia Pacific",
    "body": "Deutsche Bank was named \"Best International Trade Finance Bank\" for the third year in a row, and \"Best Global (EUR and USD) Clearing Bank\" in Asia Pacific for the sixth consecutive year at The Asian Banker Transaction Finance Awards. These awards recognise the bank’s market-leading Trade Finance and Institutional Cash Management (ICM) capabilities during an unprecedented year.\nThe publication at the same time announced their \"Bankers Choice Awards\", where Deutsche Bank took home \"Best Supplier Relationship Management in Hong Kong\" for our partnership with General Mills and \"Best Corporate Trade Finance Deal\" for Trafigura Singapore with Bharat Aluminium, India. The Asian Banker Transaction Finance Awards recognises leadership in cash management, trade finance, supply chain finance and payments amongst domestic and international financial institutions in Asia Pacific, the Middle East and Africa. The winners are determined through a combination of surveys, interviews and field research.\nSetting a high bar\nDeutsche Bank's Regional Head of Trade Finance and Lending in Asia Pacific Atul Jain, said: “We are humbled and proud to accept this award for the third year running, one which sets the bar for recognising excellence in the trade finance industry. The challenges of 2020 have necessitated even higher levels of service quality, innovative thinking, and partnership: all towards the singular goal of delighting our clients. Our Asia Pacific team has delivered yet again, and this award is an acknowledgment of their tireless efforts and strive for excellence.”\nCommenting on the win for Global Clearing, based on clearing volume and other stringent assessment criteria, APAC Head of Institutional Cash Management at Deutsche Bank, Nancy So, added: “This award is testimony to the long-term client relationships we have built in this region and the fact that we remain the bank of choice for our institutional clients seeking global clearing services for the two dominant currencies. Both factors continue to differentiate us and we are very proud of that.”\nThe Asian Banker Transaction Finance Awards 2020 – Deutsche Bank wins:\n• Best International Trade Finance Bank in Asia Pacific\n• Best Global (EURO & USD) Clearing Bank in Asia Pacific\n• Best Supplier Relationship Management in Hong Kong –Deutsche Bank and General Mills\n• Best Corporate Trade Finance Deal in Singapore/India - Deutsche Bank and Trafigura, Singapore and Bharat Aluminium, India\nTop bank for Structured Trade Finance and Treasury for new economy and NBFI clients in Asia Pacific\nJust last month, Deutsche Bank also won three regional awards at The Asset Treasury & Trade Awards, including:\n• Best Regional Bank in APAC for Structured Trade Finance\n• Best in APAC for Treasury & Working Capital for Non-Bank Financial Institutions (NBFIs)\n• Best in APAC for Treasury & Working Capital for New Economy clients (e.g. FinTechs and eCommerce businesses)\nThese regional awards are on top of the 38 awards Deutsche Bank already won from The Asset earlier in the year.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}