{
    "url": "https://www.db.com/news/detail/20201022-deutsche-bank-leads-largest-ever-social-bond-for-the-european-union?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 22, 2020",
    "tags": [
        "Corporate products",
        "Investment Banking",
        "Sustainability"
    ],
    "title": "Deutsche Bank leads largest ever social bond for the European Union",
    "body": "Deutsche Bank helped the European Union (EU) break new records this week by leading its inaugural jumbo social bond. The 17 billion euro issuance, split between a 10 billion euro 10-year and a 7 billion euro 20-year tranche was the largest social bond ever. With an order book exceeding 233 billion euros, it attracted more demand than any other bond in history according to Refinitiv.\nThe transaction marks the EU’s debut issue from its 100 billion euro SURE programme, which will provide loans to help member states reduce unemployment during the Covid pandemic. Around 30 billion euros of the approximately 100 billion euro SURE scheme is expected to be funded this year, with the remainder due next year. The EU has said it will increase its debt issuance further in 2021 as it starts to finance its larger programme, an 800 billion euro recovery fund agreed in July. The programme is set to make the EU one of the region’s biggest debt issuers.\nDeutsche Bank took a lead role as billing and delivery (B&D) to manage all investor hedges within the book, and duration manager, managing the allocation process for all 1,092 investors. Seamless coordination between multiple teams in the bank including the European government bond desk, Sovereign, Supranational and Agency (SSA) trading, the swap desk, synthetics desk and worldwide sales, meant that the bank’s syndicate team was able to execute an extremely smooth and efficient transaction. Deutsche Bank’s trading floor broke in to a spontaneous applause when the deal priced at 16.25 CET, symbolising the pride employees felt from the bank being part of this historic transaction.\nThis is a very impressive outcome and is already performing very well in the secondary market which is exactly what an issuer is looking for in an inaugural transaction such as this. The number of investors we have seen in this trade is unprecedented, paving a solid foundation for the EU’s future issuances. Being duration manager on such a prestigious transaction is a huge win for Deutsche Bank.\nNeal Ganatra, Head of SSA Syndicate in EMEA\nPanayiotis Stergiou, Head of ICG FIC EMEA, Global Head of ICG Macro Sales and Head of the SSA Coverage Group added: “The unparalleled breadth & strength of our European fixed income client franchise allowed us to partner with the issuer and our clients to place this inaugural deal into very strong client demand. Deutsche Bank’s global network also leverages our European fixed income expertise into clients in Asia and the Americas, resulting in over 500 client orders in each tranche. As a European bank, supporting this significant and historic step in the European Union’s progression is where Deutsche Bank wants to be positioned. Supporting financing for the economy in uncertain times, driving forward the ‘social bond’ issuance market and being there for our clients to support their needs.”\nTrisha Taneja, Head of Environmental, Social and Government (ESG) Advisory in the Investment Bank, added: “Three or four years ago there were barely any SSA ESG issuers. The fact the EU has achieved such a successful outcome is a sign of how far this market has come in such a short time.”\nThe Covid pandemic has brought social bonds in to the spotlight this year, as seen by the rapid stream of Covid-19 Relief Bonds from SSA issuers. There has also been a significant increase in the number of green bonds brought to market from SSAs, driven by increased focus on sustainable finance by the public sector and society at large. Last month Deutsche Bank was joint bookrunner on Egypt’s green bond, the first by a Middle East sovereign, and on the Republic of Germany’s inaugural green bond.\nKatrin Wehle in SSA DCM Origination EMEA who is responsible for the EU and other supranationals, said: “The volume of ESG issuance by SSAs has more than doubled this year to 183 billion euros, due in part to governments’ response to the pandemic. Deutsche Bank has been at the forefront of this trend, helping SSA clients to issue 11.5 billion euros of ESG debt year to date, in 27 transactions.”\nThe EU’s landmark deal comes hot on the heels of recent important ESG mandates from Luxembourg, Egypt and The Republic of Germany. They highlight our growing market presence in this exciting new market. Furthermore, these deals, coupled with the 6 billion US dollar deal from the Ministry of Finance of the People’s Republic of China last week, demonstrate the strength of our broader SSA DCM franchise and the faith that governments put in us to execute their bond deals.\nFrazer Ross, Head of Investment Grade DCM Syndicate EMEA",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 3
}