{
    "url": "https://www.db.com/news/detail/20201014-coding-against-the-odds?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 14, 2020",
    "tags": [
        "Careers",
        "Company",
        "Diversity"
    ],
    "title": "Coding against the odds",
    "body": "Carrying out everyday tasks in a world which mostly provides visual cues could appear as a daunting task for people with visual disabilities. And when the everyday task involves writing code, the challenges could seem much larger for sighted people. However, for Balaji Varadarajan from the India Technology Centre, who lost his sight in his twenties, this is something he does with great ease. As we celebrate International White Cane Day, we find out how he does that.\nPhotographic memory\nBalaji is a software developer with 25 years of experience, who joined the bank about a year ago. He is currently working in the Tax Technology team, who ensure the completeness of data that is shared with regulators. To help him with his job, he uses a screen reader called JAWS (Job Access with Speech) to read text off the screen, and writes code based on the audio cues.\nAnd while other coders depend on an Integrated Development Environment (IDE) to simplify their work, Balaji relies on a more rudimentary text editor, which he says is faster for him. “Most of all I rely on my photographic memory to manually integrate code and now the process is second nature to me,” he says.\nBlind before age 28\nWhen he was 13 years old Balaji developed retinitis pigmentosa, a genetic disorder that caused the breakdown of cells in the retina. Since then he rapidly lost vision in both eyes, which has left him totally blind by the time he turned 28. Although it was due to peer pressure that he got into technology, he says that it was a great decision:\n“As assistive technology had greatly developed by the time I turned blind, I didn’t have to take a break in my career. If I had chosen another career path, it might have been difficult to continue without a great deal of adjustment.”\nBlazing the trail\nHis manager describes him as a fiercely independent person who insists on being treated as just another employee and colleagues describe him as a passionate technologist who is always eager to learn.\nOutside his day job, Balaji has blazed a trail for other visually impaired employees at Deutsche Bank. As an active member of dbEnable, the bank’s staff network focused on promoting an inclusive, supportive and accessible workplace for all, he has raised awareness about the blind tech talent that is available in the market and the need for more accessible internal communications. Beyond this, he also helps visually impaired youth by teaching them to code.\nBalaji says, “I enjoy working at Deutsche Bank, because I know the bank’s commitment to fairness and equal opportunity comes from the heart. In fact, I think it’s a model to other corporates”.\n“Deutsche Bank is for everyone and technology has an important role to play in bringing the best out of our talent,” said Bernd Leukert, Chief Technology, Data and Innovation Officer and sponsor of dbEnable. “Balaji’s story is both inspirational and a lesson that everything is possible if we take the time to understand the different challenges our people face.”\nIndia currently has seven persons with blindness and low-vision in various roles and divisions of the bank.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}