{
    "url": "https://www.db.com/news/detail/20150629-deutsche-bank-finances-its-first-large-scale-renewable-energy-project-in-south-africa?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 29, 2015",
    "tags": [
        "Africa",
        "Sustainability"
    ],
    "title": "Deutsche Bank finances its first large-scale renewable energy project in South Africa",
    "body": "Deutsche Bank acted as sole structuring bank, mandated lead arranger, hedging bank and facility agent and underwrote ZAR 2.1 billion (EUR 155 million) in debt capital in this transaction. The initiative was developed by Solar Capital, an experienced South African renewable energy developer, which has already completed a similar sized solar photovoltaic plant in the De Aar region. The project’s co-sponsor is the Shapoorji Pallonji Group, an established infrastructure, real estate and investment group from India. The Shapoorji Pallonji Group will also construct and operate the solar photovoltaic plant through its affiliate construction company Sterling & Wilson.\nGrowing appeal of sustainable energy sources\nThe plant qualifies under South Africa’s Renewable Energy Independent Power Producer Procurement Programme. As such, it will benefit from a fixed tariff under a long-term power purchase agreement with the state-owned utility, Eskom and supported by the Republic of South Africa.\n“This deal illustrates the growing appeal of sustainable energy sources across the world and Deutsche Bank’s ability to provide innovative financing solutions for our clients globally.” Michael Volkermann, Head of Infrastructure & Energy, EMEA\nDeutsche Bank is one of the largest financiers of renewable energy worldwide. In 2014, the Bank provided around EUR 1 billion in capital which helped finance projects with a value of more than EUR 4.3 billion and with a total capacity of approximately 1.8GW across Europe, North and South America and Asia.",
    "number_of_ratings": 3,
    "rating": 3.7,
    "likes": 4
}