{
    "url": "https://www.db.com/news/detail/20150629-deutsche-bank-goes-live-with-kyc-service?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "June 29, 2015",
    "tags": [
        "Company",
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Deutsche Bank goes live with KYC service",
    "body": "Deutsche Bank’ Global Transaction Banking (GTB) division has embedded SWIFT’s Know Your Customer (KYC) Registry, a centralised repository that maintains a standardised set of information about correspondent banks required for KYC compliance, into its KYC procedures. GTB’s financial institution clients who make their data available via this shared platform will now benefit from a smoother and streamlined review as part of the regular KYC process the Bank has to undertake. Deutsche Bank has also contributed its own data into the repository.\nThe KYC Registry includes entities from more than 130 countries, facilitating compliance with a growing number of correspondent relationships worldwide. SWIFT operates the service and steers an annual review cycle to ensure the data is up-to-date. The KYC Registry was developed in collaboration with major global banks around the world. Deutsche Bank was part of this working group and uses the service since June 2015.\nThe centerpiece of The KYC Registry is an extensive and transparent standard set of KYC data and documentation that was endorsed by the industry working group in 2014 and embedded into the application allowing contributors to share their data with their counterparties. Each bank retains ownership of its own information, as well as control over which other institutions can view it. Banks are not charged for data contribution or for using the registry to share their KYC information with other banks.\nMarcus Sehr, Global Head of Institutional Cash, Global Transaction Banking, at Deutsche Bank, said: “This central repository with frequently updated customer information should greatly facilitate the KYC process. The KYC Registry should help us to meet ever growing requirements around compliance standards while at the same time reduce the administrative burden for those clients who participate in the initiative. Such level of standardisation and collaboration is key to improve the efficiency and reliability of recurring KYC controls.”\nLuc Meurant, Head of Banking Markets and Compliance Services at SWIFT, said: “The KYC Registry is a key initiative behind SWIFT’s commitment to help its community comply with financial crime compliance regulations. We are very pleased with the level of participation in the registry, both from large global and regional banks as well as financial communities. Adding a major global bank such as Deutsche Bank to our growing list of participants demonstrates the value The KYC Registry is bringing to the correspondent banking community.”",
    "number_of_ratings": 2,
    "rating": 1.0,
    "likes": 1
}