{
    "url": "https://www.db.com/news/detail/20150609-deutsche-bank-hosts-china-green-financial-reform-taskforce-meeting?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 9, 2015",
    "tags": [
        "Sustainability"
    ],
    "title": "China green financial reform",
    "body": "The green financial reform taskforce is a project of the China Council for International Cooperation on Environment and Development (CCICED). CCICED was established in 1992 as a unique high level international advisory body to further strengthen cooperation and exchange between China and the international community.\nIt is chaired by the Vice-Premier of China, Mr. Zhang Gaoli, and is composed of Vice-Ministers and other senior Chinese officials and experts as well as international figures such as the German Minister of Environment.\nIts previous recommendations have been influential in the development of environmental policy and regulations by the Chinese government as a whole as well as by relevant individual Government ministries. The taskforce is co-chaired by Andrew Steer, President and CEO of World Resources Institute, and Chen Yulu, President of Renmin University of China.\nChina’s ongoing efforts to transform its economy with renewable energy and begin a process of green financial reform are groundbreaking and very encouraging, as 2015 is a critical year for several key international political processes. The country has the opportunity to leapfrog the West by focusing the Asia Infrastructure Investment Bank, the Silk Road Infrastructure Fund and their domestic financial policies on facilitating environmental protection and a low-carbon economy.\nCaio Koch-Weser in a keynote speech to participants\nAndrew Pidden, Global Head of Sustainable Investments in Deutsche Asset and Wealth Management, also spoke at the event and said: “China is already the largest investor in renewable energy. It is rapidly creating a massive clean technology business and investment opportunity for investors and companies both within China and internationally.”\nThe taskforce discussed a range of potential reforms that are under consideration by the Chinese Central Bank (the People’s Bank of China), the China Banking Regulatory Commission (CBRC), other financial regulators and the Ministry of Finance. These include:\nDeveloping Green Bond guidelines for China and preferential risk weighting as well as capital regulations.\nEncouraging major Chinese banks to increase lending to green projects and improve environmental risk assessment.\nCreation of a national environmental fund.\nMandatory environmental disclosure requirements for listed companies and transparent reporting of investors’ environmental investment practices.\nA key member of the taskforce is Ma Jun, Deutsche Bank's former China Chief Economist and now Chief Economist at the People's Bank of China (PBOC). The PBOC has publicly stated that a green financial reform will be a key part of China’s next five-year plan.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}