{
    "url": "https://www.db.com/news/detail/20150607-media-release-deutsche-bank-appoints-john-cryan-to-succeed-juergen-fitschen-and-anshu-jain?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "June 7, 2015",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Deutsche Bank appoints John Cryan to succeed Jürgen Fitschen and Anshu Jain",
    "body": "The Supervisory Board of Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) decided at an extraordinary meeting today to appoint John Cryan (54) to the position of Co-Chief Executive Officer, effective July 1, 2015. Mr. Cryan has been a member of Deutsche Bank’s Supervisory Board since 2013, and has served as Chairman of the Audit Committee and a member of the Risk Committee. Upon becoming Co-CEO, he will step down from the Supervisory Board.\nMr. Cryan was President for Europe at Temasek, the Singaporean investment company, from 2012 to 2014. Previously, he was Chief Financial Officer of UBS from 2008 to 2011 and worked in corporate finance and client advisory roles at UBS and SG Warburg since 1987. He is a graduate of the University of Cambridge.\nThe appointment of Mr. Cryan as Co-CEO follows the decision of Jürgen Fitschen (66) and Anshu Jain (52), Co-Chief Executive Officers, to step down early from their roles. Mr. Jain will step down on June 30, 2015, and the Supervisory Board has asked him to remain as a consultant with Deutsche Bank from July 1, 2015, to January 2016.\nThe Supervisory Board has asked Mr. Fitschen to remain in his current role until the conclusion of the Annual General Meeting on May 19, 2016, to help ensure a smooth transition. Their contracts were due to run through to March 31, 2017. Upon Mr. Fitschen’s departure on May 19, 2016, Mr. Cryan will become sole CEO.\nPaul Achleitner, Chairman of the Supervisory Board of Deutsche Bank, said: “On behalf of the Supervisory Board, I would like to express our gratitude and respect for the contributions that Jürgen and Anshu have made to our bank. Due to their decades of commitment, Deutsche Bank attained its leadership position.\n\"Their decision to step down early demonstrates impressively their attitude of putting the bank’s interests ahead of their own. We are grateful to Jürgen for having agreed to continue to serve in his role until the conclusion of the Annual General Meeting on May 19, 2016, to help ensure a smooth transition.”\nAchleitner continued: “Over the course of two decades, Anshu has been instrumental in founding, and then growing, many of Deutsche Bank’s leading businesses. Without his efforts, our bank today would not have achieved or sustained its global leadership. Anshu has earned a place in our bank’s history as an executive who helped to transform Deutsche Bank into the global leader, rooted in Germany, that it is today.”\nAchleitner concluded: “We are pleased to have appointed John Cryan as Co-Chief Executive Officer. John is not only a seasoned banker with extensive experience in financial matters but also espouses the professional and personal values required to advance Deutsche Bank and Strategy 2020. He knows the bank well, and we are convinced that he is the right person at the right time. We wish John and all of our employees success in this important next phase for the bank.”\nAnshu Jain, Co-Chief Executive Officer of Deutsche Bank, said: “It has been 20 years this month since I came to work at Deutsche Bank and it has been an extraordinary time. Over the past three years, I have been afforded the privilege and honour to lead this great institution together with Jürgen.\n\"In our time as the bank’s leaders, we have boosted capital, reduced exposures and risk and invested significantly in technology, control and compliance capabilities. Most significantly, we have kept our clients happy and our revenues growing while reshaping and strengthening the bank.”\nJain continued: “I believe that with Strategy 2020 in place, which puts the bank’s future on a strong track, it is right for the bank and for me to have new leadership at this time. I will be forever honored to have served here, and I am convinced that the future of the bank is bright and in very good hands.”\nJohn Cryan, Chief Executive Officer-designate of Deutsche Bank, said: “It is a profound honour for me to have been named Chief Executive Officer of Deutsche Bank. I believe that Deutsche Bank is a special institution. Our future will be defined by how well we deliver on strategy, impress clients and reduce complexity. I look forward to beginning this work on July 1.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 19
}