{
    "url": "https://www.db.com/news/detail/20150603-deutsche-bank-to-open-three-innovation-labs?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "June 3, 2015",
    "tags": [
        "Company",
        "Digitalisation"
    ],
    "title": "Deutsche Bank to open three innovation labs",
    "body": "Deutsche Bank today announced plans to open three innovation labs in Berlin, London and Silicon Valley, working with three technology partners: Microsoft in Berlin, HCL in London and IBM in Silicon Valley.\nThe labs, which will be known as Deutsche Bank Labs, will help the organisation apply new technologies from three global centres of innovation to enhance its products, services and processes. They will also further strengthen the Bank’s ability to innovate, while deepening its relationships with technology start-ups.\nThe labs form part of the digital element of Strategy 2020, under which the Bank plans to spend up to EUR 1 billion on digital initiatives over the next five years.\nStaff from the Bank and its partners will engage with start-ups and academic institutions to evaluate potential technology solutions for the Bank and its clients’ business needs. They will then trial and develop this technology further in the labs, collaborating with clients where appropriate.\nThe three partners, all of whom have experience of running innovation labs, will contribute resources, expertise and relationships to the Bank-led efforts. The aim is for the labs to evaluate over 500 start-up ideas per year. All three labs will be fully operational by the beginning of the fourth quarter of 2015.\nHenry Ritchotte, Chief Operating Officer and Chief Digital Officer of Deutsche Bank, said: “Technology is transforming banking and innovation is one of Deutsche Bank’s core values. These labs will act as a bridge between start-ups and different parts of the Bank, enabling it to apply innovative technology to enhance service to clients and internal processes.”\n  For further information please contact:\nDeutsche Bank AG\nPress & Media Relations\nDon Hunter\nPhone: +44(20)754-14120\nE-mail: don.hunter@db.com\nNicolas Nonnenmacher\nPhone: +49 69 910 41749\nE-mail: nicolas.nonnenmacher@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}