{
    "url": "https://www.db.com/news/detail/20210510-what-do-investors-expect-from-the-bank-with-regard-to-sustainability?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 10, 2021",
    "tags": [
        "Sustainability"
    ],
    "title": "What do investors expect from the bank with regard to sustainability?",
    "body": "Investors, clients, NGOs and other stakeholders watch our progress in sustainability closely. With a dedicated “Sustainability Deep Dive” on May 20th the bank plans to update on where we stand with regard to implementing our sustainability strategy, what we have achieved in the businesses and where we have further work to do. Only recently we announced that our sustainable financing and investment volume rose in the first quarter by 25 billion euros to 71 billion euros in total.\nBut how do our investors think about our progress? We talked to Viktoriya Brand, Head of Group Sustainability, and Silke Szypa, Deputy Head of Investor Relations, who speak to institutional investors on Environmental, Social and Governance (ESG) matters, on what they expect from the bank going forward.\nOne can read everywhere that investors are focusing more and more on ESG. Can you confirm this from your talks with investors?\nSilke Szypa: Yes, our investors and analysts are interested in these topics, as ESG criteria have become an important element of global investing. Large asset manager or pension funds, endowments as well as treasury departments of especially larger companies have led and paved the way, which is rapidly being adapted by other investor groups. Just recently Viktoriya and I talked to large asset managers from the UK but also Germany which all consider ESG elements in their investment decisions, some also pay attention to governance topics. DB Research estimates that by 2030, 95 percent of global Assets under Management will be allocated taking into account ESG criteria – that’s 130 trillion euros. So, the trend is likely to continue.\nHow do shareholders see the bank’s sustainability performance?\nViktoriya Brand: They clearly acknowledge our progress. With the publication of our five-year sustainable finance and investment target of at least 200 billion euros by 2025 we have gained credibility, as investors had asked for many years for business related sustainability objectives which are quantifiable. Shareholders also appreciate the strengthened governance, as this builds the foundation for the integration of sustainability into our client business and our risk management.\nWhat is most relevant for our stakeholders – and what else do they want to see from us?\nSilke Szypa: Investors have always been looking at the ‘S’ and ‘G’ from several perspectives, including conduct aspects, our control environment or HR topics such as diversity and inclusion. One of our latest investor meetings focused on the ‘E’ and especially on climate change: they asked us when we will be able to measure the carbon footprint related to our clients, as a few European banks already report so called financed emissions, meaning carbon emissions associated with companies in their loan book. Furthermore, investors ask how we help clients with their transition toward the Paris Agreement targets. Investors also want to gain transparency on the returns from ESG activity to model in their investment case.\nHow do investors see our 200 billion euro target? Do they think this is achievable or do they think it is not ambitious enough?\nViktoriya Brand: Our Sustainable Finance Framework published last year and outlining the criteria we apply to classify our business as sustainable is seen as best practice. On the other hand, there are questions on e.g. the composition of the targets, especially the share of lending or capital market deals. Having achieved 71 billion euros by the end of March demonstrates that our businesses can deliver, but also prompts questions about future markets developments. However, overall, our Sustainable Finance target is received as credible and ambitious.\nAnd what about our new Sustainability Committee at Management Board level and senior management’s compensation now being linked to ESG factors? Does this matter to investors?\nSilke Szypa: Yes. For investors it is important that ESG is embedded into top-level decision-making, and thus in our strategy. The newly established committee at Management Board level is further evidence of that. The recent decision, linking top management compensation to further ESG criteria is clearly supporting that perception.\nWhat surprised you most in your conversations with investors?\nViktoriya Brand: In the past governance used to be the most prominent topic for investors. As Silke mentioned, the focus has shifted materially to questions around environmental and social dimensions and of course the governance around those. The focus on climate risk management will remain one of the key themes. The quarterly investor update on ESG which we started in 2020 is important to them. We will continue to provide this transparency which is key in the dynamic environment of sustainability. In this respect, the upcoming Sustainability Deep Dive will be an important piece in the puzzle for investors and all other stakeholders who wonder what sustainability looks like at Deutsche Bank.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}