{
    "url": "https://www.db.com/news/detail/20210510-deutsche-bank-rolls-out-new-esg-fund-range-for-wealthy-clients-in-germany?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 10, 2021",
    "tags": [
        "Sustainability",
        "Wealth"
    ],
    "title": "Deutsche Bank rolls out new ESG fund range for wealthy clients in Germany",
    "body": "Deutsche Bank Wealth Management is offering its clients in Germany new strategies in investment funds in which the environment, social issues and good corporate governance (ESG) play a key role. In doing so, the bank is driving positive change and responding to the growing demand from its clients, who want to pursue investments that reflect their values and to increase opportunities for returns from sustainable investments.\nThe new funds are based on the asset allocation approach of Deutsche Bank’s International Private Bank (IPB), which includes Wealth Management.\nWhen selecting investment tools, sustainability aspects are taken into account and certain business practices and areas of business are excluded. This process also incorporates data from MSCI – a leading global provider of sustainable indices and benchmarks – into its analysis.\nThe ESG funds are aligned with IPB’s global view, as were their predecessors, the well-known Vermögensfondsmandate. They are available with Conservative, Balanced and Growth risk profiles and include a more competitive “all in” fee.\n“The behaviour and goals of many investors are changing, so the timing for our ESG fund strategies could not be more appropriate,\" says Christian Nolting, global Chief Investment Officer (CIO) and Head of Investment Solutions for the IPB. “High net worth individuals want to invest in sustainable assets as efficiently as possible. They are no longer satisfied with a passive role, but want to use their expertise and their investments actively and in a goal-orientated way.”\nNolting adds: “At the same time, more and more investors realise that sustainability is not simply a variant of philanthropy. This has made private and institutional investors aware that responsible, long-term goals do not have to mean giving up interesting short- and medium-term return opportunities.\"",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 13
}