{
    "url": "https://www.db.com/news/detail/20210507-sustainability-deep-dive-three-hours-steeped-in-sustainability?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 7, 2021",
    "tags": [
        "Strategy",
        "Sustainability"
    ],
    "title": "Sustainability Deep Dive: three hours steeped in sustainability",
    "body": "Why are we holding our own sustainability event?\nWe’re aiming to provide a transparent, focused report on all the bank’s achievements over the past months and years. But what’s even more important: we aim to show where Deutsche Bank is heading on the sustainability front – and why that will be important for our clients, our staff, our shareholders, non-governmental organisations and society at large.\nWho can participate?\nYou can – if you are interested in environmental, social and governance (ESG) topics and would like to know why a bank like ours can play a key role in transforming the economy and society into sustainably operating entities.\nWhere can I find the agenda and what can I actually expect of the event?\nCEO Christian Sewing will present our new sustainability strategy and heads of the businesses – such as Stefan Hoops (Corporate Bank), Mark Fedorcik and Claire Coustar (Investment Bank), Claudio de Sanctis (International Private Bank) and Lars Stoy (Private Bank Germany) – will detail the actual ways they will focus on sustainable finance to implement this strategy. Our clients will also have their say, of course: we will find out from them which challenges they face and how our bank can support them in their transformation to a sustainable business model.\nIn addition, Management Board member and CEO Americas Christiana Riley and Global Head of Human Resources Michael Ilgner will talk about our plans and ambitions with regard to diversity and inclusion. And because reporting, risk management and data will be indispensable for the transition to more sustainable operations, Gerald Podobnik (CFO, Corporate Bank) and Chris Jaques (CRO, Group Enterprise Risk Management) will describe what we will be doing in these areas. Of course the driving forces behind the bank’s sustainability activities and the initiators of this event will also be participating live: Viktoriya Brand, our Head of Group Sustainability, and Jörg Eigendorf, who is responsible for Group-wide sustainability strategy and implementation.\nCan I follow the SDD in English and German?\nYes. All speakers will converse in English, but they will be interpreted simultaneously into German.\nCan I ask questions during the event?\nYes, via a chat function. You can find out how it works at the start of the event.\nWhere and when can I find the speakers’ presentations?\nVideo recordings of the individual presentations and agenda items can be found on the Sustainability Deep Dive 2021 website.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 7
}