{
    "url": "https://www.db.com/news/detail/20210505-sydney-film-festival-announces-deutsche-bank-fellowship-for-first-nations-film-creatives?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "Sydney, May 5, 2021",
    "tags": [
        "Asia-Pacific",
        "Culture"
    ],
    "title": "Sydney Film Festival announces Deutsche Bank Fellowship for First Nations film creatives",
    "body": "Sydney Film Festival (SFF) and Deutsche Bank today announced that submissions are open for an exciting new grant for Australian First Nations film creatives.\nThe Deutsche Bank Fellowship invites film creatives to submit applications before 18 July 2021 at sff.org.au/initiatives/Deutsche-Bank-Fellowship/. The winning Fellow will be awarded the grant to further develop their skills through international placement, or other professional development.\nDarren Dale, Sydney Film Festival Board Member, director of Blackfella Films, and award-winning producer, said, “Sydney Film Festival is proud to be working with Deutsche Bank to offer this incredible opportunity to First Nations film creatives.”\nIn addition to the Fellowship, Deutsche Bank will support SFF, through a partnership alignment with the Festival’s First Nations Film program. Deutsche Bank as lead corporate partner will help to further the Festival’s commitment to the Australian First Nations film sector. The SFF First Nations Film program is also supported by Screen Australia’s Indigenous Department.\nGlenn Morgan, Deutsche Bank Australia’s Interim CEO, said, “We are delighted to partner with the Sydney Film Festival and play a role in showcasing First Nations creatives within the industry. Supporting aspiring artists is a great way for us to have a positive impact,”\n“This partnership brings together our commitment to the Indigenous community, along with our longstanding focus on the arts and we look forward to seeing the outstanding talent this grant will attract.”\n“We encourage all Aboriginal and Torres Strait Islander film creatives, who have already started a career in any discipline within the film and television industry, and who are currently based in Australia, to apply,” Dale added.\n“The Fellowship is an important investment in developing and nurturing the talents of local creatives and enhancing global awareness of Australia’s vibrant Indigenous filmmaking talent.”\nEligible applicants are welcomed from creatives, screenwriters, producers, directors and actors with a proven track record in their chosen field.\nThe successful candidate will be selected by a panel of key industry personnel, and the Fellowship will be awarded at the 68th Sydney Film Festival which will take place 18-29 August 2021.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}