{
    "url": "https://www.db.com/news/detail/20210629-notalone-how-we-are-addressing-youth-mental-health-across-uk-and-ireland?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 29, 2021",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "#NotAlone: How we are addressing youth mental health across UK and Ireland",
    "body": "Following the announcement of Deutsche Bank’s global #NotAlone campaign highlighting the impact of the pandemic on youth mental health, the focus of support across UK and Ireland will be for two expert charities – YoungMinds in the UK and Jigsaw in Ireland. Established leaders in providing young people with advice and guidance that speaks their language, both charities provide vital resources for those facing concerns about their mental wellbeing.\nInvesting to help an entire generation\nGlobal research and evidence shows how the pandemic has worsened an existing mental health crisis amongst those under 25. The National Health Service has seen a 48% increase in the number of young people with a probable mental health disorder – rising from one in nine to one in five since the start of the pandemic. \nYoungMinds and Jigsaw have both seen significant increased demand on their services. And with impacts of this pandemic expected to be felt for years to come, Deutsche Bank is providing skilled partners relief through financial support for strategic programmes.\nThe bank’s investment will impact our #NotAlone charity partners in the UK and Ireland by:\nYoungMinds\nHelping to deepen the charity’s Never Alone digital programme, which supported 2.5 million users in 2020 alone (an increase since 2019 of 96%)\nInvesting to co-create more blogs, videos, worksheets, toolkits, with experts and young people who have lived experience of struggling with mental health.\nStrengthening the portal that provides 24 hours, free guidance and speaks to young people like a trusted friend\n“We are thrilled to be the UK Charity for Deutsche Bank’s #NotAlone campaign. The pandemic has had a huge impact on children and young people’s mental health and we must continue to be there for them at this truly crucial time. The incredibly generous support from Deutsche Bank will help young people to feel less alone and know how to look after their mental health through the vital digital information and advice we provide,” says Emma Thomas, YoungMinds Chief Executive.\nJigsaw\nAdvancing the Jigsaw Schools Hub for students and teachers across Ireland\nHelping to reach 360,000+ students and 65,000+ teachers with vital resources that aim to normalise conversations around mental health\nProviding active engagement and learning tools directly to the classroom to help young people improve their mental health literacy, building their own toolkits and identifying how to help others in need\n“We are so proud to be the Irish charity partner with Deutsche Bank for their wonderful #NotAlone campaign. The impact of this pandemic has been challenging for us all, but no more so than for young people in education. Many young people, and their schools’ staff, are experiencing feelings of anxiety, stress and loss. The resources our Jigsaw Schools Hub provide, which is being supported by funds raised from Deutsche Bank’s #NotAlone campaign, will ensure that teachers and school staff have access to the support and resources they need to feel confident exploring mental health and wellbeing with young people”, said Joseph Duffy, CEO of Jigsaw, the National Centre for Youth Mental Health.\nEvery step helps us invest more for young mental health\nSince lockdown has been hard on everyone, we are launching regional #NotAlone steps challenges to help our employees look after their own health and wellbeing too. By taking part, UKI employees will help earn a boost donation of EUR 50,000 for YoungMinds and Jigsaw when a target of 50million steps is reached.\n“Empowering young people to reach their full potential is one of the core commitments of our corporate social responsibility strategy. We therefore encourage all of you to get behind our #NotAlone campaign to help support the next generation through this challenging time”, says Lareena Hilton, Global Head of Brand Communications & Corporate Social Responsibility.",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 2
}