{
    "url": "https://www.db.com/news/detail/20210629-deutsche-bank-and-investec-arrange-financing-to-revitalise-ghana-s-railways?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 29, 2021",
    "tags": [
        "Africa",
        "Corporate products",
        "Private products"
    ],
    "title": "Deutsche Bank and Investec arrange financing to revitalise Ghana’s railways",
    "body": "Deutsche Bank and Investec in partnership with Swedish Export Credit Agency (EKN), Swedish Export Credit Corporation (SEK) and Export Credit Insurance Corporation of South Africa (ECIC) today announced the signing of an agreement to finance the construction of a 100km stretch of Ghana’s  Western Railway Line, running from Takoradi Port to Huni Valley.\nThe project is part of the Republic of Ghana’s initiative to expand and develop its rail network infrastructure, updating the route to make it safer and faster while providing an alternative to less environmentally friendly modes of transport, such as haulage trucks and private cars.\nThe 600 million euro financing consists of two loans in favour of Ghana’s Ministry of Finance. Deutsche Bank acted as mandated lead arranger (MLA) for both loans.\nThe first, backed by EKN and fully arranged by Deutsche Bank, is a 523 million euro loan covering the bulk of the cost. The second is a 75 million euro commercial loan arranged and structured by Investec to cover the down payment on the EKN-backed financing. It is backed by ECIC and funded by a syndicate of Investec Bank Ltd, Rand Merchant Bank, a division of FirstRand Bank Limited, Nedbank Limited (London branch) and Sanlam life Insurance Limited (acting through its Sanlam Capital Markets division).\nEngineering, Procurement and Construction (EPC) contract of the project will be carried out by Amandi Investment Ltd with Bluebird Finance & Projects Ltd acting as lead financial advisor for the EPC.\nHon. Ken Ofori-Atta, Minister of Finance for the Republic of Ghana, said: “This project is part of Ghana’s railway infrastructure plan and has been earmarked for implementation by government and will be the single biggest railway investment by the country, post-independence. The Western Railway line is key to the haulage of agricultural produce and minerals from the middle belt to Takoradi Port in the south of Ghana. The completion of the line will boost economic activities along the corridor and will reduce cost and time of transporting goods and passengers between the two ends.”\nWerner Schmidt, Global Head of Deutsche Bank’s Structured Trade & Export Finance said: “This deal is the latest in a long line of Deutsche Bank projects in Ghana, helping the government improve the country’s infrastructure. This transaction will finance part of the Western Railway Line, which will help strengthen Ghana’s economic growth by increasing both freight and passenger connectivity between the different regions in the country but also serves transportation of different mineral deposits. The new standard gauge line will create job opportunities, help the environment and improve community safety by reducing the number of vehicles on the roads. The loan is structured with a strong focus on international environmental and social standards”.\nThe involvement of EKN and SEK reflects the significant number of Swedish sub-suppliers participating in the project, with the Export Credit Agencies’ backing helping secure a highly favourable borrowing rate. Malin Tegner Larsen, Senior Underwriter at EKN comments, “EKN's mission is to enable financing of the purchase of Swedish high-quality service and equipment. It is particularly rewarding that EKN has participated in this important project.”\nWorking with Investec on the commercial loan, Mandisi Nkuhlu, COO ECIC, said that: “ECIC is delighted to support Investec in arranging the finance for this transaction and in doing so secure significant export contracts and jobs for South Africa as well as intra African trade.”\nThis transaction is one of a number of recent major infrastructure financings for Investec in Ghana involving the support of African based EPC contractors with export credit supply chain financing solutions, with two further projects currently in financial close in the health and transportation sectors.\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations                                          \nMohanad Nahas\nPhone: +971(4) 3611-754\nEmail: mohanad.nahas@db.com \n                                                                       Investec Bank\nMedia Agency\nClaudia Smith\nEmail: investec@orangeink.co.za ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 12
}