{
    "url": "https://www.db.com/news/detail/20210624-deutsche-bank-partners-with-oracle-to-accelerate-technology-modernization?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 24, 2021",
    "tags": [
        "Digitalisation",
        "Strategy"
    ],
    "title": "Deutsche Bank Partners with Oracle to Accelerate Technology Modernisation",
    "body": "Deutsche Bank selects Oracle Exadata Cloud@Customer to consolidate key databases in its selected data centers\nCompanies form innovation partnership to modernise Deutsche Bank’s mission-critical databases and enable new financial products and services\nDeutsche Bank and Oracle today announced a multi-year collaboration to modernise its database technology and accelerate the bank’s digital transformation.\nThe agreement will see Deutsche Bank upgrade its existing database systems and migrate the bulk of its Oracle Database estate to Oracle Exadata Cloud@Customer, an on-premises deployment option of the Oracle Exadata Cloud Service, to support applications that either will not move to the public cloud or may in the future. This will provide a dedicated platform to support and scale the bank’s existing mission-critical systems and services including trading, payments processing, risk and capital planning, and regulatory reporting.\nMigrating its systems to Oracle Exadata Cloud@Customer will enable Deutsche Bank to consolidate existing critical applications on a single platform while complying with its data residency requirements and significantly reducing operational costs. Oracle’s service can run in Deutsche Bank‘s current data centers as well as in future cloud co-location sites, minimising latency while supporting the shift of applications to the cloud. It will enable Deutsche Bank to drive data integration across its business in order to streamline operations, provide unified oversight of core service processes and implementations, and easily develop and scale applications based on customer demand.\nThe two companies have also agreed to form a joint innovation partnership, bringing together Oracle and Deutsche Bank engineering and technology teams to explore potential uses for data security technologies, Blockchain, AI and analytics to shape the design of new financial products and services.\nThe collaboration supports Deutsche Bank’s multi-year digital transformation initiative led by its Technology, Data and Innovation (TDI) division, and is a logical further step in the bank’s overall cloud strategy. This includes establishing a strategic public cloud partnership in December 2020.\n“Data is fundamental to how we manage our operations, anticipate the needs of our customers and design new products and services. Our collaboration with Oracle to modernise our databases will play an important role in our overall technology transformation,” said Bernd Leukert, Chief Technology, Data and Innovation Officer, Deutsche Bank. “Our applications supported by Oracle Exadata Cloud@Customer will benefit from a platform with the flexibility to adapt and scale critical services at speed, as well as derive better data insights. In the process, we will simplify and modernise our technology environment, save the bank significant costs and reduce energy consumption through consolidated servers.”\n“Now more than ever, financial services organisations like Deutsche Bank must quickly adopt new technologies and maintain speed-of-innovation while also meeting their data security and locality requirements in an always-changing regulatory environment. Oracle Exadata Cloud@Customer is designed to help Deutsche Bank achieve this balance, and we are looking forward to partnering with one of the financial sector’s most progressive digital innovators as we help shape the next generation of financial services and business models,” said Juan Loaiza, Executive Vice President, Mission-Critical Database Technologies, Oracle.\nFor further information please contact:\nDeutsche Bank AG\nSen Shanmugasivam\nPhone: +44 (0) 207 547 2838\nEmail: senthuran.shanmugasivam@db.com\nOracle\nKevin Bossi\nPhone: +44 (0) 7919 659805\nEmail: kevin.bossi@oracle.com",
    "number_of_ratings": 3,
    "rating": 5.0,
    "likes": 40
}