{
    "url": "https://www.db.com/news/detail/20210618-deutsche-bank-publishes-eeo-1-diversity-data-commits-to-continued-transparency?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 18, 2021",
    "tags": [
        "Diversity"
    ],
    "title": "Deutsche Bank Publishes EEO-1 Diversity Data, Commits To Continued Transparency",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today publishes its annual summary of its submission to the U.S. Equal Employment Opportunity Commission, voluntarily disclosing U.S. regional diversity statistics. The data will also be published in annual HR and Non-Financial Reports going forward.\n“Diversity and inclusion are key success factors for Deutsche Bank and many of its clients, but oftentimes opaque disclosures hinder progress and shirk accountability,” said Robert Dibble, Head of Human Resources for the Americas. “The data voluntarily published today reflects our commitment to transparency and, ultimately, a more diverse Wall Street.”\nEEO-1 Level %Men %Women\nExecutive / Senior Level Officials and Managers 78.95% 21.05%\nFirst / Mid Level Officials and Managers 73.39% 26.61%\nProfessionals 62.59% 37.41%\nSales Workers 50.96% 49.04%\nAdministrative Support Workers 34.71% 65.29%\nGrand Total 62.90% 37.10%\nEEO-1 Level % White % Asian %Latinx %Black %Native Hawaiian or Pacific Islander %Native American or Alaska Native %Two or More Races\nExecutive / Senior Level Officials and Managers 94.74% 0.00% 0.00% 5.26% 0.00% 0.00% 0.00%\nFirst / Mid Level Officials and Managers 69.98% 18.74% 7.28% 3.84% 0.00% 0.11% 0.06%\nProfessionals 49.03% 34.03% 7.84% 8.76% 0.11% 0.02% 0.21%\nSales Workers 53.18% 15.29% 21.02% 9.55% 0.00% 0.32% 0.64%\nAdministrative Support Workers 49.07% 8.45% 20.82% 20.00% 0.21% 0.21% 1.24%\nGrand Total 54.42% 27.72% 9.12% 8.33% 0.08% 0.07% 0.26%\nTo accelerate progress in the U.S., Deutsche Bank undertook seven actions to progress racial and ethnic diversity over seven months last year. This included changes in hiring practices and embedding goals in performance scorecards, which rapidly diversified Deutsche Bank’s early talent pipeline.\nThe regional graduate hire class for 2021 is 41% women and 10% Black, up significantly from last year, with a 13 and 6 percentage point increase respectively. This summer’s intern class, where the majority of graduate hires originate, is also far more diverse than last year at 45% women and 15% Black. This reflects a 7 and 8 percentage point increase versus prior year respectively.\nAdditional goals for Deutsche Bank globally include increasing women representation to at least 35% of Deutsche Bank’s Managing Director, Director and Vice President population by 2025, and at least 30% women in the positions one and two levels below the Management Board.\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nDylan Riddle\n+1 (904) 386-6481\ndylan.riddle@db.com\nInvestor Relations\n+49 800 910-8000\ndb.ir@db.com\nAbout Deutsche Bank\nDeutsche Bank provides retail and private banking, corporate and transaction banking, lending, asset and wealth management products and services as well as focused investment banking to private individuals, small and medium-sized companies, corporations, governments and institutional investors. Deutsche Bank is the leading bank in Germany with strong European roots and a global network.\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 20 March 2020 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 18
}