{
    "url": "https://www.db.com/news/detail/20210616-deutsche-bank-launches-new-strategic-income-allocation-funds-in-europe-and-asia?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 16, 2021",
    "tags": [
        "Asia-Pacific",
        "Wealth"
    ],
    "title": "Deutsche Bank launches new Strategic Income Allocation Funds in Europe and Asia",
    "body": "Deutsche Bank International Private Bank (IPB) has launched four Strategic Income Allocation (SIA) funds, utilising the capabilities of DWS as a fund manager\n\nThe SIA fund launch follows the successful launch of the IPB’s Strategic Asset Allocation (SAA) one year ago\n\nThe SIA funds are based on the IPB’s Chief Investment Office (CIO) multi-asset allocation approach and aim to generate a regular stream of income distribution with the additional feature of downside risk management\n\nSubscriptions for the SIA funds begin in June 2021 in selected jurisdictions in Asia and Europe\nThe International Private Bank (IPB) is offering its income-focused clients in Europe and Asia four Strategic Income Allocation (SIA) funds to complement its Strategic Asset Allocation (SAA) funds.\nThe new funds aim to provide diversified income sources by investing in ETFs linked to fixed income, global equity, listed real estate and infrastructure indices, as well as using options for yield enhancement.\nAchieving income while controlling risk is increasingly difficult for investors. The SIA funds seek to generate income distributions while at the same time benefitting from Deutsche Bank’s “Plus” downside risk management framework. \nIn utilising Deutsche Bank’s asset management arm DWS to offer the funds, investors have access to a competitive, cost-efficient solution for their core investment portfolio. \nThe new SIA funds complement IPB’s flagship SAA investment offering, introduced just over a year ago. Thousands of clients worldwide have already invested in the SAA funds, with assets under management now totaling over 3.5 billion euros (as of June 11, 2021).\n“With the launch of the SIA funds, we are pleased to offer our clients a contemporary, income-oriented proposition,” said Alessandro Caironi, Head of Advisory and Sales, International Private Bank, Deutsche Bank.\nHe added, “In today’s current economic climate of low and negative interest rates, this solution offers investors the opportunity to invest in a product that is focused on pursuing consistent, long-term market-oriented returns.”\n“Our new SIA Plus funds use our highly-regarded SAA strategy with the aim to deliver income from multiple sources,” said Christian Nolting, Global Chief Investment Officer and Head of CIO & Investment Solutions.\n“Clients now have the opportunity to benefit from a sophisticated but cost-efficient approach and the ability to combine a modern portfolio strategy with a “Plus”: our distinctive systematic hedging strategy.”\nThe subscription period for the SIA funds started in mid-June 2021.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 14
}