{
    "url": "https://www.db.com/news/detail/20210614-deutsche-bank-announces-public-tender-offer-for-two-senior-non-preferred-zero-coupon-securities?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 14, 2021",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank announces public tender offer for two senior non-preferred zero-coupon securities",
    "body": "Deutsche Bank (XETRA: DBKGn.DE/NYSE: DB) announces a public tender offer to buy back two Italian Lira-denominated senior non-preferred zero-coupon securities, re-dominated in Euro in 1999. The target acceptance volume of the tender is 1.0 billion euros.\nThe public tender offer is designed to proactively manage Deutsche Bank’s debt maturity profile and to provide liquidity to current bond holders.\nThe tender offer encompasses the following Italian Lira-denominated, zero-coupon securities issued by Deutsche Bank in 1996 and 1997 respectively:\n0.0% October 2026 (ISIN: DE0001342244)\n0.0% January 2032 (ISIN: DE0001892057)\nThe offer is expected to expire on Friday, 25 June 2021.\nInformation is available on Deutsche Bank’s Investor Relations website under https://www.db.com/ir or by contacting +49 800 910-8000.\nRequests for the Tender Offer Memorandum may be directed to the Tender Agent: Lucid Issuer Services Limited (+ 44 20 7704 0880, db@lucid-is.com)\nNo offer or invitation to acquire any securities is being made pursuant to this announcement. The distribution of this announcement and the Tender Offer Memorandum in certain jurisdictions may be restricted by law. Persons into whose possession this announcement and/or the Tender Offer Memorandum comes are required by Deutsche Bank to inform themselves about, and to observe, any such restrictions.\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nChristian Streckert\nPhone: +49 69 910 38079\nEmail: christian.streckert@db.com\nEduard Stipic\nPhone: +49 69 910 41864\nEmail: eduard.stipic@db.com\n\nInvestor Relations\n+49 800 910-8000\ndb.ir@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}