{
    "url": "https://www.db.com/news/detail/20181026-deutsche-bank-announces-external-auditor-rotation?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 26, 2018",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank announces external auditor rotation",
    "body": "The Supervisory Board of Deutsche Bank (XETRA: DBKGn.DE/ NYSE: DB) has decided to recommend the appointment of Ernst & Young GmbH Wirtschaftsprüfungsgesellschaft as external auditor. This recommendation will be put to shareholders at the 2019 Annual General Meeting (AGM).\nNew European and national regulations require a rotation of the external auditor at regular intervals. Therefore it is not possible to extend the mandate of the bank’s current external auditor, KPMG AG Wirtschaftsprüfungsgesellschaft. The tender process for a new external auditor was announced in February 2018. An extensive and rigorous evaluation process held over the last seven months was run independently by the Audit Committee of the Supervisory Board.\nDeutsche Bank anticipates that following the appointment, the new external auditor will review the interim financial statements of the first quarter of 2020 and will be recommended at the 2020 AGM as external auditor for the full financial year 2020. The auditor’s mandate will cover both Deutsche Bank AG and the Deutsche Bank Group.\nGoing forward, as required by EU regulation and German law, the bank plans to undertake a rotation of its external auditor at least every ten years.\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations \nMonika Schaller\nPhone: +49 69 910 48098\nE-mail: monika.schaller@db.com \nChristian Streckert\nPhone: +49 69 910 38079\nE-mail: christian.streckert@db.com \nInvestor Relations\n+49 800 910 8000 (Frankfurt)\n+44 20 7541 4100 (London)\n+1 212 250 0604 (New York)\ndb.ir@db.com ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}