{
    "url": "https://www.db.com/news/detail/20181025-supervisory-board-makes-management-changes?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 25, 2018",
    "tags": [
        "Company"
    ],
    "title": "Supervisory Board makes management changes",
    "body": "Frank Kuhnke appointed to the Management Board. Asoka Wöhrmann becomes a Senior Group Director for the asset management business. Nicolas Moreau to leave the bank at year-end\nThe Supervisory Board of Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) is making changes to the management of the bank. Frank Kuhnke, the current Chief Operating Officer, will be appointed a member of the Management Board with effect from January 1, 2019. Kuhnke has been a Senior Group Director (“Generalbevollmächtigter”) since April of this year. His responsibilities, which include Information Security, Data Management and Digital Strategy, will remain unchanged.\nNicolas Moreau, responsible for Asset Management, will leave Deutsche Bank at the end of this year. His role at the group level will be assumed by Asoka Wöhrmann, who will be permanently appointed a Senior Group Director with immediate effect. In this role he will report directly to Chief Executive Officer Christian Sewing. Wöhrmann will replace Moreau as Chief Executive Officer of DWS Group with immediate effect.\nWöhrmann was most recently Head of Deutsche Bank’s Private Clients business in Germany. He spent many years in a variety of global leadership roles at Deutsche Bank’s asset manager. Until 2015, he was responsible for the entire fund management business as global Chief Investment Officer.\nPaul Achleitner, Chairman of the Supervisory Board of Deutsche Bank, acknowledged Moreau’s achievements: ”We thank Nicolas Moreau for his important contributions to the bank as a whole and to Asset Management in particular. Under his leadership DWS was successfully floated on the stock exchange and the foundations were laid for growth”, said Achleitner. “In Asoka Wöhrmann we have appointed a Senior Group Director who has a profound knowledge of both DWS and our Private Clients business. We are convinced that under his management the success story will continue at this business that is so important for our bank.”\nAchleitner also congratulated Kuhnke on his appointment to the Management Board: “Frank Kuhnke has already played a key role in simplifying the complex processes and structures in our bank. He will rigorously remain on that track as a member of the Management Board.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}