{
    "url": "https://www.db.com/news/detail/20181024-deutsche-bank-reports-net-income-of-229-million-euros-in-the-third-quarter-of-2018-and-strengthens-common-equity-tier-1-capital-ratio?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 24, 2018",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank reports net income of 229 million euros in the third quarter of 2018 and strengthens Common Equity Tier 1 capital ratio",
    "body": "Frankfurt am Main, 24 October 2018\nChristian Sewing, Chief Executive Officer, said: “With profit before tax of 506 million euros, this result is another milestone on our way to becoming a sustainably profitable bank. We have our costs under control and sufficient capital to grow. We are on track to be profitable in 2018, for the first time since 2014.”\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) reported profit before tax(1) of 506 million euros for the third quarter of 2018, versus 933 million euros in the prior year quarter. Net income was 229 million euros, compared to 649 million euros in the prior year period. Management made further progress meeting near-term adjusted cost and headcount targets while managing the balance sheet conservatively.\nFor the first nine months of 2018, profit before tax was 1.6 billion euros, versus 2.6 billion euros in the prior year period, and net income was 750 million euros, compared to 1.7 billion euros in the prior year period. Post-tax return on tangible equity (RoTE) was 1.7% for the first nine months of 2018.\nThe Common Equity Tier 1 (CET1) ratio strengthened further, rising from 13.7% to 14.0% in the quarter, compared to the bank’s target of over 13%. This resulted primarily from a reduction of risk weighted assets (RWA) of 7 billion euros, partly reflecting lower credit risk RWA in the Corporate & Investment Bank, including through reductions in non-strategic assets, as well as lower operational risk RWA.\nNet revenues were 6.2 billion euros, down 9% versus the third quarter of 2017, partly reflecting the non-recurrence of certain specific items in the prior year quarter, as well as lower volatility and reduced client volumes in the Corporate & Investment Bank during the third quarter of 2018.\nIn the first nine months of 2018 revenues were 19.7 billion euros, down 5% year-on-year.\nProgress towards cost targets. Noninterest expenses were 5.6 billion euros, down 1% year-on-year. Adjusted costs were 5.5 billion euros, also down 1% year-on-year as reductions in professional services and other external spending more than offset ongoing investments, notably in the Private & Commercial Bank.\nFor the first nine months of 2018, total noninterest expenses were 17.8 billion euros, up 1% year-on-year, while adjusted costs were 17.4 billion euros, down 1%, as ongoing expense management more than offset more even accrual of variable compensation expenses, higher IT amortisation, investments related to the German legal entity merger, and higher bank levy charges in the first quarter. Management reaffirmed its target to reduce adjusted costs to 23 billion euros in 2018 and 22 billion euros in 2019.\nWorkforce reductions on track. On a full-time equivalent (FTE) basis, the number of employees was 94,717 at the end of the quarter, a net reduction of approximately 700 during the quarter. This development reflects reductions of around 1,450 FTEs, primarily in infrastructure areas, offset by the hiring of approximately 750 graduates in the period. In the first nine months of 2018, the bank reduced its workforce by approximately 2,800 FTEs.\nManagement reaffirms its targets to reduce the workforce to below 93,000 by the end of 2018 and well below 90,000 by the end of 2019. The forecast includes the impact of the agreed partial sale of the bank’s retail operations in Poland which is expected to close before year-end and reduce the number of employees by approximately 1,400.\nConservative balance sheet management. Both credit and market risk indicators remained close to historically low levels. Provision for credit losses remained at 9 basis points of loans at amortised cost on an annualised basis while average Value at Risk (VaR) declined by 3% in the quarter to 25 million euros.\nThe bank’s leverage ratio remained unchanged at 4.0% on a fully loaded basis and at 4.2% on a phase-in basis, compared to the bank’s target of 4.5% over time. Liquidity reserves remained strong at 268 billion euros and the liquidity coverage ratio was 148%, 76 billion euros above the minimum requirement of 100%.\nDevelopments in core businesses\nThe Corporate & Investment Bank (CIB)\nNet revenues were 3.0 billion euros, down 13% versus the prior year quarter. Global Transaction Banking revenues were down 5% year-on-year, due to changes in the business perimeter. Origination and Advisory revenues were essentially flat as significantly higher equity origination offset lower advisory and investment grade debt origination revenues.\nFixed Income Sales & Trading revenues were 15% lower, partly reflecting lower volatility and client activity in European rates as well as the impact of previously announced and now completed strategic adjustments in the US. Equity Sales & Trading revenues were 15% lower year-on-year. Declines in Prime Finance and Cash Equities were partly offset by growth in Derivatives.\nReshaping the Corporate & Investment Bank. By the end of the quarter, management had completed the reduction of front-office headcount and balance sheet resources initiated in the second quarter. The focus now is on driving growth and returns while continuously improving infrastructure and controls.\nDeutsche Bank’s Corporate Finance business scored a number of successes in the quarter. Deutsche Bank had a primary role in six of the ten largest corporate finance transactions as measured by fees (source: Dealogic), more than for any quarter in the past five years. In the year to date, Deutsche Bank was the top-ranked global coordinator of initial public offerings (IPOs) in Europe, leading four of the five largest transactions. In Germany, Deutsche Bank led all three of the top three IPOs and remains No 1-ranked in corporate finance in 2018 to date (source: Dealogic).\nThe Private & Commercial Bank (PCB)\nNet revenues were 2.5 billion euros, down 3% versus the prior year quarter, primarily reflecting the non-recurrence of a positive effect of 108 million euros from the sale of Concardis GmbH in the third quarter of 2017.\nGrowth in loan volumes. In the year to date, the Private & Commercial Bank grew loan volumes by approximately 8 billion euros. Of this, more than 5 billion euros arose in the Private & Commercial Business (Germany), with growth across both private and commercial lending, which offset continued deposit margin compression. Despite repricing measures undertaken, the Postbank-branded business saw the second consecutive quarter of net growth in current accounts.\nThe integration of Deutsche Bank’s German Private & Commercial Business with Postbank is progressing well. Consolidation of the head office and infrastructure functions and harmonisation of product governance are underway. Management confirmed its target of 900 million euros of synergies by 2022 at the latest.\nAsset Management (AM)\nNet revenues were 567 million euros, a decline of 10% versus the third quarter of 2017, largely reflecting the non-recurrence of an insurance recovery of 52 million euros related to a real-estate fund in the third quarter of 2017. Excluding this item, revenues were essentially flat compared to the prior year period and compared to the second quarter of 2018.\nAssets under management rose by 2 billion euros to 694 billion euros during the quarter, as market performance and exchange rate movements more than offset net outflows.\nDevelopments in the business included:\nIn the first nine months of 2018, DWS ranked second in Exchange Traded Products (ETP) net inflows in the European market with a 14.5% flow market share (Source: ETFGI);\nThe three open-end real-estate funds of the DWS “Grundbesitz” product family reached combined assets of more than 10 billion euros during the quarter;\nDWS agreed an alliance with the alternative asset management firm Tikehau Capital, which is also a shareholder in DWS.\n(1) Profit before tax = income before income taxes under IFRS\nGroup Results\nKey Capital Ratios\nSegment results\nCorporate & Investment Bank (CIB)\nPrivate & Commercial Bank (PCB)\nAsset Management (AM)\nAn analyst call to discuss third-quarter 2018 financial results will take place today, Wednesday, 24 October 2018, at 08.00 CEST. This conference call will be broadcast via internet: www.db.com/quarterly-results\nA Fixed Income investor call will take place on Thursday, 1 November 2018, at 14.00 CET. This conference call will be broadcast via internet.\nThe Interim Report, the Financial Data Supplement (FDS), the presentation and the audio-webcast for the analyst conference call are available at: www.db.com/quarterly-results\nThe Deutsche Bank Pillar 3 Report Q3/2018 is available at: www.db.com/regulatory-reporting\nThis document contains non-IFRS financial measures. For a reconciliation to directly comparable figures under IFRS, to the extent not provided herein, please refer to the Financial Data Supplement.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}