{
    "url": "https://www.db.com/news/detail/20181023-deutsche-bank-accelerates-the-opening-of-its-it-systems-to-third-party-providers?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 23, 2018",
    "tags": [
        "Company",
        "Corporate products",
        "Digitalisation",
        "Entrepreneurship",
        "Private products",
        "Research"
    ],
    "title": "Deutsche Bank accelerates the opening of its IT systems to third-party providers",
    "body": "Deutsche Bank has accelerated the opening of its IT systems to third-party service providers across its corporate and investment banking and private and commercial banking divisions. The bank is building an “ecosystem” of application programming interfaces (APIs), which will enable third-party providers such as FinTechs to develop new services and applications using the bank’s client data. In doing so, the bank aims to establish the broadest possible range of applications linked to its data and systems – expanding beyond traditional financial services.\n“Companies such as SAP, Amazon and Apple have created ecosystems around their platforms and systems, allowing third parties to play in their gardens,” said Thomas Nielsen, Chief Digital Officer at Deutsche Bank’s Global Transaction Bank. “The financial services industry is now undergoing the same evolution.”\n“This gives banks much greater potential for innovation and growth than they can generate by being single product-oriented. This will play a central role in driving the platform economy in banking,” adds Nielsen, who sees numerous opportunities for applications serving commercial clients right across cash and risk management, trade finance and securities services.\nDeutsche Bank’s investment bank is building on the existing Deutsche Bank Application Programming Interface (dbAPI), which was successfully launched in the private and commercial arm of the bank in 2017, and which is already linked to numerous external applications.\nThis is part of the bank’s open banking strategy, which encourages partnering companies to generate complementary and innovative products and services. These partners may be financial service providers that want to enhance existing applications with the aid of bank data, or firms that want to build completely new solutions based on that data.\nWith the help of Quantiguous Solutions, a Mumbai-based software company acquired by the bank in May this year, Deutsche Bank will accelerate the development and adoption of APIs globally.\n\nFor further information, please contact:\nDeutsche Bank AG\nPress & Media Relations\nFrank Hartmann\nPhone: +49 69 910 42744\nE-Mail: frank.hartmann@db.com\n\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking, and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 1
}