{
    "url": "https://www.db.com/news/detail/20181018-london-to-frankfurt-cycle-raises-75-000-pounds-for-cure-leukaemia?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 18, 2018",
    "tags": [
        "Company",
        "Corporate Citizenship",
        "Employee engagement",
        "Sports"
    ],
    "title": "London to Frankfurt cycle raises 75,000 pounds for Cure Leukaemia",
    "body": "In support of Cure Leukaemia, one of the bank’s UK Charities of the Year, a group of enthusiastic cyclists from Finance cycled nearly 800 kilometres (470 miles) from London, Canary Wharf to the Twin Towers in Frankfurt. They arrived at Deutsche Bank’s headquarters on Taunusanlage to enthusiastic applause from employees as they cycled their final few metres.\nJames von Moltke, Chief Financial Officer, who was there to welcome the riders said: “What an achievement for a wonderful cause. I have great admiration for each and every one of them – a big well done!”\nHow the money will be spent\nThe team has already beaten its 50,000 pound fundraising target. Through the tremendous support and generosity of employees, friends and family, the actual amount raised - including the bank’s matched giving - will be closer to 75,000 pounds. This will fund a new specialist Cure Leukaemia nurse for two years, enabling blood cancer patients to access clinical trials unavailable on the National Health Service, and ensure they are constantly monitored and cared for throughout.\nWhat the cyclists said\nDavid Keen, who with Nigel Collier had the initial idea to organise the cycle ride, said: “It was a truly remarkable four days. Working as a team, we achieved our goal and learnt a lot about ourselves as individuals on the way. I am in awe of all those who took part and feel proud to have been part of such a great effort. Exceeding our fund raising target makes the whole trip worthwhile. I have memories that will last a lifetime.”\nPaul Durant said: “It was a fantastic experience; meeting new people, getting to know others better, challenging myself physically in a way I’ve never done before, all to raise an amazing amount of money for Cure Leukaemia.”\nFor Dieter Hoffman: “It was all about meeting great people from the bank and forming one team for our four day bike ride to achieve a common goal: supporting Cure Leukaemia!”\nTaraa Muralitharan added: “What a phenomenal weekend. The trip to Frankfurt was by far the hardest thing I’ve ever done, but equally one of the most satisfying. It was such a pleasure to be part of such an amazing cause and experience it with such a talented group of people who are truly inspiring.”\nThere is still time to donate\nThere is still time to support your colleagues, please click here to make a donation.\nThank you for your support!",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}