{
    "url": "https://www.db.com/news/detail/20181017-seven-banks-join-forces-to-transform-trade-finance?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 17, 2018",
    "tags": [
        "Corporate products",
        "Investment Banking",
        "Private products"
    ],
    "title": "Seven banks join forces to transform trade finance",
    "body": "The “Trade Information Network” aims to establish an inclusive industry standard in multi-bank trade finance\nInnovative network open for corporates and banks which enables financing deeper into global supply chains and offers an easy way to join\nCGI selected as the technology provider to build the Network\nANZ, Banco Santander, BNP Paribas, Citi, Deutsche Bank, HSBC and Standard Chartered have announced a joint initiative to build a digital “Trade Information Network” by the end of 2018. The founding banks have signed a corresponding Memorandum of Understanding (MoU) and have agreed to work toward piloting the Network. They will introduce the Network at the SIBOS conference in Sydney, Australia, on 22 October 2018. Once operational, it will become the first inclusive global multi-bank, multi-corporate network in trade finance.\nThe Network aims to address the unmet demand for financing earlier in the supply chain by enabling corporates to easily and securely communicate trade information directly with banks* of their choice. In order to develop a new industry standard in trade finance, the Network’s approach has been validated with extensive corporate and bank engagement. In addition to the founding banks, more than 20 additional banks from around the world are actively participating in developing the Network and several corporates have already expressed an interest in participating in pilots. The Network has the potential to transform international trade.\nCorporates will be able to submit and verify purchase orders and invoices to request trade financing from the banks of their choice. By providing those banks with access to trusted trade information, the Network will help to mitigate the risk of double financing and fraudulent trade information across the industry. This enables the relevant banks to better assess risks and provide trade financing earlier in the supply chain, including for small and medium-sized enterprises who have traditionally experienced difficulty in accessing trade finance. Banks will provide financing outside of the Network using their existing systems.\nThe Network has open architecture and standardised connectivity based on a governance model similar to SWIFT to achieve maximum adoption across the supply chain ecosystem. Corporates will use a simple one-time registration process which will allow them to connect with all banks on the Network.\nAfter an extensive selection process, the Network selected CGI as its technology provider due to their combination of deep trade finance, technology and business consulting expertise, and global presence. The pilot version of the Network is now complete and CGI will continue to support the development of the “Trade Information Network”.\nQuotes from the founding banks\nMark Evans, Managing Director, Transaction Banking, ANZ\n\"At ANZ, digital transformation is a key priority for us – and that includes the digitisation of trade and supply chain finance. We're excited to be a founding bank for this project because it has the potential to improve the customer experience, and be adopted globally – benefitting ANZ, our customers and the industry.”\nRogier Schulpen, Global Head Trade & Working Capital Solutions, Banco Santander\n“Cooperation between the main trade finance banks and improving transparency of our clients’ global supply chains is an obvious way to facilitate financing to SMEs around the world. Having a single platform that provides transactional data on underlying trade flows will not only enable financing, but will also stimulate further innovation in the trade finance industry.”\nJacques Levet, Head of Transaction Banking EMEA, BNP Paribas\n“This project created by banks and for banks could be very transformative for the trade and supply chain financing space, helping corporates to communicate seamlessly with their banks. The single platform has the potential to impact the real economy by opening up an unparalleled global market in trade and supply chain finance. We are thrilled to be working on this global solution together with six other major industry players.”\nJohn Ahearn, Global Head of Trade, Citi Treasury and Trade Solutions\n“This is truly a revolutionary project and through our legacy of innovation, Citi is pleased to play a leading role among top global banks to help transform the trade industry. From the very beginning, we recognized the need to work together and answer the call from our clients to collaboratively design such a platform while leveraging our global network.”\nDaniel Schmand, Global Head of Trade Finance, Deutsche Bank\n“Supply chain finance is an important instrument for corporates to improve their working capital performance, but not all corporate clients today can access this source as required. With this industry network initiative, banks will be able to provide clients access to more financing opportunities and longer financing periods. The possibility to unlock additional financing opportunities along the entire supply chain will further support the overall growth in global trade.”\nVinay Mendonca, Global Head of Product & Propositions, Global Trade and Receivables Finance, HSBC\n“Effectively managing and financing global supply chains is essential for sustainable growth. This initiative is focused on providing end-to-end visibility of financial supply chains across banks. This enhanced visibility enables banks to provide more pre and post shipment finance to the currently underserved supplier segment.”\nMichael Vrontamitis, Head, Trade, Europe and Americas, Standard Chartered\n“The way in which international trade is facilitated by banks has to evolve. With changing client needs and the demand for greater connectivity and accessibility, banks need to set aside traditional models and co-innovate a new global standard for trade finance to reduce the existing 1.5 trillion US dollar trade finance gap and promote commerce globally. We firmly believe the initiative has this ability and are excited to be one of the founding banks.”\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Contact\nEduard Stipic\nPhone: +49 (0)69 910 41864\nE-mail: eduard.stipic@db.com\n  * Banks include supervised financial institutions and could potentially include non-supervised entities active in the financial industry.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}