{
    "url": "https://www.db.com/news/detail/20181011-db101-making-it-easier-for-start-ups-to-do-business-with-deutsche-bank?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 11, 2018",
    "tags": [
        "Company",
        "Corporate products",
        "Digitalisation",
        "Private products",
        "Research",
        "Strategy"
    ],
    "title": "db101: Making it easier for start-ups to do business with Deutsche Bank",
    "body": "Rather than competing, banks and start-ups are increasingly joining forces. Banks have client access, industry expertise and a ready-made infrastructure. Start-ups bring new technology insights and flexible ways of working.\nBut collaboration is not always easy. Banks are heavily regulated and large, meaning good ideas from start-ups may struggle to get off the ground. To help make the process easier, Deutsche Bank’s Innovation Labs have launched a new event series (db101) to help start-ups understand what is needed to successfully do business with the bank. The inaugural event took place in London with 30 promising start-ups and key Deutsche Bank experts from business and infrastructure. Here are the top takeaways.\nThe Innovation Labs are the bank’s entry point for hopeful start-up vendors…\nJon Pearson, Head of Innovation Labs UKI, explained how the Innovation Labs identify, evaluate and support the adoption of emerging technologies. Through their global network of Labs in Berlin, London, New York, Palo Alto and soon Singapore, the Innovation Labs work across all business and infrastructure units to uncover high priority internal technology challenges that can be solved by emerging technologies.\nDeutsche Bank deals with companies of all sizes…\nA common misconception is that big banks only deal with big vendors. But the message was: if it makes commercial sense and solves an internal challenge, it will be explored. The Third Party Management group, explained: “The innovation and agility injected by fintechs and start-ups provides great potential so it’s important that whilst we maintain a robust vendor control environment, we don’t make this prohibitive for smaller vendors to do business with us. The good news is that the vendor risk management transformation we are driving will improve transparency, efficiency and time to market, which benefits all vendors irrespective of size.”\nAn existing relationship with a rival bank doesn’t mean the end of the road…\nIn fact, the opposite can be true. Most banks have similar onboarding processes, so if a start-up has been successful at a peer, it is likely they have in place much of what Deutsche Bank is looking for.\nThe onboarding process continues to improve…\nThrough a variety of improvement measures, the time to complete the vendor risk management process has been reduced by 60% over the past year and the aim is to cut this in half again when a new platform and process go live at the end of this year.\nData protection remains the biggest sticking point…\nIf a start-up cannot prove that it can safeguard data to the standards expected by Deutsche Bank, it is unlikely to become a partner. It is critical for the bank to protect its information and data to continue operating as a business.\nFintech startups are both vendors and clients of Deutsche Bank and their reach extends across the bank.\nThe Innovation Labs aren’t the only part of the organisation working with emerging technology firms. Fintech companies in the room also heard tips from our investment bankers around what start-up companies can do at an early stage to prepare for an IPO or private placement down the road. Bankers also shared insights on what institutional investors look for when considering investments in emerging technology firms.\nEmerging technology has global economic implications\nThe Wealth Management group shared views on the “new techonomy”. The message was that embracing emerging technology is vital to the wellbeing of our global economy. Incumbents should not fear new entrants as disruptors; rather, enhanced collaboration between big corporates and start-ups is essential to competing in a technology-driven global economy. Education will drive a change in mind-set so that technology will become a tool not a threat. Ultimately, embracing technology is a prerequisite for prosperity in the future.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}