{
    "url": "https://www.db.com/news/detail/20181009-the-power-of-one-day?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 9, 2018",
    "tags": [
        "Company",
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "The power of One Day",
    "body": "Deutsche Bank UK recently celebrated its biggest annual fundraising campaign, One Day, in support of its UK Charities of the Year, Cure Leukaemia and Rays of Sunshine Children’s Charity.\nOne Day enables employees to donate a day’s salary to the Charities of the Year, which is matched by the bank outside of usual matched giving allowances.\nOver 120 charity guests, beneficiaries and celebrities were welcomed to the bank, with activities in seven locations across Birmingham and London.\nThe Rays of Sunshine Wish Choir, comprising seriously-ill children, won over hearts in four locations, and employees were also able to meet former leukaemia patients and nurses, chat to celebrities, and be entertained by musicians, caricaturists, balloon artists and magicians.\nNew this year was a digital tool to help employees calculate a day’s salary and the impact they could personally have on each charity. Chris Cohen, Head of the Benchmark & Index Control Group, Deutsche Bank says: “The new calculator is a really useful tool and I hope it is able to open a few more minds, demystify payroll giving and the impact we could each have. It also enables a simple method of giving.”\nIn addition to fundraising, employees were able to see first-hand, the work of one of our Charities of the Year, Rays of Sunshine, which grants wishes to seriously ill children. A number of live wishes were granted on the day by ambassadors Olly Murs, a singer, and magician Dynamo, along with England Football Manager, Gareth Southgate and former Chelsea FC Captain, John Terry.\nAmong the children having their wishes granted were five year old Sophie, who has just completed treatment for osteosarcoma and eight year olds Archie and Jacob who have acute lymphoblastic leukaemia.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}