{
    "url": "https://www.db.com/news/detail/20180919-against-all-odds-risk-manager-rahul-batra-completes-world-triathlon-final?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 19, 2018",
    "tags": [
        "Company"
    ],
    "title": "Against all odds: Risk Manager Rahul Batra completes World Triathlon Final",
    "body": "The inspirational story of Rahul Batra: The Market Risk Manager in London was rushed to hospital in 2013 and told he had a tennis ball-sized tumour in his chest. He was diagnosed with Non-Hodgkin’s Lymphoma, a type of blood cancer, and classified as stage 4 – the most advanced. The doctors told him three out of five people wouldn’t survive the next two years.\nRahul was an elite athlete who had competed against Michael Phelps in the 2004 World Championships. With the care of Guy’s and St Thomas’ hospital in London he managed to beat the cancer and has been in remission for four years.\nThroughout this period Rahul found mental stability, peace and comfort in going back to sport. He invested his energy in a new discipline, the triathlon - and incredibly, he qualified for the Great Britain team for the Age-group Triathlon World Championships. The event took place on Australia’s Gold Coast on Sunday but… there were still a couple of extra obstacles Rahul had to overcome.\nHe takes up the story…\nThe night before the race\nEverything had gone to plan ahead of the big day – I had recced the course with the rest of the team and checked my bike into the transition area the day before the race. I was turning into bed for an early start when I received a bombshell from the race organisers.\nDue to a forecast of unexpected high winds they had taken a last minute decision to ban the use of disc wheels. My bike was checked-in on the competition grounds and had a disc wheel on it. Having flown over from the UK, I wasn’t travelling with an extra set of wheels.\nThis set off a dramatic chain of events that sent my family and I frantically scrambling for a replacement until past midnight. With bike shops closed, we used social media to try to find other athletes in the Gold Coast area who we might be lucky enough to borrow a new wheel from – otherwise I would be refused entry. Our saviour was a fellow triathlete, who in true sportsmanship spirit offered to loan me his wheels.\nRace day\nI was up at 4:30am and arrived at Southport Broadwater Parklands as one of 109 competitors from around the world in the Men’s 30-35 age group. My training had gone well, but I was nervous about a bone inflammation in my ankle which had prevented me from running for the past four weeks. Standing on the start line along with the other competitors I vowed that I was going to leave everything on the course.\nThe swim has always been my strongest of the three disciplines and I exited the swim leg well positioned in 11th place. As I transitioned on to the bike, my weakest of the three disciplines I dropped down to 40th position needing to make up ground.\n  As I started the run I fancied my chances of breaking into the top 25. Now was the time to give it everything I had. I started making good progress. But with 3km to go to the finish I felt my leg give way and I knew instantly that something very bad had happened. I would later find out that I had fractured my fibula bone.\nIf I stopped to walk or hobble I knew my race was over. I gritted my teeth and I continued running with the adrenaline covering the excruciating pain.\nMy mind recounted the journey I had been on over the past four years. I was driven by the care and attention I had received from Guy’s and St Thomas’ hospital, my family and friends, and my colleagues, many of whom I have spoken to but never met across the bank who have supported me.\nCome hell or high water, I was going to finish this race for them. As I crossed the line in 58th position, I tried to put weight back on my leg to walk. I couldn’t. I was immediately placed into a wheel chair and taken to the medical tent.\n  24 hours later\nI’m now back at my hotel on crutches surrounded by friends and family. The race is still fresh in my mind. Given my competitive nature, I can’t help but feel slightly disappointed with my position and 2:07hrs finishing time.\nBut I know I left everything I had out there on the course and I couldn’t have dug any deeper. So I’m happy in that regard. I wasn’t able to revel in the moment and take it all in at the end, but once the dust has settled I will look back and cherish this weekend. The pain will disappear but the memories will live with me forever.\nReflections\nI will always be very grateful to the bank for its support both now and when I was first diagnosed with Non-Hodgkin’s Lymphoma. The bank has been there for me through the good times and the bad. As for my colleagues across the globe, I have felt them with me in spirit throughout my battle and I’m genuinely humbled at the outpouring of encouragement and kind donations in our collective fight against cancer. The culture I see of people constantly supporting one another is incredible. I’m not sure it exists anywhere else.\nMaking a #PositiveImpact\nSo far we’ve managed to raise well over 9,000 pounds for Guy’s and St Thomas’ hospital. I remain in regular contact with the doctors and I’m delighted to announce that they will be using the money to fund a research fellow to do a three-month study into new solutions to Non-Hodgkins Lymphomas at the hospital.\nTo have a tangible output from the money we have raised is simply amazing. Together we will make a #PositiveImpact and move the odds of beating cancer further in our favour. I would like to genuinely thank you all for supporting me and the hospital throughout this period.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 3
}