{
    "url": "https://www.db.com/news/detail/20180919-10-years-after-lehman-the-way-we-talk-to-talent-has-changed-completely?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 19, 2018",
    "tags": [
        "Company",
        "Research"
    ],
    "title": "The way we talk to talent has changed completely",
    "body": "Faye, you have been responsible for graduate recruiting at Deutsche Bank for a number of years. What has changed the most in recent years?\nThe main difference I see is that a few years ago we – and other financial institutions – were able to go onto campus and say ‘we are a bank, we are great, come and join us’, and people would. Since the financial crisis, due to the emergence of competitors outside of the financial services industry, and changing aspirations and demands from our talent pool, we now have to say ‘you are great, we need you, come and join us’.\nPreviously we would ask ourselves – how do we compete for talent with JPMorgan or Credit Suisse, for example. That’s still important, but now we are more interested in Unilever, Microsoft, BMW, Samsung and McKinsey. Competition has opened up. Everyone is after technologists and engineers at all levels. Around one third of Deutsche Bank’s graduates in recent years have a technology background.\nFinally, the way we talk to talent has changed completely. Just as technological advancements have changed everyday things like ordering a taxi from our phones, they are also being introduced to the corporate environment. We used to have to organise an event in order to talk to recruits. It would be booked and advertised weeks in advance, and we wouldn’t know who was going to turn up or not.\nNow, we can reach highly targeted groups of students online 24/7. We can stream content and information to them, they can see inside our offices, meet our senior leaders, learn about the recruitment process, even do interviews in some places, all without having to leave their dorm room.\nHas the typical working day of a recruiter also changed as a result of digitalization?\nIt’s completely changed. When I started recruiting, I put up posters at the London Stock Exchange or sent letters to students studying certain subjects, inviting them to presentations where we would show a 40-page deck of our corporate structure. I carried around up to 200 CVs a day, screening them one by one, calling students individually and scheduling them into a huge spreadsheet. We didn’t have BlackBerries or WhatsApp, and all interviews took place in hotels near universities or in the office. Recruiting was also confined to 6-8 months a year – there was a definite cycle to it.\nNow we recruit year round. We publish up to 20 posts a week on social media. We buy media space online, we stream content to prospective candidates to educate them about what we do and what they could do if they joined us. We still host events – but we use technology to tell our story. This year we have an interactive game to learn about some recent client stories and the positive impact we have on society. If they like what they see, students simply leave their contact details and we will get in touch.\nPowerPoint slides and maps have been replaced with interactive games via mobile phones. Giving pens away has turned into making donations to local charities that Deutsche Bank supports. We source candidates via LinkedIn – we headhunt graduates. We still screen applications, but instead of focusing solely on grades, we look at how recruits match our values and beliefs as well.\nThe candidate experience has also changed. We now invite students to interview via text, and they can choose interview slots directly in our systems. Once they have received an offer, they can stay in touch with us via our interactive ‘Stay Connected’ App that streams video, articles, internal announcements, training, logistics for their programmes and enables them to network – all before they even join the bank.\nRecent trends in recruiting include chat bots, artificial intelligence and automated evaluation of applications. Are there any such plans at the bank?\nYes, we already use artificial intelligence and algorithms to match employee profiles with internal vacancies. AI matches colleagues’ experiences and abilities with the requirements of open positions.\nWhat other innovations are you planning in the recruitment process?\nWe are in the process of launching a new platform for candidates, recruiters, interviewers and event attendees – Yello. Over the next 12 months, Yello will enable us to move away from outdated processes such as paper-based interview feedback and manual scheduling. It will change the way we engage with recruits, allowing us to target and share content based on a prospect’s interests and profile, giving us the opportunity to start building relationships with perspective candidates early in the recruitment process.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}