{
    "url": "https://www.db.com/news/detail/20180912-10-years-after-lehman-predicting-the-timing-or-the-scale-of-a-crisis-is-near-on-impossible?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 12, 2018",
    "tags": [
        "Company",
        "Research"
    ],
    "title": "10 years after Lehman: predicting the timing or the scale of a crisis is near on impossible",
    "body": "1. You have been in the industry for more than 20 years. What was singular about the 2008 crisis?\nFor me the overriding image that demonstrates the uniqueness of the Global Financial Crisis (GFC), which actually started in 2007, was seeing people in the UK queuing outside of the Northern Rock bank in an attempt to withdraw their life savings. For someone of my age bank runs were an image associated with black and white movies that even when made were depicting the past. The 2008 crisis also threatened the whole fabric of the way we had set up our economies over the last few decades. With the explosion in credit from the 1970s onwards, anything that dramatically restricted its supply for a prolonged period was always going to risk a severe contraction or even a depression. If there had not been unparalleled intervention from the authorities when Lehman Brothers collapsed in September 2008, it is likely we would have seen many more bank runs across the world.\n2. Why have so few economists foreseen the 2008 crisis?\nThere were a few of us who raised the warning flags in 2006 and 2007 as there was so much leverage in the system and assets linked to it like housing were showing bubble-like tendencies. However you can warn but predicting the timing or the scale of the unwind was near on impossible. Personally I think economic historians did a better job of warning people over model-based economists as anyone with a long-term knowledge of global financial markets would have found life in the mid- to late-2000s as utterly incomprehensible relative to long-term history, even if their models suggested no obvious concerns on the horizon. The other problem economists had was that the financial products that eventually started the crisis were extremely complicated and actually quite niche and not widely known about. Economists looking at their standard models would have had no tools to tell them of the impending and sudden halt to the flow of credit around the global economy as banks stopped lending to each other and confidence in the whole system evaporated.\n3. What were the lessons learnt for economists with regard to their analytic methods, indicators they monitor etc.?\nI think there is still a problem that economists face in that many of the risks in today’s financial world are outside of their natural domain and their models. These include political risk (e.g. unpredictability of populism), the still record-high levels of global debt and the lack of any historical data about what happens when central banks withdraw from the extreme monetary policy (including QE) of recent years.\n4. All in all, are we better positioned today to predict the next financial crisis?\nObviously the scale of the financial crisis is important. In a research note from last September we argued that the financial system we have inherited is prone to crises and that there have been numerous examples of these since the 1970s. However, only the GFC threatened to escalate into something that was structurally damaging to economies and societies in general.\nWe continue to think that financial crises will be a regular feature of our credit and debt based global economy. However for them to be anywhere near the scale of the 2008 version it would probably now be because a major government can’t pay back its debts. The problem with predicting that this will happen is that central banks can intervene. So a government might be insolvent but it can be kept liquid for a long period of time if there is the willingness on the behalf of central banks. The region where this is most challenging is in Europe where the central bank is not controlled by the domestic governments. So this is an area where an accident could happen in the future, especially if populism clashes with the rules-based system.\nBanks are much safer than where they were back in 2008 so the bar to a crisis here is much higher. However regulators have forced banks to hold more government bonds to make them supposedly safer so risks remain if there are concerns about certain Sovereign‘s credit quality.\nOverall I believe financial crises are a way of life in our current system but 2008-type events have typically happened once in a lifetime.\n5. Let’s give it a try right away: How stable is the global economic and financial system today? Are we already in the run-up for a next crisis?\nAs I’ve hinted I think a financial crisis somewhere is inevitable soon – which does not mean that it will be anywhere near the scale of the 2008 episode. In fact you can argue that countries like Turkey, Argentina and Venezuela are at various stages of having a financial crisis in 2018. As central banks continue to withdraw from their extreme and unique easy policy measures, you would expect the weakest parts of the global economy and the financial markets to be at risk. It’s difficult to pinpoint exactly where crises will occur but easier to conclude that we still have a crisis-prone financial system. Global levels of debt are higher relative to GDP than they were back in 2008. So if you believe that 2008 was a debt crisis then we still need to worry and be vigilant, especially as global central banks are now tightening policy.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}