{
    "url": "https://www.db.com/news/detail/20250130-a-message-from-christian-sewing-on-deutsche-bank-s-2024-results?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 30, 2025",
    "tags": [
        "Financial Results",
        "Strategy"
    ],
    "title": "A message from Christian Sewing on Deutsche Bank’s 2024 results",
    "body": "Dear Colleagues, \nFive and a half years ago, we set out to create a bank that is robust, resilient, and sustainably profitable. A bank with a clear strategy that delivers the best outcomes for its clients. Since then, we have achieved great things together and you have been working hard to ensure that we have made continuous progress since July 2019. We have already fundamentally changed Deutsche Bank, even in difficult times. In recent years, we have achieved our interim goals and have grown even more strongly than originally planned. \nIn 2024, we made great progress again, despite considerable and sometimes unexpected challenges. We have clearly demonstrated the operational strength of this bank. Thanks to continued momentum in all four businesses, we increased our revenues for the fifth year in a row, reaching 30.1 billion euros, the highest since 2015. We have moved even closer to our clients, won prestigious new mandates and grew faster than many of our global competitors in key areas, increasing our market share. Our investments in recent years are already paying off.\nWe also improved profit before tax to 7.9 billion euros, if you exclude the costs that are not directly related to our business operations. Including these nonoperating costs, however, profit before tax of 5.3 billion euros was 7 percent below the previous year's result. This was mainly because, in addition to increased restructuring costs, we had to book almost 2 billion euros in non-recurring legal costs last year, including for the proceedings surrounding the Postbank takeover, which dates back to 2010.\nHowever, this also means that we have now put these legacy issues behind us and thus significantly reduced the risks for our bank going forward. At the same time, we continued to make targeted investments last year, in future growth, technology, efficiency measures and in further strengthening our controls.\nAll of this makes 2024 an important transitional year, which laid the foundation to take the next big step together from a position of strength. We have always said that 2025 will be decisive for us. At the end of this year, we will be judged by whether we have been successful with our transformation and growth strategy. The key benchmark for this is our post-tax return on tangible equity (RoTE), and we are convinced that we will increase this to over 10 percent this year as planned. The very strong start to the year reinforces our confidence.\nIn terms of operational efficiency, we are on track to achieve our target of 2.5 billion euros in cost savings. At the same time, we continue to invest, which means that, in total, we expect our adjusted costs to remain essentially flat year on year. We now anticipate ending the year with a cost/income ratio below 65 percent, slightly higher than our original year-end target of below 62.5 percent. That’s not to say we can become complacent about costs in any way. Cost discipline remains a top priority.\nNext to a RoTE above 10 percent, we also promised investors to continuously increase distributions. Today, we announced that we aim to increase the dividend again by 50 percent this year and buy back, initially, an additional 750 million euros worth of our shares.\nBut 2025 is not only the year in which we must prove ourselves, it is also the year in which we want to lay the foundations to achieve our long-term vision and become the European Champion. We have all the prerequisites to achieve this. We know who we are, where we want to go and how we can achieve this. As the Global Hausbank, we have the right model to accompany our clients, especially through difficult times. And we have a world-class team with unique expertise, working tirelessly and with deep dedication for the lasting success and financial security of our clients at home and abroad.\nWhat we make out of these prerequisites is in our hands. I know that we can add many more chapters to our success story, this year and far beyond. But for that to happen, we must be prepared to develop continuously. I see three main levers for this:\nAfter the successful launch of our This is Deutsche Bank framework in 2024, we can steadily embed it in the bank by ensuring that all our actions and decisions are in line with our purpose and aspirational culture. All of us on the Management Board intend to lead the way to this goal, together with all managers in the bank.\nWe can further optimise our processes, our decision-making and our controls to become even more efficient while providing a better banking experience for our clients. Technologies such as artificial intelligence and automation can make an important contribution here if we apply them even faster. Furthermore, the successful transformation of our bank in recent years means we are now better placed to start giving more responsibility to the individual businesses – another factor that will make us more efficient.\nWe can be even more targeted with our capital, using it where it creates the greatest value. This also means that we will be more decisive in the areas where we do not earn our cost of capital. \nWe on the Management Board are determined to take advantage of these opportunities and are working intensively on how we can make even better use of our potential by adapting structures, delegating decisions, and removing hurdles that affect your work. We want to empower everyone in the bank to excel together every day, for our clients, for our investors and, ultimately, for all our stakeholders.\nIf you are interested in hearing more details around our reported results, you can follow our Annual Media Conference live on db.com from 9 a.m. CET.\nI look forward to working with you to make this year a great success for Deutsche Bank. On behalf of the entire Management Board, I would like to thank you once again for everything you have achieved in 2024.\nBest wishes,\nChristian",
    "number_of_ratings": 8,
    "rating": 4.0,
    "likes": 5
}