{
    "url": "https://www.db.com/news/detail/20250130-full-year-results-2024?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "January 30, 2025",
    "tags": [
        "Financial Results"
    ],
    "title": "Deutsche Bank reports 2024 profit before tax of € 5.3 billion and € 2.1 billion of proposed capital distributions to shareholders",
    "body": "Continued net revenue and business growth in 2024\nRevenues grow 4% year on year to € 30.1 billion, in line with guidance\nVolume growth with market share gains and assets under management in Asset Management surpassing € 1 trillion for the first time\nResolution of specific cost items\nNoninterest expenses of € 23.0 billion, up 6% year on year, include € 2.6 billion in nonoperating costs¹, up from € 1.1 billion in 2023\nNonoperating costs include € 1.7 billion in specific litigation items¹\nAdjusted costs¹ down 1% year on year to € 20.4 billion including € 0.2 billion in fourth-quarter exceptional items¹\nResilient operating performance\nProfit before tax of € 5.3 billion, down 7% year on year; profit before tax of € 7.9 billion before nonoperating costs, up 16% year on year, and € 7.0 billion excluding specific litigation items\nNet profit of € 3.5 billion, down 28%, reflects non-recurrence in 2024 of € 1.0 billion positive deferred tax asset (DTA) valuation adjustment in 2023\nPost-tax return on average tangible shareholders’ equity (RoTE)¹ of 4.7%, or 7.1% excluding specific litigation items\nCost/income ratio of 76%, compared to 75% in 2023 and 71% excluding specific litigation items\n€ 2.1 billion in capital distributions to shareholders announced for 2025 so far\n~€ 1.3 billion in proposed dividends for the year 2024, or € 0.68 per share, up 50% from € 0.45 per share for 2023\n€ 750 million in share repurchases approved and reflected in 13.8% CET1 ratio at the end of 2024\nFourth quarter of 2024: business growth and resolution of specific items\nRevenues of € 7.2 billion, up 8% over prior year quarter; highest since 2014\nProfit before tax of € 583 million, down 17%, after absorbing € 594 million of specific litigation items\n Net profit of € 337 million, down from € 1.4 billion in fourth quarter of 2023, primarily driven by non-recurrence of € 1.0 billion positive DTA valuation adjustment in prior year quarter\n>10% RoTE target in 2025 and capital distribution goal reaffirmed, reflecting expectations of:\n2025 revenues of around € 32 billion, in line with guidance\nLower noninterest expenses through non-recurrence in 2025 of specific litigation items in 2024 and adjusted costs essentially flat to 2024\nPart-normalization of provision for credit losses from 2024 levels\nCapital distributions in excess of € 8 billion in respect of years 2021-25\n2024 was a vital year for Deutsche Bank. Our strong and growing operating performance reflects the turnaround achieved in recent years. We delivered another year of revenue and business growth, maintained tight operating cost discipline, acted decisively to put significant legacy costs behind us and continued to invest in our platform. All of this – together with the strong start we have made this year – gives us firm confidence that we will deliver on our RoTE target of above 10% in 2025 and further increase distributions to shareholders. In addition, we are already working on measures to further increase returns in the coming years. \nChristian Sewing, Chief Executive Officer\nDeutsche Bank (XETRA: DBGn.DB / NYSE: DB) today announced profit before tax of € 5.3 billion for the full year 2024, down 7% compared to 2023. Revenues grew by 4% year on year to € 30.1 billion, in line with guidance. Noninterest expenses were € 23.0 billion, up 6%, and included € 1.7 billion relating to specific litigation items including settlements relating to the bank’s takeover of Postbank AG; adjusted for these items, profit before tax was € 7.0 billion. Adjusted costs, which exclude nonoperating items, were down 1% to € 20.4 billion, and included € 235 million in fourth quarter exceptional items consisting of real estate measures and true-up adjustments for UK bank levies.\nNet profit was € 3.5 billion, down from € 4.9 billion in 2023. This year-on-year development reflected both costs relating to specific litigation items in 2024 and the non-recurrence in 2024 of € 1.0 billion in DTA valuation adjustments which positively impacted 2023.\nPost-tax return on average tangible shareholders’ equity (RoTE1) was 4.7% in 2024, compared to 7.4% in 2023. 2024 RoTE excluding specific litigation items1 was 7.1%. Post-tax return on average shareholders’ equity (RoE) was 4.2%, compared to 6.7% in the prior year. The year-on-year development in both ratios reflects both the specific litigation items in 2024 and the non-recurrence of the DTA valuation adjustments which positively impacted 2023. The cost/income ratio was 76%, compared to 75% in 2023, and 71% excluding the aforementioned specific litigation items.\nDeutsche Bank reaffirms its target for RoTE of above 10% in 2025. The bank reaffirms its 2025 revenue goal of around € 32 billion, not including further upside potential from exchange rate movements. The bank expects provision for credit losses to moderate from 2024 levels. The bank also expects to reduce noninterest expenses. Nonoperating costs are expected to normalize considerably, primarily through the non-recurrence of significant litigation items, while adjusted costs are expected to remain essentially flat compared to 2024, creating significant operating leverage. The bank is on track to achieve its target of € 2.5 billion euros in cost savings from its operational efficiency program, which offset additional investments to support further business growth and increased returns to shareholders beyond 2025. Reflecting both operational efficiencies and additional investments, the bank now targets a cost/income ratio of below 65% in 2025, slightly above its original target of below 62.5%.\nFourth-quarter pre-tax profit was € 583 million, down 17% from the fourth quarter of 2023. This development reflected charges for specific litigation items of € 594 million in the quarter, and the aforementioned exceptional items of € 235 million. These more than offset growth in revenues of 8% over the prior year quarter to € 7.2 billion. Net profit was € 337 million, additionally reflecting non-tax-deductible litigation items during the quarter, and the non-recurrence of € 1.0 billion in DTA valuation adjustments which positively impacted the prior year quarter.\nA further € 2.1 billion in planned capital distributions to shareholders\nDeutsche Bank today announced plans for € 2.1 billion in further capital distributions to shareholders in 2025. The bank has received supervisory authorization for further share repurchases of € 750 million so far in 2025 and plans to propose 2024 dividends of € 1.3 billion, or € 0.68 per share, at its Annual General Meeting in May 2025, up 50% from € 0.45 per share for 2023. These measures would increase cumulative capital distributions to shareholders to € 5.4 billion since 2022, in excess of the € 5 billion goal in the bank’s transformation program launched in 2019. The bank reaffirms its aim to exceed its capital distribution goal of € 8 billion in respect of the financial years 2021-25, paid in 2022-26.\nJames von Moltke, Chief Financial Officer, added: “Our performance in 2024 was impacted by significant nonoperating costs, particularly longstanding litigation items, and actions we took to accelerate the execution of our strategy. Having put these behind us, we look ahead to 2025 having decisively reduced our risk profile and with confidence that our operating strength will be clearly reflected in our financial results. We remain absolutely focused on achieving the full benefits of our operational efficiency program and expect credit provisions to normalize. This positions us to grow returns, boost organic capital generation and exceed our € 8 billion goal for capital distributions through 2026.”\nAccelerating execution of the Global Hausbank strategy:  further progress towards 2025 targets\nDeutsche Bank made further progress on accelerating execution of its Global Hausbank strategy on all dimensions during 2024:\nRevenue growth: Net revenues grew to € 30.1 billion in 2024, in line with guidance of around € 30 billion for the year. Compound annual revenue growth since 2021 was 5.8% through the end of 2024, in line with the bank’s target range of 5.5-6.5%. The bank reaffirms its goal for revenues of around € 32 billion in 2025. Assets under management grew by € 170 billion across the Private Bank and Asset Management to € 1.6 trillion, including net inflows of € 55 billion, during 2024; this is expected to drive revenue growth in these businesses in future periods.\nOperational efficiency: Deutsche Bank made further progress on its € 2.5 billion operational efficiency program during 2024. Measures include optimization of the bank’s platform in Germany and workforce reductions, notably in non-client-facing roles. As at year-end 2024, savings either realized or expected from completed efficiency measures grew to € 1.8 billion, or approximately 75% of the program’s expected total savings, including € 1.7 billion in savings realized. The bank expects the large majority of these measures to positively impact the adjusted cost run-rate in 2025. Workforce reductions related to the program reached a cumulative total of 3,500 full-time equivalents (FTEs) by the end of 2024, in line with target. Additionally, external contract staff were reduced by approximately 1,800 during 2024.\nCapital efficiency: Deutsche Bank’s capital efficiency program increased RWA equivalent benefits to a cumulative € 24 billion by the end of 2024, close to its target range of € 25-30 billion by the end of 2025. This included a further € 2 billion in reductions in the fourth quarter, primarily due to further data and process improvements. The bank aims to reach the higher end of its target range by year-end 2025. Capital efficiencies contributed to the bank’s year-end 2024 CET1 ratio of 13.8%, which includes € 750 million in share repurchases authorized for 2025. The bank plans to maintain progress on capital efficiencies in 2025 and reaffirms its aim to distribute more than € 8 billion in capital to shareholders in respect of the years 2021-2025.\nRevenues: fourth-quarter and full-year growth with market share gains and growing assets under management\nNet revenues were € 30.1 billion in 2024, up 4% year on year, in line with full-year guidance of around € 30 billion and with the bank’s compound annual growth rate target. Commissions and fee income grew 13% to € 10.4 billion, while net interest income in key segments of the banking book remained resilient, reflecting higher deposit volumes and loan margin expansion. Fourth-quarter net revenues were € 7.2 billion, up 8% year on year and the bank’s highest fourth-quarter revenues for a decade. Deutsche Bank reaffirms its goal for revenues of around € 32 billion in 2025.\nRevenue performance in the bank’s businesses in 2024 was as follows:\nCorporate Bank net revenues were € 7.5 billion, down 3% year on year after growth of more than 20% in 2023. The normalization of deposit margins during 2024 was mostly offset by higher deposit volumes and growth in commissions and fee income. Revenues in Corporate Treasury Services were down 4% to € 4.2 billion, Institutional Client Services revenues grew by 3% to € 2.0 billion, and Business Banking revenues were down 7% to € 1.3 billion. In the fourth quarter, Corporate Bank revenues were € 1.9 billion, down 2% on the prior year quarter. Net interest income was € 1.2 billion, down slightly year on year, reflecting normalizing deposit margins which were largely offset by interest hedging and higher volumes. Commissions and fee income increased by 2% to € 606 million, driven by growth in the Corporate Treasury Services. Corporate Treasury Services revenues were € 1.1 billion, up 1% year on year, while revenues in Institutional Client Services were down 3% to € 479 million and Business Banking revenues declined 11% to € 320 million, reflecting lower net interest income in the normalizing interest rate environment.\nInvestment Bank net revenues grew 15% year on year to € 10.6 billion, driven by growth across the franchise. Fixed Income & Currencies (FIC) revenues rose 9% to € 8.6 billion, with FIC ex. Financing up 8%, driven by strength in Credit Trading, and Financing revenues up 12%. In the Euromoney FX Awards for 2024, Deutsche Bank was named Best FX Bank for both Western Europe and Asia Pacific. Origination & Advisory revenues grew by 61% to € 2.0 billion, and Deutsche Bank’s share of a growing global fee pool increased by approximately 50 basis points to 2.3% (source: Dealogic). These gains reflected strength across Debt Origination and growth in M&A. In the fourth quarter, revenues were € 2.4 billion, up 30% on the prior year quarter, with growth across both FIC and Origination & Advisory. Revenues in FIC grew 26% to € 1.9 billion, the bank’s highest on record for a fourth quarter; Financing revenues were significantly higher, reflecting strong fee income and increased net interest income. In Trading, revenues increased across all major businesses due to heightened market activity and client engagement. Origination & Advisory revenues grew 71% to € 522 million, with market share gains across business lines in a growing industry fee pool while maintaining the bank’s number one rank in Germany (source: Dealogic). Debt Origination revenues were up 39%, reflecting strong pipeline execution in Leveraged Debt, whilst Advisory revenues more than doubled in a static fee pool (source: Dealogic), with the business benefitting from prior period investments.\nPrivate Bank net revenues were € 9.4 billion in 2024, down 2% year on year. Growth in investment products, reflecting the Private Bank’s strategy of growing noninterest income, was more than offset by a 6% decline in net interest income which reflected the impact of higher hedging and funding costs. Revenues in Personal Banking were down 5% year on year to € 5.3 billion, as growth in deposit revenues was more than offset by the aforementioned rise in hedging and funding costs. Revenues in Wealth Management & Private Banking grew by 2% year on year to € 4.1 billion, as growth in both lending and investment products more than offset a decline in deposit revenues. Assets under management rose to € 633 billion, their highest ever level and € 55 billion higher than at the end of 2023, driven partly by net inflows of € 29 billion. In the fourth quarter, Private Bank net revenues were € 2.4 billion, down 1% on the prior year quarter. Positive momentum in client revenues was more than offset by continued higher funding costs from the impact of minimum reserves, the group-neutral impact of certain hedging costs and the non-recurrence of certain lending revenues in the prior year quarter. Personal Banking revenues were € 1.4 billion, down 2% year on year, while revenues in Wealth Management & Private Banking were € 1.0 billion, unchanged year on year. Assets under management grew by a further € 8 billion, including net inflows of € 2 billion, during the quarter.\nAsset Management net revenues were € 2.6 billion, up 11% year on year. This growth was driven by a 7% increase in management fees to € 2.5 billion; performance and transaction fees up 16% to € 148 million, from € 128 million in the prior year period; and an increase in other revenues to € 23 million, compared to negative € 59 million in the prior year, driven by lower treasury funding charges. Assets under management grew to € 1,012 billion, € 115 billion higher than at the end of 2023, and surpassing € 1 trillion for the first time. This reflected rising market levels, net inflows of € 26 billion during the year and positive FX impacts. In the fourth quarter, revenues were € 709 million, up 22% on the prior year quarter. Management fees were € 647 million, up 13%, reflecting higher average assets under management in both Active and Passive products. Performance and transaction fees were € 108 million, up from € 41 million in the prior year quarter, predominantly driven by a significant Multi Asset performance fee. Other revenues were negative € 46 million in the quarter, mainly reflecting unfavourable movements in the fair value of guarantees and lower investment income. Assets under management rose by € 49 billion to € 1,012 billion during the quarter, driven by net inflows of € 18 billion, primarily in Passive, and the positive FX effects.\nNoninterest expenses: operating cost discipline more than offset by impact of specific litigation items\nNoninterest expenses were € 23.0 billion in 2024, up 6% year on year. Non-operating costs were € 2.6 billion, up from € 1.1 billion in 2023, and included € 1.7 billion in charges relating to specific litigation items, up from € 255 million in the prior year and including approximately € 900 million relating to the bank’s takeover of Postbank AG. Adjusted costs, which exclude nonoperating items, were € 20.4 billion, down 1% year on year and included € 235 million in real estate measures and true-up adjustments to UK bank levies. Higher compensation and benefit expenses were largely offset by lower technology and professional services costs during the year.\nIn the fourth quarter, noninterest expenses were € 6.2 billion, up 14% from the prior year quarter. Nonoperating costs were € 945 million, up from € 167 million in the prior year quarter, and including € 594 million relating to the aforementioned specific litigation items. Fourth quarter adjusted costs were € 5.3 billion, down 1%, from the prior year quarter and included the aforementioned € 235 million of exceptional items together with a negative year-on-year FX impact of € 65 million.\nThe workforce was 89,753 FTEs at the end of 2024, a decrease of 483 FTEs during the fourth quarter and down 377 FTEs during the year. Investments in business growth, controls and technology, together with internalizations of external contract staff, were more than offset by leavers, including through operational efficiency measures, during the year.\nCredit provisions down 15% in the fourth quarter\nProvision for credit losses was € 1.8 billion in 2024, up from € 1.5 billion in 2023 and 38 basis points (bps) of average loans, in line with the guidance the bank provided after the third quarter. The increase was driven by cyclical impacts from commercial real estate, a small number of corporate credit events and residual temporary impacts in the Private Bank following the Postbank integration. The wider portfolios performed broadly in line with expectations despite the challenging macroeconomic and interest rate environment.\nIn the fourth quarter, provision for credit losses was € 420 million and 35 bps of average loans, down 15% from € 494 million in the third quarter and down 14% from the prior year quarter. The quarter-on-quarter development primarily reflects a decline in provisions for non-performing loans (Stage 3) from € 482 million to € 415 million, driven by a larger recovery on a legacy case and a decline in commercial real estate provisions as expected. Provision for performing (Stage 1 and 2) loans was € 6 million; the effect of portfolio movements was largely offset by slightly improved macroeconomic forecasts and overlay recalculations. For 2025, the bank expects provision for credit losses to be around € 350-400 million per quarter on average.\nStrong capital generation supports 50% year-on-year proposed dividend growth\nThe Common Equity Tier 1 (CET1) capital ratio was 13.8% at the end of 2024, up slightly compared to the end of 2023, as organic capital generation offset the combined impacts of dividends, share buybacks and business growth during the year. On a ‘pro forma’ basis, reflecting the introduction of the EU’s Capital Requirements Regulation 3 (CRR 3) on January 1, 2025, the CET1 ratio was 13.9%. Capital efficiency measures, part of Deutsche Bank’s accelerated execution of its Global Hausbank strategy, had delivered cumulative RWA equivalent reductions of € 24 billion by the end of 2024, close to the bank’s end-2025 target of € 25-30 billion. € 2.1 billion of capital distributions to shareholders are proposed or approved for execution in 2025, including € 1.3 billion in dividends of € 0.68 per share, up by 50% year on year, and approved share repurchases of € 750 million.\nIn the fourth quarter, the CET1 ratio was 13.8%, unchanged from the end of the third quarter. The CET1 ratio was impacted, as anticipated, by the deduction for the bank’s € 750 million share repurchase program announced today, largely offset by the positive impact of lower RWAs, principally due to lower market risk. As at the end of the fourth quarter, the bank had a CET1 capital buffer over requirements of € 9 billion.\nThe Leverage ratio was 4.6% in the fourth quarter of 2024, unchanged versus the previous quarter. The bank’s € 1.5 billion AT1 issuance during the fourth quarter was partly offset by the aforementioned capital change relating to the upcoming share repurchase program.\nLiquidity and funding strength\nThe Liquidity Coverage Ratio was 131%, above the regulatory requirement of 100%, representing a surplus of € 53 billion. The Net Stable Funding Ratio was 121%, slightly above the bank’s target range of 115-120% and representing a surplus of € 110 billion above required levels.\nDeposits were € 666 billion at the end of 2024, up by € 44 billion from year-end 2023 and including a rise of € 16 billion during the fourth quarter of 2024.    \nSustainable Finance: volumes² reach € 373 billion in five years\nSustainable Financing and ESG investment volumes ex-DWS² were € 21 billion in the quarter, bringing the cumulative total since January 1, 2020 to € 373 billion and to € 93 billion in 2024, including a € 10 billion one-time contribution following the integration of ESG criteria into Deutsche Bank’s German pension plan. This was the second best since measurement began at the beginning of 2020 and an increase by almost half compared to 2023. Volumes in the fourth quarter included a first-time € 1 billion contribution for market making activities in the Investment Bank, reflecting the annual average volume of the eligible bond inventory.\nAt the end of the quarter, Deutsche Bank returned to the Dow Jones Sustainability Index (DJSI) with a score of 66 out of 100 in the annual Corporate Sustainability Assessment of S&P Global Sustainable¹.\nIn the fourth quarter, Deutsche Bank’s businesses contributed as follows:\nCorporate Bank: € 6 billion in sustainable financing, raising the Corporate Bank’s cumulative total since January 1, 2020 to € 70 billion.\nInvestment Bank: € 13 billion in sustainable financing, capital market issuance and market making, for a cumulative total of € 224 billion since January 1, 2020.\nPrivate Bank: € 2 billion growth in ESG assets under management and new client lending, and a cumulative total of € 68 billion since January 1, 2020\nDuring the fourth quarter of 2024, notable transactions included:\nThe Corporate Bank served as the Original Lender and Hedge Counterparty for an AU$ 1.8 billion project financing facility for Global Power Generation (GPG) Australia, an international developer and manager of power generation assets. This transaction supports the investment in a 1.8- Gigawatt portfolio of renewable energy assets across Australia. It contributes to a total of nearly 3.6 Gigawatt of renewable energy projects financed in 2024 in Australia by Deutsche Bank. The GPG renewables portfolio consists of existing assets which have been refinanced as well as new project commitments.\nFIC served as Mandated Lead Arranger, Underwriter and Bookrunner for $ 560 million sustainability-linked loan for global nutrition and wellness company Health & Happiness International (H&H) to strengthen its ESG credentials by driving sustainability in its supply chain. The KPIs structured by Deutsche Bank were developed in line with the Science Based Targets Initiative (SBTi), linking the financing to H&H meeting criteria in the areas of renewable electricity, sustainable packaging and supplier engagement.\nOrigination & Advisory acted as Left Lead Bookrunner and ESG Coordinator on IHO Verwaltungs GmbH’s approximately € 1.9 billion-equivalent Sustainability-Linked Notes. IHO Verwaltungs GmbH is majority owner of Schaeffler Group, a leading German automotive supplier. The transaction is based on IHO’s new Sustainability-Linked Financing Framework, which sets out concrete decarbonization targets for Schaeffler Group.\nGroup results at a glance\n¹For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ below, and on pp 15-22 of the fourth quarter 2024 Financial Data Supplement.\n²Cumulative ESG volumes include sustainable financing (flow) and ESG investments (stock) in the Corporate Bank, Investment Bank, Private Bank and Corporate & Other from January 1, 2020 to date. Products in scope include capital market issuance (bookrunner share only), market making activities (annual average volume of eligible bond inventory), sustainable financing, period-end assets under management and period-end pension plan assets (gross assets). Cumulative volumes and targets do not include ESG assets under management within DWS, which are reported separately by DWS.\nESG Classification\nWe defined our sustainable financing and ESG investment activities in the “Sustainable Financing Framework” and “Deutsche Bank ESG Investments Framework” which are available at investor-relations.db.com. Given the cumulative definition of our target, in cases where validation against the Framework cannot be completed before the end of the reporting quarter, volumes are reported upon completion of the validation in subsequent quarters. In Asset Management, for details on ESG product classification of DWS, please refer to the section “Our Responsibility – Sustainable Action – Our Product Suite” in DWS Annual Report 2023.\nAnnual Media Conference\nDeutsche Bank will host its Annual Media Conference at 09:00 CET today. Christian Sewing, Chief Executive Officer, and James von Moltke, Chief Financial Officer, will discuss the bank’s fourth quarter and full year 2024 financial results and provide an update on the bank’s strategy and outlook. This event can be followed live on the bank’s website from 09:00 to 11:00 CET.  \nAnalyst call\nAn analyst call to discuss fourth quarter and full year 2024 financial results will take place at 11:00 CET today. The Financial Data Supplement (FDS), presentation and audio webcast for the analyst conference call are available at: www.db.com/quarterly-results\nA fixed income investor call will take place on January 31, 2025, at 15:00 CET. This conference call will be transmitted via internet: www.db.com/quarterly-results\nAnnual Report\nThe figures in this release are preliminary and unaudited. Deutsche Bank will publish its 2024 Annual Report and Form 20-F on March 13, 2025.",
    "number_of_ratings": 12,
    "rating": 4.8,
    "likes": 17
}