{
    "url": "https://www.db.com/news/detail/20250128-deutsche-bank-supports-quinbrook-s-debt-financing-for-supernode-battery-storage-project-in-queensland?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 28, 2025",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank supports Quinbrook’s debt financing for Supernode battery storage project",
    "body": "With Deutsche Bank acting as Lead Arranger, Original Lender and Hedge Counterparty, Quinbrook Infrastructure Partners (Quinbrook) has closed a 722 million Australian dollar new debt financing for Stages 1 and 2 of its ‘Supernode’ battery storage project in Queensland. This landmark transaction is one of Australia’s largest stand-alone Battery Energy Storage System (BESS) project financings to date.\nFinancing Australia’s largest battery storage project\nSupernode is strategically located adjacent to the central node of the electricity network in Queensland and is the largest BESS project under construction in Australia on an energy capacity basis.\nQuinbrook has secured long-term offtake agreements (https://www.quinbrook.com/news-insights/quinbrook-signs-significant-expansion-of-supernode-battery-storage-project-with-origin-energy/ ) with Origin Energy for Stages 1 and 2 for a combined BESS nameplate capacity of 520 MW / 1856 MWhs. Quinbrook is also planning the addition of Stage 3 which will bring the combined site to a nameplate capacity of 760 MW / 3096 MWhs, making Supernode one of the largest BESS projects under construction anywhere in the world.\n“We are grateful for the strong support received from both our existing and new financing partners who recognise the critical role that large scale storage investments provide in supporting Queensland and the wider National Electricity Market as the energy transition accelerates,” said Brian Restall, Managing Director and Regional Leader Australia for Quinbrook.\nWe’re pleased to support Quinbrook with this financing which will provide dispatchable supply services for the Queensland grid. This transaction paves the way for Supernode to become one of the largest battery energy storage systems globally, demonstrating DB’s expertise in Project Finance, and commitment towards sustainable energy solutions.\nRachel Chia, Deutsche Bank's Head of Project Finance, Asia Pacific, Corporate Bank\nDeutsche Bank worked alongside Bank of America, Commonwealth Bank of Australia, MUFG, Mitsubishi UFJ Financial Group (MUFG) and Mizuho Bank, on this transaction.\nThis transaction continues the bank’s strong trajectory in supporting sustainable financing solutions, marking the bank’s 25th renewable energy asset financed in Australia to-date.\nDeutsche Bank’s Corporate Bank provides a holistic suite of financing solutions spanning project finance, acquisition finance, corporate finance (and others) across the infrastructure and energy markets. The Corporate Bank has been active in project financings in Australia since 2019.\nThe Supernode battery energy storage project",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}