{
    "url": "https://www.db.com/news/detail/20230213-deutsche-bank-and-wwf-agree-on-cooperation?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Berlin, February 13, 2023",
    "tags": [
        "Germany",
        "Corporate Citizenship",
        "Strategy",
        "Sustainability"
    ],
    "title": "Deutsche Bank and WWF agree on cooperation",
    "body": "Today Deutsche Bank's Private Bank Germany and WWF Germany signed an agreement in Berlin for an initial two-year advisory service. The bank and the conservation organisation will work together in the coming months to further advance sustainable finance at Private Bank Germany and thus contribute to Deutsche Bank's sustainability strategy.\nPhilipp Gossow, Head of Sales Private Bank Germany and Head of ESG Private Bank : \"We look forward to working with the WWF and to what we will achieve together in the coming months. The financial sector plays a key role in the sustainable transformation of our economy and society. At Private Bank Germany, we provide comprehensive advice to our clients, including on sustainable finance products and services – an area in which we are looking to expand our expertise.\"\nHeike Vesper, Managing Director Politics & Transformation WWF Germany: \"The ecological transformation will only succeed if banks actively shape the transformation of the economy and society. The window of opportunity is shrinking and already this decade, structural changes will be needed to take the path to the 1.5-degree limit. In concrete terms, many decisions now need to be taken and financed in a climate-friendly manner. In order to accelerate the systemic changes in the remaining period and to channel financing correctly, WWF Germany is cooperating with Deutsche Bank. It has an impact on the German financial market and, by designing financing solutions, for example in the mortgage space, the bank has substantial leverage in the transformation being a success.\"\nIs a bank product or service conducive to transitioning to a greener way of life? This is a question that Deutsche Bank, together with the WWF, intends to ask much more. It also plans to further develop its suite of products and services with exactly this in mind. The same goes for structures, processes and the bank’s dialogue with its clients – increased sustainability across the board. The bank also plans to cooperate with the WWF to evaluate the concept of its designated green branches.\n(from left) Philipp Gossow: Head of Sales Private Bank Germany and Head of ESG Private Bank, Heike Vesper: Managing Director Politics & Transformation WWF Germany, Alf Meyer zur Heyde: Head of “Future Advisory & Sustainability” Private Bank Germany, Matthias Kopp: Head auf Sustainable Finance\nIn recent years, Deutsche Bank has already taken measures to improve sustainability, for example by joining the German Financial Sector’s collective commitment to climate change as well as its pathways to net zero. With the WWF, the Private Bank Germany wants to develop further concepts and measures.\nFinancing more sustainable housing, for example through energy-efficient building renovation, is a priority of the cooperation; another is advising on sustainable investments. The aim of the cooperation is to better understand and gauge people's needs in terms of sustainable projects and investments at different stages of their lives. This knowledge will form the basis for further developing processes and products.\nThe WWF will contribute its extensive expertise and existing network to the cooperation. The joint projects will pay into the much-needed transformation towards a greener, more sustainable economy and society in Germany and beyond.\n                ",
    "number_of_ratings": 14,
    "rating": 3.8,
    "likes": 22
}