{
    "url": "https://www.db.com/news/detail/20230208-christian-sewing-s-keynote-at-new-year-reception-deutsche-bank?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 8, 2023",
    "tags": [
        "Management & Leadership"
    ],
    "title": "Christian Sewing's keynote at New Year Reception Deutsche Bank",
    "body": "Every year, we wish each other Happy New Year, good health, success and happiness. In 2022, we added something that we had for so long taken for granted that hardly anyone mentioned it anymore. This struck me most reading through this year’s messages — how frequently people wished one a peaceful year. One senses that the longing for peace is growing every day.\nThe brutal war of aggression against Ukraine overshadowed 2022. This war is a great human tragedy: the images of suffering and destruction deeply affect us. At the same time, I admire the courage and resilience of the Ukrainians who - also for all of us - are fighting for peace and democratic values.\nIt is also an immense political and economic challenge. At our New Year's reception a year ago - the sabre-rattling from Russia was already clearly audible at the time - I spoke of an \"unmistakable signal that we have arrived in a new geopolitical era\". Unfortunately, I was right. That is why this year I cannot avoid talking to you again about challenges and risks - even if I see more reason for confidence overall. \nThe new era I have been talking about is characterised by multiplying conflicts, greater isolationism, protectionism and rising nationalism.\nThe war is changing the security architecture of Europe. Russia will remain an unpredictable factor and a threat for the foreseeable future. The EU must react to this and become more resilient. This includes secure energy supplies and a resolute defence policy. This applies to each country individually. But we also need to talk about a common European defence strategy.\nI don't want to imagine where Ukraine would be today without the US, which leads the Western alliance of supporters. The transatlantic alliance must remain a central pillar of our security policy. But we cannot rely on the Americans alone in the future Both parties in Washington expect Europe to take more responsibility for its own security.\nThis cannot be done without investing in military strength. Defence budgets will have to increase significantly. \nThis additional investment requirement coincides with other challenges. In the energy sector, we need a new start in Germany. The past year has ruthlessly exposed the lack of diversification in our energy imports, especially our dependence on cheap Russian gas. The German government's efforts to reduce this dependence deserve respect. But there is still a long way to go to make our energy supply secure and affordable in the long run.\nThis is the path we must take at a time when the world's economy is not only characterised by disrupted supply chains, the highest inflation in decades, and an increasingly pressing labour shortage. At the same time, we are facing arguably the most serious transformation of our generation, namely the shift to a resource-efficient economy. I will come back to this later.\nWe have proven time and again in the past that we use crises as opportunities to reinvent ourselves. This quality is now needed again.\nChristian Sewing, CEO\nThis unique concentration of challenges is the reason why I speak of an epochal change. For Europe, it will be the decisive test of how well our community functions under pressure - and whether we manage to put aside differences and ego and take joint responsibility. If we succeed in this, we have a good chance of maintaining our position in the world against the ever more powerful Chinese and Americans. What's more, I am convinced that we will then even be able to expand it and become more relevant again.\nWe have what it takes. After Russia's invasion of Ukraine, the EU states have shown that they can make difficult decisions together. And in Germany, as in the pandemic, politics and business have cooperated in an exemplary manner to find solutions. In addition to the enormous resilience of our companies, this is an important reason why the economic forecasts are more benign today.\nIt is crucial that we do not let up now. The slight improvement must not prevent us from tackling necessary reforms with courage. This is the year in which we must set the course to secure our competitiveness in the long term.\nWe have proven time and again in the past that we use crises as opportunities to reinvent ourselves. This quality is now needed again - and I see five concrete measures that we need to tackle as a priority:\n1. Reorganise energy policy\nNumber one is the reorganisation of our energy policy that I already mentioned.\nWe must not be deceived by the recent easing of gas prices. Gas will remain more expensive than before for years to come. And this cannot be permanently absorbed by the public purse.\nIt is right and proper that politicians provide targeted support in the acute crisis and cushion hardship so that companies in Germany can operate competitively. However, I agree with Christian Lindner who recently said that we have to get out of crisis mode at some point.\nA central goal must be to consistently expand renewable energies throughout Europe. And we must consume even less energy overall. This requires investment in more modern plants, facilitated by tax incentives. In the meantime, it is important to guarantee a secure energy supply for our companies. We need long-term contracts with a variety of suppliers. The imperative is diversification. \n2. Green transformation as a location policy\nWhen I talk about renewable energy, I do so with mixed emotions. It is extremely regrettable that we carelessly squandered the lead we had in Germany in solar and wind energy and that we are still delaying further expansion - because there is a lack of investment incentives and the approval procedures for new plants are unacceptably long.\nOn the other hand, I am encouraged by the dynamism with which we in Germany and Europe have moved forward on the issue of sustainability in recent years.  Our companies, research facilities and institutions have become global pioneers.\nThis time we must defend this lead - and that is why my second point is that we drive the green transformation forward with verve. The opportunities are immense and diverse. However, others are catching up fast. This is especially true for the US. The Inflation Reduction Act introduced by the Biden administration has pledged at least 374 billion US dollars in subsidies for climate protection and the strengthening of future industries. Germany and Europe must also think bigger and understand the green transformation as a location policy. I do not mean to suggest a subsidy race. It would already help a lot if we were quicker and less bureaucratic.\n3. Cut back on regulation\nThis brings me to my third point. Complex rules and regulations are not only a burden on wind and solar power providers. No, the complaints about excessive regulation in Berlin and Brussels run through all sectors. It is becoming a real competitive disadvantage.\nTo be clear: as a bank board member and former risk manager, I appreciate the benefits of regulation. Stricter regulations have been instrumental in helping our industry stabilise after the financial crisis. But in the meantime, in many parts of the economy the pendulum has swung too far and this is where we need to take countermeasures.\n4. Enable targeted and qualified immigration \nWe also need simplification in another area, and that is immigration. Here we are still conducting the wrong debate. The question has long since ceased to be whether we want immigration. The question is whether we can get the workers we need at all. That's why my fourth point is that we need to be more open to targeted and qualified immigration.\nBy mid-2030, the number of people of retirement age in Germany is expected to increase by about four million. Automation and digitalisation alone will not be able to absorb this. This means that we cannot afford to stop at national borders in the search of the best brains. Simplified naturalisation laws would be one effective means, special visa programmes for highly qualified immigrants another. Opening up our labour market is a top priority if we want to remain competitive in the long run.\n5. Strengthen education and qualification\nImmigration alone will not be enough, however. We must - and this is my fifth point - also modernise our education systems. We must connect them better and consistently orient them towards the technologies and skills that the economy will need in the future. And we must ensure that more people have access to the best possible education. That's the only way we'll get more highly qualified skilled workers.\nI also see those of us leading corporations as having a duty when it comes to the important issue of employee qualification. We need completely different systems to be able to continuously train our staff.  There are estimates that up to 40 percent of the jobs that will be needed in 2030 do not even exist today. Even if such figures cannot be verified exactly, the message behind them is very clear: we must change our human resources work so that it promotes lifelong learning. \nA strong Europe as the key to the future\nThese five measures - a new energy policy, accelerated green transformation, less regulation, facilitated immigration and a push on education - are reforms that individual countries can initiate and implement.\nBut they will only be truly effective if we break away from national thinking and harness the power of a common Europe.\n\"The unity of Europe was a dream of a few. It became a hope for many. Today it is a necessity for all of us.\"\nThis was said by the then German Chancellor Konrad Adenauer back in 1954.\nBut it was not until almost four decades later, on 1 January 1993, that the common EU internal market came into being. Today it comprises almost 500 million people and an economic output of 11.5 trillion euros. This makes the European single market significantly larger than the US single market.\nTheoretically.\nIn fact, the single market is still not nearly complete. Companies are still subject to different rules in each sub-market, and the Europe-wide sale of identical products remains an illusion in many areas. We are thus leaving an enormous potential untapped. And whoever I speak to outside Europe: nobody understands what we are doing here - and above all: what we are not doing.\nOf course, a common market means that the individual member states have to give up some of their sovereignty. But if we are serious about Europe, we must finally deepen integration. In an increasingly polarised world, cooperation among Europe's neighbours is at least as important as it was in Adenauer's time. But, to be clear, this must not mean abandoning the budgetary discipline that we uphold in Germany.\nA unified capital market for Europe\nFor me, the most important thing is that we create the conditions to mobilise cross-border capital in Europe and to get investors on board. Because without sufficient financing, we will hardly be able to realise any of the measures I just spoke about.\nThat's why Europe needs to play the ace it has held for a long time so that all can see it: the European capital markets union. At the risk of repeating myself, the capital markets union is the most favourable economic engine for Europe.\nIt would expand financing opportunities for companies and attract funds from global investors. There is no lack of interest. All over the world investors tell me they are eager to invest in Europe. They value our companies and our innovation - and they also value our strong democracies and liberal values. But our small national capital markets simply do not offer the conditions that large investors need - which is why their commitment remains well below its potential.\nAs a result, Europe's firms are still too reliant on credit today: Banks provide about 80 percent of corporate financing in Europe. In the US, by contrast, about 60 percent of companies are financed on the capital market.\nIt is only if Europe catches up that we will free up the capital necessary for future investment.  And here, too, I can only repeat what I have often emphasised: Europe will not achieve sustainable transformation without a capital markets union. Interim steps such as an improved framework for securitisations are welcome. I would like to explicitly thank Finance Minister Lindner here for his initiative.\nStrengthening the competitiveness of banks\nWhen I call for more capital markets, this does not mean, of course, that I am taking us banks out of the picture. On the contrary, as banks in Europe, we want to be part of the solution, we want to support our economy in global competition and stand by it with our capital markets expertise.\nAnd Europe must be interested in having strong banks. Banks are at least as important for our strategic independence as the European energy companies. Unfortunately, this role was too little recognised by politicians and regulators. Instead of promoting the competitiveness of European banks, regulation is largely geared towards excluding any risk - yet banks are more robust today than they have been for decades. That is why I would once again like to express my appreciation for the Finance Minister, who in November called for banks to be competitive as well as stable - and also called for a measured approach to regulation.\nSome 15 years after the financial crisis, it is time to recognise these positive developments and review regulation. Because here and there it overshoots the mark.\nAs a result, our economy lacks capital that it urgently needs in these times. And European banks are weakened in global competition. Barely a handful of institutions are operating on an equal footing with the Americans. If we do not want to be exclusively dependent on foreign institutions in the key field of financing, we urgently need to change course. We must not repeat the mistakes we made in energy supply when it comes to banking services. \nDeutsche Bank as a strong partner\nLadies and gentlemen, allow me to speak briefly about our bank at this point. Deutsche Bank is one of the institutions in Europe that can accompany European companies worldwide and build bridges to the capital markets worldwide. And nothing else should be our ambition. As your Global Hausbank, we want to be there for you precisely when the environment becomes more difficult: with tailor-made products and solutions, with our international network and with comprehensive expertise in risk management.\nLast year, we were able to live up to this claim. This also enabled us to increase our earnings by more than 7 percent over the year to 27.2 billion euros. Our pre-tax profit even rose by 65 percent to 5.6 billion euros. This was the best result in 15 years. The basis for this success was the strong business we were able to do with you, our clients. I would like to thank you for this trust on behalf of all the employees of our bank.\nI would also like to sincerely thank you for the way you have supported us during our transformation over the past years. In July 2019, we started the transformation with the aim of putting our bank on a stable and sustainable foundation.  Our bank is now sustainably profitable again, it is significantly more efficient, and it has four strong business areas that complement each other and ensure a good balance.\nWe are confident that with this set-up we will continue on our growth path. In 2025, we want to achieve revenues of more than 30 billion euros and a return on equity of above 10 percent. But above all, we want to continue to accompany you closely in all your undertakings.\nOur employees are there to support you in these volatile times and to develop plans for the future with you.\nOne area that is of particular importance to us is sustainability. This is not just about developing attractive products and solutions. It is about engaging in transformational dialogue with our clients - with the aim of supporting them on their way to climate-neutral business models.\nConclusion\nThis brings me back to the epochal change I spoke of at the beginning, which is marked by conflict, compartmentalisation and setbacks for globalisation. The contradiction with the fight against climate change could not be greater, because this most global of challenges requires considerably more cooperation.\nThat is why it is so important for me that we strengthen what unites us wherever we have the opportunity. We will only be able to solve the challenges together. This requires courage, passion and the willingness to take responsibility. Without this attitude, we would not have been able to turn Deutsche Bank around in the past three and a half years. And we now need this attitude at all levels to advance our European home market and set the course for a successful future. Business, politics and regulators are called upon to work together here. We at Deutsche Bank are ready to play our part.",
    "number_of_ratings": 8,
    "rating": 3.9,
    "likes": 12
}