{
    "url": "https://www.db.com/news/detail/20230207-turkey-and-syria-earthquake-relief-campaign?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 7, 2023",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Turkey and Syria Earthquake Relief Campaign",
    "body": "Following the devastating earthquake in Turkey and Syria, Deutsche Bank is launching an emergency appeal for donations. The bank will make a start by donating 500,000 euros. The bank is also inviting staff to donate and support those in need. \nThe pictures and reports coming out of Turkey and Syria are heart-breaking. Our thoughts go out to all those swept up in this tragedy and we wish the emergency services and rescue teams every strength as they seek to save lives. \nChristian Sewing, CEO\nThe 7.8 magnitude earthquake struck at 4:17am on Monday in southern Turkey near the city of Gaziantep, and was followed by a series of powerful aftershocks. A second earthquake hit the Elbistan district around 80 miles north of Gaziantep in the early afternoon. \n \nMedia are reporting that thousands have been killed as hundreds of buildings collapsed, and thousands more have been injured. These figures are unfortunately expected to rise significantly. \n\nResponse \nDeutsche Bank’s corporate social responsibility teams and foundations around the world are launching a campaign to support humanitarian relief. \n\"As a bank we’ve been in Turkey since 1909 and we stand by our colleagues there,\" Sewing said. \"We are making a donation to support the Red Cross/Red Crescent and will start a donation campaign among staff worldwide.\" \nThe campaign will support the work of Red Cross/Red Crescent organisations worldwide, who are providing aid to the communities impacted by this natural disaster. Rescuers are racing to save people trapped beneath the rubble and get shelter and support to those who have lost their homes or are afraid to return inside. \nThe Turkish Red Crescent has launched a crisis response operation and mobilised teams in more than 10 regions across the country, while the Syrian Arab Red Crescent is delivering assistance and support to those in need in the regions of Hama, Aleppo and Lattakia.  ",
    "number_of_ratings": 55,
    "rating": 4.7,
    "likes": 53
}