{
    "url": "https://www.db.com/news/detail/20220309-deutsche-bank-reports-very-limited-russia-exposure?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 9, 2022",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank reports very limited Russia exposure",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today provided details of its limited and substantially mitigated risk exposures to Russia and Ukraine, including risks arising from its local operations.\nDeutsche Bank has reduced its Russian exposure and local footprint significantly since 2014, with further reductions in the past two weeks. “Our direct exposures are currently very limited and tightly managed. Second- and third-order effects of the current situation, including sanctions and cybersecurity risk, are being carefully evaluated and monitored,” said Stuart Lewis, Chief Risk Officer and Member of the Management Board.\nCredit exposures to Russia and Ukraine account for a very small portion of the bank’s overall loan portfolio and are protected by a number of risk mitigants. These include offshore collateral and financial guarantees, while market risk exposures have been significantly reduced prior and subsequent to Russia’s invasion of Ukraine.\nAs of December 31, 2021, the bank’s credit exposure to Russia and Ukraine was as follows:\nNet loan exposure to Russia of € 0.6 billion after taking account of guarantees and asset collateral. Gross loan exposure was € 1.4 billion, around 0.3% of the overall loan book. The bank’s net exposure comprises:\n€ 0.5 billion to large Russian companies with material operations and cashflow outside Russia (€ 1.1 billion gross), booked offshore and with de minimis onshore exposure\n€ 0.1 billion from loans to subsidiaries of large multinational companies (€ 0.3 billion gross), predominantly guaranteed by parent companies, of which around 50% booked offshore\nNet loan exposure to Ukraine of € 42 million (€ 0.6 billion gross)\nThe vast majority of Deutsche Bank’s derivative exposure to Russia has been unwound. The remaining exposure presents no material credit risk as the bank has a net liability position\nOffshore loans to counterparties with a Russian connection by the wealth management business were adequately collateralised, and the collateral is not linked to Russia\nIn respect of market risk exposure, at the time of Russia’s invasion of Ukraine, Deutsche Bank’s Russia/Ukraine market risk exposure was well contained and the bank had a modest defensive position.\nOperational risks are closely monitored\nThe operational risk arising from a potential closure of Deutsche Bank’s Russian Technology Centre is also well contained. The bank’s technology service centre in Russia is one of several technology centres around the world and presents no significant business continuity risk to the functioning of Deutsche Bank’s global operations. The Centre has some 1,500 employees¹, approximately 5% of the Group’s internal and external technology workforce.\nThe bank sees production risk as manageable and has stress-tested the ability of its other technology centres around the world, including in Asia, to cover the Russian service centre’s development capabilities.\nFurther information on Deutsche Bank’s exposures to Russia and Ukraine is available on the bank’s website: https://investor-relations.db.com/RussiaExposure\n¹As at 31 January 2022",
    "number_of_ratings": 2,
    "rating": 1.0,
    "likes": 24
}