{
    "url": "https://www.db.com/news/detail/20220308-empowering-women-in-rural-communities-across-asia-pacific-to-break-the-bias?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 8, 2022",
    "tags": [
        "Asia-Pacific",
        "Corporate Citizenship"
    ],
    "title": "Empowering women to break the bias",
    "body": "Through Deutsche Bank’s Corporate Responsibility programme in Asia Pacific, it is empowering women from local communities and women social entrepreneurs break the bias. In 2021, the bank helped more than 200,000 women with formal education, vocational training, healthcare, entrepreneurship programmes or other essential needs. \nSupporting women entrepreneurs in rural communities in China and India\nIn China, as a part of the bank’s Made for Good initiative, it is supporting an entrepreneurship programme this week for women in rural areas of Chaozhou, Guangdong province, in partnership with China Women’s Development Foundation (CWDF). The programme includes training in creative product design and live-streaming sales for around 80 local women who work in the traditional embroidery industry.\nThe impact is two-fold. The trainees will learn how to promote their well-designed products through e-commerce platforms, improving their income and quality of life, while also helping preserve and promote traditional crafts. Over 100 women benefitted from a similar entrepreneurship programme in 2021.  \nIn India, the bank has been partnering with Self Employed Women's Association (SEWA), to help women in rural communities become financially independent. This year, the bank is expanding support to over 400 women in poorer sections of society through four different programmes\nGitanjali – Women from the waste-picking community are trained to make stationery items using wastepaper, and eventually become entrepreneurs by setting up their own stationery units. This gives them dignified employment as well as increases their monthly income.\nRUDI ­– This is an app-based agriculture cooperative run entirely by rural women producers. This app creates a rural retail network in all villages of the 14 districts of Gujarat, enabling direct market linkages to small farmers and supporting the distribution of quality essential nutritious food products. This leads to higher profit for the women.\nKamala Café & Kamala on Wheels is a chain of bakeries run by women in Gujarat. The programme provides livelihood training for women, including training on food processing and retail management. The women are also taught how to set up their own cafes on wheels or bakeries in their communities.\nThe Upcycling cooperative collects floral waste from offerings at temples and converts it into incense sticks. This project is expected to provide livelihood to over 20 women this year.\nSupporting women social entrepreneurs in the sustainability space\nFrom helping rural silk weavers in Thailand, addressing plastic pollution in Sabah, Malaysia to supporting local communities in the Philippines with sustainable fishing, 8 women social entrepreneur finalists pitched their solutions for tackling sustainability related problems in their local communities as part of Deutsche Bank’s regional BOOST-X programme in 2021. This programme was run in partnership with social-enterprise enabler Ashoka.\nThe BOOST programme equips APAC operations colleagues with new digital skills to drive efficiency and transformation at work. 11 BOOST participants mentored women social entrepreneurs in Indonesia, Malaysia, Philippines, and Thailand who are working towards addressing climate change and sustainability in their communities.\nTwo entrepreneurs won 5,000 euros each from Deutsche Bank to help accelerate their sustainability projects. Fashion graduate and founder of Phinix Textile Recycling Centre, Pamela Mejia is tackling waste in the fashion industry by collecting and reusing textile waste and turning it into higher valued products that can be used again, such as shoes and bags.\nSupaporn Tongsook, founder of the Foundation for Community Soul and Khwan Silk Craft, ensures Thai silk weavers are valued for their workmanship and not forced to sell their products at a lower prices due to economic inequality. Through her initiatives, including preservation of natural colored trees and upskilling, she hopes to have a concrete impact on their health and livelihoods.  \n“These programmes are just a few examples of what we have been doing to support women in the region, where the need is undeniable. Change is coming but it will continue to be an uphill battle for many women, and we will continue to support and empower them.” said Annie Yeo, Deutsche Bank’s Head of CSR for Asia.\n ",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 6
}