{
    "url": "https://www.db.com/news/detail/20220304-deutsche-bank-statements-on-war-in-ukraine?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 4, 2022",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank statements on war in Ukraine",
    "body": "Statement on Russia-related business, 3/3/2022 \nWe support the decisions of the German government and its allies and will promptly and fully implement the sanctions and other measures imposed. Within this framework, we continue to support our clients globally, including with respect to their Russia and Russia-related activities. Most of our clients with Russian operations or requirements are European or multinational corporates who are currently adapting their business activities in the country. We are monitoring the situation closely and may adapt our approach as appropriate. We have reduced our exposure to Russia significantly over recent years and the risks are well contained. \nStatement on Technology Centre, 3/3/2022 \nRussia is just one of multiple tech centres that we have around the world. Clearly the Ukraine invasion will have an impact on the bank, as it will on many companies. But we have rigorously tested our operational resiliency and are confident that the day to day running of our trading business will not be affected. We have no code and no data housed in the Russia tech centre. \nStatement on latest sanctions, 27/2/2022 \nWe support the decisions of the German government and its allies and will consistently implement the sanctions. Our sympathy is with the people of Ukraine. \nStatement from Christian Sewing in his capacity as President of the Association of German Banks, 24/2/2022 \nThe German banking industry stands united behind the German government and the European Union when it comes to sanctions. Acts of aggression that violate international law and the invasion of another country must not go unpunished in the 21st century. Everyone has the right to live in freedom and democracy. Our thoughts are with the people of Ukraine. \nInitial statement at the beginning of the invasion, 24/2/2022 \nWe are deeply concerned about the attack on a sovereign European country and that the borders in Europe are being questioned. First and foremost, our thoughts are with the people in Ukraine, with our colleagues and clients. \nOf course, we will continue to abide by political decisions and sanctions. We have prepared for different scenarios and have contingency plans in place. We have reduced our exposure to Russia significantly over recent years and the risks are well contained. ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 24
}