{
    "url": "https://www.db.com/news/detail/20220304-deutsche-bank-provides-disclosure-on-financed-co2-emissions-and-updates-on-net-zero-target-setting?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 4, 2022",
    "tags": [
        "Europe",
        "Germany",
        "Capital markets",
        "Corporate Citizenship",
        "Strategy",
        "Sustainability"
    ],
    "title": "Deutsche Bank provides disclosure on financed CO2 emissions and updates on net zero target setting",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today disclosed for the first time data on its financed greenhouse gas emissions. Using the standards established by the Partnership for Carbon Accounting Financials, an industry-wide initiative (PCAF Standards), Scope 1 and 2 financed emissions of the global corporate industry loan book were calculated at 30.8 million tonnes of CO2 equivalent per year (MtCO2e/y) as at year-end 2021.\nThe transparency provided today forms part of Deutsche Bank’s wider commitment to net zero CO2 emissions by 2050, and to provide further disclosure on financed emissions of its loan portfolio and sector-specific decarbonization targets, by the end of 2022.\nWithin Deutsche Bank’s corporate loan portfolio, financed emissions are concentrated in a few sectors and a very limited number of companies.\nThree sectors account for around 68% of the total Scope 1 and 2 emissions: oil & gas; utilities, including power generation; and steel, metals and mining. Total lending* to these sectors as at year-end 2021 was € 17 billion, 16% of the bank’s corporate industry loan book and around 3.5% of total loans. PCAF Standards and client data indicate that around 1% of corporate industry clients account for approximately 70% of the financed emissions in the bank’s corporate industry loan book.\nIn 2021, financed emissions in these sectors were as follows:\nOil & gas: financed emissions of 9.7 MtCO2e/y, or 32% of overall financed emissions in the corporate industry loan portfolio, on loan exposures of € 8.2 billion\nUtilities including power generation: financed emissions of 7.7 MtCO2e/y, or 25% of the corporate industry loan portfolio total, with loan exposures of € 4.5 billion;\nSteel, metals & mining: financed emissions of 3.5 MtCO2e/y, 11% of the corporate industry loan portfolio’s financed emissions, on loan exposures of € 4.3 billion;\nThe automotive sector accounts for a relatively modest portion of Scope 1 and 2 financed emissions, but forms part of Deutsche Bank’s net zero pathway analysis due to its contribution to Scope 3 emissions. The bank’s approach and methodology by industry sector is set out in more detail in Towards Net Zero Emissions, a white paper published today. \n“These disclosures are an important step on our pathway to net zero”, said Christian Sewing, Chief Executive Officer of Deutsche Bank and Chairman of the Group Sustainability Committee. “We are absolutely committed to building on this transparency and to supporting our clients in their transition and decarbonisation efforts. We are on track in embedding carbon intensity in Deutsche Bank’s reporting, governance and risk management processes.” \nEstablishing sector-specific net zero targets\nDeutsche Bank re-affirms its commitment to publishing 2050 net zero targets for key carbon intensive portfolios, together with intermediate targets for 2030, by the end of 2022. The bank also reaffirms its commitment, made within the Climate Commitment of the German Financial Sector (Klima-Selbstverpflichtung des deutschen Finanzsektors), to align its credit and investment portfolios to the goals of the Paris agreement, develop mutually accepted methodologies for measuring climate impact by the end of 2022, and report annually on progress. \nBy using the International Energy Agency (IEA)’s Net Zero scenario (NZE) as its benchmark, Deutsche Bank is developing net zero pathways for its overall loan portfolio, while concentrating on four particularly energy-intensive sectors driven by the following specific metrics:\nOil & gas: kg of CO2e per gigajoule (Gj) of production;\nPower generation: kg of CO2e per megawatt hour;\nSteel: kg of CO2e per tonne of steel produced;\nAutomotive: g of CO2/e per vehicle kilometre travelled (Scope 3).\nAdditionally, the bank will expand its disclosures beyond its loan book into other on- and off-balance sheet activities such as capital markets financing and total committed facilities.\nDeutsche Bank’s fossil fuel policy prohibits the financing of new oil & gas projects in the Arctic region or oil sands projects. Furthermore, the bank’s coal policy prohibits the financing of new coal-fired power plants, and places under review the financing of energy companies which are more than 50% reliant on thermal coal to ensure they have credible diversification plans in place. The complete exit from the financing of thermal coal mining is planned by 2025.\nWorking with clients on pathways to net zero\nSupporting clients as they define clear pathways towards meeting the goals of the Paris Agreement on Climate Change forms a core element of Deutsche Bank’s sustainability strategy.\nTo decarbonise its loan portfolio and other financing activities, Deutsche Bank will deploy different levers. These include providing transition financing to clients reducing their carbon footprint; rebalancing the bank’s loan portfolio towards clients who are well advanced in developing de-carbonisation plans and focused on less carbon-intensive technologies, such as renewables.\nDeutsche Bank is also committed to addressing industry-wide climate-related data challenges by refining data quality through several levers: reducing reliance on proxy data; improving data quality from third party providers, and incorporating more data sourced directly from individual clients.\nWorking with industry partners\nDeutsche Bank is actively involved in industry-wide initiatives on climate and other ESG risks, accounting and reporting standards and industry frameworks. These include:\nContributing, as a founding member of the Net Zero Banking Alliance (NZBA), to NZBA working groups whose purpose is to develop consistent international standards to propel the implementation of decarbonization strategies\nParticipating, as a member of the Partnership for Carbon Accounting Financials (PCAF), in PCAF’s Sovereign and Capital Market Instruments Working Groups as well as its Climate Data Working Group;\nParticipating in the Science Based Targets initiative’s (SBTi) Expert Advisory Group (EAG). This group includes representatives of financial institutions,  NGOs, and academic institutions, and advises SBTi on the development of their framework for financial institutions.\n*Total loans at amortised cost before impairment allowances, period end\nPDF\nRead the Whitepaper",
    "number_of_ratings": 6,
    "rating": 1.7,
    "likes": 38
}