{
    "url": "https://www.db.com/news/detail/20220303-ukraine-and-russia-support-for-corporate-clients?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 3, 2022",
    "tags": [
        "Corporate products",
        "Digital banking & services"
    ],
    "title": "Ukraine and Russia: support for corporate clients",
    "body": "The situation in Ukraine and Russia means many of the bank’s corporate and institutional clients with business interests in these countries are facing considerable challenges: How to manage volatility in FX? How can companies pay their bills in Russia? What does the current situation mean for a company’s manufacturing units in that region? – to name but a few.\nKey information for our clients\nTo help the bank’s clients across Europe stay up to date with the recent developments and the impact on their business, the bank has set up a portal that provides information on the economic impact of the Russian attack on Ukraine.\nThe website offers answers to the many questions that are now being asked, especially by companies with global operations. The site provides useful links and information on a wide range of relevant topics, from recent developments to sanctions or market implications. New information is continually being added.\nEssential support for client advisors\nTo provide the bank’s client advisors across Europe with critical information in this fast-moving situation, Deutsche Bank’s Corporate Bank has set up dedicated task force over the weekend.\nThe team, consisting of 20 colleagues from across the Corporate Bank’s core business and infrastructure functions, keeps a close eye on legal, financial and regulatory aspects of the situation and prepares key information for our client advisors. Within the first 24 hours, the team addressed more than 150 queries from the bank’s clients – and demand remains high.",
    "number_of_ratings": 5,
    "rating": 2.6,
    "likes": 110
}