{
    "url": "https://www.db.com/news/detail/20220302-deutsche-bank-and-staff-donate-to-support-ukraine?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 2, 2022",
    "tags": [
        "Company",
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank and staff donate to support Ukraine",
    "body": "Deutsche Bank is making a €1m donation to support relief efforts in Ukraine and enabling employees around the world to join a fundraising drive. Russia's invasion of Ukraine could displace more than a million people, according to the UN’s refugee agency, sparking a humanitarian crisis.  The donations raised will go to Red Cross and other organisations working on the ground.\nOur thoughts are with the people of Ukraine. Families who had to flee in fear for their lives, and may have lost everything in the process, need our help now. Our bank has a long history of fulfilling its social responsibility and it’s deep within our culture – especially in challenging times.\nChristian Sewing, Chief Executive Officer\nFor the past eight years, the International Committee of the Red Cross (ICRC) has been on the ground in eastern Ukraine delivering urgent help, including food, shelter, fuel for heating and medical supplies. This commitment remains steadfast in this war, too. Red Cross teams now in Ukraine and neighbouring countries will continue their work to repair vital infrastructure, provide health facilities with medicines and equipment, and support families with food and hygiene items. Across the country, more than 3,000 Red Cross staff and volunteers are supporting firefighters, medical staff, and civil protection units.\n\nDonations from US-based employees will go to the International Medical Corps, which is responding to the conflict by expanding access to medical and mental health services for those living in affected communities.",
    "number_of_ratings": 27,
    "rating": 4.2,
    "likes": 104
}