{
    "url": "https://www.db.com/news/detail/20220427-a-message-from-christian-sewing-on-q1-results-2022?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 27, 2022",
    "tags": [
        "Financial Results",
        "Strategy"
    ],
    "title": "A message from Christian Sewing on Q1 results 2022",
    "body": "Dear Colleagues,\nThe war in Ukraine has overshadowed everything these past few months. It has brought terrible suffering to the country’s people and is having a huge impact elsewhere, too. We condemned the invasion emphatically and unequivocally. As announced, we are in the process of winding down our business in Russia. At the same time, along with many of you, our bank has been lending support in a variety of ways to the victims of this war, to the many refugees and also to our colleagues in Ukraine. I would like to thank you very much for your tremendous generosity and solidarity.\nThese recent weeks and months have also shown that our bank performs particularly well during challenging times. As we outlined at our Investor Deep Dive on March 10, we have also shown we have everything it takes to be a Global Hausbank. With our first-class risk management and focus on all four business divisions, we offer our clients a global network combined with local expertise, along with our leading products and solutions. We have helped our clients manage their risks and have provided them with the short to long-term financing that they desperately need right now. And we are supporting government actions, on the one hand by unreservedly implementing the sanctions against Russia, on the other by exchanging views on the economic consequences of this war.\nDeutsche Bank is more stable and resilient than it has been for many years. Our figures for the first quarter demonstrate this clearly. Despite the difficult environment, we once again managed to increase our net revenues over what was already a strong quarter in the previous year, reaching 7.3 billion euros this quarter. Since we were also able to further reduce costs, we generated more profit than in the same period last year: profit before tax rose by 4 percent to 1.7 billion euros, while net profit was 1.2 billion euros, an increase of 18 percent. This has been the best start to the year since 2013. We can all be proud of this achievement!\nIt is particularly pleasing that our growth this quarter is once again driven by all four core businesses. Year-on-year, we achieved higher revenues and profit across the board:\nIn the Corporate Bank, business growth continued despite the more challenging market. We saw this reflected in loans which were up by 3 billion euros in the quarter and by 8 billion euros year-on-year. The interest rate environment in many regions improved further, with US, non-euro EMEA and Asia now more than offsetting remaining negative effects of low interest rates in the Eurozone. Overall, the Corporate Bank increased its net revenues by 11 percent. This, combined with a reduction in non-interest expenses of 7 percent, helped us to deliver a 25 percent year-on-year increase in profit before tax.\nIn the Investment Bank, profit before tax rose slightly by 1 percent compared to the strong prior-year quarter. Net revenues were up by 7 percent thanks to strong client demand in Fixed Income & Currencies (FIC) Sales & Trading. This more than compensated for a decline in revenues from our Origination & Advisory business where we saw a decline in client activity in capital markets due to the uncertain geopolitical and economic situation. An exception was in Mergers & Acquisitions (M&A) which increased revenues by more than 80 percent.\nThe Private Bank was able to absorb the negative effects of low euro interest rates and grow revenues, thanks in part to successive quarters of business volume growth. Net revenues rose by 2 percent. This was mainly due to an increase of 4 percent in the International Private Bank, but the Private Bank Germany also grew its revenues. Profit before tax in the Private Bank rose by more than half and was the highest of any quarter since we launched our transformation programme – a clear sign of how we improved efficiency here. We took a further step in this direction in mid-April, when four million Postbank clients who exclusively use savings products were all migrated to Deutsche Bank’s IT platform. By the beginning of next year all of Postbank's client connections are to follow.\nIn Asset Management, assets under management fell for the first time in eight quarters owing to the price slide in many markets, and investors withdrew a net 1 billion euros from DWS products. However, this was mainly due to outflows in low-margin cash products. Excluding Cash, net inflows were 5.7 billion euros, with substantial net inflows into Active (ex-Cash) products and inflows into Alternatives and Passive products. ESG funds attracted inflows of 1.1 billion euros. In addition, net revenues grew by 7 percent, primarily driven by higher management fees, and profit before tax was up 12 percent. \nOur Capital Release Unit rounds off this quarter’s positive picture. Here we were able to further reduce leverage exposure and risk-weighted assets. At the same time, we continued to cut costs, reducing the unit’s loss before tax by 17 percent year on year.\nThese are all impressive results; we have shown our strengths in difficult circumstances. And importantly, we have still managed to remain disciplined on costs. We were able to reduce adjusted costs (excluding transformation charges and bank levies) by a further 3 percent to 4.6 billion euros. If currency effects are excluded, the reduction was 5 percent. One of the factors contributing to this was that our investments in more efficient technology are increasingly paying off. We will need to maintain this discipline in the coming months.\nOf course, we must also keep an eye on the growing risks. The global economic outlook is deteriorating, while inflation rates continue to rise. This is reflected in our results; we increased our credit loss provisions in the first quarter. There were no major defaults yet, but we are now better equipped to absorb possible defaults in future. We have an excellent loan book, strong risk management and a solid capital base. At the end of the first quarter, our Common Equity Tier 1 capital ratio (CET1) was 12.8 percent and thus above our target of 12.5 percent.\nWe are convinced that we are well prepared for more difficult times. The good start to the year gives us further confidence that we will achieve our targets for the current year. With a post-tax return on tangible equity of 8.1 percent, we exceeded our year-end target of 8 percent in the first quarter. At 73 percent, the cost-income ratio is also not far shy of our 70 percent target – even though we booked almost all of the bank levies for the entire year in the first three months, and these were significantly higher than in the previous year.\nThis business success is the indispensable prerequisite for us to be able to live up to our responsibility for our clients, the economy, and society as a whole.\nTogether, we have achieved great things, as we have done in every quarter since we announced our new strategy in mid-2019. In March, we announced the start of the next stage and, as before, we set ourselves ambitious goals that we know we can achieve. Our first quarter results have shown us that again.\nBest wishes,\n\nChristian Sewing",
    "number_of_ratings": 3,
    "rating": 2.3,
    "likes": 13
}