{
    "url": "https://www.db.com/news/detail/20220427-deutsche-bank-reports-EUR-1-7-billion-profit-before-tax-in-the-first-quarter-of-2022?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 27, 2022",
    "tags": [
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank reports € 1.7 billion profit before tax in the first quarter of 2022",
    "body": "Profit before tax up 4% to € 1.7 billion with net profit up 18% to € 1.2 billion\nPost-tax return on tangible equity (RoTE)¹ of 8.1%\nCost/income ratio of 73%, down from 77% in prior year quarter\nProfit grew despite 28% increase in bank levies to € 730 million\nCore Bank profit before tax of € 2.0 billion, post-tax RoTE¹ of 10.7% and cost/income ratio of 69% with profit growth across all businesses\nCorporate Bank up 25% to € 291 million\nInvestment Bank up 1% to € 1.5 billion\nPrivate Bank up 54% to € 419 million\nAsset Management up 12% to € 206 million\nCapital Release Unit cuts loss before tax by 17% year on year to € 339 million\n32% reduction in noninterest expenses more than offsets revenue decline\nFurther portfolio reduction: RWAs down € 3 billion to € 25 billion and leverage exposure down € 4 billion to € 35 billion during first quarter\nNet revenues up 1% to € 7.3 billion reflecting growth across core businesses\nCorporate Bank up 11% year on year to € 1.5 billion\nInvestment Bank up 7% to € 3.3 billion\nPrivate Bank up 2% to € 2.2 billion\nAsset Management up 7% to € 682 million\nNoninterest expenses reduced 4% year on year to € 5.4 billion\nAdjusted costs ex-transformation charges and bank levies¹ down 3% to € 4.6 billion\nCapital, risk and balance sheet in line with objectives\nCommon Equity Tier 1 (CET1) capital ratio of 12.8%\n€ 300 million share repurchase completed in April\nProvision for credit losses of € 292 million, in line with guidance\nIn this quarter, we showed our strength and resilience as the Global Hausbank. Our priority was to enable clients to respond quickly to geopolitical events and guard against risks. All our businesses delivered results in line with or ahead of our targets, and we produced our highest quarterly profit for nine years.\nCEO Christian Sewing\nDeutsche Bank (XETRA: DBGn.DB / NYSE: DB) today announced profit before tax of € 1.7 billion for the first quarter of 2022, up 4% year on year. Post-tax profit was up 18% to € 1.2 billion, the highest quarterly post-tax profit since 2013. This result was achieved despite a 28% increase in Deutsche Bank’s annual bank levies to € 730 million, recognised in the first quarter.\nPost-tax return on average shareholders’ equity was 7.2% in the quarter, while post-tax return on average tangible shareholders’ equity (RoTE)1 was 8.1%, up from 7.4% in the prior year quarter. The cost/income ratio improved to 73%, from 77% in the first quarter of 2021.\nAssuming an equal distribution of Deutsche Bank’s annual bank levies across the four quarters of 2022 and a three-month pro rata (three twelfths) share in the first quarter, pre-tax profit would have been € 2.2 billion in the quarter. Post-tax RoTE¹ would have been 11.2%, compared to the bank’s full year 2022 target of 8%, and the cost/income ratio would have been 66% versus the full year target of 70%.\nIn a challenging environment, we delivered both revenue and profit growth across all core businesses. Our first quarter revenues demonstrate clear momentum towards our 2022 objectives. We believe this momentum, combined with continued cost discipline and organic capital generation, positions us well for delivery on our 2022 targets.\nJames von Moltke, Chief Financial Officer\nCore Bank: profit growth across all businesses\nIn the Core Bank, which excludes the Capital Release Unit, profit before tax was € 2.0 billion, essentially unchanged year on year, despite a year on year rise of € 184 million in bank levies to € 587 million. Revenues grew 3% to € 7.3 billion, noninterest expenses were down 1% to € 5.0 billion, and adjusted costs ex-transformation charges and bank levies were down 1% to € 4.4 billion.\nPost-tax RoTE¹ was 10.7%, higher than the Core Bank’s full year 2022 target of above 9% and compared to 10.9% in the first quarter of 2021. The year on year development reflected growth in tangible equity. The cost/income ratio was 69%, versus 71% in the prior year quarter. Assuming a three-month pro rata (three twelfths) share of full year bank levies, Core Bank post-tax ROTE¹ would have been 13.4% and cost/income ratio would have been 63%.\nThe core businesses contributed as follows to the bank’s key target ratios:\nCorporate Bank: post-tax RoTE¹ of 7.2% and cost/income ratio of 70%\nInvestment Bank: post-tax RoTE¹ of 16.8% and cost/income ratio of 53%\nPrivate Bank: post-tax RoTE¹ of 9.1% and cost/income ratio of 77%\nAsset Management: post-tax RoTE¹ of 25.4% and cost/income ratio of 62%\nThe Capital Release Unit\nThe Capital Release Unit maintained its progress on portfolio reduction. Leverage exposure was reduced by € 4 billion to € 35 billion during the first quarter, and Risk weighted assets (RWAs) were down a further € 3 billion to € 25 billion, including operational risk RWAs of € 19 billion. The Capital Release Unit remains ahead of its year-end 2022 targets for both leverage exposure and RWA reduction and has cut leverage exposure by 86% and RWAs by 61% since its creation in mid-2019.\nThe Capital Release Unit reduced its loss before tax to € 339 million, down 17% from a loss before tax of € 410 million in the first quarter of 2021. The improvement was driven primarily by cost reduction, with noninterest expenses down 32% year on year to € 337 million. This reduction more than offset the non-recurrence of net revenues which primarily reflects the cessation of revenues from Prime Finance cost recovery after the completion of the transfer of Prime Finance to BNP Paribas at the end of 2021.\nRevenue growth across all core businesses\nNet revenues were € 7.3 billion, up 1% over the prior year quarter and the highest since the first quarter of 2017. Revenue growth in Deutsche Bank’s core businesses more than offset negative revenues in the Capital Release Unit and Corporate & Other. In the core businesses, net revenues were as follows:\nCorporate Bank net revenues were € 1.5 billion, up 11% year on year, the highest since the launch of the transformation programme and the second consecutive quarter of double-digit revenue growth. Revenues in Corporate Treasury Services were up 14%, Institutional Client Services revenues rose 11% and Business Banking revenues were up 1%. Revenues were driven in part by business growth, with deposits up 5% and gross loans up 7% over the prior year quarter.\nInvestment Bank net revenues were € 3.3 billion, up 7% over a strong first quarter of 2021. Fixed Income & Currencies (FIC) revenues grew 15%, driven by strong Financing, Rates, Foreign Exchange and Emerging Markets which more than offset a decline in Credit Trading. This growth in FIC revenues more than offset a 28% decline in Origination & Advisory revenues, driven by a significant year on year decline in Equity Origination which reflected lower industry fee pools against a backdrop of economic and geo-political uncertainties.\nPrivate Bank net revenues were € 2.2 billion, up 2% year on year. Revenues in the Private Bank Germany were up 1%, while the International Private Bank grew revenues by 4% over the prior year quarter. Net new business volumes were € 13 billon, predominantly net inflows into investment products of € 9 billion and net new client loans of € 3 billion, which are expected to contribute to revenue growth in future quarters.\nAsset Management net revenues rose 7% to € 682 million. A 13% rise in management fees, to € 621 million, more than offset a decline of 34% in performance and transaction fees which reflected the non-recurrence of a substantial performance fee in the prior year quarter. Net outflows were € 1 billion, driven by Cash and Fixed Income products; net inflows ex-Cash were € 5.7 billion. Assets under management were € 902 billion at quarter-end, down 3% quarter on quarter but up 10%, or € 82 billion, year on year.\nSustainable Finance: further progress and accelerated targets\nEnvironmental, Social and Governance (ESG)-related financing and investment volumes² were € 20 billion ex-DWS in the quarter, bringing the cumulative total since January 1, 2020 to € 177 billion. In the first quarter, Deutsche Bank’s businesses contributed as follows:\nCorporate Bank: € 4 billion in sustainable financing, raising the business’ cumulative total since January 1, 2020 to € 30 billion;\nInvestment Bank: € 11 billion in sustainable financing and capital market issuance, for a cumulative total of € 98 billion;\nPrivate Bank: € 4 billion growth in ESG assets under management and a further € 1 billion in ESG new client lending, raising the Private Bank’s cumulative total to € 50 billion.\nAt its Investor Deep Dive on March 10, 2022, Deutsche Bank announced an acceleration of its targets for sustainable financing and investment volumes for the second time. The bank now aims to achieve cumulative volumes since January 2020 of over € 200 billion by the end of 2022, a year earlier than previously, and a further € 100 billion per year from 2023 to 2025, reaching a cumulative total of over € 500 billion by the end of 2025. The bank expects net revenues arising from the volumes categorised under Deutsche Bank’s Sustainable Finance Framework to be in excess of € 1.5 billion in 2025.\nExpenses: year on year reductions despite higher bank levies\nNoninterest expenses were € 5.4 billion in the quarter, down 4% year on year, despite the aforementioned rise in annual bank levies of € 159 million to € 730 million. Adjusted costs ex-transformation charges and bank levies1 were down 3% to € 4.6 billion. By the end of the first quarter, Deutsche Bank had recognised 98% of the total transformation-related effects anticipated through end-2022.\nCredit provisions: year on year growth reflects macroeconomic developments\nProvision for credit losses was € 292 million in the quarter, up from € 69 million in the first quarter of 2021. This development was driven by provision for performing (Stage 1 and 2) loans of € 178 million, compared to net releases of € 95 million in the prior year quarter, primarily reflecting rating migrations and overlays to reflect macro-economic uncertainties. This increase was partly offset by a 30% decline in provision for non-performing (Stage 3) loans to € 114 million, partly reflecting a small number of larger releases in the Investment Bank.\nRussia exposure further reduced in the quarter\nDeutsche Bank further reduced its Russian credit exposures during the quarter:\nGross loan exposure was cut by 5% to € 1.3 billion, with de minimis onshore exposure and exposures to Russian subsidiaries of multi-national corporations largely guaranteed by parent companies;\nNet loan exposure decreased 21% to € 0.5 billion during the quarter, reflecting active exposure management and repayments;\nAdditional contingent risk was reduced by 35% to € 1.0 billion in the quarter. Undrawn commitments were reduced to € 0.8 billion and are largely mitigated by Export Credit Agency coverage and contractual drawdown protection. Guarantees were reduced by two thirds to € 0.2 billion, largely due to roll-offs.\nRuble cash balances with the Central Bank of Russia were € 0.9 billion at the end of the quarter, predominantly reflecting deposits from existing clients. All major derivative exposures have been unwound and market risk exposure to Russia remains low. The bank has implemented the sanctions policies adopted by Western governments and continues to take care of local employees and to invest in the management of technology, cyber and other risks. The local balance sheet of Deutsche Bank Moscow was unchanged at € 1.5 billion and the local capital position of € 0.2 billion was fully FX hedged.\nSupport for Ukraine\nDeutsche Bank remains operational in Ukraine and has taken action to support its local employees and their families. The bank and its employees have offered support for Ukraine through initiatives which include:\nA donation of € 1 million by the bank, supplemented by donations of more than € 500,000 from employees, to support relief efforts by the Red Cross, the International Medical Corps and other aid organisations working on the ground in Ukraine and neighbouring countries;\nSupporting Wellcome, a German charity helping Ukrainian mothers and their children fleeing to Germany, through the bank’s payroll giving scheme;\nOffering free current accounts with simplified opening procedures agreed with the Federal Government for Ukrainian refugees arriving in Germany, and reimbursing transaction fees on money transfers to Ukraine;\nProviding technology expertise in partnership with JobAidUkraine to roll out a free website helping Ukrainian refugees to find job opportunities.\nCapital and liquidity in line with goals\nThe Common Equity Tier 1 (CET1) capital ratio was 12.8% at quarter end, down from 13.2% at the end of the previous quarter. Around half of this decline was driven by ECB mandated model adjustments. The decline further reflected business-related growth in risk weighted assets and the negative impact on ratings and higher prudent valuation adjustments resulting from the war in Ukraine. Strong organic capital generation through net income was largely offset by share repurchases, deductions for common share dividends, future Additional Tier 1 (AT1) coupon payments and equity compensation.\nBy the end of the first quarter, Deutsche Bank had completed around 50% of its € 300 million share repurchase for termination, announced on January 26 as part of the bank’s aim to distribute approximately € 700 million of capital to shareholders during 2022. This repurchase programme was completed in April.\nThe Leverage ratio was 4.6% in the first quarter, down from 4.9% at the end of the previous quarter. This development primarily reflected a € 1.75 billion reduction in AT1 capital resulting from the bank’s decision during the quarter to redeem AT1 notes issued in 2014, and growth in leverage exposure of 2% arising from loan growth and other business activity in the Core Bank.\nLiquidity reserves were € 246 billion at the end of the first quarter, versus € 241 billion at the end of the previous quarter, including High Quality Liquid Assets of € 214 billion. The Liquidity Coverage Ratio was 135%, above the regulatory requirement of 100% and a surplus of € 55 billion. The Net Stable Funding Ratio was 121%, above the bank’s target range of 115-120%, with a surplus of € 106 billion above required levels.\n¹For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ on pp 17-25 of the first quarter 2022 Financial Data Supplement and “Non-GAAP financial measures” on pp. 46-54 of the first quarter 2022 Earnings Report, respectively.\n²Cumulative ESG volumes include sustainable financing (flow) and investments (stock) in the Corporate Bank, Investment Bank and Private Bank from January 1, 2020 to date, as set forth in Deutsche Bank’s Sustainability Deep Dive of May 20, 2021. Products in scope include capital market issuance (bookrunner share only), sustainable financing and period-end assets under management. Cumulative volumes and targets do not include ESG assets under management within DWS, which are reported separately by DWS.\nRead the\nPDF\nfull media release in the downloadable PDF.\nAnalyst call\nAn analyst call to discuss first-quarter 2022 financial results will take place at 13:00 CEST today. An Earnings Report, Financial Data Supplement (FDS), presentation and audio webcast for the analyst conference call are available at: www.db.com/quarterly-results\nA fixed income investor call will take place on April 29, 2022, at 15:00 CEST. This conference call will be transmitted via internet: www.db.com/quarterly-results",
    "number_of_ratings": 6,
    "rating": 1.7,
    "likes": 23
}