{
    "url": "https://www.db.com/news/detail/20220422-gubataan-nurturing-environmental-champions-in-the-philippines?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 22, 2022",
    "tags": [
        "Asia-Pacific",
        "Corporate Citizenship"
    ],
    "title": "Gubataan: nurturing environmental champions in the Philippines",
    "body": "Deutsche Bank is partnering with Ashoka to run a series of environmental change-making camps for young people from marginalised communities in the Philippines.\nThrough the programme, called ‘Gubataan: A Youth Forest’, young people will spend 30-45 days immersed in nature camps learning about the natural environment, the importance of sustainable practices, and how to be a force for good for the planet. By igniting an interest in the natural world, the programme aims to empower participants through education, boosting their confidence in their capabilities and the impact they can have in the world as agents of change.\nParticipants will learn practical skills to take back to their communities, such as how to grow their own ‘food gardens’, leadership and problem-solving skills, and the benefits of good nutrition. They also have the chance to meet young people facing the same challenges, connect with Ashoka fellows on potential innovation apprenticeships, and become Forest Guides themselves at future camps.\nParticipants benefit from the mentorship of Gubataan facilitators, at least five of whom are Deutsche Bank employees.\nDeutsche Bank will sponsor three Youth Forest camps over the next two years, impacting up to 120 young people from disadvantaged backgrounds.\n“This programme is powerful because it not only educates young people on the potential of our planet, it also teaches them about their own potential and what they are capable of. We are proud to work with our long-standing partner Ashoka on such an inspiring and innovative initiative,” said Annie Yeo, Head of CSR for Asia Pacific.\nIn 2020, Deutsche Bank partnered with the Bayan-Anihan project of NGO Gawad Kalinga to help farming families across four villages and farming communities supported by Gawad Kalinga in the Philippines, create a sustainable farming income amid the devastating effects of the pandemic on the agricultural sector. Read more here.",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 17
}