{
    "url": "https://www.db.com/news/detail/20220411-deutsche-bank-invests-in-skyhive?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 11, 2022",
    "tags": [
        "Digitalisation"
    ],
    "title": "Deutsche Bank invests in SkyHive",
    "body": "The bank’s Corporate Venture Capital (CVC) group has invested in SkyHive, a cloud-based workforce management and reskilling software provider. The start-up’s labour analysis platform helps enterprises to better understand their workforce, skillsets, and talent needs for employee upskilling.\n“Using data intelligently and with purpose will take human capital management to the next level”, said Michael Ilgner, Deutsch Bank’s Global Head of Human Resources and Real Estate. “SkyHive is addressing a key talent shortage issue observed across all industries and particularly prevalent in financial services. Its value proposition of providing employers with a better understanding of the skills of their workforce and in the market paves the way for improved resource management, workforce upskilling, and employee retention.”\nSkyHive's platform uses technologies such as Natural Language Processing (NLP) to automate processing of resumes, patent applications, articles, and journals to obtain a granular breakdown of skillsets. Data collected is then processed by Machine Learning services to understand the workforce of an enterprise client and compare against the emerging labour economy to identify talent gaps and areas for upskilling.\nGil Perez, Chief Innovation Officer at Deutsche Bank and Head of Deutsche Bank Corporate Venture Capital, said: “We are delighted to invest, partner and collaborate with SkyHive. Deutsche Bank’s digital transformation has accelerated the pace and scale we need to upskill our workforce, attract, and recruit the best talent in the market. Our ability to effectively and continually invest in our current and future employees is an integral part of our digital transformation.”\nSkyHive is the latest addition to the bank’s CVC portfolio, following the recent investment into Taina and SeaLights. The CVC programme is a core element of the bank’s innovation agenda. The CVC team focuses on investing in selected fintech and start-up technology solutions that will enable Deutsche Bank to either improve the client experience, create innovative banking and financial services, or increase productivity by helping the bank to digitalise more of its front-to-back processes.\nFurther information about the CVC programme can be found here.",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 6
}