{
    "url": "https://www.db.com/news/detail/20220405-deutsche-bank-trades-highest-volumes-on-indonesia-s-first-interbank-fx-engine?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 5, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank trades highest volumes on Indonesia’s first interbank FX engine",
    "body": "Deutsche Bank today announced it was the first foreign bank to have won in the Most Volume Traded category, at the inaugural Refinitiv FX Awards in Indonesia. The award recognises Deutsche Bank for its leading role in Refinitiv Matching, which is Indonesia’s first interbank electronic marketplace for Rupiah trading.\nThe Refinitiv FX Awards is held regionally across Thailand, Vietnam and now Indonesia, Southeast Asia’s largest economy. It aims to promote transparency and liquidity in foreign exchange markets in these fast-growing economies.\nAs part of the selection process, Refinitiv analysed FX trading activity contributions in Matching, its global electronic trading platform launched in Indonesia in 2021. Matching offers traders a single source of access to multiple FX trading venues.\nDeutsche Bank Head of FIC Trading, Indonesia, Francis Soetopo, said, “Refinitiv has an unparalleled FX solution that offers deep price discovery, concentrated liquidity and efficient execution for traders. This award reflects the market-making expertise of our Indonesian platform across asset classes, from fixed income to currencies.”\n“Indonesia remains one of the key destinations for emerging market investors and we look forward to continuing our partnership with Refinitiv to meet emerging client and market demand,” he added.\nDeutsche Bank was additionally recognised as a leading provider of APAC FX trading services at the annual Asiamoney FX Survey (2021), which is widely considered a benchmark league table for the FX market. It was also named FinanceAsia’s Best International Investment Bank in Indonesia in 2021. The bank was one of the first foreign banks in Indonesia to transact Domestic Non-Deliverable Forwards, an important FX hedging tool for corporates and investors.\nRefinitiv is a subsidiary of London Stock Exchange Group (LSEG), one of the world’s largest providers of financial markets data and infrastructure.\n\nFor further information please contact:\nDeutsche Bank AG Media Relations\nDerrick Tee\nPhone: +65 8788 5403\nEmail: derrick.tee@db.com ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 3
}