{
    "url": "https://www.db.com/news/detail/20220404-statement-to-media-by-christian-sewing-as-president-of-the-association-of-german-banks?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 4, 2022",
    "tags": [
        "Company"
    ],
    "title": "Statement to media by Christian Sewing as President of the Association of German Banks",
    "body": "Good morning ladies and gentlemen,\nI too would like to welcome you to our media briefing today.\nWhen we take your questions at this time of year, it is usually on topics like fiscal policy or banking regulation. But times are not normal. Russia’s military aggression against Ukraine was and still is a shock for Europe. It has deprived us of the illusion that such aggression can no longer be possible in today's Europe – and that economic interdependence and political dialogue are too intense for a large nation to completely abandon the existing world order.\nWe stand united with the people of Ukraine who are suffering from violence and destruction. Their morale, courage and will to defend is remarkable, they are fighting for a free Europe. Our thanks also go out these days to all those who are helping the millions of refugees and by doing so are helping to alleviate a little of the human suffering that this war is causing. We would also like to thank all our employees who have been donating or lending a hand directly.\nEconomic impact of the war: Russia and banks \nThe economic consequences of the war are, of course, also the dominant theme when the bodies of our association meet here in Berlin today. We have said from the outset that we fully support the Western sanctions against Russia. Implementing them consistently is a top priority for banks in Germany. This is a complex task in view of the comprehensive, multinational measures.\nBut for us there is no doubt: such a brutal war, which violates international law, must not remain without consequences. The sanctions are therefore justified in their unprecedented severity, and it is encouraging how quickly and united Europe and its transatlantic allies have acted here. The Russian economy’s downward spiral of historic proportions is proof that the sanctions are having an impact.\nIt is, at this point, completely unclear what economic relations between Russia and Europe will look like in the future. A reversion to the status quo ante is barely conceivable. Many European and US banks have already announced their intention to withdraw from the Russian market. And unless the Kremlin radically changes its policy, this trend is certain to continue, in the financial sector as well as in other industries.\nLet me also be clear in this context: the immediate economic risks of this situation are manageable for German banks, as they are for the European financial system as a whole. It was the right decision for German banks to start significantly scaling back their business in Russia as early as after 2014. As a result, exposure today is generally very limited.\nAt the same time, the European banking sector as a whole is very resilient, and capital buffers are now higher than ever. This is also important because the economic consequences of the war and sanctions can affect European countries in different ways, and our banks in Europe are part of a particularly strong network.  \nEconomic impact: business cycle \nThe stability of the banking sector is also significant because the economy was already struggling beforehand. We have multiple risks to manage: the Covid pandemic is not over yet. Disrupted supply chains and raw material shortages have led to production losses worldwide and thrown sand in the gears of global trade relations. And even before the outbreak of the war, inflation had reached heights not seen since the beginning of monetary union. Added to this now are the war-related price effects on the commodity and food markets– and we cannot yet estimate the extent of this.\nBut it is already clear that the economy will suffer considerably. The chief economists of the private banks have halved their forecast compared with their estimates from before the war. The German economy is now only expected to grow by around two percent this year. A return to pre-pandemic levels will therefore be delayed further – both in Germany and in Europe.\nEven this forecast is subject to reservations, as there are considerable risks that have not yet been factored into the calculation. First and foremost, these include energy prices: they are a burden for many companies and consumers. Even though the German government has now introduced relief measures, further price rises or acute bottlenecks could significantly slow down the economy.\nGlobal supply and trade chains will also once again be put to the test. And not just because of the war; the new lockdown measures in China could lead to renewed production stoppages and supply bottlenecks. For the global economy, this would be a further major damper.\nThe situation would be even worse if imports or supplies of Russian oil and natural gas were to be halted. A significant recession in Germany would then be virtually unavoidable. The question of government aid measures for companies and industries would then become even more pressing.  \nEconomic effects: inflation \nThese less than encouraging prospects are accompanied by further increases in inflation rates in the euro zone. At over seven percent, they are likely to reach levels in this half-year that were beyond our imagination only a short time ago. In the event of an energy embargo, even higher rates would be likely.\nAnd with each passing month, there is a growing risk that this level will become entrenched, that there will be second and third-round effects, and that inflation expectations will rise.\nLet me be clear: permanently high inflation rates are toxic for the stability of our economy. And not just because high rates of inflation unsettle businesses and consumers alike. It's also because the policy of cheap money has been accompanied by harmful redistributive effects for years. I already warned about this in 2019. Because the main beneficiaries are those who hold assets such as shares or real estate and have the necessary credit rating to take on debt. On the flip side, those who depend on state pensions and life insurance will lose out.\nNow, with consumer prices rising, there is the threat of much more serious social dislocation. With inflation rates as they are, almost a quarter of households with a net income of less than 2,500 euros can barely keep up with their regular expenses. This was a finding in a recent survey initiated by Postbank, and it is alarming. I can therefore only warn against continuing with the policy of cheap money and exacerbating these redistribution effects with all their social implications.\nThis now presents central banks with a challenge the likes of which have not been seen for at least 30 years. They have to combat rising prices in a phase of economic uncertainty.\nIn the coming weeks and months, it will also be important for the European Central Bank to show that it has a firm grip on the reins and is prepared to take countermeasures. Despite all the uncertainties, there is much that speaks in favour of ending net bond purchases before the end of the year and sending out an initial signal on interest rates. By ending the negative interest rate policy, the ECB could limit a further rise in inflation expectations. It would send a clear signal to investors, labour unions and private households. A signal that is urgently needed.\nConsequences of the war for the EU\nThis war is a test for the European Union – economically as well as politically. So far, the EU has passed this test. The European states are pulling together impressively and taking a unified stance. They can give the European Union a real boost and strengthen its structure.\nWe should seize this momentum. Perhaps this is the moment to strengthen Europe significantly and permanently. If we once again recognise that we are stronger together, we can – as unreal as it sounds at the moment – perhaps even emerge stronger from this crisis.\nThe European Union derives much of its strength and economic clout from the size of its single market. If we strengthen this single market wherever possible, we will be making a significant contribution to a stronger Europe, both economically and politically.\nWe need this economically stronger Europe more urgently than ever. Because the need for investment is enormous, and it has become even greater following the Russian invasion of Ukraine. Climate protection, digitization, infrastructure, alliance and national defence – billions must be mobilised, month after month, for the major policy areas of the present and future.\nGovernment investment will be indispensable in order to be able to manage the transformation process of the coming years. However, public budgets are already under considerable strain from the Covid pandemic and are being further stretched by the consequences of the war and the sanctions. The state's financial resources are limited.  \nTherefore, private investment will naturally be very important\nParticularly in the case of climate protection, smart government subsidy policies can provide an important boost. Nevertheless, a large part of the expenditure for new technologies and production processes must and will be financed privately. It is therefore clear that we need a financing architecture that makes it possible to mobilise unprecedented amounts of private funding.\nThis financing architecture must be a European one. And a key component of this is a European capital markets union that efficiently harnesses the huge potential of private capital in Europe. In the light of the new challenges, this is needed now more than ever. There is no more cost-effective economic stimulus package than a banking and capital markets union for Europe. To date, a fragmented European capital market prevents us from fully exploiting our financing options. We can quickly remove this stumbling block.\nThe European financial architecture we need also includes a stable and profitable banking sector that can reliably finance companies. The regulation of the coming years must therefore also be measured by whether it reduces banks' lending options or whether, ideally, it expands their scope. Ever higher payments to the Single Resolution Fund are therefore out of step with the times.\nThe same applies to the countercyclical capital buffer, which was increased at the beginning of the year – at that time still with a view to an expected recovery of the economy, i.e. in an environment that has since changed radically. All of this restricts banks' scope for lending. And this at a time when banks are particularly in demand as financiers of investments – especially in view of the imperfect European capital market.\nWhen I took office last year, we focused on four economic policy issues for the Association of German Banks: competitive banks, strengthening capital market financing, our contribution to modernising the economy and more European integration.\nThese priorities have only become more pressing in recent weeks and months.\nWe banks can do a lot, as we proved during the Covid pandemic. And we want to continue to be part of the solution. But we can only fulfil this role in the long term if the framework for an efficient banking market is in place in a completed European banking union. This should be one of the guiding principles of European policy in the coming years.",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 0
}