{
    "url": "https://www.db.com/news/detail/20230531-deutsche-bank-publishes-details-of-its-sustainability-strategy-in-residential-real-estate?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "May 31, 2023",
    "tags": [
        "Europe",
        "Germany",
        "Strategy",
        "Sustainability"
    ],
    "title": "Deutsche Bank publishes details of its sustainability strategy in residential real estate",
    "body": "The financed emissions from Deutsche Bank’s European residential real estate loan portfolio were 3.9 million tonnes of CO2 equivalent per year (MtCO2e/y) in 2022, as disclosed today in Residential Real Estate – Leading to Net Zero, a white paper outlining the role of residential real estate in Deutsche Bank’s sustainability strategy.\nFinanced emissions: disclosures now cover 60% of Deutsche Bank’s loan book\nThe white paper provides first-time disclosure of financed emissions in the residential real estate sector in Deutsche Bank’s loan portfolio. As at year-end 2022, this portfolio stood at € 175 billion¹, or approximately 40% of the bank’s total loan book. The bank has now published financed emissions data for around 60% of its total loan book. This follows the disclosure, in 2022, of the financed emissions in its € 107 billion1 corporate loan portfolio of 30.5 MtCO2e/y.\nRenovation: the € 80 billion challenge facing residential real estate clients\nResidential Real Estate – Leading to Net Zero sets out the financial impact on homeowners of meeting future EU energy efficiency requirements for their residences. The cost to renovate an individual residence to the highest energy performance level (EPC Class A) can exceed € 100,000. To meet these requirements, the cost to Deutsche Bank’s residential real estate clients could reach around € 80 billion, at today’s prices. This is equivalent to nearly 50% of the bank’s existing real estate loan portfolio and makes clear the enormous investment requirements for German and European economies. Deutsche Bank’s analysis also shows that around two-thirds of the bank’s private clients have the financial resources to undertake energy-efficient home renovations, while the remainder will need additional financial assistance. This analysis reinforces Deutsche Bank’s conviction that the banking industry and national governments must work in partnership to support homeowners in financing the renovation of existing residences and reducing greenhouse gas emissions.\nThe white paper also sets out pathways to net zero emissions in residential real estate by 2050 under different scenarios, making clear the scale of the challenge for the wider economy.\nShoulder to shoulder with clients on the path to net zero: financing of € 12 billion by end-2023\nResidential Real Estate – Leading to Net Zero sets out Deutsche Bank’s sustainability strategy with private clients. The Private Bank’s target is for € 12 billion in new business volumes (gross volume, cumulative since January 1, 2020) by year-end 2023.\nDeutsche Bank aims both to support energy-efficient new-build home construction and help homeowners address the challenge of historically low energy efficiency standards in existing residences, and thereby meet the EU Parliament’s energy performance requirements. Financial support, both through tailored lending products and access to grants, incentives and subsidies, plays a vital role in this strategy.\nThis strategy leverages services already offered through Deutsche Bank’s German mortgage subsidiary, BHW. Deutsche Bank estimates a financing requirement for energy modernization in German residential real estate of around € 600 billion by 2045.\nPartnering with clients on the path to more sustainable residential real estate\nResidential real estate plays a key role in the economy’s transition to becoming climate neutral, given that buildings account for 40% of energy usage and 36% of carbon emissions across the EU².\nDeutsche Bank’s residential real estate strategy takes account of the complete building life cycle and includes the following objectives:\nTo provide private clients with a holistic offering of support, information and financing services for the construction and renovation of energy-efficient homes, to reduce operational (Scope 1 and 2) emissions\nTo partner with corporate clients on decarbonization pathways in ‘upstream’ industries, including power utilities and manufacturers of construction materials to the real estate sector, to reduce embodied (Scope 3) emissions\nTo engage with policymakers, banking sector peers, industry alliances and other public and private bodies to define sector-wide strategies and financial assistance mechanisms to accelerate the reduction in emissions from residential real estate\nTo contribute to the harmonization of methodologies, data quality and reporting standards in the sector-wide effort to manage and monitor the energy efficiency of residential real estate and compliance with EU legislative frameworks and the requirements of national governments\nNet zero pathways under different scenarios\nResidential Real Estate – Leading to Net Zero sets out Deutsche Bank’s methodological approaches to the International Energy Agency’s roadmap to net zero emissions by 2050. Deutsche Bank calculates net zero pathways for its European residential real estate portfolio under three different IEA scenarios: the Stated Policies scenario (STEPS), the Announced Policies scenario (APS), and the Net Zero Emissions by 2050 scenario (NZE), together with an outlook for Scope 3 emissions.\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nChristopher R. Springer\nPhone: +49 69 / 910 48935\nEmail: christopher-renz.springer@db.com \nStefanie Duennwald          \nPhone: 069 910 / 40839\nEmail: stefanie-a.duennwald@db.com \nInvestor Relations\n+49 800 910-8000 (Frankfurt)\ndb.ir@db.com \n\n\n¹ Total loans at amortized cost as at 31.12 2022\n² Source: Energy Performance of Buildings Directive 2010/31/EU",
    "number_of_ratings": 9,
    "rating": 5.0,
    "likes": 15
}