{
    "url": "https://www.db.com/news/detail/20230512-sylvia-beh-appointed-ceo-of-malaysia-trustee-business?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "May 12, 2023",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Sylvia Beh appointed CEO of Malaysia Trustee Business",
    "body": "Deutsche Bank has today announced that it has appointed Sylvia Beh as CEO of Deutsche Trustee Malaysia Berhad, which forms part of its Securities Services division.\nSylvia will lead the Malaysian fund services business that offers trustee and fund accounting services to unit trusts, wholesale funds and private retirement schemes for domestic and foreign clients. She will report to Richard Lim, Head of Securities Services Malaysia.\nSylvia has more than 20 years of experience in the fund management industry, having held roles in unit trust management for a trustee, financial institution and regulator. During her ten-year tenure at the Securities Commission Malaysia, she developed strong engagement across the fund management industry, collaborating with industry leaders and advocating for industry improvements.\n“Sylvia has a deep understanding of the fund management industry. Her in-depth knowledge and expertise positions her strongly to lead our business, which focuses on a range of asset managers, institutional investors, insurance and corporate clients in Malaysia,” said Richard Lim, Deutsche Bank’s Head of Securities Services in Malaysia.\nDeutsche Bank has had a presence in Malaysia for more than 55 years, with offices in Kuala Lumpur and Labuan. It offers corporate and commercial clients both corporate banking and investment banking solutions, which include global transaction banking and strategic advice relevant to financing, fixed income and currencies, as well as equity capital markets capabilities.\nDeutsche Bank Malaysia has been recognized by a range of industry awards, the most recent being The Asset’s Triple A Sustainable Investing Awards in 2022. The business received awards for Best Domestic Custodian (won for the fifth consecutive year), Best Fund Administrator for Retail Funds (also won for the fifth consecutive year) and Best Islamic Custodian (won for the sixth consecutive year).\nDeutsche Bank AG                                       \nMedia Relations                                           \nAmy Chang\nPhone: +852 2203 8434\nEmail: amy.chang@db.com             \n  Kate Fields\nPhone: +852 2203 5094\nEmail: kate.fields@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}