{
    "url": "https://www.db.com/news/detail/20191030-deutsche-bank-transformation-on-track?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 30, 2019",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank: transformation on track",
    "body": "Christian Sewing, Chief Executive Officer, said: “Despite having launched the most comprehensive restructuring of our bank in two decades, we delivered profits in our four core businesses during the quarter and grew loans and assets under management. Transformation is fully underway with tangible progress on costs and de-risking. A 13.4% CET1 ratio underlines our strength. I want to thank our employees for their strong performance and commitment during this period of change, and our clients for the strong vote of confidence in our new strategy.\"\nSignificant progress on transformation with regard to de-risking and costs\nAs a result of strategic adjustments and in line with expectations, Group reports a net loss of 832 million euros and pre-tax loss of 687 million euros\nThe Core Bank, which excludes the Capital Release Unit, made a pre-tax profit of 353 million euros after absorbing 315 million euros of specific revenue items¹, restructuring and severance and transformation-related charges²\nAll four core businesses profitable in the quarter\nCapital Release Unit pre-tax loss of 1.0 billion euros, driven by the exit of non-strategic business and transformation costs³\nCommon Equity Tier 1 ratio stable at 13.4%\nDe-risking in Capital Release Unit offsetting negative impact on earnings from transformation\nOn track to meet 2019 cost reduction targets after 7th consecutive quarter of year-on-year reduction in adjusted costs² ex. transformation charges and bank levies\nAdjusted costs down by 1.8 billion euros annualised since 1st quarter 2018\n Noninterest expenses of 5.8 billion euros\nCore Bank business growth in key areas demonstrating franchise stability\nLoan growth of 12 billion euros\nNet inflows of 5 billion euros\nAssets under management of 1.24 trillion euros, up 125 billion euros in 2019, across Asset Management and the Private Bank\nGained market share in core Debt Origination franchises; over 50 Equity Origination mandates completed, priced or won since July\nGroup headcount below 90,000 for first time since Postbank acquisition\nGroup result driven by execution of transformation strategy\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) has made significant progress with its restructuring in line with key targets which management announced in July. This included de-risking, cost reduction and growth in business volumes.\nAs a result of these restructuring efforts, Deutsche Bank reported a net loss of 832 million euros and a loss before tax of 687 million euros in the third quarter of 2019. Results in the quarter included valuation adjustments on deferred tax assets (DTA) of 380 million euros, in line with expectations, as part of strategy execution.\nSubstantial transformation-related costs have now been recognised. Of a total of 2.8 billion euros of DTA impact anticipated in 2019, as laid out in the strategy announcement on July 7, 2.4 billion euros has now been recognised. 537 million euros of transformation-related charges, predominantly impairments on software, are now absorbed out of a currently anticipated 2019 total of up to 1.0 billion euros. 234 million euros in restructuring and severance charges have also been recognised, out of the currently anticipated 2019 total of 700 million euros.\nThe Core Bank reported a pre-tax profit of 353 million euros, with all four core businesses profitable in the quarter. Core Bank results were negatively impacted by 315 million euros of specific and transformation-related items, comprising 81 million euros of specific revenue items, primarily Debt Valuation Adjustments, 98 million euros in transformation charges and 135 million euros of restructuring and severance. Without these impacts, pre-tax profit in the Core Bank would have been 668 million euros.\nThe Capital Release Unit reported a loss before tax of 1.0 billion euros in the quarter, partly reflecting costs and the non-recurrence of revenues associated with discontinued business activities and transformation charges.\nPercentage comparisons throughout this media release are calculated for the third quarter 2019 compared to the third quarter 2018 (year-on-year) unless otherwise specified.\nStrategy execution: significant progress\nDeutsche Bank made significant progress on key dimensions of its transformation strategy in the quarter. Of note:\nThe Capital Release Unit has made significant progress in reducing risk weighted assets and leverage exposure.\n— Risk weighted assets declined by 9 billion euros in the quarter and by 16 billion euros year-to-date to 56 billion euros, compared to a full year target of 52 billion euros.\n— Leverage exposure declined by 73 billion euros in the quarter and by 104 billion euros year-to-date to 177 billion euros, compared to a full year target of 119 billion euros.\nLeverage exposure at the end of the third quarter includes approximately 40 billion euros of leverage exposure relating to Prime Finance balances in scope of our BNP Paribas transaction agreement. Of these, approximately 50% are expected to be reduced on closing of this transaction before year-end, with the remainder expected to be transferred in future quarters. Our leverage exposure target assumes the closing of the agreement in the fourth quarter of 2019 and the transfer of the remaining leverage exposure over time.\nAdjusted costs excluding transformation charges declined by 4% to 5.2 billion euros, the seventh consecutive quarter of year-on-year reduction excluding bank levies. Adjusted costs were down in all categories except IT, in line with our strategic priority of investment in technology. Deutsche Bank reaffirms its full-year 2019 target for adjusted costs excluding transformation charges of 21.5 billion euros.\nWe continued to grow business volumes to support future revenue growth.\n— Loans in the Core Bank grew by 12 billion euros, or 6 billion euros on an FX-neutral basis, in the quarter to 423 billion euros. The growth was focused on selected, high quality segments in the Corporate Bank, Investment Bank and Private Bank.\n— Assets under management stood at 1.24 trillion euros across Asset Management and the Private Bank. Assets under management grew by 37 billion euros in the quarter including net inflows of 5 billion euros. In the first nine months of 2019, assets under management grew by 125 billion euros with cumulative net inflows of 23 billion euros.\nRevenues in core businesses resilient\nNet revenues were 5.3 billion euros in the quarter, down 15%. The most significant driver of this development was our strategic decision to exit Equities Sales & Trading.\nRevenues in the Core Bank were 5.5 billion euros, down 4%. Excluding specific items¹, revenues were 5.6 billion euros, down 3% against the background of significant restructuring, headwinds in the global economy, and further pressure on interest rates during the quarter. Revenues in more stable businesses - the Corporate Bank, Private Bank and Asset Management - were in aggregate marginally up. These businesses together accounted for 71% of Core Bank revenues.\n¹Specific revenue items, 3rd quarter 2019 and 3rd quarter 2018\nProgress on costs\nNoninterest expenses were 5.8 billion euros in the quarter, up 4%, and included 234 million euros of restructuring and severance and 186 million euros of transformation charges, which consisted primarily of software impairments.\nAdjusted costs (2) excluding transformation charges were 5.2 billion euros, down 4%. This decline was driven by lower compensation and benefits expenses reflecting the impact of workforce reductions and adjustments to employee benefits, and reductions in professional service fees. The year-on-year decline in other expenses was supported by recoveries and lower occupancy.\nIn the Core Bank, adjusted costs excluding transformation charges were 4.7 billion euros, down 2% versus the prior year quarter.\nIn the third quarter, following the implementation of our new corporate structure, we made changes to the way we allocate costs of internal services. These have no impact on Group financial performance, but do impact some of the current quarter business unit variances and performance. This impact is reflected in the results of the businesses.\n² Noninterest expenses, adjusted costs and adjusted costs ex-transformation charges, 3rd quarter 2019 and 3rd quarter 2018\n³ Transformation costs: costs, included in adjusted costs, that are directly related to Deutsche Bank’s transformation as a result of the new strategy announced on July 7, 2019. In the second and third quarters of 2019, such charges included the transformation-related impairment of software and accelerated depreciation of real estate assets, legal fees related to asset disposals as well as the quarterly amortisation on software related to the Equities Sales & Trading business.\nThe workforce declined to 89,958 on a full-time equivalent basis at the end of the quarter, down by approximately 4,750 since the prior year quarter and to below 90,000 for the first time since our acquisition of Postbank in 2010.\nCredit quality remains solid\nProvision for credit losses was 175 million euros in the quarter, up by 86 million euros. Provision for credit losses was impacted by a number of specific provisions, principally in the Corporate Bank, including a net positive effect of 104 million euros arising from changes in estimates of 167 million euros, stemming from model refinements and the annual recalibration of the forward looking information in our model, which more than offset a negative impact of 63 million euros from the quarterly update of macroeconomic variables. This effect positively impacted results in the core businesses.\nAt 15 basis points of loans year-to-date, provision levels remain low by historical standards, reflecting the aforementioned positive effects, strong underwriting standards and the low risk profile of our loan portfolio.\nCapital and balance sheet strength remain strong\nThe Common Equity Tier 1 ratio was 13.4% at the end of the quarter, stable versus the end of the second quarter. In line with strategy, the positive impact of de-risking efforts, including reductions in operational risk weighted assets, offset the negative impact on capital of the quarterly net loss driven by transformation.\nRisk weighted assets were 344 billion euros at the end of the quarter, a decline of 3 billion euros. Reductions in risk weighted assets in the Capital Release Unit of 9 billion euros were partly offset by business growth in the Core Bank.\nThe fully loaded Leverage Ratio was 3.9% at the end of the quarter, broadly stable compared to the previous quarter. On a phase-in basis, the Leverage Ratio was stable versus the previous quarter at 4.2%. Leverage exposure declined by 13 billion euros, or 39 billion euros on an exchange rate neutral basis, as the 73 billion euro reduction in the Capital Release Unit was partly offset by business growth in the Core Bank.\nLiquidity reserves remained robust at 243 billion euros at the end of the third quarter. The Liquidity Coverage Ratio at the end of the quarter was 139%, representing a 59 billion-euro excess above the required level of 100%.\nGroup results at a glance\nBusiness segment performance\nCorporate Bank\nThe Corporate Bank made good progress against its strategic objectives in the quarter with both volume growth and accelerated revenue growth.\nNet revenues were 1.3 billion euros, up 6%, principally driven by higher net interest income, with loans growing by 7%.\nAcross Global Transaction Banking, Cash Management revenues were slightly higher as a result of balance sheet management initiatives including adjustments in deposit pricing strategy, while revenue growth in Trade Finance reflected increased lending activity in our target areas of Germany and Asia. In Commercial Banking, solid revenues in Germany were driven in part by growth in lending volumes in selected areas of 4 billion euros.\nProvision for credit losses was 76 million euros, up year-on-year, impacted by a number of specific provisions, partly offset by the aforementioned positive effect.\nNoninterest expenses were up 13% to 989 million euros. Adjusted costs excluding transformation-related costs were 973 million euros, up 14%. The increase reflects higher spending on controls and technology, as well as the aforementioned changes to the allocation of costs of internal services.\nProfit before tax was 254 million euros in the quarter, down 27%, primarily driven by the aforementioned cost factors.\nCorporate Bank results at a glance\nInvestment Bank\nThe Investment Bank made progress against its objectives of stabilising revenues, reallocating resources and reducing costs in the quarter, despite launching a far-reaching restructuring.\nNet revenues were 1.6 billion euros, down 5% year-on-year. Excluding specific items¹, predominantly Debt Valuation Adjustments, revenues were 1.7 billion euros, a decline of 3%.\nOrigination & Advisory revenues grew 20% year-on-year, outperforming market fee pools which were flat according to Dealogic. Growth was driven by strength in Advisory and Debt Origination with market share gains in both High Yield and Leveraged Loans according to Dealogic.\nFixed Income & Currency (FIC) Sales & Trading revenues were 1.2 billion euros. Financing revenues grew, reflecting increased client activity and loan growth of 4 billion euros in the quarter and 12 billion euros year-on-year in focused segments across FIC. Foreign Exchange revenues declined slightly with corporate-related flows partly offsetting continued low levels of market volatility. Revenues in Rates and Emerging Markets Debt declined, reflecting our business restructuring and challenging market conditions including some risk management losses in the quarter.\nDeutsche Bank reaffirmed its commitment to robust, broad-based Core Rates and Emerging Markets Debt businesses. Management is encouraged by progress in restructuring efforts and restored momentum in the businesses so far.\nProvision for credit losses was 20 million euros in the quarter. This low level reflects the low risk nature of our portfolio and the aforementioned positive effect.\nNoninterest expenses rose slightly to 1.6 billion euros. Adjusted costs excluding transformation² related costs were 1.4 billion euros, down 3%, reflecting the run-rate impact of strategic initiatives and the aforementioned changes to the allocation of costs of internal services.\nProfit before tax was 64 million euros in the quarter, down 73% year-on-year.\nInvestment Bank results at a glance\n    Private Bank\nThe Private Bank made progress against its objectives with further cost synergies from the integration of our German units, volume growth across the businesses and an acceleration of revenue growth in Wealth Management.\nNet revenues were 2.1 billion euros, down 3%, or down 2% excluding specific items¹. Revenues declined by 5% in Private Bank Germany, driven partly by interest rate headwinds. This was partly offset by revenue growth in Private Bank International, up 5%, and Wealth Management, up 5% excluding specific items¹. The Private Bank continued to grow business volumes with loans up 4% and assets under management up 3% since the third quarter of 2018.\nProvision for credit losses was 54 million euros, down 18%, partly reflecting the aforementioned positive effect and the low risk nature of our portfolio.\nNoninterest expenses were 1.9 billion euros, down 1%. Adjusted costs excluding transformation charges were also 1.9 billion euros, down 1%, reflecting benefits from reorganisation measures mainly in Germany, partly offset by higher investments in Wealth Management and the aforementioned changes to the allocation of costs of internal services.\nThe Private Bank has delivered approximately 150 million euros of merger-related cost synergies in the first nine months of 2019 and the integration of our German operations remains well on track.\nProfit before tax was 92 million euros, down 22%.\nPrivate Bank results at a glance\nAsset Management\nDWS is on track to reach its targets for net inflows and cost/income ratio, driven in part by faster-than-planned delivery on cost savings targets. The business reported the third consecutive quarter of net inflows, mainly driven by target growth areas of Passive, Multi-Asset and Alternatives.\nNet revenues were 543 million euros, down 4%. If adjusted for the impact of lower interest rates on the fair value of guarantees in certain retirement products, revenues were essentially flat year-on-year despite industry-wide fee pressures.\nNoninterest expenses were 404 million euros, up 3%, affected by the non-recurrence of a litigation release in the prior year quarter. Adjusted costs excluding transformation2 charges were down 6% to 389 million euros, benefiting from cost savings initiatives most notably in professional service fees.\nProfit before tax was 105 million euros in the third quarter, down 27%, primarily reflecting the non-recurrence of the aforementioned litigation release in the prior year quarter.\nAssets under management grew by 33 billion euros to 754 billion euros during the quarter, the highest level since 2015, driven by net inflows of 6 billion euros, market performance and a favourable FX impact. After three consecutive quarters of net inflows, cumulative year-to-date net inflows reached 13 billion euros while assets under management were up by 89 billion euros year-to-date.\nAsset Management results at a glance\nCorporate & Other\nCorporate & Other reported a loss before tax of 161 million euros, compared to a loss before tax of 23 million euros in the third quarter of 2018. This development was largely driven by higher funding & liquidity charges which reflect certain funding costs held centrally as part of the implementation of our new funds transfer pricing framework, together with litigation expenses of 78 million euros in the quarter. Other contributing factors included higher shareholder expenses, driven by restructuring, and a lower positive contribution from valuation and timing differences.\nCorporate & Other results at a glance\n  Capital Release Unit\nThe Capital Release Unit, formed in July, made significant progress in its first quarter of operation, with material reductions in Equities Sales & Trading positions and operations, and reduction underway in Fixed Income and other assets.\nNet revenues were negative 223 million euros, principally reflecting 100 million euros of specific items which included Debt Valuation Adjustments and an update to a valuation methodology. Revenues were also negatively impacted by hedging costs and de-risking activity, including on portfolios now de-risked. Operating revenues net of liquidity and other funding costs were close to zero.\nNoninterest expenses were 790 million euros in the quarter, down 21% versus the second quarter of 2019, as lower transformation charges more than offset higher restructuring and severance charges and litigation charges. Adjusted costs excluding transformation charges decreased by 6% to 580 million euros, reflecting a 16% reduction in headcount and the implementation of further cost reduction measures.\nLoss before income taxes was 1.0 billion euros in the quarter, an increase of 35% versus the second quarter of 2019, primarily reflecting reduced operating revenues and specific revenue items.\nCapital Release Unit at a glance\nFor a discussion of Deutsche Bank’s nine-month financial performance, please refer to the Earnings Report www.db.com/quarterly-results\nAn analyst call to discuss third-quarter 2019 financial results will take place today, Wednesday, October 30, 2019, at 13.00 CET. This conference call will be broadcast via internet: www.db.com/quarterly-results\nA Fixed Income investor call will take place on Monday, November 4, 2019, at 16.00 CET. This conference call will be broadcast via internet: www.db.com/quarterly-results\nThe Earnings Report, the Financial Data Supplement (FDS), the presentation and the audio-webcast for the analyst conference call are available at: www.db.com/quarterly-results\nThe Deutsche Bank Pillar 3 Report Q3 2019 will be published on October 30, 2019, and will be available at:\nwww.db.com/regulatory-reporting\nThis document contains non-IFRS financial measures. For a reconciliation to directly comparable figures under IFRS, to the extent not provided herein, please refer to the Financial Data Supplement.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}