{
    "url": "https://www.db.com/news/detail/20191030-outstanding-yahoo-finance-recognises-stuart-lewis-and-jon-tilli-for-their-advocacy-for-lgbt-inclusion?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 30, 2019",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "OUTstanding: Yahoo Finance recognises Stuart Lewis and Jon Tilli for their advocacy for LGBT+ inclusion",
    "body": "The 2019 OUTstanding lists of Role Models, supported by Yahoo Finance, recognise executives around the world who, either as LGBT+ executives or Allies, have excelled in promoting LGBT+ inclusion in the workplace. All Role Models are nominated by peers and colleagues.\nStuart Lewis, Chief Risk Officer and Management Board Member, has been recognized as an OUTstanding LGBT+ Ally Executive. As Executive Sponsor of dbPride Stuart has supported efforts to establish a dbPride Allies programme in Brazil with dbPride now active in 12 countries; continued his sponsorship of the Born to Be Proud initiative in the UK with Diversity Role Models; opened dbPride events in the US, UK and Japan; continues to lead discussion on LGBT+ inclusion at Management Board level; and once again led DB’s marking of IDAHOTB in May, which included participation from thousands of staff globally.\nStuart also worked with other senior leaders to drive Deutsche Bank’s response to the oppressive laws passed by the Kingdom of Brunei targeting members of the LGBT+ community, removing the Dorchester Collection as a preferred supplier within days of the law’s announcement.\nExternally, Stuart sponsored Deutsche Bank’s founding of the Partnership for Global LGBTI Equality with six other multinationals and the World Economic Forum. This year, under Stuart’s Executive Sponsorship, Deutsche Bank participated in 12 Pride Parades globally. He also joined the first-ever dbPride Global Summit in New York in June and marched with nearly 1,000 DB staff and family at the World Pride parade becoming the first DB Management Board member to partake in a Pride parade.\nIn addition, Jon Tilli, who works in Global Credit Trading in New York and is chair of dbPride Americas, was named as an OUTstanding LGBT+ Future Leader in 2019. Jon has been the driving force behind Deutsche Bank’s participation in the Partnership for Global LGBTI Equality with the World Economic Forum. He has also hosted the WEF Young Global Leaders and Shapers World Pride Reception; led Deutsche Bank’s partnership with the Leslie-Lohman Museum and their participation in World Pride; and hosted a United Nations consultation, including representatives from dozens of LGBT+ NGOs in Berlin.\nJon also co-chairs the Open Finance forum in New York and organised Deutsche Bank’s first LGBT+-focused client event at Frieze New York.",
    "number_of_ratings": 3,
    "rating": 2.0,
    "likes": 1
}