{
    "url": "https://www.db.com/news/detail/20191024-whatever-it-takes-german-chief-economist-stefan-schneider-on-mario-draghi-s-legacy-at-the-european-central-bank?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 24, 2019",
    "tags": [
        "Company",
        "Research"
    ],
    "title": "\"Whatever it takes?\"",
    "body": "After eight years at the helm of the European Central Bank, Mario Draghi is leaving the European Central Bank (ECB). Stefan Schneider, Deutsche Bank’s German Chief Economist, went live on Bloomberg TV to discuss Draghi’s legacy and to assess what is at stake for the incoming president Christine Lagarde. Read extracts of his interview with Nejra Cehic on Bloomberg Daybreak: Europe.\nStefan, great to speak to you this morning. Has Mario Draghi’s tenure then been a success?\nStefan Schneider: “That depends very much on the counter-factual evidence. You would have to imagine what would have happened if he hadn’t done what he has done. For some, he is probably the rescuer of Europe, and the Euro was at the brink back in 2012, but then, if you look at the later stage of his tenure, you could argue that maybe he missed the timing to get out of this super-expansionary policy and, actually, was forced to even add to that. So that’s what critics will probably blame him for.”\nYes, and there is certainly a lot of talk about that super-expansionary policy hitting its limits. So when Christine Lagarde takes the helm, do you expect that to continue under her leadership?\n“Draghi has set the tone by the decisions last month at the council, basically saying that the path is now state-dependent and that it takes a sustained pick-up in inflation for the ECB to change its course. On the basis of the ECB’s own inflation forecasts, that’s not within the next 2-3 years. So, in this regard, Lagarde probably has to continue the course and, actually, we even assume that there will be most likely another 10 basis point cut in the deposit rate in the December meeting when Lagarde takes over.”\nMario Draghi ultimately is going to be remembered for his three words “whatever it takes”, Stefan, but one thing, as you were sort of hinting at, that he might be criticised for as well is the fact that the actual official mandate in terms of inflation hasn’t actually been reached, so do you think there will be a policy review under Christine Lagarde and, if so, what should be changed?\n“There will certainly be a policy review. The question is, how wide will it be? The ECB should consider having a kind of medium-term inflation target because what the tenure of Mr Draghi has basically shown, and what we have seen with a lot of other central banks around that world, is that currently we have some deflationary forces at play, demographics, globalisation and things like that, which cannot be overcome by monetary policy alone.\nMoreover, we even see that the fight of monetary policy to get inflation back to 2 per-cent is creating more and more negative side effects, property bubbles and things like that. So in this respect, the sole focus on consumer price inflation is probably too narrow and the central bank should think about a bigger inflation picture.”\nStefan, will Christine Lagarde be able to convince Germany to open the fiscal tabs?\n“I don’t see that. If you talk to German politicians, they are saying that the economy is slowing, but we are far from any kind of crisis and we have built-in fiscal stabilisers in our social system, which help to fundamentally cushion this downswing. So, as long as Germany isn’t facing a proper recession with GDP growth forecasts falling into negative territory for 2020, I don’t think that Germany is prepared to open the fiscal coffers beyond of what is already in place.\nSomething which is quite often overlooked is that the German fiscal stance has eased this year and continues to ease next year. The officials have pointed out frequently that anything beyond that is facing severe capacity constraints, for example in the construction sector, so the answer is: no, I don’t think that Lagarde will convince the German Finance Minister to open his purse.”\nThank you for joining us, Stefan Schneider, Chief German Economist at Deutsche Bank.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}