{
    "url": "https://www.db.com/news/detail/20191023-deutsche-bank-research-presents-the-house-view-shelter-from-the-storm?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 23, 2019",
    "tags": [
        "Research"
    ],
    "title": "Deutsche Bank Research presents The House View: \"Shelter from the storm\"",
    "body": "“The good news this month is that the biggest downside risks facing the global economy have moderated. Brexit talks have shifted in a productive way and both sides in the US-China trade war have shown a willingness to talk instead of escalating matters for now. Much remains unresolved on trade though and is likely to stay that way for some time.\nNevertheless these two developments are both positive catalysts but is it too late to change the negative global growth momentum? Uncertainty has already pushed global manufacturing into a steep contraction and slowed the growth of global trade.\nCracks are now beginning to show in the services sector as well. Services employment in Germany has slowed, and crucially surveys of non-manufacturing sentiment in the US have dropped. There are even signs that the slowdown is infecting the labour market, with private payrolls growth slipping to its slowest pace in almost a decade.\nThe only reason we don’t expect an outright recession is that policy responses are set to be swift and substantive. At the forefront of this we expect the Fed to cut rates three more times over the next few months. Even though the limits of monetary policy are being reached in many areas, the regions which still have space are deploying it.\nWe are cautious about the outlook for the economy and markets over the next few months. But into 2020, our economists expect growth to rebound. We prefer US equities to European equities for now, and like positioning for steeper curves. We believe the euro has bottomed out against the dollar and will appreciate moving forward.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}