{
    "url": "https://www.db.com/news/detail/20191017-the-art-of-reinvention-deutsche-bank-s-women-in-banking-and-finance-annual-forum?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 17, 2019",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "Deutsche Bank's Women in Banking and Finance annual forum",
    "body": "  In today’s business world, it could be said that if you’re not reinventing yourself, you’re standing still. This was the topic of the 11th Women in Banking and Finance Annual Forum in Sydney this week, which Deutsche Bank was once again proud to host. Leaders from diverse industries discussed ‘The Art of Reinvention’ and shared their perspectives on how to stay relevant in a constantly evolving environment.\nHere are four key takeaways from the blockbuster line-up of speakers:\n“Those who take their human skills to the next level will be powerfully differentiated in a dynamic and demanding new market”, said keynote: Andrea Clarke, Founder, CareerCEO and author of Future Fit: How to stay relevant and competitive in the future of work\n“There is now more of an ability to stand up and make a change than ever before”, said Raelene Castle, ONZM, Chief Executive Officer, Rugby Australia\n“Lifelong learning is the new norm – we need to put ourselves in a position where we have to learn something new”, said Adam Jacobs, Co-Founder, THE ICONIC; Co-Founder, Hatch\n“The world is changing, our customer is changing, the external environment is changing, so we too need to change and anticipate it before it happens”, said Maggie Zhou, Managing Director, Alibaba Group (Australia and New Zealand)\n  Closing the event, Alex Cartel, Head of Investment Banking Coverage for Australia, said: “We have now hosted this event for 11 years and it is an initiative that here at Deutsche Bank we are very proud of as it provides an opportunity to really inspire an audience”. He continued: “What we’ve heard during this discussion should leave us with no doubt that wherever you are in your career, there is always an opportunity to reinvent yourself”.\nAbout the event\nDeutsche Bank is proud to be a Diamond Member of Women in Banking and Finance.\nWomen in Banking and Finance is a not-for-profit organisation making a tangible impact in addressing gender diversity in our sector. Deutsche Bank has hosted the WiBF Annual Forum since its launch in 2009 as an important part of its global commitment to diversity and inclusion.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}