{
    "url": "https://www.db.com/news/detail/20191014-deutsche-bank-publishes-prior-periods-pro-forma-results-based-on-new-business-segmentation?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 14, 2019",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank publishes prior periods' pro-forma results based on new business segmentation",
    "body": "Deutsche Bank (XETRA: DBKGn.DE/ NYSE: DB) today published a Financial Data Supplement aligned to the business segmentation which was announced with the bank’s transformation strategy on 7 July 2019. The restated Financial Data Supplement is available on the bank’s website: www.db.com/quarterly-results\nThe Financial Data Supplement presents the bank’s results for the financial years 2017 and 2018 as well as the results on a quarterly basis from the first quarter of 2018 to the second quarter of 2019.\nTo further improve transparency and reflect progress towards the bank’s financial targets, the new Financial Data Supplement includes a number of additional disclosures on the Deutsche Bank’s financial position and performance.\nThe bank intends to report according to this structure in its interim financial statements for the third quarter of 2019, to be published on 30 October 2019, and for subsequent reporting periods.\nThe new segmental structure is as follows:\n— The Core Bank, which includes the Corporate Bank, Investment Bank, Private Bank, Asset Management business divisions together with Corporate & Other\n— The Capital Release Unit\nThe key changes compared to Deutsche Bank’s previously reported segmental information are outlined below.\nCorporate Bank\nThe Corporate Bank includes the Global Transaction Bank which was previously part of the former Corporate & Investment Bank as well as the German Commercial and Corporate Clients division, formerly part of the Private & Commercial Business (Germany).\nInvestment Bank\nThe Investment Bank, previously part of the former Corporate & Investment Bank, includes Deutsche Bank’s Origination & Advisory businesses. The Investment Bank also includes FIC Sales & Trading, which includes our Global Credit Trading, Foreign Exchange, Rates and Emerging Markets Debt businesses.\nPrivate Bank\nThe Private Bank comprises three business segments. The Private Bank Germany serves private customers and small business clients in Germany. The Private Bank International also serves private and small business clients, as well as commercial and corporate clients in Italy, Spain, Belgium and India. In addition, Private Bank covers Wealth Management clients globally. The businesses included in the Private Bank were previously disclosed as part of the Private & Commercial Bank division.\nAsset Management\nAsset Management operates under the DWS brand. Asset Management is unchanged from Deutsche Bank’s previous segmentation and provides investment solutions to individual investors and institutions with a diversified range of Active, Passive and Alternative Asset Management products and services.\nCorporate & Other\nCorporate & Other includes revenues, costs and resources held centrally that are not allocated to the individual business segments.\nCapital Release Unit\nThe Capital Release Unit was created to quickly and efficiently dispose of non-strategic or low-return assets which are no longer consistent with the Bank’s strategy to release capital, reduce leverage and related cost, thus creating a smaller, simpler and less market-sensitive balance sheet. The Capital Release Unit consists primarily of Equities Sales & Trading assets, legacy Fixed Income positions and the IT and operations functions associated with these assets and positions.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}