{
    "url": "https://www.db.com/news/detail/20191011-the-power-of-out?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 11, 2019",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "The Power of Out",
    "body": "October 11 marks “Coming Out Day”, when in 1987 half a million people marched in Washington for Lesbian and Gay Rights. Now in its 31st year, “Coming Out Day” matters because there is power in bravely being out and having a community of allies It can be easier to come out in the company of others.\nOn Coming Out Day, we honor our colleagues who are living openly as well as our colleagues, friends, and loved ones who are not yet ready or cannot be out.\nDeutsche Bank places great importance on inclusive workplaces, and has been visible and vocal on LGBTQI issues. On “Coming Out Day”, several out colleagues in Germany have been recognised and Deutsche Bank contributed to a pioneering report in the UK.\nIn Germany, Gernot Sendowski, Kurt Siering, Reinhard Thole and Matthias Weber were named on the list of \"Germany’s Top 100 Out Executives\", which recognises out LGBTQI leaders who are strong supporters of equality in the workplace. Deutsche Bank is also well represented on the first list of \"20 LGBTQI Future Leaders\", with Oliverio Walter-Gomez, Danny Kiefer and Joanna Labecka all recognised. “We are extremely proud of our colleagues, who have deservedly been recognised for being active role models in the workplace and positively contributing to an open-minded culture,” said Stuart Lewis, Chief Risk Officer and Management Board sponsor of dbPride.\nIn the UK, Deutsche Bank partnered with Clifford Chance, the University of York and National Student Pride to better understand LGBT+ identities and experiences in higher education and the workplace. The research, which is the largest of its kind and polled over 4,000 students, found there is a clear correlation between being open about one's sexuality and wellbeing in the workplace. Lewis said of the report: “While progress has been made, some of the findings are troubling; two in three LGBTQI students report experiencing discrimination, and rates of homelessness and poor mental wellbeing are high for young LGBTQI people.”\nIn Jacksonville, where 60 percent of homeless youth identify as LGBTQI, Deutsche Bank has partnered with JASMYN to help meet the immediate needs of homeless youth, while connecting them with stable housing and other resources. The bank is also sponsoring the forthcoming Coming Out Breakfast on October 16.\nTo better understand how you can be an ally, please take a few minutes to watch \"Nine Tips for LGBTQI-inclusive business practices\". It answers important questions including how to create inclusive workplaces, what the business case for inclusion is, and why word choice matters.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}