{
    "url": "https://www.db.com/news/detail/20191011-global-bank-consortium-creates-capital-markets-syndication-platform-directbooks?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 11, 2019",
    "tags": [
        "Investment Banking"
    ],
    "title": "Global Bank Consortium creates Capital Markets Syndication Platform, Directbooks™",
    "body": "A group of leading global financial institutions announced today the creation of DirectBooks™, a new technology platform designed to streamline connectivity within the primary market.\nThe financial institutions partnering to develop this new platform include Bank of America, Barclays, BNP Paribas, Citi, Deutsche Bank, Goldman Sachs, J.P. Morgan, Morgan Stanley, and Wells Fargo.\nAddressing inefficiencies in the marketplace across multiple communication channels, DirectBooks will simplify the primary issuance process through the use of structured data and streamlined communications. The new service will increase the efficiency and accuracy of deal workflow information among market participants by disseminating it through a robust communication platform that can be integrated into underwriter and investor systems to better connect underwriters and their clients. DirectBooks expects to scale globally for primary market offerings.\nRichard D. Kerschner has been named as the Chief Executive Officer of Primary Markets LLC, the holding company for DirectBooks. A former NYMEX, CLS and ICAP/NEX Group executive, Rich has over 25 years of strategic and operating experience across technology platforms and capital markets. Rich also has extensive experience as an active FinTech investor and board member. “I am thrilled to have joined DirectBooks at this important stage, and am eager to help drive its evolution for the benefit of the market,” said Rich.\nDirectBooks expects to cooperate with OMS providers and members of the buyside technology ecosystem to ensure optimal service for all market participants. BlackRock and the Aladdin platform have already engaged with the company in the development of an enhanced integrated issuance process to bring efficiencies and standardization for buyside participants.\n“As an industry-led platform, DirectBooks will offer a centralized hub for communication around primary market transactions and greatly improve the efficiency of the new issue process”, said Andrew Karp, Head of Global Investment Grade Capital Markets at Bank of America (BofA Securities).\n“DirectBooks will help drive increased collaboration on a global scale, and has the ability to deliver efficiencies and benefits to all participants in the primary issuance market. While DirectBooks will initially focus on Investment Grade transactions, its functionality should make it a platform of choice for other asset classes in the future,” said Anne Daley, Investment Grade Syndicate at Barclays.\n“This initiative represents an important step towards eliminating manual tasks, digitalizing interactions with investors and making the new issue process significantly more efficient,” said Fred Zorzi, Global Head of Primary Markets, BNP Paribas.\n“DirectBooks represents a collaborative, non-exclusive effort by the consortium to alleviate the pain points and inefficiencies in the primary market process felt by both underwriters and investors,” said Peter Aherne, Citi Head of North American Investment Grade Capital Markets, Syndicate, and Capital Strategy & Structuring.\n“The platform is a great opportunity to systematically and efficiently deliver our capabilities to our clients. We keep governance over the data being generated and the ability to share announcements becomes more transparent resulting in faster communications between market participants. Adding in digitized data makes this the best way to optimize the new issue business,” said Henrik Johnsson, Co-Head of Investment Bank EMEA at Deutsche Bank.\n“Communication protocols in the new issue process have remained largely untouched for decades across asset classes. DirectBooks has the capacity to profoundly alter the way in which underwriters and investing clients engage with one another – with substantial benefits on tap for all participants,” said Jonathan Fine, Head of Goldman Sachs’ Investment Grade Syndicate in the Americas.\n“We are focused on delivering an efficiency tool that not only offers clients a better execution model than we have today, but is centered on standardization, security, and data protection. We are excited to engage with the broader investor and dealer community on this platform,” said Bob LoBue, Global Head of Fixed Income Syndicate, J.P. Morgan.\n“DirectBooks is an example of the underwriter community’s commitment to providing our collective client base a responsive service,” said Paul Spivack, Morgan Stanley Global Head of Fixed Income Syndicate and Co-head of Fixed Income Capital Markets, Americas.\n“DirectBooks streamlines the new issuance process by bridging a communications gap between underwriters and investors, allowing for more transparency and improved deal execution,” said John Hines, Global Head of High Grade Debt Syndicate for Wells Fargo Corporate & Investment Banking.\n“The creation of DirectBooks is an opportunity to re-engineer the way primary markets function by leveraging technology to improve connectivity, efficiency and accuracy,” said Kamya Somasundaram, Head of Americas Credit Capital Markets at BlackRock. “We are lending our expertise as an investor in the primary market as well as a leading provider of order management systems, investment technology and risk analytics, via the Aladdin platform, to enhance the function of the markets for all investors.”\nWe look to forward to further communication with industry participants as DirectBooks prepares to launch its services.\nAbout DirectBooks LLC\nDirectBooks leverages its technology expertise and the market knowledge of its participants to streamline the primary issuance process. DirectBooks improves efficiency and accuracy for sell-side underwriters and allows the buy-side investor community to focus on the investment process.\nFor additional information on DirectBooks, please visit www.DirectBooks.com \nor contact MediaRelations@DirectBooks.com.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}