{
    "url": "https://www.db.com/news/detail/20191010-cloud-computing-the-most-important-technology-for-treasurers-survey-finds?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 10, 2019",
    "tags": [
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Cloud computing the most important technology for treasurers, survey finds",
    "body": "Almost half of respondents to the latest Economist Intelligence Unit (EIU) survey say that cloud computing will be the most important technology for treasurers over the next five years, followed by big data analytics and artificial intelligence.\n44% of respondents to the EIU survey indicate that cloud computing will be the most important technology for treasurers over the next five years, followed by big data analytics (42%) and artificial intelligence (37%). Interestingly, despite the attention it attracts robotic process automation (RPA) was cited by only 9% of respondents: treasurers say it facilitates automation more than data analysis.\nThe EIU’s report, “A Quantum Leap: Building a data-driven treasury”, supported by Deutsche Bank, is based on a survey of 300 senior corporate treasury executives from around the world, identifying what being a data-driven treasury means and key considerations when developing a data strategy.\nTreasury Management Systems deployed in the cloud offer a host of benefits, including a wider and more dynamic view of financial positions, automatic access to the latest analytical tools and an ability to more easily collaborate with stakeholders, reducing the need for data collection and input by treasury. It has taken some time for risk-averse treasurers to accept the security and robustness of cloud-based solutions, but we are now witnessing a change in mindset.\nOle Matthiessen, Global Head of Cash Management, Deutsche Bank\n“With cloud-based solutions, you are now spending less time trying to consolidate the data and more time analysing it and questioning the assumptions,” adds Takachida Kuhudzai, EMEA treasury manager, Kimberly Clarke, within the report.\nBig data analytics are highlighted as the second most important technology for treasurers. When applied to high volume transactions, such as payments data, these analytics can deliver insights not just for treasury but for other parts of the business too.\nFrom payments data, I am able to see locations that receive the most customers and the times at which they are buying in our stores. We can ensure we have the right salespeople in our stores at the right time.\nWolfgang Ratheiser, Vice President finance and treasury, Porsche\nTreasurers say the primary benefits to becoming more data-driven are higher operational efficiency (39%) and improved return on investments/assets (36%). Data intelligence can also help treasurers to navigate increasingly complex regulation, such as the International Financial Reporting Standards 9 and the General Data Protection Regulation (GDPR). However, four in 10 treasurers express significant concerns about the quality of data they are working with.\n“Simply ‘owning’ data is not enough; digital transformation is required in order to extract, aggregate, and analyse good quality data,” concludes Matthiessen. “The journey towards an efficient data-driven treasury takes time and our survey can help treasurers to identify how far along they are and what steps they need to take next.”\nTo receive a PDF copy of “A Quantum Leap: Building a data-driven treasury”, or to receive further information about Deutsche Bank’s work in this area, please contact:\nThomas Morris\nMoorgate-Finn Partners\n+ 44(0)2073774998\nthomas.morris@finnpartners.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}