{
    "url": "https://www.db.com/news/detail/20170330-konzept-10-decaf-how-to-invest-in-a-post-carbon-world?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 30, 2017",
    "tags": [
        "Company",
        "Investment Banking"
    ],
    "title": "DeCAF: How to invest in a post-carbon world?",
    "body": "Welcome to the tenth issue of Konzept, Deutsche Bank’s flagship research magazine. We hope you have enjoyed (or even made money) reading Konzept over the past two years. Our first cover story was an upbeat piece on German asset prices (equities have soared 30 per cent since). Twelve months ago we argued that inflation was not dead (turned out it wasn’t). And hopefully some readers sold their prime London properties when Konzept warned them to back in October 2015 (best not to look).\nThis issue is packed with original investment ideas too, including summaries of three completely new research products launched since January. Our feature article by Martin Brough, Lucas Herrmann and Rineesh Bansal introduces the Deutsche Carbon Alignment Framework – a new approach to thinking about the transition to a low-carbon world. DeCAF is based on the fact that volume goals and value creation are not necessarily aligned. Understanding the relationship between them makes picking winners from decarbonisation much easier.\nAlso in this issue is an article about a revolutionary improvement to the consensus forecasts of economic data releases by adjusting for behavioural biases. According to Nicholas Weng, a trading strategy using his so-called Persona model would have returned 25 per cent over the past decade. Likewise we take some guesswork out of accounting. Luke Templeman’s article on changes to lease accounting – with serious implications for some sectors – is based on yet another new research product. Accounting Lifeguard aims to help investors navigate the murky waters of tax and accounting by explaining these important concepts using plain English.\nReturning to decarbonisation, a second feature goes into more detail about the volume assumptions behind our DeCAF methodology. Will gas replace coal or does the world jump straight to renewables? Are electric cars really the enemy of oil producers? Another article by Martin Brough asks specifically whether Germany is ready to deliver a second wave of its ambitious energy transformation, while a related piece by Eric Heymann looks at the effect energiewende has on capital spending.\nEver wanted to know where the cloud actually is? Or what is inside one? Karl Keirstead, Deutsche’s internet software and services analyst explains. There is even an article about the cross-currency swap and interest rate swap markets. John Tierney writes that readers need to know about these less-visible but essential markets because they will tell us whether Donald Trump’s mooted reforms of financial regulation are working or not.\nAs usual our resident spy has managed to sneak into an industry leading event – this time Deutsche Bank’s auto conference in Detroit, hosted by Rod Lache. And finally our book review is a must read for anyone involved in negotiating – which I guess means all of us.\nDavid Folkerts-Landau\nGroup Chief Economist and Global Head of Research\nTo send feedback you can write to the team at research.haus@db.com.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}