{
    "url": "https://www.db.com/news/detail/20170320-deutsche-bank-publishes-annual-report-2016?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 20, 2017",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank publishes Annual Report 2016",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) today published its 2016 Annual Report. This includes an overview of Deutsche Bank, the Management Report and the bank’s audited consolidated financial statements for the financial year 2016. In addition, the bank today published its 2016 Corporate Responsibility Report and Human Resources Report.\nIn his letter to shareholders, John Cryan, Chief Executive Officer, wrote: “2016 was a very challenging year for us at Deutsche Bank. It was also a year in which we demonstrated our resilience and changed much for the better, despite a tough environment. We focused our business and significantly strengthened our core capital ratio. We continued to make Deutsche Bank safer and simpler. We also made Deutsche Bank more digital and resolved major litigation matters.”\nCommenting on the bank’s recently-announced refinement of strategy and capital raising, he wrote: “Our goal is to strengthen our position as a leading European bank with global reach, supported by our strong position in our home market, Germany. A solid capital base is essential if we are to succeed in our future strategy and capture growth opportunities for Deutsche Bank. For that reason, the Management Board has decided on a capital raising from which we expect proceeds of around eight billion euros.”\nCryan concluded: “We are making progress toward our goal of building a better Deutsche Bank: a bank which enables growth in the economy, serves society and creates a positive impact for our clients, our people, the communities we serve and for our shareholders.”\nAnnual Report\nDeutsche Bank reported a net loss for 2016 of 1.4 billion euros, versus a net loss of 6.8 billion euros for 2015. Revenues were 30.0 billion euros, down 10 percent versus the prior year. Noninterest expenses were 29.4 billion euros, down 24 percent.\nThe adjusted cost base, which excludes costs for litigation, impairments of goodwill and intangibles, restructuring and severance and policyholder benefits and claims, was reduced by six percent to 24.7 billion euros.\nThe bank’s Common Equity Tier 1 capital ratio (fully-loaded) was 11.8 percent at year-end 2016 versus 11.1 percent at the end of 2015. Risk weighted assets were reduced by 10 percent to 358 billion euros, versus 397 billion euros at the end of 2015.\nCompensation\nThe Annual Report includes the bank’s Compensation Report. Total compensation awarded for 2016 decreased to 8.9 billion euros (2015: 10.5 billion euros). This was driven by a 77 percent reduction in variable compensation awarded in 2016, from 2.4 billion euros in 2015 to 0.5 billion euros in 2016, following the Management Board’s decision to substantially limit variable compensation for employees at senior levels. A portion of this variable compensation will be paid out in future years.\nFor the second consecutive year, no member of the Management Board received variable compensation for 2016. Annual total compensation excluding fringe benefits and pension service costs was 2.4 million euros each in base salary for ordinary Management Board members while John Cryan, Management Board Chairman and Group Chief Executive Officer, received a salary of 3.8 million euros. These amounts were unchanged versus 2015. Management Board members who joined or left the Management Board during the year received compensation calculated pro-rata on the proportion of the calendar year served.\nHuman Resources\nThe bank’s Human Resources Report, also published today, provides employee metrics and information on Deutsche Bank’s strategic Human Resources priorities and initiatives during 2016. The number of employees (full-time equivalent) decreased in 2016 by 1,360 or 1.3 percent to 99,744. Divestments, job reductions due to restructuring and other leavers more than offset headcount growth from strategic hires to strengthen the bank’s control functions including Compliance and Anti-Financial Crime, and from the internalisation of external employees, primarily in technology and digitization roles, during the year.\nThe bank remained committed to filling vacant positions with internal candidates whenever possible during 2016. In 2016, 39 percent of global open positions were filled by existing staff, up from 30 percent in 2015. In Germany, this proportion increased to 71 percent, versus 60 percent in 2015. Deutsche Bank also continued to invest in young talent during 2016. Globally, the bank hired 813 graduates, an increase of 6 percent over 2015. 39 percent of the graduate class are female, and 23 percent of all graduates hired joined the technology function, reflecting the bank’s strategic focus on digitization.\nThe bank also sustained its apprenticeship programme in Germany, hiring 741 new apprentices during 2016.\nThe bank underlined its commitment to gender equality during 2016. The percentage of women at Managing Director and Director level rose again, from 20.5 percent in 2015 to 21.3 percent. The number of women at these levels has grown by 16 percent since the bank’s 2011 voluntary commitment, alongside other DAX 30 companies, to increase the proportion of women in executive positions. Chief Operating Officer Kim Hammonds was appointed to the Management Board in August 2016.\nThis followed Chief Regulatory Officer Sylvie Matherat’s appointment in November 2015, and means that Deutsche Bank’s Management Board, for the first time in the bank’s history, now includes two female members. The proportion of women on the Supervisory Board remained at 35 percent. Deutsche Bank is one of only two German companies included in the global Bloomberg Financial Services Gender Equality Index. This recognises firms for their commitment to gender diversity.\nDeutsche Bank has employees from 150 different nationalities as at the end of 2016. The bank has also remained a strong supporter of inclusion for lesbian, gay, bisexual, transgender, trans- and intersexual (LGBTI) people. For the fourteenth consecutive year, Deutsche Bank was awarded the maximum score of 100 in the Human Rights Campaign’s annual Corporate Equality Index.\nCorporate Responsibility\nDeutsche Bank has been carbon neutral since 2012 and sustained its support for renewable energy projects during 2016. It arranged 3.9 billion euros in project financing for renewable energy projects expected to generate around 3,500 megawatts. It also strengthened its Environmental and Social Risk Policy Framework, which provides transparency and sets out guidelines on business in sectors that fall within the bank’s environmental and social risk policies.\nDuring 2016 Deutsche Bank announced that it will no longer grant new financing for new coal power plant construction and greenfield thermal coal mining, and will gradually reduce its existing exposure to the thermal coal mining sector.\nDeutsche Bank was the first commercial bank globally to be accredited as an implementing entity for the UN Green Climate Fund. In 2016 the Fund approved a 74.4 million euro investment in a Deutsche Asset Management fund supporting renewable energy access in Africa.\nDeutsche Bank’s corporate citizenship activities reached nearly five million people in 2016. Approximately 2.4 million people were given access to Deutsche Bank art and culture sponsorships and programmes, while the bank’s ‘Born To Be’ education programmes reached 1.35 million young people in 2016. Community development efforts supported some 900,000 disadvantaged people around the world, tackling issues ranging from homelessness to basic amenities such as food, water and shelter. The ‘Made For Good’ enterprise programme helped nearly 10,000 charities and social entrepreneurs provide support for nearly 150,000 beneficiaries.\nAround 17,000 Deutsche Bank employees donated nearly 188,000 hours of their time and expertise in a wide variety of volunteering activities during 2016.\nAll reports can be downloaded from: www.db.com/reports \nThe Annual Report on Form 20-F, which will be submitted to the U.S. Securities and Exchange Commission (SEC) over the course of today, will also be made available following submission (in English only) at SEC Filings for Financial Results \nAn updated 4Q2016 Financial Data Supplement is available at: www.db.com/ir/en/reports-and-events.htm\nPrinted copies of the complete Annual Report can be ordered free of charge from: www.db.com/order-service and will be dispatched starting mid-April 2017.\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations \nMichael Golden \nPhone: +44 20 754 56469\nE-mail: michael.golden@db.com \nChristian Streckert\nPhone: +49 69 910 38079\nE-mail: christian.streckert@db.com\nInvestor Relations \n+49 69 910 35395 (Frankfurt)\n+44 20 754 50279 (London)\n+1 212 250 1540 (New York)\ndb.ir@db.com\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 11 March 2016 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}