{
    "url": "https://www.db.com/news/detail/20170319-deutsche-bank-fixes-total-proceeds-from-capital-increase-at-eur-8-0-billion?language_id=1",
    "language": "EN",
    "article_type": "Ad-hoc Release",
    "publish_date": "March 19, 2017",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank fixes total proceeds from capital increase at EUR 8.0 billion",
    "body": "Frankfurt am Main, 19 March 2017 – 14:56 CET – Deutsche Bank AG (XETRA: DBKGn.DE / NYSE: DB) today fixed the total proceeds from its capital increase against cash contributions at EUR 8.0 billion and set the following key parameters:\n — Issue of 687.5 million new shares\n — Subscription ratio of 2 : 1\n — Subscription price of EUR 11.65 per share\nDeutsche Bank will issue a total of 687.5 million new registered no par value shares (common shares) in public offerings in Germany, the United Kingdom and in the United States, using authorized capital. The subscription price will be EUR 11.65 per new share issued, and the subscription ratio will be 2 : 1. This means that Deutsche Bank shareholders may acquire for the subscription rights attached to two existing shares one new share at the subscription price during the subscription period which is expected to run from 21 March through 6 April 2017.\nThe new shares will have the same dividend entitlement as the existing shares. The gross proceeds from the offering, which is fully underwritten, will amount to EUR 8.0 billion. The underwriting syndicate was increased from eight to 30 banks since the initial announcement on 5 March 2017.\nThe subscription rights are expected to be traded on the German stock exchanges from 21 March through 4 April 2017, and on the New York Stock Exchange from 21 through 31 March 2017. It is expected that the new shares will be delivered through Clearstream Banking AG on or about 7 April 2017 and through The Depository Trust Company on or about 11 April 2017, and will be included in the existing quotation of the Deutsche Bank shares on the German stock exchanges and on the New York Stock Exchange on or about 7 April 2017.\nContact:\nMichael Golden\nDeputy Head of Communications & CSR\nPhone: +44 207 5456469\ne-mail: michael.golden@db.com\nIMPORTANT NOTICE\nFor readers in the European Economic Area\nThis release does not constitute an offer to sell, or the solicitation of an offer to buy or subscribe for, any securities of Deutsche Bank AG. This document does not constitute a prospectus within the meaning of the EC Directive 2003/71/EC of the European Parliament and Council dated 4 November 2003, as amended (the “Prospectus Directive”).\nThe public offer in Germany and the United Kingdom will be made solely by means of, and on the basis of, a securities prospectus which is to be published following its approval by the German Federal Financial Supervisory Authority (BaFin). Any investment decision regarding any subscription rights or shares should only be made on the basis of the prospectus which will be published after its approval and will be available for download on the internet site of Deutsche Bank AG (www.db.com/ir).\nCopies of the prospectus will also be readily available upon request and free of charge at Deutsche Bank AG, Taunusanlage 12, 60325 Frankfurt am Main, Germany.\n\nIn any Member State of the European Economic Area that has implemented the Prospectus Directive (other than Germany or the United Kingdom) this communication is only addressed to, and directed at, qualified investors in that Member State within the meaning of the Prospectus Directive.\nStabilization\nIn connection with the offering of the New Shares, Credit Suisse Securities (Europe) Limited will be acting as the stabilization manager and it (or one of its affiliates) may take stabilization measures aimed at supporting the market price of the shares of Deutsche Bank AG in order to offset any existing selling pressure in such shares (stabilization measures). The stabilization manager has no obligation to undertake stabilization measures.\nAccordingly, it cannot be guaranteed that stabilization measures will be taken at all. If stabilization measures are taken, they may be discontinued at any time without prior announcement. Such stabilization measures may be taken on the Frankfurt Stock Exchange (Frankfurter Wertpapierbörse) or the New York Stock Exchange as from the date of the publication of the Subscription Offer and must cease at the latest on the 30th calendar day following expiration of the subscription period, expected to be May 6, 2017 (stabilization period).\nStabilization measures may result in a (quoted) market price of the shares of the Company that is higher than would be the case in the absence of such measures. Furthermore, the (quoted) market price may temporarily reach a level that is not sustainable.\nFor readers in the United Kingdom\nThis communication is only being distributed to, and is only directed at, (i) persons who are outside the United Kingdom or (ii) investment professionals falling within Article 19(5) of the Financial Services and Markets Act 2000 (Financial Promotion) Order 2005 (the “Order”) or (iii) high net worth companies falling within Article 49(2)(a) to (d) of the Order, or (iv) other persons to whom it may lawfully be communicated, (all such persons together being referred to as “relevant persons”).\nThe new shares are only available to, and any invitation, offer or agreement to subscribe for, purchase or otherwise acquire such new shares will be engaged in only with, relevant persons. Any person who is not a relevant person should not act or rely on this document or any of its contents.\nFor readers in the US\nDeutsche Bank has filed a registration statement (including a prospectus) with the U.S. Securities and Exchange Commission (the “SEC”) for the offering to which this communication relates. Before you invest, you should read the prospectus in that registration statement, the supplement to that prospectus Deutsche Bank expects to file with the SEC and other documents Deutsche Bank has filed and will file with the SEC for more complete information about Deutsche Bank and this offering.\nYou may get these documents, once filed, free of charge by visiting EDGAR on the SEC Web site at www.sec.gov. Alternatively, Deutsche Bank, any underwriter or any dealer participating in the offering will arrange to send you the prospectus after filing if you request it by calling Deutsche Bank at +49 69 910-35395.\nFor readers in Canada\nDeutsche Bank intends to make the offering to which this communication relates in Canada pursuant to a Canadian offering memorandum filed with the Canadian securities regulatory authorities under an exemption from the requirement to file a prospectus in Canada.\nBefore you invest, you should read the Canadian offering memorandum and other documents Deutsche Bank has filed and will file with the Canadian securities regulatory authorities for more complete information about Deutsche Bank and this offering.\nYou may get these documents, once filed, free of charge by visiting SEDAR at www.sedar.com. Alternatively, Deutsche Bank will arrange to send you the Canadian offering memorandum after filing if you request it by calling Deutsche Bank at +49 69 910-35395.\n\nDeutsche Bank AG\nTaunusanlage 12\n60325 Frankfurt am Main\nGermany\nISIN: DE0005140008\nWKN: 514000\n\nListed: Regulated market in Berlin-Bremen, Duesseldorf, Frankfurt (Prime Standard), Hamburg, Hanover, Munich und Stuttgart; EUREX; NYSE\nThe International Securities Identification Numbers (ISINs) of further financial instruments issued by Deutsche Bank AG, and admitted to trading on a domestic organized market or for which such admission has been applied for, are available on Deutsche Bank’s Investor Relations website under https://www.db.com/ir/.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}