{
    "url": "https://www.db.com/news/detail/20170316-john-cryan-we-have-to-find-a-new-role-for-ourselves-in-society?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 16, 2017",
    "tags": [
        "Corporate products"
    ],
    "title": "John Cryan: \"We have to find a new role for ourselves in society\"",
    "body": "Restoring public trust in the financial sector is a key priority for the industry, and it begins with explaining how banks serve the real economy. “We have to find a new role for ourselves in society,” Deutsche Bank’s Chief Executive Officer John Cryan said at the 2017 IIF G20 Conference in Frankfurt on Wednesday. “Explaining our purpose and role in society is important, and we are not doing a good job at the moment.”\nCryan was on a panel that assessed the current state of banking in Europe alongside other CEOs of European banks. Comparing the banking industries in Europe and in the US, he noted that the entire US industry is smaller than the 20 largest European banks by assets. Still, US banks generated 170 billion US dollars of net income in 2016, while net income of the 20 largest European banks decreased to 33 billion euros. One of the main reasons for the higher profitability in the US is pricing, said Cryan. \"Clients in the US are prepared to pay more for banking services than European clients,\" he explained.\nHe highlighted the importance of more developed capital markets in Europe and of increased harmonisation across the region to enable cross-border banking. “We are still far away from a real banking union,” Cryan said.\nAsked about the growing competition of Fintechs, Cryan said it is critical to “work with them, not against them”. Pointing to the bank’s Digital Factory, he noted that the cooperation can be very productive and that solutions offered by Fintechs make banking, including payment services, more user-friendly.\n  Taking stock of financial regulation\nEarlier in the day, Sylvie Matherat, Deutsche Bank’s Chief Regulatory Officer, spoke on a panel that took stock of financial regulation. “It is the right time for the public sector to assess the impact of regulation introduced since the financial crisis,” she said. Meanwhile for banks, “it is time to focus less on our balance sheet and more on our P&L.”\nMatherat stated her belief that measures introduced to deal with systemic risk posed by large banks considered “too big to fail” help make the financial industry more resilient. However, they also tie up capital and liquidity and thus limit the ability of banks to provide financing to the real economy. “It is very good [for banks] to be able to die, but before you should be able to live,” she said.\n  About the IIF G20 Conference\nThe ninth annual IIF G20 Conference, hosted by the Institute of International Finance, brought together more than 500 representatives from the private and public sector to facilitate dialogue on the key topics for the global economy. Deutsche Bank is a lead sponsor of the event.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}