{
    "url": "https://www.db.com/news/detail/20170316-deutsche-bank-s-supervisory-board-nominates-new-members?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 16, 2017",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Deutsche Bank's Supervisory Board nominates new members",
    "body": "The Supervisory Board of Deutsche Bank (XETRA: DBKGn.DE/NYSE: DB) will submit a proposal for the Annual General Meeting on 18 May 2017 for two new members to be elected to the Supervisory Board. Gerhard Eschelbeck is the Head of IT Security at the US technology group Google and is to succeed Peter Loescher, whose period of office will end as scheduled and who is not available for re-election.\nThe Supervisory Board has also nominated Alexander Schuetz for election. The founder and Chief Executive Officer of C-Quadrat, headquartered in Vienna, Austria, is to replace Klaus Ruediger Truetzschler who will also leave the committee as scheduled.\nC-Quadrat manages HNA Group’s stake in Deutsche Bank. Schuetz is to be elected at the Annual General Meeting 2017 for an initial period of one year so that in the coming year he can be nominated for a regular term of five years.\nThe Supervisory Board has also nominated its current chairman, Paul Achleitner, for a further term of five years. Should his nomination be approved at the Annual General Meeting, the intention is for Achleitner to be re-elected as chairman.\nAs previously announced, Stefan Simon will also stand for election at this year’s Annual General Meeting. He was appointed as a member of the Supervisory Board by court order in August 2016.\n“We are delighted that another anchor investor is demonstrating it is convinced of Deutsche Bank's long-term success,” said Supervisory Board Chairman Achleitner. “In Alexander Schuetz we have a capital markets expert with many years of experience in asset management joining the Supervisory Board. In Gerhard Eschelbeck we will also be gaining an expert in the critical topic of cyber security for the bank and the Supervisory Board.”\nAchleitner thanked the departing members: “During a turbulent period Peter Loescher and Klaus Ruediger Truetzschler made valuable contributions to the work of the Supervisory Board. On behalf of my colleagues on the Supervisory Board, I would like to thank them most sincerely for their commitment and their untiring dedication.”\nThere is also already a consensus in the Supervisory Board to nominate Norbert Winkeljohann for election at the Annual General Meeting 2018. He is Chairman of the Management Board of the advisory and accounting firm PricewaterhouseCoopers in Germany and is to replace Henning Kagermann, who has decided not to stand for re-election.\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Contact\nMichael Golden\nPhone: +49 69 910 24611\nE-mail: michael.golden@db.com\nChristian Streckert\nTel: +49 69 910 38079\nE-Mail: christian.streckert@db.com\n  About Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\n\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement. Such factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission. Such factors are described in detail in our SEC Form 20-F of 11 March 2016 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}