{
    "url": "https://www.db.com/news/detail/20170308-deutsche-bank-s-alternative-investment-survey-reveals-how-hedge-funds-can-stay-in-the-game-in-2017?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 8, 2017",
    "tags": [
        "Investment Banking",
        "Sustainability"
    ],
    "title": "Deutsche Bank's Alternative Investment Survey reveals how hedge funds can stay in the game in 2017",
    "body": "Deutsche Bank today released its 15th annual Alternative Investment Survey, one of the industry’s largest and longest standing hedge fund investor surveys. This year, 460 global hedge fund investors, representing almost 2 trillion US dollars in hedge fund assets, shared insights into their current sentiment and allocation plans for 2017.\n“Despite another challenging year for hedge funds in 2016, investors remain committed. We found that over three quarters of investors plan to grow or maintain their allocations to hedge funds in 2017,” said Anita Nemes, Global Head of Hedge Fund Capital Group at Deutsche Bank. “However, to become and remain part of an institutional hedge fund portfolio is ever more difficult. These investors not only demand better risk-adjusted returns but are increasingly calling for partnership, innovative and bespoke portfolio solutions and better aligned fee structures and terms.”\nMarlin Naidoo, Americas Head of Hedge Fund Capital Group said: “The rise of quant is accelerating with 79 percent of investors allocating to the space. The number of strategies available has been growing and now range from simple low fee alternative risk premia products to more complex high alpha products that have seen further enhancements due to the advances in areas such as machine learning, quantum computing and the cloud. This has contributed to the additional interest and demand.”\nHighlights of Deutsche Bank’s 15th annual Alternative Investment Survey:\nHedge funds expected to perform in 2017, driving industry growth\nClose to three quarters of investors expect their hedge fund portfolios to perform better in 2017 versus 2016. Performance-based gains are expected to drive industry assets to reach 3.14 trillion US dollars by year-end.\nManager selection more critical than ever\n2016 marked another year in which significant return dispersion shaped hedge fund performance. On average, investors’ top quartile funds returned +11.22 percent in 2016, while respondents’ bottom quartile managers were down -6.86 percent. Manager selection has become of crucial importance in the success of a hedge fund portfolio, and investors are increasingly diverting capital to a smaller number of consistent alpha generators.\nHedge fund fee discussions intensifying\nThe topic of fees has moved to the forefront of investors’ minds, and is playing a critical role in allocation decisions. The average management fee and performance fee that investors pay for their typical hedge fund investment is 1.59 percent and 17.69 percent, respectively. Three quarters of respondents negotiate fees with their managers, led by pension funds.\nInvestors are not only focused on securing lower fees, but also on creating fee structures that are better aligned with their portfolio needs. Hurdle rates, as well as management fees that scale down as assets grow, are highly sought after by investors.\nQuantitative strategies to play an even greater role in hedge fund portfolios\nThe number of investors investing in quantitative strategies continues to grow: 79 percent of all respondents allocate to systematic strategies, up from 70 percent last year. Furthermore, close to half of survey respondents plan to increase their allocation in 2017. Survey results also suggest that investors are embracing a wider variety of quantitative strategies. Five of the top ten most in-demand strategies are systematic, whereas there were only three in the top ten in last year’s survey.\nGlobal macro strategies most in-demand\nDiscretionary macro is the most sought after strategy by survey respondents this year. On a net basis, 27 percent of investors plan to increase their exposure to discretionary macro over the next twelve months. Furthermore, we found investor appetite for quant macro has also increased significantly year on year with this strategy moving up the ranks from 12th place last year to 3rd place this year.\nInvestor appetite for alternative beta / risk premia solutions to grow\nThe percentage of survey respondents who allocate to alternative beta / risk premia strategies has increased to 26 percent, up from 20 percent last year and 15 percent the year prior. Pension funds are driving this trend: almost half of all pension fund respondents are allocating to alternative beta / risk premia solutions today, nearly double the proportion observed in last year’s survey.\n  For further information please contact:\nDeutsche Bank AG\nPress & Media Relations\nEMEA\nCharlie Olivier\nPhone: +44(20)754-57866\nE-mail: charlie.olivier@db.com\nAmericas\nTroy Gravitt\nPhone: +1(212)250-4875\nE-mail: troy.gravitt@db.com\nAsia\nAmy Chang\nPhone: +852 2203 8434\nE-mail: amy.chang@db.com\n\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 20 March 2015 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}