{
    "url": "https://www.db.com/news/detail/20170305-a-message-from-john-cryan-on-capital-increase-and-strategy-of-deutsche-bank?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 5, 2017",
    "tags": [
        "Company",
        "Management & Leadership",
        "Strategy"
    ],
    "title": "A message from John Cryan on capital increase and strategy of Deutsche Bank",
    "body": "Dear Colleagues,\nIn the past few weeks and months, I’ve often been asked about the next phase of our strategy – by clients and investors, by analysts and journalists, and by you, our colleagues.\nIn order to answer these questions we needed to resolve some important legal matters, we needed more clarity about future regulation and, last but not least, we needed to examine carefully the different strategic options available to Deutsche Bank in a fast-changing environment.\nThis process is concluded now, and I am pleased to be able to tell you how we aim to grow and make Deutsche Bank sustainably successful.\nThe Management Board has decided on some fundamental revisions and decisive advances in the strategy we announced in the autumn of 2015. Today, these were approved by the Supervisory Board. There are three core elements:\n— Strengthening our position in our home market by combining Postbank with our Private & Commercial Clients business, thus creating the clear market leader in Germany;\n— Unleashing the growth potential of Deutsche Asset Management by floating a minority stake; and\n— Reinforcing our business with international corporations by creating a single, integrated corporate and investment bank. This business has been the hallmark of Deutsche Bank since we were founded.\nA strong capital base is essential if we’re to succeed in charting this strategy. For that reason, the Management Board has decided to issue up to 687.5 million new shares. We expect proceeds of around 8 billion euros from this. According to the future capital rules this would enable us to reach a core capital ratio of approximately 14 percent and remove a major source of uncertainty. That should make us significantly more attractive for our clients.\nFor it is our clients who are at the centre of this strategic refinement. To reach our goals, we are now placing Deutsche Bank on three strong pillars:\n— Together, Deutsche Bank and Postbank will be by far the largest Private & Commercial Bank in Germany, even though we will maintain separate brands. Our international Private and Commercial Clients business will be part of this division as will our global Wealth Management business, which we intend to grow further. Personally, I see this integration as highly promising: 20 million clients give us an important size advantage in a market that has seen increasing pressure to consolidate against a backdrop of low interest rates. Additionally, digitization remains a dominant theme, and both Deutsche Bank and Postbank have recently made strides in this area. Around ten million of our clients are already using our digital offering. We’re aware that some observers are currently sceptical about a combination of Postbank and Deutsche Bank – especially as it represents another change of course in our domestic private client business. However, market conditions and the regulatory environment are more favourable now. That makes retaining Postbank more attractive than might have been expected two years ago.\n— Deutsche Asset Management remains an integral part of our business, although a partial IPO gives it more operational independence. The success of many independent asset managers is testimony to that. With a clearer external profile for Deutsche Asset Management, we will be more attractive for additional top-quality talent in this business – which is essential for Deutsche Asset Management to grow more strongly again. Moreover, we are generating additional capital for the group and making the enormous value of Deutsche Asset Management more visible.\n— Our present Global Markets and Corporate & Investment Banking divisions (including Global Transaction Banking) will be merged into a single Corporate & Investment Bank. We are doing much more than just putting these businesses under one roof; we aim to synchronise these businesses more closely together. In future, our focus will be incrementally on corporate clients whom we aim to serve in key areas ranging from financing and payments to hedging and advisory. Many of these clients have so far worked with only one of our three existing businesses. We aim to change that, and this new structure gives us what we need to do so. At the same time, I would like to stress that we are proud of our capital market expertise and the strong business we have with many institutional clients. That expressly includes the US market and Asia-Pacific. These decisions put the new CIB in a good position to grow and are aimed at strengthening our profile as a leading European bank with global business reach.\nAt the same time, we need to control our costs even more tightly. Last year, we achieved a lot. However, in this tough environment, further reductions are unavoidable. We aim to reduce adjusted costs from 24.1 billion euros last year to around 21 billion euros by 2021. Given our recent successes, I am all the more confident that we will reach these goals.\nOur next step will be to integrate our infrastructure, where practicable and possible, more closely into these three business divisions. This helps us establish more direct responsibility and reduce costs. That said, central standards and controls must be maintained.\nSome of this may prompt you to wonder: isn’t this a step backwards? Didn’t we already have that?\nThe right answer is, as you’ll see on closer inspection, that we have not simply revived old concepts. Without placing any self-imposed limits on our thinking, we selected the right structure for us to react quickly and firmly to the needs of our clients, given a dynamic market environment and new regulatory requirements. We will draw on past experience to tackle the reorganisation which lies ahead. We need your experience. We’ll do it together and we’ll do it right.\nWe are firmly convinced that we are building a strong Deutsche Bank which can restore growth in all three business areas. That is the task of the new leadership team which the Supervisory Board confirmed today:\n— Our new Private & Commercial Bank will prospectively be led by Christian Sewing and Frank Strauss;\n— Deutsche Asset Management will continue to be led by Nicolas Moreau;\n— Marcus Schenck is planned to join Garth Ritchie in leading the new Corporate & Investment Bank in the course of the year.\nThe Supervisory Board will decide on his successor as CFO in due course.\nJeff Urwin will retire from the Management Board after a transition period. He will continue to support the bank, especially regarding regulatory topics in the US. The roles of my Management Board colleagues Kim Hammonds, Stuart Lewis, Sylvie Matherat, Karl von Rohr and Werner Steinmueller remain unchanged.\nGoing forward I will personally oversee the bank’s US business on the Management Board. Also for that reason I am pleased that the Supervisory Board has agreed to my request to appoint two Deputy CEOs. Together with Marcus Schenck and Christian Sewing, I will do everything to make sure that we fulfil Deutsche Bank’s prominent role in its home market even better and reach our ambitious goals faster.\nI am proud that together we have made progress since the autumn of 2015 and have put the worst crisis for decades behind us. With today’s decisions we are creating a Deutsche Bank which is stronger and which can look forward again and grow with confidence.\nLet us boldly seize the opportunities we have and, together, get back on the front foot.\nWith best wishes,\nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}