{
    "url": "https://www.db.com/news/detail/20240927-deutsche-bank-helps-china-s-ministry-of-finance-to-issue-2-billion-euro-sovereign-bonds?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 27, 2024",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank helps China’s Ministry of Finance to issue 2 billion Euro sovereign bonds",
    "body": "Deutsche Bank has once again helped China’s Ministry of Finance (MoF) to price a 2 billon euro International Sovereign Bond issuance, with a three and seven-year tranche. Deutsche Bank acted as Joint Lead Manager and Bookrunner on this transaction.\nThis issuance sees China’s return to the euro bond market, after its last issuance in 2021, this time setting a new pricing benchmark for Chinese corporate offshore bond issuances. This is also Deutsche Bank’s ninth consecutive international sovereign bond mandate from MoF since 2017.\nThe bond was 8.1 times oversubscribed, catching the attention of a diverse pool of global investors including central banks, sovereign wealth managers and multilateral institutions and development banks across developed and emerging markets, as well as European fund managers.\nRose Zhu, Deutsche Bank China Chief Country Officer commented: ”We are proud to facilitate MoF issuing its first benchmark-setting offshore sovereign in recent years and improve the Euro yield curve for the China sovereign. This is another testimony to the attractiveness of China’s assets to international investors and a demonstration of China’s economic resilience. Deutsche Bank will continue to play to our strength in cross-border debt financing to enhance the global connectivity of China’s fixed income market.”\nSamuel Fischer, Deutsche Bank's Head of China Onshore Debt Capital Markets said: “The bond was very well received by global investors, both sovereign and institutional fund managers, and came after a string of monetary policy easing and stimulus measures were announced earlier on Monday which lifted market sentiment and saw China stock benchmarks rally. This issuance will further enhance global appetite for China bonds and diversify offshore financial channels for Chinese issuers to extend their international investor outreach.”\nDeutsche Bank has been actively supporting the continuous opening-up of the capital markets in China. As a leading institution in China’s debt capital markets, Deutsche Bank is fully committed to contributing to RMB internationalisation through its active participation in both onshore and offshore markets.",
    "number_of_ratings": 7,
    "rating": 4.7,
    "likes": 8
}