{
    "url": "https://www.db.com/news/detail/20240925-deutsche-bank-strengthens-its-ocean-protection-policies-under-backblue-initiative?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "Frankfurt am Main, September 25, 2024",
    "tags": [
        "Company",
        "Sustainability"
    ],
    "title": "Deutsche Bank strengthens its ocean protection policies under #BackBlue initiative",
    "body": "Becoming effective in the course of Q4 2024, Deutsche Bank will enhance its due diligence requirements related to ocean protection. This update is a continuation of its commitment to the #BackBlue initiative. Deutsche Bank became in 2023 the first bank to join #BackBlue – a commitment led by Deutsche Bank’s partner Ocean Risk and Resilience Action Alliance (ORRAA) and backed by the United Nations. Under this initiative, Deutsche Bank aims at working on developing financial solutions supporting ocean protection. The bank also committed to reviewing its internal policies on ocean-related activities throughout 2024.\nThe development of the new ocean protection due diligence requirements has been guided by international frameworks such as the Sustainable Blue Economy Finance Principles hosted by the UNEP FI (United Nations Environment Programme Finance Initiative). The key changes under the ocean-related policy update are:\nA new guideline on maritime transport and infrastructure which includes provisions to monitor compliance with the environmental and social conventions of the United Nations and its specialised agencies International Maritime Organisation (IMO) and International Labour Organisation (ILO)\nExclusions and due diligence provisions to ensure stronger protection of sensitive marine areas and critical habitats\nExpansion of the already existing fisheries guideline to include new due diligence requirements for marine aquaculture\nConsidering current gaps in regulation and science-based understanding of the impact of deep-sea mining, direct finance of deep-sea mining projects has been prohibited for the time being.\n“A healthy global economy requires a healthy ocean. Our understanding of this connection has improved dramatically in recent years, and with it our sense of urgency about the need to conserve the marine environment,” said Markus Müller, Chief Investment Officer ESG & Global Head of Chief Investment Office, Deutsche Bank Private Bank and Co-Chair of the bank’s Nature Advisory Panel. “This step is just one of many that will be required to build a truly sustainable blue economy. We are committed to transformation and want to help our clients navigate the associated risks and opportunities.”\nMore details on the updated policies can be found in Deutsche Bank´s\nPDF\nEnvironmental and Social Policy Framework.",
    "number_of_ratings": 6,
    "rating": 5.0,
    "likes": 6
}