{
    "url": "https://www.db.com/news/detail/20240919-deutsche-bank-appoints-raffael-gasser-as-head-of-wealth-management-and-private-banking-in-germany?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, September 19, 2024",
    "tags": [
        "Germany",
        "Personnel announcements",
        "Wealth"
    ],
    "title": "Deutsche Bank appoints Raffael Gasser as Head of Wealth Management and Private Banking in Germany",
    "body": "Deutsche Bank has appointed Raffael Gasser as Head of Wealth Management & Private Banking in Germany. In this business area, the bank serves affluent and wealthy up to ultra-high-net-worth clients in its home market. Effective November 1, 2024, Gasser will assume the position and become a member of the Private Bank Executive Council. He will report to Claudio de Sanctis, the Deutsche Bank Management Board Member responsible for the Private Bank.\nClaudio de Sanctis said: “Throughout his career Raffael has combined business areas several times, has consistently aligned the offering to the needs of the clients and has thus enabled new business and growth. With his deep knowledge of the German market, he brings the best experience to lead our business in the home market into the next phase: As the clear market leader among affluent and wealthy clients in Germany, we now want to continue to grow through a closer integration of Private Banking and Wealth Management. I am looking forward to further driving our strategy together with Raffael.”\nGasser joins from UBS in Zurich, where he has led the Northern European business with wealthy clients. Prior to UBS, he spent 14 years at Credit Suisse in various senior positions in Wealth Management, most recently as a member of the Management Committee of Global Wealth Management and as Head of Private Banking International, the business unit for wealthy clients worldwide who were managed in Switzerland. Prior to this, he was among others as CEO of Credit Suisse in Luxembourg responsible for various European branches and before that for the German market. The Swiss national started his career in 2002 with Goldman Sachs, followed by a tenure at McKinsey & Company from 2003 to 2009 where he focused on corporate finance and banking.\nRaffael Gasser said: \"It is a unique mandate to lead Deutsche Bank's Private Banking and Wealth Management as market leader in its home market. I am convinced that we can further expand our leading position through outstanding personal advice in combination with digital channels and data analysis. In addition, there is great potential in the comprehensive offering of the Global Hausbank and in connecting the Private Bank, Corporate Bank and Investment Bank, which is of particular interest to family entrepreneurs. I am pleased to join my new colleagues and the bank's excellent advisors and to give our best for our clients every day.”\nGasser will relocate to Frankfurt with his family. He will work closely with Dominik Hennen, Head of Personal Banking, who oversees the broad retail business of Deutsche Bank and Postbank. As a member of the Private Bank Executive Council, Hennen also reports to Claudio de Sanctis. Until Gasser joins, Hennen will temporarily head private banking, while Stefanie Rühl-Hoffmann, Head of the team for ultra-high-net-worth-individuals (UHNWIs) has interim responsibility for Wealth Management in Germany. ",
    "number_of_ratings": 4,
    "rating": 4.8,
    "likes": 0
}