{
    "url": "https://www.db.com/news/detail/20240906-lars-stoy-to-leave-deutsche-bank?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, September 6, 2024",
    "tags": [
        "Personnel announcements"
    ],
    "title": "Lars Stoy to leave Deutsche Bank",
    "body": "Lars Stoy, Head of Private Bank Germany, has informed Deutsche Bank about his intention to leave the firm to take on a new challenge.\nHead of the Private Bank in Germany since May 2021 and a member of the Group Executive Committee, Stoy is currently responsible for both the broader retail business of Deutsche Bank and Postbank, as well as the business with wealthy and ultra-high-net-worth (UHNW) clients in Private Banking and Wealth Management.\nLars Stoy has been with Deutsche Bank Group for 16 years, time during which he has successfully developed the private client business, both strategically and culturally. He has been responsible for various business areas, including as a member of the Management Board of Deutsche Bank Privat- und Firmenkundenbank AG and as a member of the Management Board of Deutsche Postbank AG, where he was in charge of the retail banking business. He was also Chief Executive Officer (CEO) of Postbank Finanzberatung AG, the mobile sales unit of the organisation; CEO of BHW Bausparkasse AG, the Group’s building society arm; and he was Head of Investor Relations at the former Postbank Group.\nClaudio de Sanctis, Member of the Management Board of Deutsche Bank and Head of Private Bank, said: “Lars Stoy has significantly shaped the retail business of Deutsche Bank and Postbank in Germany over many years, initiating and implementing the kind of changes that will further strengthen the bank’s position as market leader in Germany. I am grateful for his great commitment to the bank, his outstanding work and the partnership we enjoyed. I wish him all the best for the future.”\nDominik Hennen, Head of Personal Banking and the retail business in Germany, so far reporting to Lars Stoy, will now report directly to Claudio de Sanctis in this role. The successor for the Private Banking & Wealth Management Germany area will be announced in due course. In the meantime, Dominik Hennen will take over Private Banking in Germany, while Stefanie Rühl-Hoffmann, who currently manages the UHNW team in Germany, will on an interim basis assume responsibility for Wealth Management Germany.",
    "number_of_ratings": 5,
    "rating": 5.0,
    "likes": 6
}