{
    "url": "https://www.db.com/news/detail/20181127-deutsche-bank-research-shares-insights-on-holiday-weekend-retail-sales?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 27, 2018",
    "tags": [
        "Company",
        "Sustainability"
    ],
    "title": "Deutsche Bank Research shares insights on holiday weekend retail sales",
    "body": "The research team led by US Retail Analyst Paul Trussell reported Monday on the trends and takeaways from Thanksgiving sales including Black Friday. Here are the key observations shared with clients:\nIndependent analysis collected in the New York City, NY, Philadelphia, PA, Wilmington, DE, Washington, DC, and Jacksonville, FL areas, showed somewhat slower traffic trends vs. last year with ShopperTrak, a leading provider of retail analytics, reporting a 1.7% decline in Black Friday traffic. Deutsche Bank thinks many opted to stay home with family and football, and instead purchased online.\nMobile sales surpassed 1 billion dollars for the first time. Adobe Analytics reported a 28% increase year-over-year to 3.7 billion with 54% of traffic from mobile devices vs. 46% last year.\nThe bank’s analysts believe the top sellers on Thanksgiving evening and Black Friday included electronics, small kitchen appliances, footwear, and soft home goods, i.e., bedding, linens. Electronics were a clear winner this Thanksgiving weekend, particularly TVs, wireless headphones, gaming bundles, and Apple products.\nAmazon called out both toys and fashion items regarding its Black Friday performance as \"in just the first nine hours of Black Friday, Amazon customers have ordered more than 1 million toys and more than 700,000 fashion items.\"\nBrands and retailers showing solid to over-performance through the holiday weekend were American Eagle Outfitters, Vans, Timberland and the Lbrands banner, which includes PINK, Victoria’s Secret and Bath & Body Works, among others. Walmart experienced heavy levels of traffic with televisions and toys – in some cases selling out of televisions. Macy’s saw large crowds on both Thanksgiving and Black Friday, with strong sales including small appliances and footwear. Nordstrom’s looked relatively solid with footwear being a standout.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}