{
    "url": "https://www.db.com/news/detail/20181108-deutsche-bank-signs-business-statement-supporting-transgender-equality?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 8, 2018",
    "tags": [
        "Awards",
        "Careers",
        "Company",
        "Diversity"
    ],
    "title": "Deutsche Bank Signs Business Statement Supporting Transgender Equality",
    "body": "Deutsche Bank joined a coalition of 56 major companies to issue a statement in support of transgender equality last week, reiterating the bank’s longstanding support of equal rights and campaigning for US federal government recognition for transgender people. The Business Statement for Transgender Equality calls for “respect and transparency in policy-making, and for equality under the law for transgender people,” in response to reported attempts to remove US federal protections against transgender discrimination.\nThe 56 signatory companies represent more than 2.4 trillion dollars in combined revenue and nearly 4.8 million employees around the globe in financial services, technology, consumer products and related industries.\n“We believe everyone, including our transgender colleagues, friends and family members are entitled to dignity, equality, and freedom from discrimination,” said Kathryn Burdett, Deutsche Bank Americas Head of Diversity & Inclusion. “Inclusion and diversity are central to our values. Different perspectives and identities lead to greater innovation and help us make better business decisions. By standing up for the rights of all people, including some of the most marginalized of our society, we make the case that discrimination is bad for business. We are proud to join some of the world’s leading companies who share our values.”\nDeutsche Bank has an extensive history of supporting and promoting an inclusive workplace and society. In 2017, Human Rights Campaign recognized Deutsche Bank as one of the world’s Best Places to Work for LGBTQ Equality for the 15th consecutive year. Last month, the Financial Times OUTstanding list of Role Models recognized three Deutsche Bank employees as exemplary promoters of LGBT+ inclusion in the workplace.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 83
}