{
    "url": "https://www.db.com/news/detail/20181108-best-private-bank-for-diversity-deutsche-bank-is-hands-down-winner-in-pwm-the-banker-awards?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "November 8, 2018",
    "tags": [
        "Awards",
        "Diversity"
    ],
    "title": "Best private bank for diversity: Deutsche Bank is \"hands down\" winner in PWM/The Banker awards",
    "body": "Deutsche Bank Wealth Management was the \"hands down\" winner of Professional Wealth Management (PWM) / The Banker magazine's award for \"Best private bank for diversity\", the Financial Times publications wrote in commending the bank for numerous initiatives to promote a diverse and inclusive work environment.\nThe 15 industry judges of the prestigious Global Private Banking Awards 2018, now in their 10th year, singled out the global rollout of a mentoring programme for women, following the success of a pilot scheme in London last year; an executive training programme for mid-level women employees in the UK, also due for further rollout; and the broader bank's sponsorship of events such as the Women 20 Summit in Berlin featuring Angela Merkel and Christine Lagarde.\n\"Diversity is another area through which private banks can hope to gain commercial advantage,\" wrote Yuri Bender, Editor-in-Chief of PWM. \"Deutsche Bank's wealth management division has won hands down in this category.\"\nHe added: \"Our judges report the importance of diversity and its influence on successful business models is almost totally ignored or underestimated by private banks, although most will be forced to 'follow suit' when a handful successfully tackle this key 'global issue'.\"\nFabrizio Campelli, Global Head of Deutsche Bank Wealth Management, highlighted milestones towards greater inclusion, including the fact that the division has 78 nationalities globally and that most of its top relationship managers are women. At Deutsche Bank, women represent 30 percent of the Supervisory Board.\n\"Diverse minds lead to better decisions,\" Campelli said in the writeup, published both in both PWM and The Banker.\n\"At the same time, though, what really makes a difference is making diversity an integral part of our management and decision-making process,\" Campelli added. \"Like the rest of the industry, we still have work to do, but we're making progress.\"\nThe award was presented on Wednesday at a ceremony in London.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}