{
    "url": "https://www.db.com/news/detail/20200218-deutsche-bank-invests-in-sri-lanka?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "February 18, 2020",
    "tags": [
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Deutsche Bank invests in Sri Lanka",
    "body": "Deutsche Bank today announced it is investing in Sri Lanka and launching a major push into the corporate client market, with the rollout of a new digitally-enhanced foreign exchange (FX) platform.\nThe rollout marks the bank’s first step in introducing a comprehensive suite of digital FX solutions for our corporate clients in Sri Lanka.\nDeutsche Bank Sri Lanka Chief Country Officer Vikas Arora said: “We are investing in our Corporate Bank business in Sri Lanka. As international supply chains gravitate toward settlements in local currency, we are pleased to cater to our clients’ requirements.”\nE-commerce customization is driving a change in payments currency, and increasingly international supply chains across Asia are demanding banks and payment service providers enable local currency payment.\n“Clients are challenging the historical trend of settling payments in USD between two Asian markets, as they become more aware of the layers and costs in their payment chain. As a result, clients are demanding cheaper and faster ways of delivery, which our digital FX platform Autobahn is enabling,” he said.\nBy mid-year Deutsche Bank Sri Lanka will be on par with other Deutsche Bank branches across Asia where clients can pay in local currency between two Asia markets, reducing the FX execution costs to a single conversion along with a faster delivery between the branch network.\nLast month the bank hosted clients at an outlook forum in Colombo where the new digital offering was launched.\n“The launch of the upgraded Autobahn FX in Sri Lanka is the foundation for expanding our digital payment, collection and hedging capabilities to better serve our clients’ local currency needs both onshore and overseas.\n“In addition to introducing the enhanced FX platform, we are also extending FX API technology to local clients. This means they can connect our platform into their own direct sales eCommerce infrastructure, while we support them in pre and post trade activities,” Arora added.\nGlobally Deutsche Bank most often sees API used by clients to expand their own B2B and B2C sales offering by introducing a wider range of currencies for online transactions. This gives end customers more choice around payment currency and often local currency is preferred, given USD currency movement can affect price point.\nMore upgrades are planned in the rest of the year to further enhance the foreign currency payment offering for both inbound and outbound payments in Sri Lanka Rupee (LKR).\nThe Sri Lanka branch rollout of the digital FX platform follows the launch of an online payments facility for customs and excise for importers toward the end of 2019.\nDeutsche Bank has operated in Sri Lanka since 1980, providing banking and financing solutions to multinationals, large local corporates and financial institutions, ranging from cash management, FX, custody and trade finance. This year Deutsche Bank is proud to celebrate its 40th anniversary in Sri Lanka.\nDeutsche Bank AG Colombo Branch is a licensed bank supervised by the Central Bank of Sri Lanka.\n  Disclaimer:\nThis press release has been approved and/or communicated by Deutsche Bank AG or by its subsidiaries and/or affiliates (“DB”).\nDeutsche Bank AG is authorized under German Banking Law (competent authority: BaFin - Federal Financial Supervisory Authority) and by the Prudential Regulation Authority and subject to limited regulation by the Financial Conduct Authority and Prudential Regulation Authority.\nDetails about the extent of our authorization and regulation by the Prudential Regulation Authority, and regulation by the Financial Conduct Authority are available from us on request. Securities and investment banking activities in the United States are performed by Deutsche Bank Securities Inc., member NYSE, NASD and SIPC, and its brokerdealer affiliates.\nLending and other commercial banking activities in the United States are performed by Deutsche Bank AG, and its banking affiliates.\nCopyright © Deutsche Bank Aktiengesellschaft (Incorporated in the Federal Republic of Germany & members’ liability is limited).",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}