{
    "url": "https://www.db.com/news/detail/20200214-deutsche-bank-champions-emerging-film-makers-at-frieze-los-angeles?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 14, 2020",
    "tags": [
        "Art",
        "Company",
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank champions emerging film makers at Frieze Los Angeles",
    "body": "Deutsche Bank championed emerging film makers this week with the launch of the Deutsche Bank Frieze Los Angeles Film Award, working with the non-profit film academy Ghetto Film School to fund short films by a diverse group of budding directors about the city’s vibrant art, culture and social landscape.\nTen fellows were shortlisted in October 2019 and completed an intensive three-month program at Ghetto Film School. Their films were then screened at the Paramount Pictures Theatre next to the client lounge of Deutsche Bank Wealth Management throughout the second Frieze Los Angeles art fair.\nThe winning film, selected by a jury of leading art and entertainment figures, was ‘Beauty Never Lost’, made by Silvia Lara. The two-and-a-half-minute picture encompasses a series of vignettes depicting a heightened reality that capture the essence of life in Whittier, California through the perspective of its residents.\nDeutsche Bank has been the Global Lead Partner for Frieze for the past 16 years in London and more recently New York and then extended its partnership with the inaugural Frieze Los Angeles last year.\n“Deutsche Bank’s continued partnership with Frieze Los Angeles demonstrates our commitment to the West Coast and to engaging with our clients through our shared passion for art,” said Claudio de Sanctis, Global Head of Deutsche Bank Wealth Management.\nThe Deutsche Bank Frieze Los Angeles Film Award\n“The Deutsche Bank Frieze Los Angeles Film Award is an exciting progression in our partnership with Frieze,” said Mary Findlay, International Curator at Deutsche Bank. “We are thrilled to support emerging filmmakers in partnership with Frieze and the Ghetto Film School. Supporting aspiring artists is a great way for us to have a positive impact.”\nDeutsche Bank has been supporting the work of emerging and established international artists and their galleries for nearly 40 years and has distinguished itself as a global leader in corporate art initiatives.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}