{
    "url": "https://www.db.com/news/detail/20200210-deutsche-bank-arranges-first-sustainable-development-notes-in-indonesian-rupiah-for-inter-american-development-bank?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "February 10, 2020",
    "tags": [
        "Company",
        "Corporate products",
        "Private products",
        "Sustainability"
    ],
    "title": "Deutsche Bank arranges first Sustainable Development Notes in Indonesian Rupiah for Inter-American Development Bank",
    "body": "Deutsche Bank AG has successfully launched the first Sustainable Development Note in Indonesian Rupiah (IDR) for issuer Inter-American Development Bank (IDB or IADB), rated Aaa/ AAA (Moody’s/S&P).\nIDB raised the equivalent of 100 million US dollars by pricing the Sustainable Development Notes denominated in IDR, with a three-year maturity and an annual coupon of 5.50%.\nProceeds of the Sustainable Development Notes will support IDB’s strategic priorities to reduce poverty and inequality in Latin America and the Caribbean by promoting economic and social development in a sustainable, climate friendly way. Each strategic priority of IDB aligns to at least one of the United Nations Sustainable Development Goals (SDGs).\nThis is the first time Deutsche Bank has priced Sustainable Development Notes in an Asian local currency.\nDeutsche Bank’s Head of Asia Local Markets Trading and Solutions, Ashok Das said: “We are proud to have structured the first Sustainable Development Notes denominated in Indonesian Rupiah. The offer was very well received by real money investors in the US, Europe and Asia Pacific where there is continued demand for investments in the environmental, social and governance (ESG) theme.\n“Investors with ESG mandates are rallying to support development banks with clear strategic priorities linked to Sustainable Development Goals,” Das said. “With demand strong and attractive pricing terms, it’s a good time for development banks to finance.”\nThe Notes support the United Nation’s Sustainable Development Goals linked to IDB’s mission which focuses on three challenges involving social inclusion and equality (SDGs 1,2,3,4,6, 10), productivity and innovation (SDGs 4, 7, 8, 9) and economic integration (SDGs 8,9,17).\nIDB Head of Funding Laura Fan said: “IDB is pleased to issue our first ever Sustainable Development Bond denominated in Indonesian Rupiah. IADB has now issued Sustainable Development Bonds in seven different currencies and we hope to grow this number in 2020 due to strong investor demand for socially responsible investments.”\nDeutsche Bank AG acted as sole dealer and structured the Sustainable Development Notes in Asian local currency format.\n\nFor further information, please contact:\nDeutsche Bank AG\nMedia Relations\nSarah Stabler\nPhone: +65 6423 8413\nE-mail: sarah.stabler@db.com\n\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\n\nThis press release has been approved and/or communicated by Deutsche Bank AG or by its subsidiaries and/or affiliates (“DB”). Deutsche Bank AG is authorised under German Banking Law (competent authority: BaFin - Federal Financial Supervisory Authority) and by the Prudential Regulation Authority and subject to limited regulation by the Financial Conduct Authority and Prudential Regulation Authority. Details about the extent of our authorisation and regulation by the Prudential Regulation Authority, and regulation by the Financial Conduct Authority are available from us on request. Securities and investment banking activities in the United States are performed by Deutsche Bank Securities Inc., member NYSE, NASD and SIPC, and its broker-dealer affiliates. Lending and other commercial banking activities in the United States are performed by Deutsche Bank AG, and its banking affiliates. Copyright (C) 2019 Deutsche Bank AG. Deutsche Bank Aktiengesellschaft (Incorporated in the Federal Republic of Germany & members’ liability is limited).",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}