{
    "url": "https://www.db.com/news/detail/20200207-deutsche-bank-is-the-leading-green-consumer-finance-operator-in-italy?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 7, 2020",
    "tags": [
        "Company",
        "Corporate products",
        "Sustainability"
    ],
    "title": "Deutsche Bank is the leading green consumer finance operator in Italy",
    "body": "Deutsche Bank’s consumer loan business in Italy, Deutsche Bank Easy, provided loans to more than 16,000 individuals and companies in 2019 – a total of over 100 million euros, which constitutes a 20 percent market share for “green loans” aimed at making homes and offices more energy efficient. This is what data collected by the Italian consumer credit and real estate association Assofin shows. The association measured the value of Italy’s green consumer finance market for the first time in 2019. Data from the first nine months show that the market is worth 500 million euros.\nOne of the first banks to offer green loans\nOne of the first banks to start covering green consumer loans over 15 years ago, Deutsche Bank has a wealth of experience in financing energy-saving and low environmental impact products. Not only has it been offering retail and corporate clients loans to help pay for things like photovoltaic systems, solar panels, heat pump boilers, windows and fixtures for thermal insulation, it has gradually been expanding its product range to include innovative solutions for a growing number of consumers and companies. In the past six years alone, Deutsche Bank Easy has helped 71,000 clients with their green projects.\n2020: meeting consumers’ rising demand for green financing\n2020 will see further commitment to green consumer loans with the launch of products dedicated to financing green automotive solutions (plug-in electric cars and hybrids) – to satisfy Italian consumers’ rising demand for sustainable products and services.\nAccording to the first Coldiretti / Ixè survey on “The green turn of Italians” in 2019, roughly 90 percent of respondents believe that each individual can do a lot to protect the environment, while 44 percent are already reducing their consumption of products with excessive packaging; 72 percent say they are willing to us their car or motorbike less, and 59 percent believe that the circular economy will create a lead to substantial job growth.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}