{
    "url": "https://www.db.com/news/detail/20200203-deutsche-bank-partners-with-the-european-investment-bank-on-its-latest-green-bond?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 3, 2020",
    "tags": [
        "Sustainability"
    ],
    "title": "Deutsche Bank partners with the European Investment Bank on its latest green bond",
    "body": "Deutsche Bank has once again partnered with the European Investment Bank (EIB) as Sole Lead Manager to increase the EIB’s Australian dollar Climate Awareness Bond (CAB) by 150 million.\nDeutsche Bank Australia also participated as a significant investor in the bond issue, demonstrating the bank’s own commitment to climate action investments.\nEIB said: upsizing the latest CAB “confirms Asia-Pacific investors’ growing focus on climate change with 93 percent of allocations to Australian and Japanese investors.”\nFunds raised from the 150 million Australian dollar issue will be directed to EIB’s climate action lending projects within the fields of renewable energy and energy efficiency (RE&EE).\nDeutsche Bank Australia’s CEO, Anthony Miller, said: “Deutsche Bank is delighted to be assisting EIB with its commitment to climate action by acting as both a Sole Lead Manager and an investor in its latest Australian Dollar Climate Awareness Bond. As a leader in green bond issuance globally, we foresee an increasing demand from clients this year in green financing as they seek to play a role in addressing climate change. As an investor, EIB’s clearly defined climate action priorities align with our own Environmental, Social and Governance principles.”\nIn 2007, EIB issued the world’s first green bond, or CAB, also managed by Deutsche Bank. As at the end of 2019, EIB remained a leading issuer of green bonds with over 26.7 billion euros raised across 13 currencies.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}