{
    "url": "https://www.db.com/news/detail/20160429-re-publica-ten-from-may-2-may-4-in-berlin-we-ll-be-there?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 29, 2016",
    "tags": [
        "Digitalisation"
    ],
    "title": "re:publica TEN in Berlin: Deutsche Bank will be there",
    "body": "Now in its tenth year, the conference will be covering all kinds of internet-related topics under the motto “TEN is NET” – from Virtual Reality, to Big Data, to Blockchain applications. Over three days, visitors will be able to interact with over 700 speakers at meet-ups, sessions, talks and fireside chats.\nDeutsche Bank sessions on “Big Data” and “Social Impact”\nAt the first Deutsche Bank session on Monday, May 2, 1.30 – 2.30 pm, we’ll be looking at huge amounts of information – Big Data. How can Big Data be used by institutions to innovate? JP Rangaswami, Chief Data Officer at Deutsche Bank and long-time chronicler of the digital transformation, will share his views on this topic.\nIn our second session on Wednesday, May 4, 1:45 – 2:45 pm, Norbert Kunz of Social Impact, Nicolas Ritouet, Co-Founder of CodeDoor and Nadia Boegli will be addressing the questions: How can social start-ups contribute to the integration of refugees? How can good ideas be scaled up – and what should entrepreneurs keep in mind if they want to be active in this field?\nDeutsche Bank has been involved in this area for many years, providing coaching and mentors for social entrepreneurs. In light of current events, an impact fund was recently set up to help social start-up founders who contribute to refugee integration.\nEconomy Stories: Film portraits of the pioneers of digital change\nFor the third consecutive year, Deutsche Bank will be producing short films with some of the interesting speakers at re:publica as part of its Economy Stories series. Whether viewed as part of the re:publica event, or as stand-alone films, these videos make a lively contribution to the digital debate.\nFeatured in Economy Stories this year are the former maths professor, author and speaker Gunter Dueck, consultant Laura Sophie Dornheim, and our partner for many years, Norbert Kunz, CEO of Social Impact.\nTake a look at our film portraits from #rp14 and #rp15:\n#rp15\nShari Langemark: Digitalizing healthcare\nMarco Petracca: Sharing knowledge\nAnna Lena Schiller: Daring to innovate\n#rp14\nHolm Friebe: Innovation im digitalen Zeitalter\nDr. Sarah Spiekermann: Innovation im digitalen Zeitalter\nre:publica – Home of start-ups\nThere have always been a lot of start-ups at re:publica – looking to share ideas and present their business models. This year, for the first time, re:publica will be providing an official platform – the ARENA / Factory – to facilitate discussion between well-established companies and start-ups.\nDeutsche Bank’s Start-up Team will be on site offering coaching. The team already supports more than 1,000 start-ups from its base in Berlin.\nWill we see you in Berlin?\n\n(Photo: © re:publica / Gregor Fischer)",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}