{
    "url": "https://www.db.com/news/detail/20160428-georg-f-thoma-to-leave-the-supervisory-board-of-deutsche-bank?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 28, 2016",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Georg F. Thoma to leave the Supervisory Board of Deutsche Bank",
    "body": "Georg F. Thoma informed Deutsche Bank today that he will resign from his role as a member of the Supervisory Board. In accordance with the Supervisory Board’s terms of reference, his duties will conclude on 28 May 2016, following a one-month notice period. In addition, Mr. Thoma will resign from his role as Chairman of the Supervisory Board’s Integrity Committee effective immediately and will no longer serve as a member of this committee.\nMr. Thoma was elected to the Supervisory Board in 2013 and his term was due to expire in 2018.\nPaul Achleitner, Chairman of the Supervisory Board, praised the work of Georg Thoma over the past three years. Dr. Achleitner said: “We thank Georg for everything he has done for the Bank. With his vast legal experience and tremendous personal commitment, he has delivered outstanding service. He has implemented processes of great importance and benefit to the Bank. The Supervisory Board is determined to continue its work of investigating possible misconduct and to draw lessons for the future.”\nThe Supervisory Board’s Nomination Committee has initiated the process of identifying Mr. Thoma’s successor. The Integrity Committee will be chaired on an interim basis by Louise M. Parent, an American lawyer and member of the Supervisory Board since 2014. She will be assisted by Johannes Teyssen, also a lawyer and member of the Supervisory Board.\nAlfred Herling, Deputy Chairman of the Supervisory Board, said: \"The employee representatives on the Supervisory Board thank Mr. Thoma for his contributions and initiatives. We will continue to conduct all investigations thoroughly and independently and irrespective of the positions of the people involved.”\nThe biographies of Louise Parent and Johannes Teyssen are available at https://www.db.com/supervisoryboard.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}