{
    "url": "https://www.db.com/news/detail/20160428-deutsche-bank-and-the-berliner-philharmoniker-free-open-air-concert-on-27-august-in-berlin?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 28, 2016",
    "tags": [
        "Company",
        "Corporate Citizenship",
        "Culture"
    ],
    "title": "Deutsche Bank and the Berliner Philharmoniker: free open-air concert on 27 August in Berlin",
    "body": "To mark the opening of the 2016/2017 season, Deutsche Bank is making it possible for the Berliner Philharmoniker to put on a free open-air concert outside the Berliner Philharmonie on 27 August. The Berliner Philharmoniker Open Air Concert will be one of the most prominent cultural highlights this summer in Berlin.\nDeutsche Bank and the Berliner Philharmoniker have enjoyed an unparalleled partnership spanning more than 25 years. This close and vibrant cooperation aims to bring classical music to life for large numbers of people, foster young talent and make innovative musical projects a reality.\nSince it began in 2002, more than 44,000 children and young people have participated in the education programme of the Berliner Philharmoniker, made possible exclusively by Deutsche Bank. Whether through dancing, singing or playing an instrument, every child is given the opportunity to embark on a personal journey of musical discovery under the guidance of the orchestra's education experts.\n“Together with our business divisions, we aim to provide our clients with new ways of accessing art, culture and sport,” explained Thorsten Strauss, Deutsche Bank's Global Head of Art, Culture & Sport. “We have bundled our development programmes in this division and will further refine them”, he added.\nDeutsche Bank and its foundations have set new global benchmarks through their commitment to art, culture and sport, such as the longstanding partnership with the Berliner Philharmoniker, The Deutsche Bank Collection - one of the world's most significant collections of contemporary photographs and works on paper - or the Deutsche Bank KunstHalle in Berlin.\nDeutsche Bank's cultural projects and cooperation’s with concert halls, theatres, galleries and museums have reached more than 2.4 million people in the past year.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}