{
    "url": "https://www.db.com/news/detail/20160428-a-message-from-john-cryan-and-juergen-fitschen-on-deutsche-bank-s-1q-2016-financial-results?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 28, 2016",
    "tags": [
        "Company",
        "Financial Results",
        "Management & Leadership"
    ],
    "title": "A message from John Cryan and Jürgen Fitschen on Deutsche Bank's 1Q 2016 financial results",
    "body": "Dear Colleagues,\nThis morning, we released our first-quarter 2016 financial results. We will be discussing these with analysts and the media later today, but first we would like to share them with you.\nAs you know, business conditions were challenging during the quarter, particularly in January and February, as financial market participants reacted to concerns about the outlook for the global economy.\nThese are reflected in our results.\nGroup revenues were 8.1 billion euros, 22 percent lower than in the first quarter of 2015. Above all, revenues in our capital markets-related businesses were substantially lower year-on-year. On the other hand, revenue declines in our other businesses were less pronounced, despite persistent low or negative interest rates. In addition, this quarter’s revenues reflected our implementation of strategic decisions to reduce or exit certain products, locations and client relationships.\nNoninterest expenses were also lower, at 7.2 billion euros, down 17 percent year-on-year, primarily due to considerably lower litigation charges than in the first quarter of 2015. Pre-tax profit was 579 million euros and net income 236 million euros, both substantially lower than in the first quarter of last year.\nTurning to our results in our business divisions: in Global Markets, revenues in both Equity and Debt Sales & Trading were down 29 percent. This partly reflected our decision to reduce or exit certain businesses and relationships. In Corporate & Investment Banking, Corporate Finance revenues were lower year-on-year, largely from lower client issuance. However, we were pleased that Transaction Banking produced solid revenues, reflecting the stability of the business.\nIn Private, Wealth & Commercial Clients, revenues were resilient when adjusted for the impact of the upcoming sale of our stake in Hua Xia Bank. In Deutsche Asset Management, however, revenues were lower, reflecting weak markets.\nWe continue to make important progress in transforming the bank. Preparations for the operational separation of Deutsche Postbank are almost complete. Our Non-Core Operations Unit (NCOU) sustained its progress, reducing risk weighted assets to 30 billion euros, down by nearly a third year-on-year; we recently announced the disposal of the Maher Terminals Port Elizabeth facility; and this week the IPO of Red Rock Resorts was successfully priced.\nMoreover, we are making Deutsche Bank simpler and more focused.\nWe closed 43 branches in Spain and Poland and proceeded to downsize or exit certain countries. We have been strengthening our control environment, upgrading technology and improving the processes by which we adopt clients. We sustained efforts to put remaining legal and regulatory issues behind us.\nWe are working hard to modernise the bank and bring it back to a leadership position in technology. This week we launched a new app, Deutsche Bank Mobile, which places us at the forefront of digital banking. This is vital as we seek to reach, and win, a younger generation of clients.\nIn addition, we laid the foundations for our Digital Factory in Frankfurt. Here, around 400 digital specialists and banking experts will work together and cooperate closely with our Innovation Labs in Berlin, London and Silicon Valley to push forward our digital agenda. With this initiative, we are building for the future.\nThe economic and financial market outlook remains uncertain – but as you can see we are making progress on many fronts. This progress is thanks above all to your hard work and diligence, which we very much appreciate.\nSo, on behalf of all our Management Board colleagues, thank you for your efforts. Our goal is clear: to build a better Deutsche Bank. We remain convinced that together, we will succeed.\nYours sincerely,\nJohn Cryan         Jürgen Fitschen",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}