{
    "url": "https://www.db.com/news/detail/20160415-deutsche-bank-agrees-to-sale-of-maher-terminals-at-port-elizabeth?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 15, 2016",
    "tags": [
        "Africa",
        "Capital markets"
    ],
    "title": "Deutsche Bank agrees to sale of Maher Terminals at Port Elizabeth",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) has reached an agreement with Macquarie Infrastructure Partners III (“MIP III”), a fund managed by Macquarie Infrastructure and Real Assets (“MIRA”), to sell Maher Terminals USA, LLC, a 454-acre multi-user container terminal in Port Elizabeth, New Jersey.\nUnder the transaction, MIP III has agreed to acquire 100% of Maher Terminals USA, LLC. This is subject to Port Authority and other regulatory approvals. Terms of the transaction were not disclosed, but are not expected to have a material impact on Deutsche Bank’s financials.\nMaher Terminals in New Jersey currently moves more than 2 million twenty-foot-equivalent containers per year and provides a vital transport link between land and water for the global marketplace. Since acquiring the asset in 2007, Deutsche Bank has managed this vital transport link through the financial crisis and recovery.\nThis is a legacy asset held within the Bank’s Non-Core Operations Unit (NCOU). In 2015, Deutsche Bank sold Maher Terminals’ Canadian operations Fairview Container Terminal in Prince Rupert, British Columbia, to DP World.\n“This sale marks another important step in Deutsche Bank’s commitment to the reduction of legacy assets,” said Pius Sprenger, Deutsche Bank’s Head of the NCOU.\nAbout MIRA\nMacquarie Infrastructure and Real Assets (MIRA) is the world's leading infrastructure asset manager with growing portfolios in real estate, agriculture and energy. MIRA manages more than $100 billion of assets under management invested in more than 120 portfolio businesses, ~ 300 properties, ~ 3.6 million ha of farmland. MIRA is part of Macquarie Group, a leading financial services provider across a diverse range of sectors around the world. Founded in 1969, Macquarie Group is listed on the Australian Stock Exchange and has operations in 28 countries and has a total of $370 billion in assets under management.\n\nMIP III is a diversified, closed end infrastructure investment vehicle that focuses on investments in infrastructure and related assets in the US and Canada.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 0
}