{
    "url": "https://www.db.com/news/detail/20160414-deutsche-bank-names-new-global-head-of-compliance-and-new-global-head-of-anti-financial-crime?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 14, 2016",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank names new Global Head of Compliance and new Global Head of Anti-Financial Crime",
    "body": "Deutsche Bank announced today that effective June 6, 2016, Pamela Root will join as Global Head of Compliance and Group Chief Compliance Officer. She will be based in London and will report to Sylvie Matherat, Chief Regulatory Officer and Member of the Management Board of Deutsche Bank.\nPamela Root joins from Citigroup where she was Chief Compliance Officer for the Global Institutional Clients Group from 2009. Prior to joining Citigroup, she served in different Legal and Compliance roles at Goldman Sachs, including as the General Counsel to Global Compliance. Before joining Goldman Sachs in 1986, she was a lawyer at Sullivan & Cromwell in New York practicing securities, banking and corporate law.\nPeter Hazlewood will join Deutsche Bank in July 2016, as Global Head of Anti-Financial Crime and Group Money-Laundering Reporting Officer. He will be based in Frankfurt and will also report to Sylvie Matherat.\nPeter Hazlewood is an experienced career financial crime professional who over the past 28 years has held a number of senior global Anti-Financial Crime positions at large financial institutions, including HSBC, JP Morgan, DBS and Standard Chartered. Peter Hazlewood also brings diverse geographic experience, having worked in Hong Kong, Singapore, London, New York and, most recently, Bahrain.\nSylvie Matherat said: “Robust and effective controls are essential to our business practice. Compliance and AFC are key functions to ensure that we manage our business activities to high standards at all times. I am very pleased that with Pamela Root and Peter Hazlewood we are gaining two widely respected and very experienced experts to head these important functions.”\nPamela Root succeeds Nadine Faruque who decided for personal reasons to leave Deutsche Bank in March 2016. Peter Hazlewood succeeds Ulrich Göres who decided at his own request to leave the Bank at the end of January 2016.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}