{
    "url": "https://www.db.com/news/detail/20231122-esg-investors-committed-to-transition?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 22, 2023",
    "tags": [
        "Sustainability",
        "Wealth"
    ],
    "title": "ESG investors committed to transition",
    "body": "Investors, especially in Europe, remain committed to achieving environmental, social and governance (ESG) goals and are concerned about the economic transition, according to a survey by Deutsche Bank’s Private Bank Chief Investment Office (CIO).\nThe annual survey of private clients and institutional investors showed that climate change remains the biggest environmental issue for investment decisions, even though the number citing it (44 percent) has fallen since last year’s survey.\n“Investors are focused on the economic transition to a low carbon economy,” Markus Müller, Deutsche Bank’s Private Bank CIO ESG and Global Head of the CIO said. “Despite the backlash against ESG in some public debates, our survey shows a strong commitment to the issue, especially among European investors. Companies that can deliver on their transition plan and show their credentials will benefit from investor support.”\nThe survey also showed that investors favour regulation to protect the environment. But when it comes to company transition plans, they prefer to see market-driven solutions like better production processes, technology improvements and consumer education, versus policy-led initiatives.\nThe findings also reveal that while investors understand climate risk and are concerned about the need for economic transition, still only a small proportion of investors consider themselves well-versed in ESG. \nEven with the significant rise in ESG investing in the past three years, especially during Covid-19, still only 15 percent of investors said they had a good knowledge of ESG, while just 3 percent identified themselves as ESG experts.\n“There is a gap between what investors know needs to be done for the economy to transition, and how ESG investing can help with the transition. Clearly, much more investor education is needed,” Müller added.\nInvestment opportunity vs risk management\nThe energy transition is the most preferred (18 percent) investment opportunity, compared to investing in Artificial Intelligence, manufacturing and the circular economy.\nWhile investors expect environmental change to impact individual asset classes and see nature as a key factor in individual investment decisions, faith appears to be waning in the ability of ESG to manage portfolio risk. Lower than last year’s survey, 37 percent of respondents strongly or slightly agree that ESG factors can help manage portfolio risk.\nHigher expectations from women\nThe survey also found a difference in attitudes between men and women. More women (27 percent) would avoid an investment if sustainability related factors do not meet their expectations compared to men (19 percent), and more women (54 percent) wanted more information on company transition plans, compared to men (40 percent). Seventy percent of women believed stronger international regulation is required to protect the ocean and biodiversity, compared to 58 percent of men.\nSpotlight on Germany, Spain and Italy\nThe CIO received 1759 survey responses between June and the end of July this year, with the majority of responses (around 55 percent) from Germany, followed by Spain (18 percent) and Italy (16 percent).   \nBetween these three European nations, there was a difference in the degree of investor belief and strong conviction in ESG.\nMore investors in Italy agreed that ESG factors will improve performance and manage risk, when compared to responses from German and Spanish investors.\nOn the other hand, German investors were less likely to strongly agree to the survey’s ESG propositions and more likely to strongly disagree. They were also more skeptical about ESG’s impact on portfolio performance and risk, or the availability of ESG product solutions.\nHowever, the bulk of investors across Italy (78 percent), Spain (74 percent) and Germany (73 percent) strongly or even slightly agreed that investors need more information on how companies plan to transition to a sustainable business model. \nThe full CIO Special: ESG Survey 2023 ‘Sustainable transition and investment’ is available here.",
    "number_of_ratings": 6,
    "rating": 4.8,
    "likes": 4
}