{
    "url": "https://www.db.com/news/detail/20231109-never-again-is-now-deutsche-bank-underlines-commitment-to-countering-antisemitism?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 9, 2023",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Never again is now: Deutsche Bank underlines commitment to countering antisemitism",
    "body": "Deutsche Bank’s Management Board underlined the bank’s commitment to countering antisemitism and expressed concern about the rise of antisemitic incidents globally, as Germany marks its annual day of remembrance for the victims of Nazism.\n“We believe that open dialogue and education are key to eradicating antisemitism as well as other forms of racial and ethnic discrimination,” the Management Board said in an email to all staff globally. “Accordingly, the bank has committed 1 million euros to educate our youth on tolerance, empathy, and the distinction between political discourse and acts and speech of hatred and prejudice.”\nThe bank has unreservedly condemned the terrorist attacks in Israel on October 7 and expressed concern about the humanitarian crisis unfolding in Gaza.\nTo mark November 9, the day in 1938 when Germany’s Jews suffered horrific pogroms, Deutsche Bank’s leadership expressed concern about the increase in antisemitic incidents around the world.\n“These developments cannot be ignored and cannot be tolerated. The bank is committed to opposing, condemning and eradicating antisemitism, among all forms of discrimination, prejudice and hatred,” they said.\n“Nor is there any room for confusion on the distinction between antisemitism, on the one hand, and legitimate political discourse and free expression, on the other hand, including criticism of government policies or actions, as exists in every free society including Israel itself. But what cannot be allowed to stand is for that to spill into antisemitism.”\nDeutsche Bank is a signatory to the International Holocaust Remembrance Alliance’s definition of antisemitism, which provides examples distinguishing clearly between antisemitism and legitimate political criticism.\nStarting in 1988, the bank has encouraged independent historical research into its own actions during the Nazi period which uncovered documents about loans related to the financing of construction work in Auschwitz, prompting its leadership at the time to acknowledge its ethical and moral responsibility. More recently, Deutsche Bank’s Historical Institute has worked to document the fates of Jewish employees at the bank who were victims of Nazi persecution.",
    "number_of_ratings": 89,
    "rating": 4.6,
    "likes": 81
}