{
    "url": "https://www.db.com/news/detail/20190828-deutsche-bank-opens-new-german-loan-market-for-china?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "August 28, 2019",
    "tags": [
        "Capital markets",
        "Corporate products",
        "Investment Banking",
        "Research"
    ],
    "title": "Deutsche Bank opens new German loan market for China",
    "body": "Deutsche Bank recently closed Germany’s first ever ‘Schuldschein’ loan to a Chinese entity. In this transaction, Deutsche Bank helped Chinese subway operator Tianjin Rail raise 200 million euros with a tenor of 10 years, in its inaugural Schuldschein financing in the German domestic loan market. Tianjin Rail Transit Group is the subway operator in the metropolitan area of Tianjin, a city in north-eastern China near Beijing.\nThis landmark transaction is the first euro-denominated assignable loan for Tianjin Rail, fully underwritten by Deutsche Bank Fixed Income and Currencies. It highlights Deutsche Bank’s expertise in executing cross-border transactions, providing balance sheet to corporate issuers in international funding situations, and creating opportunities for our institutional investors.\nDeutsche Bank’s Co-Head of Private Debt Syndicate Konstantin Kraus said: “Teamwork between Deutsche Bank China and Europe, coupled with our in depth client knowledge, enabled us to quickly develop a solution that met the client’s needs and opened a new market for Chinese government-linked borrowers.”\nSam Fischer, Head of Onshore Debt Capital Markets at Deutsche Bank in Beijing said: “This transaction is another milestone for cross-border diversification and maturity extension for Chinese issuers.”\nHunter Xiong, Head of Deutsche Bank’s Belt & Road Initiative Office in Beijing, said: “This transaction opens a new foreign currency funding source for Chinese sponsors in long-term asset sectors like infrastructure and energy. We expect Schuldschein loans to become a valuable alternative international financing option for more Chinese sponsors, particularly for Belt & Road Initiative businesses.”\nSchuldschein are specific German law governed loan instruments used in the German market for financing or investment. They combine the flexibility of bilateral arrangements, the privacy of over the counter markets and the liquidity of capital markets. They are treated like private placements. The investors are mainly German banks, savings banks and insurance companies, which are familiar with the mechanisms and standards of the Schuldschein market.",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 0
}