{
    "url": "https://www.db.com/news/detail/20190822-letter-from-james-von-moltke-chief-financial-officer-in-response-to-the-american-banker?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "August 22, 2019",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "Letter from James von Moltke, Chief Financial officer, in response to the American Banker",
    "body": "The following is a letter from James von Moltke, Chief Financial officer of Deutsche Bank AG, in response to an OpEd piece published in the American Banker on August 14.\nAfter reading an opinion piece about our bank published in the American Banker on August 14, 2019, I felt compelled to respond. We feel that this piece is a gross misrepresentation of our plans and mistakes both our intentions and the risks in executing on our objectives.\nThe principal assertion of this piece is that the strategy we announced on July 7th and 8th is predicated on short-term benefits for shareholders and management while somehow imposing risks and costs on the financial system and, ultimately, taxpayers. This interpretation is groundless and could not be further from the truth. We are taking our responsibilities seriously as we restore Deutsche Bank to profitability, far from privatizing gains and socializing losses.\nBy funding the restructuring with our existing resources, management is taking tough decisions to address the bank’s underlying strategic challenges at the expense of short-term returns, but with a view to generating benefits for all our stakeholders in the medium term.\nAll of this is possible because of the work that recent management teams at Deutsche Bank have conducted over the last several years to create a strong and stable balance sheet and make significant investments in our control framework. These efforts have been made to avoid repeating the mistakes that the industry made in the run-up to the financial crisis. Our capital and liquidity ratios and the levels of risk that we are running are among the most prudent in the industry. This conservatism is exactly what allows us to execute on our bold restructuring plan.\nContrary to another assertion in the August 14 article, we have not received regulatory forbearance to execute our plan, nor do we expect any. We have been working closely with our regulators over several years to ensure we meet their expectations.\nOur decision to reduce our Common Equity Tier 1 (CET1) ratio target by 50 basis points reflects the less capital markets-intensive business model that we are working towards. But even at the 12.5% minimum we foresee in our plan, our capital ratio will remain at all times well above our expected regulatory requirements and in line with our global peers.\nAt the same time, we manage the Group with significant cushion in our Total Loss Absorbing Capacity (TLAC) and liquidity ratios, incorporating the lesson of the crisis that Global, Systemically Important Banks (G-SIBs) should internalize the cost of any resolution in the remote circumstances that would give rise to such an event. Currently, we maintain Total Loss Absorbing Capacity in excess of 120 billion euros, or 132 billion US dollars, far exceeding our regulatory minimum requirements and higher than most of our US peers on a ratio comparison, and we aim to maintain a substantial TLAC buffer going forward.\nThe idea that we present a risk to US taxpayers is belied by the capital strength of our US bank holding company, where our US subsidiary operates with the highest CET1 ratio of all the major US institutions, and the support our branch receives from the Group. Moreover, there were neither quantitative nor qualitative objections from the Federal Reserve in our 2019 stress test (CCAR).\nWe also categorically disagree with the characterization of assets that we are re-segmenting to be part of to our Capital Release Unit as being “riskiest, most toxic assets”. These assets are designated as non-core to our new strategic direction, but this designation does not in any way inform a judgment about the riskiness of these assets. The assets in our Capital Release Unit are generally held at fair value and will likely run off relatively quickly; overall, we believe these assets to be readily saleable, especially in the current interest rate environment.\nThe article’s reference to ‘illiquid, hard-to-price assets’, which we presume to mean Level 3 assets, does not accurately represent either Deutsche Bank’s true position nor the nature of these assets. Level 3 assets represent less than 2% of our total assets and are thus hardly a ‘substantial part’ of our balance sheet.\nIn the past two years, movements (redemptions, sales and purchases within the year) have accounted for roughly 40% of our Level 3 portfolio, which belies the characterisation of these assets as illiquid or hard to sell. Furthermore, our Level 3 portfolio and the valuations of its assets are independently audited, so they are hardly, as the piece states, ‘easy to manipulate.’\nThe combination of our existing capital strength and the resources that we will free up from exiting assets in our Capital Release Unit is expected to put us in a position of having excess capital over time. Our plan to return capital to shareholders is predicated on future profitability once the benefits of our restructuring are clearly evident, and these distributions will be subject to regulatory and shareholder approvals — hardly a situation where we can or would be irresponsible.\nOn the contrary, we wanted to signal to investors a more disciplined approach to capital allocation, demonstrating that we are likely to be better off deleveraging and returning capital than continuing to invest in businesses that we judge cannot produce acceptable returns over time. This is definitely not an attempt to enrich management or shareholders at the expense of prudent stewardship of the bank.\nIn conclusion, the management team of Deutsche Bank takes its position as stewards of one of Europe’s leading financial institutions seriously. The new strategy will make the bank even safer and stronger than it is currently and will be done without the need for external support. We would have appreciated it if these cornerstones of our strategy had, in any way, been reflected in this opinion piece.\nYours sincerely,\nJames von Moltke\nChief Financial Officer\nDeutsche Bank AG",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}