{
    "url": "https://www.db.com/news/detail/20190816-cash-management-goes-digital?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "August 16, 2019",
    "tags": [
        "Corporate products",
        "Digitalisation",
        "Private products",
        "Research"
    ],
    "title": "Cash management goes digital",
    "body": "In two digital breakthroughs in a matter of weeks, we are making business easier and more convenient for corporate clients across the world.\nWith the quest for greater efficiency capabilities high on the wish list of today’s corporate treasurers, energy giant E.on can now manage all of its accounts with Deutsche Bank entirely digitally. Chemical company BASF, along with all cash management clients in Asia Pacific, can also now use digital signatures to do business with the bank.\nOne click at E.on\nThe new service, which uses financial messaging system SWIFT, brings several benefits for E.on. From November, its customers will be able to open or close accounts or make mandate changes at the touch of a button. Deutsche Bank’s automation software eBAM (Electronic Bank Account Management) is the basis for this solution.\nJens Otto, E.on’s Head of Financial Settlement, called the new technology a “significant enhancement of our day-to-day business”, in an interview with the magazine Der Treasurer. Another benefit for E.on: the upcoming integration process of German energy company Innogy, which E.on agreed to buy in March 2018, will be less complex.\nDeutsche Banks’s new ability to handle the eBAM technology will help us to serve other corporate customers: “The solution is a milestone toward paperless, efficient cash management,” said Ole Matthiessen, Head of Global Cash Management at Deutsche Bank.\nGoodbye to paper at BASF\nWe are also helping clients push ahead with their digital goals in Asia Pacific.\nDeutsche Bank’s cash management clients in the region can now use digital signatures to do business with us. This significantly speeds up account opening and makes the typically time-consuming process of cross-border document and contract signing quick and easy.\nIn an interview with the Corporate Treasurer, Jimmy Lui, Regional Treasurer, Asia Pacific for BASF, said: “Being a regional treasury, we often execute agreements with our banking providers that impact a number of our entities across the region. Having a digital signing process that is available in all markets where we operate makes banking with Deutsche Bank easy and efficient.”\nDigital signatures are available to our clients across 21 countries worldwide.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 1
}