{
    "url": "https://www.db.com/news/detail/20190110-deutsche-bank-hackathons-win-fintech-for-good-award?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 10, 2019",
    "tags": [
        "Corporate Citizenship",
        "Digitalisation",
        "Employee engagement",
        "Entrepreneurship",
        "Research"
    ],
    "title": "Deutsche Bank Hackathons win FinTech for Good award",
    "body": "Deutsche Bank’s innovative global hackathons recently won the #FinTechforGood Award at the Banking Technology Awards in London.\nThe bank was recognised for its CommunITy Hackathons initiative, which harnesses the skills of its employees to develop real-world technology solutions for charities. The award, which is judged by Banking Technology magazine’s panel of industry experts, acknowledges three recent hackathons in support of the UK Charities of the Year. Over 1,000 employees from across the globe have taken part in the initiative since its launch in 2016.\nLast year over 800 Deutsche Bank employees collaborated with Cure Leukaemia to create a digital prototype that aims to help connect and benefit leukaemia patients worldwide.\nA previous 24 hour hackathon in partnership with Autistica helped develop a prototype that helps those with autism manage anxiety. The app is now available under the name Molehill Mountain on Apple and Android. Plans are underway to develop an app in support of Rays of Sunshine, one of the bank’s charities of the year for 2019.\n“Huge congratulations to everyone who has engaged with our CommunITy hackathons in support of these fantastic causes,” said Paul Shepheard Head of Delivery Platforms & Services for CTO Platform Technology.\n“The award highlights the tremendous impact we can have by applying their skills and expertise to real societal problems. The Molehill Mountain app is already delivering lasting, positive change with more apps to be launched in 2019.”\nFurther recognition:\nDuring the event, the bank was also recognised for its technology efforts in the following categories.\nHighly commended: Best Use of IT in Retail Banking category: API Program\nShortlisted: Best Use of IT in Corporate Banking\nShortlisted: Best Fintech Partnership for Deutsche Bank: Centre of Excellence\nShortlisted: Best Tech Overhaul Project: Enhanced Prime Brokerage Reengineering\nFurther information on how you can get involved in one of the upcoming CommunITy Hackathons will be shared in the coming months.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}