{
    "url": "https://www.db.com/news/detail/20190104-thursday-s-currency-flash-crash-explained?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "January 4, 2019",
    "tags": [
        "Capital markets",
        "Investment Banking"
    ],
    "title": "Thursday's currency \"flash-crash\" explained",
    "body": "Singapore-based FX analyst Mallika Sachdeva says Japanese retail investors likely caused Thursday’s “flash crash” in Asia trading which saw the Japanese yen rally more than 3% in a matter of minutes against the US dollar, almost 8% against the Australian dollar, and nearly 10% against the Turkish lira.\nWhat happened?\nOn Thursday morning around 7:30am Tokyo time, the Yen rose more than 3% in less than ten minutes against the US dollar.\nThe “flash-crash” happened almost an hour after the widely reported Apple downgrade, which many attributed as the cause of the fall. Yet there was no significant move in S&P futures, or in the Renmimbi.\nOn the other hand, the move was isolated to a series of Yen currency crosses, with the largest moves taking place against a specific subset of currencies—the Aussie dollar, South African Rand and Turkish Lira.\nSachdeva believes Japanese retail FX margin traders, known as Mrs Watanabes, was likely behind the Yen flash-crash, following “a surge in open interest in the Aussie dollar versus the Yen over December”.\n“The extent of the move in different Japanese Yen crosses correlated well to the degree of open interest in them on the Tokyo Financial Exchange (as of Jan 2nd),” Sachdeva wrote in a note published on January 3.\nBank of Japan (BoJ) research on Japanese retail FX flows found that FX margin traders tend to exhibit a few key characteristics: they are typically contrarian (selling on rallies and buying on dips) and they tend to be net short the Yen and long currencies with higher yields.\nThe BoJ concluded that their contrarian behaviour acts to contain volatility in normal times, but during times of volatility, retail flows can exacerbate FX swings through “forced liquidation of positions under loss cutting rules”.\nNotably, the BoJ found that the risk of loss-cuts is highest “during early mornings on Mondays and Japanese holidays.\" This is likely what happened on Thursday.\nBloomberg data also showed that the percentage of long positions in the Aussie dollar against the Yen on their platform was near historical highs of 90% at the start of the year and the build-up in Aussie/ Yen longs over December is consistent with the contrarian investing pattern of Japanese retail, which adds on dips.\nWhy is the Yen move significant?\nThe Japanese Yen is traditionally viewed as a safe haven currency in times of volatility, and Sachdeva says “a number of shifts in flows will see the Yen stronger this year, with gains expected to be front loaded in the first quarter of 2019.”\n“Japanese repatriation of overseas equities is likely to accelerate, Japanese asset managers could be forced to add to US dollar hedges, and seasonality is bearish US dollar/Yen heading into the fiscal year end,” she wrote.\nCan this happen again?\nThe short answer it ‘yes’. Even in Japan’s USD 1 trillion a day FX market, retail investors are a major force with the power to swing trade. As of September 2018, retail customers had 1.9 trillion Yen in margin deposits across Over-The-Counter FX firms and the Tokyo Exchange. While retail investors can technically have an outstanding position of over USD400bn (able to leverage 25x), actual leverage is much lower at 5-10x. But there is a high degree of intraday trading and cycling of positions.\nMallika Sachdeva is an FX strategist based in Singapore as part of Deutsche Bank’s Asia Macro Strategy team",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}