{
    "url": "https://www.db.com/news/detail/20190227-are-markets-paying-enough-attention-to-wealth-inequality?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 27, 2019",
    "tags": [
        "Investment Banking",
        "Research"
    ],
    "title": "Are markets paying enough attention to wealth inequality?",
    "body": "Wealth inequality and economic mobility are two of the biggest socio-economic issues of our time. Chief International Economist Torsten Slok’s research looks at indicators which show how the widening wealth gap can affect markets and economies globally. It continues to generate strong interest from clients and media including a recent CNN Business interview.\nWe asked Slok about his research, including its relationship to populism; the market’s understanding of how wealth inequality has developed in different countries – and why the market should start paying attention.\nWhat factors are driving economic inequality?\nInequality started deteriorating in the 1980s and it is driven by technological change, globalization, tax policies, and education costs and policies. Some of these forces have been in place for decades and turning them around is going to require a broad spectrum of policies touching all these areas of society.\nWhy is it important for investors to pay attention to economic inequality? What are the potential impacts on the market?\nDeutsche Bank Research worries that widening inequality is a key source of populism. Inequality has been deteriorating not only in the US but also in Europe and Asia. And we are now seeing more and more signs of voters asking for change without getting much change. In those countries where populists have been elected into office, it has been a challenge to turn policies around quickly and in a business-friendly way. As a result inequality and populism have become very important dimensions to focus on for investors across all asset classes.\nCan you explain the disconnect between the strong performance in markets and what the median family is experiencing in household wealth decline and economic mobility?\nUS markets have tended to focus on economic policies. In 2016 consumers got very optimistic on tax policy, deregulation, and the general business environment but it looks like that trend is reversing The reason why median wealth declined from 2007 to today is because there are fewer households owning stocks and a lower homeownership rate. This points to a bigger concentration of wealth, which again is a key reason why the median household has less wealth, despite the record high levels of stock prices and home prices.\nWhat would we need to see in the market to move towards closing some of the gaps in mobility?\nThis is a big challenge for politicians and there are no easy solutions. One solution would be to implement policies which push back on some of the global trends in widening inequality discussed above.\nHow does the US compare to other countries in terms of wealth gaps? What are some examples of how economic inequality is manifesting in other regions such as Europe and APAC? What countries are most compromised by economic inequality?\nLooking at indicators of inequality, including the Gini-coefficient, which is the most commonly used measurement of inequality, shows that there is more inequality in the US where it has deteriorated faster than in other countries. But the big picture is that inequality has been deteriorating everywhere globally. Which is exactly why investors need to pay more and more attention to the political consequences of this trend.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}