{
    "url": "https://www.db.com/news/detail/20190225-payments-as-a-key-apac-ceo-werner-steinmueller-on-growth-in-asia?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 25, 2019",
    "tags": [
        "Investment Banking"
    ],
    "title": "Payments as a key: APAC CEO Werner Steinmueller on growth in Asia",
    "body": " APAC CEO Werner Steinmueller recently spoke with German business newspaper Handelsblatt about his growth plans for the region, including investment into the region, particularly around IT.\nHandelsblatt noted that: “A good twelve per cent of the bank's income is generated in the Asia-Pacific region,” and Steinmueller wants to reposition the Asia businesses, which the bank considers an important market for the future. “This is to be achieved with investments in growth markets, a new management team and of course, a contribution to further cost reductions,” the newspaper said.\nDeutsche Bank in December announced its decision to invest an additional 500 million euros of capital in India. The bank’s businesses in the country - as well as in China - recently grew at a double-digit rate, noted Handelsblatt.\nSteinmueller sees the boom in new payment systems in countries such as China and India, where customers can use apps to conduct a large part of their everyday transactions, from paying electricity bills to buying rickshaws, as a key driver for growth for the bank in the region.\nKey quotes from the story:\n“We have optimised our management structure in the region…For us it is about making our business more efficient overall and bringing more energy to the markets.”\n“India is consistently one of our five most profitable markets in the world and increasingly also the most profitable in the Asia-Pacific region.\"\n\"We are transforming our retail bank (in India) into a digital platform. For this we need technological innovation.\"\nOn working with fintechs in the region: “It's about taking our systems to a new level and working with Fintechs on new technologies and solutions….We need to bring innovation to us. Asia is more advanced in this area than Europe.\"\n“We want to get more involved in the ASEAN region...[The main topics of discussion in the banking sector are China and India.] ASEAN is often neglected. I think that’s a mistake.”",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 1
}