{
    "url": "https://www.db.com/news/detail/20190222-romania-full-of-eastern-promise?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 22, 2019",
    "tags": [
        "Company",
        "Digitalisation",
        "Research"
    ],
    "title": "Romania: full of Eastern promise",
    "body": "At the beginning of the year Romania took on the Presidency of the Council of the European Union. Before its term ends on June 30, the next European elections will be held from May 23 to 26. This is one good reason to ask how the country is progressing and about the role Deutsche Bank is playing – after all, Germany has long been Romania’s most important trading partner. We spoke to Mihai Ionescu, Head of Deutsche Bank’s Representative Office Romania.\nMr. Ionescu, the economy in Romania has been gaining momentum for years. But is the bank also benefiting?\nYes, the positive winds driving the Romanian economy forward have resulted in a clear benefit for the bank as well. First, we have been able to access and work with private corporate clients, whereas traditionally Romania – similar to other CEE locations – offered primarily sovereign client opportunities. Secondly, we have been able to win and successfully execute the full spectrum of corporate finance transactions, from investment grade bonds to high yield, loans IPOs and M&A.\nLast but certainly not least, Romania proved to be a very hospitable place for our Technology Centre, which is now home to some 900 highly skilled employees, developing cutting-edge technology for the use of the bank globally. The Technology Centre benefited from the support of a state-funded job creation scheme for the IT sector in Romania.\nWhere is Deutsche Bank particularly good in Romania?\nFollowing a number of years of successful corporate finance activity, DB is recognised as the leading global investment bank active in Romania.\nFor example, we were involved in two major M&A sell-side transactions that resulted in the creation of a leading regional real estate company and a leading global security software firm, which in turn should generate a reasonable flow of business to the bank. We have built a particularly strong record in the real estate sector, with two of the top CEE players being based in Romania.\nThe Technology Centre in Bucharest has already achieved some recognition – not only in Romania, but also within the bank. What makes it successful there?\nIt’s a combination of factors. We believe that our assumptions when selecting Bucharest as the location have been proven right. It offers strong physical IT infrastructure; an abundant IT talent pool and good universities producing new graduates every year.\nThe staff have strong language skills and the geographic proximity to Germany and the UK is an advantage. However more important was the shaping of the team: its members are young, energetic, motivated and enthusiastic about cutting edge, financial technologies. And we have a good balance of women and men, so there is a truly positive environment here.\nWhich business a do you want to work on more intensively in the near future, i.e. where do you see the greatest business opportunities for sustainable growth?\nRomania’s main trade partner now and historically has been Germany with more than 8 billion euros of trade flows annually, and the strong German business community across Romania spans the manufacturing to the high-tech sectors. We see an opportunity in servicing our German clients as they do business in Romania.\nWe also believe that our access to select, important local clients will pay dividends in the future – especially in the technology and real estate sectors. Deutsche Bank thus benefits from the economic upturn, while also making a key contribution towards this. This is what I see as our material positive impact.\nAfter all, Deutsche Bank is not the only large company targeting growth in Romania. Can you find enough qualified employees?\nShortage of labour is a common theme these days not only for Romania, but also for the broader CEE region – and even in Western Europe.\nWe believe however that in Romania we have an edge over our competitors: first, the content of the work we do here motivates our team; second Deutsche Bank enjoys very strong brand recognition here; and third, due to the efforts of our local HR team we have become known as one of the employers of choice in the country.\nAnd last but not least, we provide indoor sports facilities: table tennis, table football, electric cars and numerous other opportunities enable our young team to work hard and play hard.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}