{
    "url": "https://www.db.com/news/detail/20190211-deutsche-bank-presents-the-smallest-and-most-exclusive-private-members-club-in-the-world?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "February 11, 2019",
    "tags": [
        "Art",
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank presents the smallest and most exclusive private members' club in the world",
    "body": "Deutsche Bank is delighted to extend its longstanding support of Frieze in London and New York to the first ever Frieze Los Angeles, presenting works by leading contemporary artists Victoria Fu and Tom Pope at the Paramount Studios in Hollywood.\n“Our support for the launch of Frieze Los Angeles underlines our strong commitment to the US, and to the West Coast in particular as an increasingly important center for contemporary art, for business and for our clients,” said Fabrizio Campelli, Global Head of Deutsche Bank Wealth Management.\nFrieze Los Angeles(LA), starting on February 14, is the latest edition of Frieze, which Deutsche Bank has sponsored as Global Lead Partner for more than 15 years.\nWhether showcasing the Deutsche Bank Collection, the most substantial corporate collection of contemporary works on paper and photography, partnering with international museums or sponsoring legendary performers in music or sporting events, promoting excellence across disciplines has a global positive impact.\nThorsten Strauss, Global Head of Art, Culture & Sports at Deutsche Bank, said: “Support of Frieze LA underscores our 40 year commitment to encouraging new and noteworthy talents in art, culture and sports from across the globe. We are delighted to present Victoria Fu and Tom Pope – two extraordinary artists – at the LA fair. Both art installations embrace the site in unique ways and reflect the international scope of both the Frieze platform and our own extensive program.”\n  Victoria Fu Installation in the Deutsche Bank Wealth Management Lounge\nVictoria Fu, Still image from Télévoix 1, 2017\n  The Deutsche Bank Wealth Management Lounge at the Paramount Theater will display an installation by California-based artist Victoria Fu. In her multi-layered installations, Fu uses film, photography, sculpture and light to create unique, site-based viewing configurations that explore the virtual space of moving images and the relationship between touch and the digital world.\nResponding to the architecture of the Paramount Theater lobby, Fu will transform the environment with elements of light, both natural and artificial. Manipulating light projected onto the ceiling, filtering in from the windows and emitting from a neon sculpture, the artist creates an interplay between the above and below, abstraction and representation, the real and the virtual. Like an earlier generation of California artists experimenting with space and light, she references the luminous and the theatrical, two hallmarks of Hollywood and the Paramount Studios site.\n \nDeutsche Bank ArtSpace presents Tom Pope’s One Square Club\nTom Pope, Pop(e), 2017 (l.) and One Square Club, 2018, (r.)\n  In the Paramount Pictures Studios’ backlot, the Deutsche Bank ArtSpace at Frieze Los Angeles will present UK performance artist Tom Pope’s One Square Club. What may be the smallest and most exclusive private members’ club in the world is a unique space measuring just one square meter which offers premium facilities including a bar, music and games.\nMembers of the One Square Club are also participating in an experimental artwork. Pope is the flamboyant host of this interactive performance and fully functioning private members’ club where the members actively shape how their time is spent and how the experience unfolds. The club, like a dormant stage, comes to life when the members and host engage collaboratively.\n  Press contacts:\nCarlotta Dennis-Lovaglio or Lucinda Riding or call +44 020 3487 0077.\nTo find out more about Deutsche Bank’s support for art, culture and sports, please contact Klaus Winker or call +49 69 910 32249\nTo find out more about Deutsche Bank Wealth Management, please contact Christina Partyka on +1 212 250 1013 or Adrian Cox on +44 20 7541 7775.\n  About Deutsche Bank Wealth Management\nWith client assets of approximately 300 billion euros (as at September 30, 2018), Deutsche Bank’s Wealth Management is one of the largest wealth managers worldwide. It offers wealthy clients a broad range of traditional and alternative investment solutions, as well as comprehensive advice on all aspects of Wealth Management. Its goal is to create lasting value as a trusted partner to wealthy individuals and entrepreneurs, family offices and foundations around the world. It aims to bring a unique perspective as both a European and a truly global institution; to offer bespoke solutions that others do not; to offer expert advice to its clients, their families and their business; and to connect them to a world-class capital markets institution.\nAbout Deutsche Bank Art, Culture & Sports\nArt, Culture & Sports is a bank-wide division within Deutsche Bank that combines its expertise and international networks with the bank’s business initiatives around the globe. Through our longstanding programs and partnerships, we provide exclusive access to top artists, performers and athletes that provide first-rate, inspiring experiences for our clients and colleagues. In 2018, Deutsche Bank launched the PalaisPopulaire, a state-of-the-art cultural center in the heart of Berlin, featuring programmatic experiences with the brightest stars in contemporary art, culture and sports.\nAbout Frieze\nFrieze is the world’s leading platform for modern and contemporary art for scholars, connoisseurs, collectors and the general public alike. Frieze comprises three magazines—frieze, Frieze Masters Magazine and Frieze Week— and four international art fairs—Frieze London, Frieze Masters, Frieze New York and Frieze Los Angeles. In addition, Frieze organizes a program of special courses and lectures in London via Frieze Academy.\nFrieze was founded in 1991 by Matthew Slotover and Amanda Sharp, with the launch of frieze magazine, the leading international magazine for contemporary art and culture. In 2003, Sharp and Slotover launched Frieze London art fair, which takes place each October in The Regent’s Park, London. In 2012, they launched Frieze New York, which is held each May in Randall’s Island Park, and Frieze Masters, which coincides with Frieze London in October and is dedicated to art ranging from ancient to modern. In 2018, Frieze announced the launch of Frieze Los Angeles, which will take place from February 14 to 17, 2019 at Paramount Pictures Studios, Los Angeles. In 2016 Frieze entered into a strategic partnership with Endeavor (formerly WME | IMG), a global leader in sport, entertainment and fashion.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}