{
    "url": "https://www.db.com/news/detail/20190205-chinese-new-year-ushers-in-period-of-growth-for-luxury-goods?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 5, 2019",
    "tags": [
        "Investment Banking",
        "Research"
    ],
    "title": "Chinese New Year ushers in growth period for luxury goods",
    "body": "An early Chinese New Year spending spree will kick-start a year of growth for the country’s luxury goods makers, supported by domestic expansion and overseas acquisitions, according to Deutsche Bank Research. Gift buying in the run up to the Year of the Pig on February 5, which is two weeks earlier than 2018, has given high-end brands a flying start for 2019, which will see growth in demand for luxury goods reach 4.5 percent, according to a recent report.\nAgainst the backdrop of a turbulent macro environment as a result of the trade war, luxury goods makers are sharpening their propositions and looking to enhance brand loyalty among China’s 4 million high net worth individuals and 70 million millennials.\nOne approach is to offer greater customisation to meet Chinese consumers’ increasing demand for newness. “This is something that the mega-brands have already developed and we expect this to continue whether in the form of full made-to-measure or mini collections, more backdrops in store during the year, the possibility to personalise purchases, etc.” they add.\nTo supplement internal expansion, Chinese companies are also looking abroad: “We are seeing more and more China groups adopting multi-brand strategies and acquiring foreign brands,” the report says.\nFurther capitalising on a general uptick in domestic consumption, luxury brands are also expanding to China’s lower tier cities which, although they cannot match the wealth of Beijing or Shanghai are still home to significant numbers who can afford designer brands.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}