{
    "url": "https://www.db.com/news/detail/20190201-deutsche-bank-reports-first-full-year-net-profit-since-2014-and-delivers-on-2018-targets?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "February 1, 2019",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank reports first full-year net profit since 2014 and delivers on 2018 targets",
    "body": "Christian Sewing, Chief Executive Officer, said: “Our return to profitability shows that Deutsche Bank is on the right track. Now, our priority is to take the next step. In 2019 we aim not only to save costs but also to make focused investments in growth. We aim to grow profitability substantially through the current year and beyond.”\n2018 highlights\nFirst full-year net profit since 2014, profit before tax¹ up 8% to 1.3 billion euros\nDelivered on 2018 adjusted cost² and headcount target\nLoan growth³ of 14 billion euro\nOver 3,000 new Mittelstand clients in German\nCommon Equity Tier 1 (CET1) ratio of 13.6\nLowered 2019 adjusted cost target to 21.8 billion euro\nEarnings per share of -1 cent after payment of coupons on AT1 capital\nFourth-quarter 2018 highlights\nPre-tax loss of 319 million euros, versus a 1.4 billion-euro loss in the prior year\nAdjusted costs were reduced by over 1 billion euros or 15% year-on year\nNet revenues down 2% year-on-year\nRevenue growth in Private & Commercial Bank and Global Transaction Banking\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) reported group net income of 341 million euros for 2018, versus a net loss of 735 million euros in 2017. Net income attributable to Deutsche Bank shareholders was 267 million euros, versus a negative 751 million euros in 2017. Profit before tax was 1.3 billion euros for 2018, up 8% versus 2017. The Management Board intends to recommend to the Supervisory Board a dividend of 11 cents per share in respect of 2018.\nDelivery on 2018 adjusted cost and headcount targets\nDeutsche Bank delivered ahead of target on costs. Noninterest expenses were 23.5 billion euros in 2018, down 5% year-on-year. Adjusted costs of 22.8 billion euros, down 5%, were below the bank’s full-year 2018 target of 23.0 billion euros.\nWorkforce reductions met Deutsche Bank’s 2018 target. On a full-time equivalent (FTE) basis, the number of internal employees was reduced to around 91,700 at the end of 2018, meeting the bank’s year-end target of below 93,000. Reductions more than offset hiring in growth areas and control functions.\n2019 targets reaffirmed or upgraded\nGiven the progress in 2018, management has lowered its 2019 adjusted cost target to 21.8 billion euros, versus 22 billion euros previously. Management reaffirmed its target to reduce the internal workforce to well below 90,000 by the end of 2019. Additionally, Deutsche Bank reaffirmed its commitment to its plans to achieve a post-tax Return on Tangible Equity (RoTE) target of above 4% in 2019.\nRevenues: down 4% in a challenging environment\nFull-year net revenues were 25.3 billion euros in 2018, down 4% versus 2017. This development reflects strategic measures to focus the business, challenging financial markets, particularly in the final quarter, together with negative Deutsche Bank-specific news including the raid by state prosecutors on the bank’s premises in late November.\nSolid capital, risk and balance sheet: a foundation for growth\nThe Common Equity Tier 1 (CET1) ratio was 13.6% at the end of 2018, consistent with the bank’s target of over 13%. During the fourth quarter, risk weighted assets (RWA) increased by 9 billion euros to 350 billion euros, mainly reflecting higher market risk RWA. Management is committed to managing resources to keep the CET1 ratio above 13%.\nThe CRR/CRD 4 leverage ratio improved from 4.1% to 4.3% during the year on a phase-in basis, close to the bank’s mid-term target of 4.5%. On a fully loaded basis this ratio rose from 3.8% to 4.1%, driven in part by a reduction in leverage exposure of 122 billion euros or 9% during the year. Adjusting for fluctuations in exchange rates year-on-year, this reduction was 148 billion euros.\nThe bank’s strong balance sheet provides a solid foundation for growth. Liquidity reserves remained strong at 259 billion euros. The Liquidity Coverage Ratio was 140%, 66 billion euros above the minimum requirement of 100%, while the loan-to-deposit ratio remained conservative at 77%.\nThis enabled the bank to enhance balance sheet productivity with loan growth of 14 billion euros, or 21 billion euros if adjusted for divestitures, including operations in Poland; a reduction in excess liquidity; and an increase in the share of liquidity held in high-quality short-term securities to 29% in the fourth quarter of 2018, up from 21% in the prior year quarter.\nThe bank estimates its payment capacity for Additional Tier 1 (AT1) instruments to be comfortably above 325 million euros in anticipated coupon payments before considering general additional reserves.\nProvision for credit losses was 525 million euros in 2018, unchanged versus 2017.\nThe bank made further progress on litigation matters in 2018. It has now wholly or partially resolved 19 of the 20 most significant matters as measured by financial risk at the beginning of 2016. No new matters with an order of magnitude or financial risk similar to those matters have arisen. Litigation provisions stood at 1.2 billion euros at the end of the year, down 40% from 2.0 billion euros at the end of 2017.\nPerformance in the fourth quarter of 2018\nThe bank reported a net loss of 409 million euros in the quarter. The net loss attributable to Deutsche Bank shareholders was 425 million euros, compared to a net loss attributable to shareholders of 2.4 billion euros in the prior year quarter. The loss before tax was 319 million euros, versus a pre-tax loss of 1.4 billion euros in the prior year quarter.\nRevenues in the fourth quarter were 5.6 billion euros, down 2% year-on-year, driven by the implementation of strategic measures, a challenging market environment and negative Deutsche Bank-specific news.\nCosts were reduced by over 1 billion euros, or 19%, year-on-year. Noninterest expenses were 5.6 billion euros, down 19%, while adjusted costs fell 15% to 5.4 billion euros. This reduction was achieved across both compensation expenses and all major categories of non-compensation expenses, driven by cost initiatives.\nIn the Corporate & Investment Bank, revenues were 2.6 billion euros, down 5%. Revenues in the quarter benefited from positive debt valuation adjustments of 67 million euros and a positive change in the valuation of an investment of 56 million euros, versus a negative debt valuation adjustment of 19 million euros in the prior year quarter. Adjusting for these items, revenues would have declined by 10%.\nGlobal Transaction Banking revenues were 996 million euros, up 5%, driven by higher net interest income and transaction growth, notably in cash management.\nSales & Trading revenues in Fixed Income & Currencies fell 23% to 786 million euros in challenging market conditions. Strength in Foreign Exchange trading was more than offset by revenue declines in Rates and Credit. Equity Sales & Trading revenues were essentially unchanged at 379 million euros.\nOrigination & Advisory revenues were down 23% to 411 million euros. Both Advisory and Equity Origination revenues were up 17% year-on-year, with Advisory revenues the best in any quarter for three years. This was more than offset by a significant decline in Debt Origination driven by lower market volumes.\nIn the Private & Commercial Bank, revenues were 2.5 billion euros, up 6%. Revenues in the quarter benefited from a gain on a property sale in Sal. Oppenheim of 40 million euros and 35 million euros from Sal. Oppenheim workout activities, compared to the positive impact in the prior year quarter of 43 million euros from Sal. Oppenheim workout activities.\nAdjusted for these effects, revenues would have been up 5%. The year-on-year growth rate was favourably impacted by revenues from exited businesses of 31 million euros in the quarter, versus a negative 91 million euros in the prior year quarter.\nIn the Private & Commercial Business (Germany), revenues were up 2% at 1.6 billion euros, as growth in consumer and mortgage lending as well as smaller asset sale transactions offset continued deposit margin compression.\nRevenues in the Private & Commercial Business (International) were up 5% to 349 million euros, while Wealth Management revenues were 433 million euros, down 4%. Growth in Wealth Management Asia-Pacific was more than offset by significantly lower revenues in Europe, the Middle East and Africa (EMEA) including Germany.\nIn Asset Management (principally DWS), revenues were 514 million euros, down 17%, driven by lower management and performance fees and net outflows in the quarter of 7 billion euros. Revenues were also impacted by the non-recurrence of revenues from sold or discontinued businesses.\nFourth-quarter provision for credit losses was higher than in earlier quarters at 252 million euros, mainly due to increased provisions on performing loans required under IFRS 9.\nBusiness developments in 2018\nThe Corporate & Investment Bank\nSignificant progress on strategic refocusing and evidence of excellence in many core areas: the Corporate & Investment Bank executed on its strategic adjustments in 2018, focusing around core strengths, reducing leverage exposure in US Rates and Equities and redeploying resources around key clients. This delivered adjusted cost reductions of approximately 700 million euros and a reduction in leverage exposures of 137 billion euros.\nDeutsche Bank was named ‘Best FX bank in the Eurozone’ in the FX Week Best Banks awards and ‘European High-Yield Bond House of the Year’ in the IFR awards for the fourth consecutive year. Deutsche Bank was also the No. 1 arranger of non-US dollar high-yield bonds (source: Thomson Reuters).\nGlobal Transaction Banking was named ‘Best Trade Finance Provider in Germany’, one of 15 No. 1 rankings in the 2018 Euromoney awards. Deutsche Bank was also named ‘Best Securities Services Bank’ by The Banker, while in the Euromoney Cash Management Survey, Deutsche Bank was voted No. 1 in Europe and No. 1 in Germany.\nLandmark corporate finance transactions: Deutsche Bank played a lead role in 15 of the top 25 transactions in EMEA in 2018, as measured by fees according to Dealogic. The bank was a top-ranked global coordinator of European IPOs, leading four of the five largest IPOs in 2018. In Germany, the bank played a lead role on seven of 2018’s top 10 transactions, including all of the three largest IPOs. It maintained top-10 positions in both the US and Asia ex-Japan (source: Dealogic).\nThe Private & Commercial Bank\nBusiness growth: the Private & Commercial Bank reported net new loan growth of 3 billion euros in 2018. Adjusted for disposals, including the partial divestiture of retail operations in Poland, loan growth was 10 billion euros including 7 billion euros in the Private & Commercial Business (Germany). Customer deposits grew by 8 billion euros in the year; adjusted for disposals, deposit growth was 12 billion euros.\nIn Germany, the business attracted more than 3,000 new commercial (Mittelstand) clients during the year. The fourth quarter saw further progress in digital capabilities with the go-live of SEPA real-time transfers. The launch of Apple Pay resulted in a 7% increase in the number of Deutsche Bank-issued Mastercards within four weeks.\nSignificant progress on strategy execution: the Private & Commercial Bank delivered a RoTE of nearly 5% in 2018, despite a full programme of strategy execution. The legal entity merger with Postbank AG in Germany, progress in optimising the branch network and the partial sale of operations in Poland, which closed during the fourth quarter, all marked continued progress in focusing the business. Wealth Management completed the integration of the Sal. Oppenheim business, rolled out a new regional structure, closed senior hires in key areas and achieved solid growth in lending.\nAsset Management\nDWS maintained a strong market position despite difficult markets, which reduced demand for European active equity retail funds, and the negative impact of US tax reform on asset flows. Assets under management fell 5% in the quarter to 664 billion euros in a challenging market environment, with outflows from active retail funds partly offset by inflows in Passive.\nThe business retained clear leadership in retail asset management in Germany (source: BVI) and ranked No. 2 in European Exchange-Traded Products (exchange-traded funds and commodities), capturing 17% of all inflows in the year and 27% in the fourth quarter (source: ETFGI). DWS was named ‘Passive Management Group of the Year’ at Investment Week’s 2018 Investment Awards.\n¹ Profit (loss) before tax = income (loss) before income taxes under IFRS.\n² Adjusted costs = noninterest expenses excluding impairment of goodwill and other intangible assets, litigation, and restructuring and severance. For a reconciliation to noninterest expenses, please see the financial summary below.\n³ Loan growth includes a reduction to the reported December 31, 2017 loan balance of 15 billion euros to reflect the transition impact of IFRS 9.\n      The figures in this release are preliminary and unaudited. The Annual Report 2018 and Form 20-F are scheduled to be published on 22 March 2019.\nAn analyst call to discuss fourth-quarter 2018 financial results will take place at 08:00 CET today. A Financial Data Supplement (FDS), presentation and audio-webcast for the analyst conference call are available at:\nwww.db.com/quarterly-results\nToday a media conference will be held at 10:00 CET. Further news can be found on the Deutsche Bank website: https://www.db.com/newsroom\nA fixed income investor call will take place on Monday, 4 February, 2019, at 15:00 CET. This conference call will be transmitted via internet.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}