{
    "url": "https://www.db.com/news/detail/20180426-a-message-from-christian-sewing-on-first-quarter-results-and-deutsche-bank-s-strategy?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 26, 2018",
    "tags": [
        "Company",
        "Corporate products",
        "Management & Leadership"
    ],
    "title": "A message from Christian Sewing on first-quarter results and Deutsche Bank's strategy",
    "body": "Dear Colleagues,\nA little over two weeks ago I promised to tell you more about our plans as soon as possible. Today we are presenting a first outline, together with our first-quarter results.\nEven a quick look at the figures makes one thing clear: we have to take action – fast. The first issue is the development of our costs. We only managed to keep our expenditure at the prior-year level. This is not enough. This year’s adjusted costs must not exceed 23 billion euros – that is not negotiable. Therefore we are taking additional action. We have to avoid a sudden increase in costs, as happened in the fourth quarter of 2017.\nAdditionally, the results of our largest division, the Corporate & Investment Bank, are under pressure. Although there are exceptional factors, first and foremost exchange rates, there is no denying that the environment is very challenging here.\nThat’s why we are currently intensively analysing our earnings, costs and capital structures. What I will share with you now is not a final set of measures. It is still early days. But it shows you clearly the direction in which we want to go.\nHere are the measures the Management Board has agreed on:\n1. We aim to achieve a better balance between our businesses and a more stable earnings profile. We will do this by growing the Private & Commercial Bank and DWS. We want these businesses, together, to account sustainably for approximately 50 percent of our revenues by 2021. If we add the revenues of Global Transaction Banking, the share of our revenues from more stable sources should be around 65 percent.\n2. The Private & Commercial Bank and our Asset Management business DWS will rigorously implement the strategies we have already communicated. Following the partial IPO, DWS is well equipped for further growth. Our goals are clearly defined. At the Private & Commercial Bank we are satisfied with the progress we are making. In our home market, Germany, we will soon serve our 20 million-plus private clients from a single legal entity.\nThe bank has now received confirmation from the European Central Bank that the merged entity may apply the capital waiver permitting more efficient liquidity management for Deutsche Bank. This represents a vote of confidence in us and an important milestone in the merger.\nInternationally, we are now focusing on growing markets such as Italy and Spain, having exited Poland and Portugal. We also plan to expand our position with wealthy private clients in Germany and internationally. This market is growing fast and we are in a good position to participate in this development. We aim to invest in this area.\n3. We will adapt our Corporate & Investment Bank to changed market conditions and position ourselves according to our strengths. Before we go into detail: our business with international corporates and investors remains a core element of Deutsche Bank. This particularly includes Global Transaction Banking, treasury solutions, foreign exchange and structured finance. In essence we will concentrate on corporates and institutions that invest in the real economy.\nBut this makes clear that our resource commitment – people, investments and risk appetite – has not been sufficiently aligned to these core strengths. We shall change this now by scaling back certain activities where we don't see ourselves as sustainably competitive. The Management Board has decided on the following measures:\nTo focus our Corporate Finance business on industries and segments which either align with our core European client base or link to global financing and underwriting products in which we enjoy a leadership position. We will reduce our commitment to sectors in the US and Asia in which cross-border activity is limited.\nTo scale back our activities in US Rates by shrinking our balance sheet, leverage exposure and repo book in particular. At the same time we will invest in our European Rates business which is one of our proven strengths.\nTo undertake a review of our global Equities business with the expectation that we will reduce our platform. This includes our Global Prime Finance business where we will focus on maintaining our deepest client relationships. We will inform you in due course how we intend to position the Equities business overall.\nThese actions will involve cost reductions. These cutbacks will be painful, but they are unfortunately unavoidable if we want to be sustainably profitable in the best interests of our bank, our clients and our investors.\n4. We will reduce costs further and live up to a disciplined cost culture. While we have made progress, we still have an overall cost base which is not supported by our revenues. We will tackle this with a three-pronged approach:\nWe will start with the management:\nThe Management Board has already become smaller. More decision making will be delegated to the businesses and they will be held more accountable. This will result in a faster and more agile organisation.\nWe will slim down the leadership structure below the Management Board. Less hierarchy, more teamwork – this has to be the name of the game.\n\nWe will introduce additional short-term cost measures:\nWe will have to reduce our workforce, in particular stemming from the right-sizing of the Corporate & Investment Bank, including the supporting infrastructure functions.\nWe will scrutinise our external spend and significantly rationalise our real estate costs.\nWe will review our investments and stop running projects which do not meet our standards or expectations.\n\nWe have started a strategic “Cost Catalyst Programme” which is overseen by James von Moltke and supported by the entire Management Board. It aims to meaningfully improve our expense culture, detect cost drivers early on and eliminate duplication of functions. James will soon provide you with a detailed presentation on this programme.\nI know you have all worked tremendously hard in the past few years and we in the Management Board are grateful for this. But given our results and our share price, it is our imperative to take tough decisions and ensure we implement them in a disciplined way. All too often in the past we have failed to follow through on the objectives we set ourselves with the persistence we needed. We have to regain our credibility.\nDeutsche Bank has all the resources it needs to thrive: great people around the world, deep and long-standing client relationships and financial strength. This gives us the flexibility we need to redefine the core of our bank and to pave the way for our long-term success.\nWith best wishes,\nChristian Sewing",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}