{
    "url": "https://www.db.com/news/detail/20180426-deutsche-bank-announces-actions-to-reshape-its-corporate-und-investment-bank-and-additional-cost-cutting-measures?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 26, 2018",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Deutsche Bank announces actions to reshape its Corporate & Investment Bank and additional cost-cutting measures",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) has announced strategic adjustments to shift the bank to more stable revenue sources and strengthen its core business lines. By 2021, the bank envisages a sustainable revenue share of approximately 50% from the Private & Commercial Bank and the DWS asset management business. Adding the revenues of Global Transaction Banking, the share of more stable revenues should be around 65%.\nSpecifically, within the Corporate & Investment Bank (CIB), Deutsche Bank will focus its activities and resources on its European and multinational clients and the products which are most relevant for them, while reducing its exposure to other areas. The Management Board has also agreed on additional cost-reduction measures.\nStronger focus on European clients\nIn reallocating resources the bank aims to focus more on businesses where it has a leading market position – including global payments and foreign exchange markets, for example. The bank will scale back other areas where the Management Board believes that Deutsche Bank no longer has a competitive advantage in the changed market environment:\n— Deutsche Bank will focus its Corporate Finance business on industries and segments which either align with its core European client base or link to underwriting and financing products in which it enjoys a leadership position. Commitment to sectors in the US and Asia, in which cross-border activity is limited, will be reduced.\nThe bank will remain committed to offering global industry expertise to corporates, financial institutions and financial sponsors whose activities are closely aligned with the strengths of the German and European economies.\n— The bank will scale back activities in US Rates sales and trading, shrinking the balance sheet, leverage exposure and repo financing, while remaining committed to the European business, which given its scale and relevance to our client base generates more attractive returns.\n— The bank will be undertaking a review of its Global Equities business with the expectation of reducing its platform. This includes reducing leverage exposure to global prime finance where the focus will be on maintaining our deepest client relationships by reprioritising the deployment of resources.\nChristian Sewing, Chief Executive Officer, said: “Deutsche Bank is deeply rooted in Europe – here we want to provide our clients access to global financing and treasury solutions. This is what we will focus on more decisively going forward.” Reshaping the Corporate & Investment Bank will imply headcount reductions in the affected regions and business areas. Sewing added: “These reductions are painful but regrettably unavoidable to ensure our bank’s competitiveness in the long run.”\nThe asset management unit DWS which has successfully executed its IPO, as well as the Private & Commercial Bank (PCB) are implementing their strategies as previously announced. The merger of Postbank with Deutsche Bank’s German retail business is making progress as planned.\nInternationally, the Private & Commercial Bank intends to focus on growing markets like Italy and Spain while in Wealth Management, the bank will look to grow in Germany and in international markets. “We intend to grow the business in our Private & Commercial Bank and at DWS,” Sewing said.\nShort and medium-term measures are intended to reduce costs further\nIn addition the Management Board has agreed on several short and medium-term measures to reduce the bank’s cost base further. The Management Board, which used to have 12 members, will become smaller as three members leave the bank as previously announced. Co-head structures in business divisions are discontinued. The bank also aims to delayer management structures across the organisation to reduce costs and increase the speed of decision making. It intends to rationalise vendor costs and real estate costs worldwide and will work to improve efficiency of internal controls. In the medium-term a strategic cost programme will include elements such as making cost drivers more transparent as well as identifying and removing overlapping activities. James von Moltke, Deutsche Bank’s Chief Financial Officer, is responsible for this programme.\nThe Management Board reiterates its commitment to keep the adjusted cost base for 2018 below 23 billion euros.\nSewing said: “Deutsche Bank has all the resources it needs to thrive: great people around the world, deep and long-standing client relationships and financial strength with a solid capital position, high levels of liquidity and a very conservative risk profile. This gives us the flexibility we need to redefine the core of our bank and to pave the way for long-term success.”\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nThis release contains forward-looking statements.\nForward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement. Such factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission. Such factors are described in detail in our SEC Form 20-F of 16 March 2018 under the heading “Risk Factors”.\nCopies of this document are readily available upon request or can be downloaded from www.db.com/ir.\n   ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}