{
    "url": "https://www.db.com/news/detail/20180419-deutsche-bank-provides-details-on-ifrs-9-implementation-and-adjustments-to-segmental-reporting?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 19, 2018",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank provides details on IFRS 9 implementation and adjustments to segmental reporting",
    "body": "Deutsche Bank (XETRA: DBKGn.DE/NYSE: DB) today published its IFRS 9 Transition Report. This provides transparency on Deutsche Bank’s implementation of IFRS 9, which is mandatory for reporting under International Financial Reporting Standards and has replaced IAS 39 as of January 1, 2018.\nIFRS 9 introduces new requirements on how an entity should classify, measure and reflect impairments to financial instruments. The Transition Report summarises the impact of the implementation of IFRS 9 on shareholders’ equity, Risk Weighted Assets (RWA), regulatory capital, and key ratios for Deutsche Bank Group.\nFollowing the implementation of IFRS 9, the bank’s fully loaded Common Equity Tier 1 (CET 1) ratio, which was 14.0% as of December 31, 2017, decreased by 13 basis points. This impact is thus marginally higher than the bank’s earlier estimates, as a consequence of refined methodologies. The voluntarily published Transition Report includes an analysis of movements from figures reported under IAS 39 as of December 31, 2017, to figures reported under IFRS 9 as of January 1, 2018. The transition rules do not require a retrospective application to prior periods, accordingly the initial adoption effect is reflected in the opening balance of shareholders’ equity for the financial year 2018. The Interim Report as of March 31, 2018, will contain these opening impacts as well as first quarter activity under IFRS 9.\nAdjustments to segmental reporting\nIn addition, Deutsche Bank today confirmed the following changes to its segmental reporting, with effect from and including the first quarter of 2018.\nCorporate & Investment Bank (CIB)\nThe definition of CIB’s ‘Sales & Trading (FIC)’ revenue category has been updated to improve alignment with peer reporting and enable more relevant comparisons. As a result, the category ‘Financing’ ceased to exist as of January 1, 2018, and the majority (more than 95%) of revenues previously reported under that category for the year 2017 has been moved into the ‘Sales & Trading (FIC)’ category and the remainder into ‘Other’. The presentation of comparison periods has been adjusted accordingly.\nCorporate & Other (C&O)\nInfrastructure expenses relating to shareholder activities as defined in the OECD Transfer Pricing Guidelines, i.e. costs for specific group functions, are no longer allocated to segments, but instead held centrally and reported under ‘Corporate & Other (C&O)’, formerly ‘Consolidation & Adjustments (C&A)’. In 2017 these infrastructure expenses amounted to approximately EUR 370 million. The presentation of comparison periods has been adjusted accordingly. All categories previously reported under C&A, including valuation and timing differences as well as treasury-related and corporate items not allocated to the divisions, remain in C&O.\nA Financial Data Supplement (FDS) is published today which presents an adjusted presentation of the bank’s 2016 and 2017 financial results.\nAccess to this version of the FDS as well as to the IFRS 9 Transition Report:\nwww.db.com/annual-reports\n  About Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement. Such factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission. Such factors are described in detail in our SEC Form 20-F of 16 March 2018 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}