{
    "url": "https://www.db.com/news/detail/20200320-supervisory-board-recommends-dagmar-valcarcel-sigmar-gabriel-and-theodor-weimer-to-be-elected-at-the-annual-general-meeting?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "March 20, 2020",
    "tags": [
        "Company"
    ],
    "title": "Supervisory Board recommends Dagmar Valcárcel, Sigmar Gabriel and Theodor Weimer to be elected at the Annual General Meeting",
    "body": "The Supervisory Board of Deutsche Bank will submit a proposal to the Annual General Meeting on May 20, 2020 for three candidates to be elected to the Supervisory Board of Deutsche Bank.\nIn addition to Dagmar Valcárcel (53) and Sigmar Gabriel (60), who were already appointed as members of the Supervisory Board by the court in August 2019 and March 2020 respectively, Theodor Weimer (60) will also stand for election by the shareholders. He is to be the successor to Katherine Garrett-Cox (52), who will resign from her mandate at the Annual General Meeting 2020.\n“We very much regret that Katherine Garett-Cox is leaving our Supervisory Board due to her other professional commitments and thank her sincerely for her contribution over the past nine years. My colleagues on the Supervisory Board and I wish her all the best for the future”, said Paul Achleitner, Chairman of the Supervisory Board of Deutsche Bank.\n“At the same time, I am delighted that we are able to propose to the Annual General Meeting that Dagmar Valcárcel, Sigmar Gabriel and Theodor Weimer – three strong and distinctive personalities – be elected to the Supervisory Board. In Theodor Weimer, who will join the Supervisory Board for the first time, we will gain an expert with deep knowledge of the German and European financial industry as well as an outstanding banker.”\nDagmar Valcárcel has worked in the financial sector for 24 years in a variety of roles in a number of countries such as Germany, the UK, Spain, Greece, Switzerland and Luxembourg.\nUntil June 2019, she was the Non-Executive Chair of the Management Board of Andbank Asset Management Luxembourg. Since 2015 she has been a member of the Supervisory Board of amedes Holding, based in Hamburg.\nFrom 2010 until 2017, she held various leading roles in Barclays Bank, among others, as General Counsel for Western Europe and Head of Strategic Resolution for Insurance Operations. She holds a PhD in Law from the University of Bonn and is admitted to the Bar in Germany, the UK and Spain.\nSigmar Gabriel held senior political offices for decades. He was Germany’s Vice Chancellor from December 2013 to March 2018.\nHe was a member of Chancellor Angela Merkel’s cabinet for nine years in total, initially serving as Federal Minister for the Environment, Nature Conservation and Nuclear Safety, then as Federal Minister for Economic Affairs and Energy and lastly as Federal Minister for Foreign Affairs. Gabriel was leader of the Social Democratic Party of Germany from 2009 to 2017.\nPrior to his career at the federal level he was Prime Minister of Lower Saxony from 1999 to 2003. He was also a member of the Board of Supervisory Directors at KfW Group from 2005 to 2009 and one of its alternating chairmen from 2013 to 2017.\nTheodor Weimer has experience in the financial sector and in banking for over 30 years.\nSince January 2018, he has been the Chief Executive Officer of Deutsche Börse, Frankfurt. Between 2007 and 2017 he worked for the UniCredit Group, Milan, and Hypovereinbank / UniCredit Bank AG, Munich, where he was Chief Executive Officer from 2009 until 2017.\nPrior to that he worked at Goldman, Sachs & Co in Frankfurt where he was Partner in the investment bank division between 2004 and 2007.\nBetween 1988 and 2001 he was with the consultancies McKinsey & Co (1988-1995) and Bain & Co (1995-2001).\nHe studied economics, business administration, and geography in Tübingen and St. Gallen and received a doctorate from the University of Bonn.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}