{
    "url": "https://www.db.com/news/detail/20200319-coronavirus-kindness?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "March 19, 2020",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Coronavirus kindness",
    "body": "During times of crisis, a little kindness goes a long way. As part of the bank’s Corporate Social Responsibility In the Community focus, colleagues across Asia Pacific are uniting with communities to help fight the spread of COVID-19.\nActs of kindness\nHong Kong employees are helping feed the homeless by distributing bento box meals prepared by long-term charity partner, Dignity Kitchen. The meals are given to ImpactHK, an organisation supporting homeless people for whom charitable organisations can be a lifeline.\nAs well giving much needed sustenance to the individuals receiving the meals, this arrangement is also helping the charity partners weather the crisis.\nEmployees have also donated and distributed 6,000 face masks to Hong Kong’s vulnerable community.\nWe’re in this together\nWealth Management’s Frederick Fong, who is personally sponsoring a number of the bento boxes given to the homeless in Hong Kong explains: “Small gestures can make a world of difference, not only practically but also as a reminder of the generosity of the human spirit. Fighting this virus is a collective effort – we’re all in this together.”\nLast month the bank in China pledged 1 million yuan (around 130,000 euros) to the China Charity Federation, an organisation providing critical medical supplies to hospitals and to protect front-line medical staff from the virus.\nThe donation is being used to distribute protective and surgical masks, disposable protective clothing and medical goggles to medical staff and volunteers and to fund prevention and control programmes in the Hubei Province and other affected cities in China.\nFeeding the front line\n16,000 miles away in Singapore, we are sponsoring 800 meals for doctors, nurses and medical support staff working at Singapore’s largest hospital.\nStaff are preparing hand-made thank you cards to go along with the bento boxes. “Our healthcare workers are going above and beyond to keep everyone safe; their efforts mean a lot to people,” said Annie Yeo, APAC Head of CSR. Dignity Kitchen, a social enterprise where 80 percent of the staff are disabled, is again producing the meals.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}