{
    "url": "https://www.db.com/news/detail/20200318-deutsche-bank-economists-forecast-severe-recession-due-to-covid-19?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "March 18, 2020",
    "tags": [
        "Research"
    ],
    "title": "Deutsche Bank Economists forecast \"severe recession\" due to Covid-19",
    "body": "Covid-19 has become a pandemic and spread further and more rapidly than was generally expected several weeks ago. There’s now early evidence of the negative economic impact on China and it has been far in excess of initial projections. This, among other factors, including more widespread and draconian containment measures to deal with the spread, the emergence of strain in credit markets, and sharp tightening of financial conditions have caused Deutsche Bank Research to revise down substantially their global growth forecasts in the first half of the year.\nDeutsche Bank’s team of Global Economists led by Peter Hooper, Global Head of Economic Research, now see a severe global recession occurring in the first half of 2020, with aggregate demand plunging in China in the first quarter by about 32% and in the Euro Area and US in the second quarter, by 24% and 13%, respectively. The quarterly declines in GDP growth they anticipate substantially exceed anything previously recorded going back to at least World War II.\nThe team points out that the crisis has also engendered unprecedented policy responses. The Fed and ECB, already relatively low on ammunition, have gone pretty much all out in their responses. The Fed has moved rates to zero in short order, and both have injected tremendous amounts of liquidity into money and credit markets in an effort to diminish the prospects for another major financial crisis.\nThe fiscal response could turn out to be huge, with serious discussion in the US of stimulus packages amounting to 6% of GDP on top of already significant automatic stabilizers. In Europe, the fiscal rules have been effectively suspended and leaders pledge to spend \"whatever it takes\".\nThe report stresses the degree of uncertainty surrounding these projections as the current events are unprecedented. The evolution of the virus is also highly uncertain. Deutsche Bank’s baseline forecast assumes that the severe containment measures being taken will succeed in flattening the epidemic curves by mid-year in the Euro Area and US, and that activity there will begin to bounce back in the third and fourth quarter, supported also by massive policy responses. This baseline view of a \"V\" shaped recovery is based importantly on clear signs that economic activity in China is quickly returning to normal even as the first quarter is drawing to a close.\nIt is easy to imagine a still worse outcome though. The virus could prove more difficult to contain in the US and Euro Area than it was in China. Stress in financial markets could also trigger sharper and more protracted declines in activity. But the team takes some heart in the commitment of political leadership to do what it takes to slow the spread and ease financial tensions, as well as in the relatively sound condition of the global economy and banking sectors when the epidemic started.\nDeutsche Bank Research clients can find the full report on our Research portal.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}