{
    "url": "https://www.db.com/news/detail/20200310-deutsche-bank-india-s-tradepay-app-wins-banktech-award?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "March 10, 2020",
    "tags": [
        "Awards",
        "Company",
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Deutsche Bank India's TradePay app wins BankTech Award",
    "body": "Deutsche Bank India has won the BankTech Award for its TradePay application at this year’s BFSI Summit and Awards. The “Best Use of IT – Payment Systems” award was presented at a ceremony in Mumbai on February 27, 2020 and recognised the application’s innovative solution that reduces the turn-around time for banking processes for importers and exporters.\nDeutsche Bank was the only foreign bank to receive an award in the BankTech category, which was instituted this year.\nAnand Jha, Deutsche Bank’s Head of Trade Finance India says: “The pace of digitalization is gaining momentum in India and we are delighted to be a part of this journey. TradePay meets the requirements of clients and regulators by reducing the time taken for cross-border trade and makes it easier to do business.”\nTradePay was launched at the end of 2017. Using the web portal, Deutsche Bank clients can share information and documents related to imports and exports electronically. The end-to-end workflow is thus digitized and does away with the need to maintain a lengthy paper trail. The bank ensures the veracity of the documents and registers them, as required by the government. Any discrepancies identified by the bank can be rectified by the client in the system itself.\n“Owing to the digital workflow, we are now able to complete the entire review and approval process within just a couple of days – something that would take up to 15 days in the past,” says Umang Agarwal, Trade Finance Product Manager at Deutsche Bank, who was also involved in designing TradePay.\nThe system reduces complexities and delays in the supply chain, enhances controls and transparency of payments and increases the speed of settlement, while also ensuring regulatory requirements are adhered to.",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 4
}