{
    "url": "https://www.db.com/news/detail/20210129-deutsche-bank-sets-customer-service-benchmark-in-spain?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 29, 2021",
    "tags": [
        "Private products"
    ],
    "title": "Deutsche Bank sets customer service benchmark in Spain",
    "body": "Deutsche Bank has been recognised for providing the best service quality for customers in Spain for the sixth consecutive year by Spanish independent consultant “Stiga” in their annual Sectorial Objective Quality Study (EQUOS).\nThe study, which utilises “mystery shoppers” to test various aspects of customer service in the Spanish banking sector, this year developed its results via 3,681 unique branch visits across 14 financial institutions.\nDeutsche Bank Spain achieved a benchmark score of 8.62 out of 10, well ahead of its competitors.\nFernando Sousa, Head of the International Private Bank in Spain said, “This achievement is testament to the efforts of our employees across our branch network. Our colleagues overcame enormous challenges presented by the COVID-19 pandemic, maintaining an exceptional level of customer service across the country.\nHe added, “We are very proud of this achievement, especially given the unique challenges of the past year. Our business has maintained a unique, market-leading quality of service of which we can all be very proud.”\nDeutsche Bank’s survey ranking demonstrates a strategic commitment to high quality customer service. The bank has been a leader in Spanish service quality ten times in the last twelve years.\n“For us, it is important to be number one in aspects that we consider key for the “future of banking” model. Time dedicated to clients, kindness, interest and product clarity are all important aspects at which we excel. Our bank offers an added service to clients which is reflected in our ratings”, Fernando said.",
    "number_of_ratings": 2,
    "rating": 1.5,
    "likes": 9
}