{
    "url": "https://www.db.com/news/detail/20210129-helping-set-best-practice-in-environmental-risk-management-for-singapore-s-financial-services-sector?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "Singapore, January 29, 2021",
    "tags": [
        "Sustainability"
    ],
    "title": "Helping set best practice in environmental risk management for Singapore’s financial services sector",
    "body": "The Monetary Authority of Singapore (MAS) today published its Environmental Risk Management Handbook for the financial services sector, driven by its Green Finance Industry Taskforce of which Deutsche Bank is a member.\nAs an active member of the MAS Green Finance working group to enhance Financial Institutions’ environmental risk management practices, Deutsche Bank was one of the authors for the MAS Environmental Risk Management handbook.\nDeutsche Bank Director, Risk Management, Bhavesh Gokani said: “We are pleased to support the development of Singapore’s green finance ecosystem by sharing our global bank’s industry leading practices and insight.”  \nThe MAS Environmental Risk Management handbook is a ‘best practice’ guide for the financial services sector in Singapore.\nThe publication offers a set of environmental risk management guidelines for banks, asset managers and insurers, outlining MAS’ expectations to the sector in governance and strategy, risk management practices, and disclosure of environmental risk information.\n“The Environmental Risk Management handbook draws on best practices and has been written by the industry, for the industry, given financial institutions are encouraged to integrate environmental risks into their financial and non-financial risks assessment,” Gokani added. \nSingapore, which contributes 0.11% of global carbon emissions, is actively transitioning its economy for a low carbon world, with the MAS steering the financial services sector.\nThe MAS Green Finance Industry Taskforce, consisting of four industry work streams, aims to: a) establish Singapore as the premier financial hub for green finance in Asia; b) leverage green finance as one of the key approaches to achieving Singapore’s green agenda; and c) identify best practices needed to develop the green finance ecosystem in Singapore.\nSingapore targets to peak emissions at 65MtCO2e around 2030, and aspires to halve emissions from its peak to 33MtCO2e by 2050, with a view to achieving net zero emissions as soon as viable in the second half of the century.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 3
}