{
    "url": "https://www.db.com/news/detail/20210730-deutsche-bank-results-of-2021-eba-stress-test?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 30, 2021",
    "tags": [
        "Corporate products"
    ],
    "title": "Deutsche Bank: Results of 2021 EBA stress test",
    "body": "In the EU-wide stress test conducted by the European Banking Authority (EBA), Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) met the minimum supervisory requirements in both ‘baseline’ and ‘adverse’ scenarios across all three years covered by the exercise.\nIn the baseline scenario, Deutsche Bank’s CET 1 ratio would remain at least 13.6%, a buffer of 321 basis points above a supervisory requirement of 10.4%. In the adverse scenario, which is more severe than in previous EBA stress tests, Deutsche Bank's Common Equity Tier 1 (CET 1) capital ratio would decline to 7.6%, 165 basis points above supervisory minimum requirements of 5.9%.\n“Even in this year’s more severe adverse scenario, Deutsche Bank proves its resilience in the face of potential challenging conditions. This underscores the strengthening of our risk profile and the benefits of disciplined execution of our transformation strategy,” said Chief Financial Officer James von Moltke. “This outcome is all the more encouraging because the strong profit growth we delivered in the first half of 2021 is not reflected in this exercise.”\nThe stress test uses a common scenario definition and methodology for participating banks based on the balance sheet as of December 31, 2020. Accordingly, business strategies adopted and management measures implemented after that date are not reflected in the results. In the first six months of 2021, Deutsche Bank produced a profit before tax of € 2.8 billion and a net profit of € 1.9 billion, its best first half result since 2015.\nThe adverse scenario of the 2021 stress test is significantly more severe than in previous exercises and implies four consecutive years of EU-wide recession. From year-end 2020, after a 6.9% contraction in EU gross domestic product (GDP) during that year, the 2021 adverse scenario assumes further contraction of 3.6% in total over its three-year time horizon. This compares to a cumulative three-year contraction of 2.7% in the adverse scenario of the 2018 stress test, after growth of 2.4% in 2017. This implies a cumulative, four-year GDP contraction of 10.3% in the 2021 stress test, versus a four-year decline of only 0.4% in the 2018 exercise.\nDespite this significantly more severe adverse scenario, Deutsche Bank’s CET 1 capital ratio depletion would increase by only 20 basis points versus the 2018 stress test. This relatively modest increase reflects improvements in the bank’s risk profile, including progress achieved in its transformation strategy.\nAs in prior stress tests, the absolute amount of CET 1 ratio depletion remains impacted not only by the severity of the adverse scenario but also methodological constraints, such as constraints on modelling provisions for defaulted loans, market liquidity and model reserves and securitizations.\nDeutsche Bank’s results in detail were as follows (all ratios in %):\nBaseline scenario\nSupervisory\nrequirement [1]  2021 2022 2023\nCET1 Ratio 10.43 13.78 13.91 13.64\nTier 1 Ratio 12.40 15.83 15.62 15.35\nTotal Capital Ratio 15.02 17.91 17.94 17.66\nLeverage Ratio transitional[2] 3.00 4.88 4.85 4.78\nAdverse scenario\nSupervisory minimum\nrequirement[3] 2021 2022 2023\nCET1 Ratio 5.91 8.91 8.47 7.56\nTier 1 Ratio 7.88 10.77 10.01 9.09\nTotal Capital Ratio 10.50 12.81 12.12 11.20\nLeverage Ratio transitional[2] 3.00 3.67 3.47 3.16\nRegulatory minimum requirement plus Pillar 2 requirement plus combined buffer requirement\nLeverage exposure per 31 Dec 2020 remains unchanged over the stress test horizon per EBA Methodological Note and thus excludes certain central bank balances as per the ECB decisions of 17 Sep 2020\nRegulatory minimum requirement plus Pillar 2 requirement",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 43
}