{
    "url": "https://www.db.com/news/detail/20210728-a-message-from-christian-sewing-on-q2-results-2021?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 28, 2021",
    "tags": [
        "Corporate products",
        "Financial Results",
        "Investment Banking",
        "Strategy"
    ],
    "title": "A message from Christian Sewing on Q2 results 2021",
    "body": "Dear Colleagues,\nI am very pleased that we have completed another quarter in which we made a pre-tax profit of more than 1 billion euros and gained market share in key business segments. What is also important is that these numbers are underpinned by many facts and anecdotal evidence which reassure us that we are on the right track.\nThe first of these is that we are the No. 1 bank for corporate clients in Germany again, a position we have not held for five years. Finance Magazin’s highly regarded survey of 200 chief financial officers of domestic and foreign companies ranked us first. This is a major success not only for our Corporate Bank, but also for our Origination & Advisory business, as we are also the No. 1 in Germany in corporate finance for the first half of the year. So in our home market, we are finally back to where we believe we should be.\nI am also proud of our successes in sustainability. Only 13 months after announcing our target of 200 billion euros in sustainable finance and investments by 2023 we are already halfway towards reaching our goal.\nThis shows what our bank is able to deliver when we focus on an important strategic topic.\nAnd what is not reflected in the second-quarter numbers, but is also one of the standards we set ourselves, is that we stand shoulder to shoulder with people who have been hit hard by the extreme weather events, especially in Germany, by making donations of more than 900,000 euros in total, supporting affected clients as much as possible and offering special loan programmes with a volume of 300 million euros. Here our Private Bank and our Corporate Bank have done a great job and demonstrated how we are also part of the solution in this crisis.\nWe have acted in this spirit elsewhere, too. Our global #NotAlone campaign supports young people experiencing mental health difficulties due to the Covid-19 pandemic. About 10,000 employees around the world have so far contributed to this cause. In addition, we have donated 2.5 million euros to support the fight against Covid in India. We would like to thank everyone who made these campaigns possible and gave their support.\nThese achievements, just a snapshot of what we have accomplished, are an important endorsement of our path. They show that the right strategy and hard work do pay off. And we are where we want to be, at the centre of society. This is precisely the path we intend to continue to follow rigorously.\nLet me now highlight some figures for the past quarter. With a pre-tax profit of 1.2 billion euros, we were able to continue the success of the previous quarter. This translates to a profit after tax of 828 million euros. So we reported our best second quarter and best first half year since 2015. In the second quarter we achieved a return on tangible equity of 5.5 percent for the Group, and almost 8 percent in the Core Bank.\nAs in the first quarter, all our core business divisions were more profitable than one year ago, and the Capital Release Unit managed to cut its losses by more than half. Revenues fell by only 1 percent compared to the exceptionally good prior year quarter, which bolsters our conviction that a substantial portion of the revenue growth of the last two years is proving to be sustainable. All four divisions provide grounds for optimism:\nThe Private Bank can look back on a very successful quarter, both in Germany and internationally. Its revenues increased by 3 percent and were up by 8 percent if adjusted for the impact of the decision of the German Federal Court relating to pricing changes. We continue to grow our client business faster than planned: the Private Bank granted a net new loan volume of 4 billion euros and achieved 7 billion euros in investment product inflows – this means that we have already achieved a substantial part of the business growth targets for 2021 after just six months. \nIn the Corporate Bank revenues were stable, stripping out episodic items which we benefited from in the corresponding quarter last year. So we continue to successfully counter interest-rate headwinds by adjusting our pricing model and driving business growth. We continue to invest in growth areas such as payments, for example with the partnership with payments expert Fiserv.\nThe market environment for our Investment Bank has normalised, which impacted several areas of our Fixed Income & Currencies (FIC) business as well as investment grade debt issuance. We were, however, able to largely offset this via growth in credit trading, financing and our advisory business. We once again outperformed relevant peers in FIC sales and trading, whilst we gained market share year on year in a number of our Origination & Advisory businesses. In FX, we improved our ranking in Euromoney’s 2021 FX Survey to regain our top 3 position globally.\nDWS has booked net inflows for five quarters in succession and during the past quarter our Asset Management business even achieved a record volume of 20 billion euros. This helped boost the assets under management to 859 billion euros, also a new record high. This is showing up on the revenue side: our Asset Management division’s revenues rose by 14 percent year on year.\nWe achieved all of this while managing our risk conservatively, which is reflected in credit loss provisions of just 75 million euros in the quarter, down 90 percent year on year. We have a solid Common Equity Tier 1 ratio of 13.2 percent.\nNow it is crucial that we continue to implement our transformation programme in a disciplined manner. A number of external developments are weighing on us, such as bank levies and unexpected higher contributions to the deposit protection scheme. We will not reduce our planned investments to offset the additional 400 million euros that these effects will likely cost us in the coming year, which is in line with what we announced at the Investor Deep Dive in December.\nDespite all our ongoing cost discipline, we do not think it makes sense to cap investments because of unexpected externally driven expenditures. At the same time, however, we need to keep on top of all the expense factors that we can influence.\nIn the second quarter, we demonstrated our ability to do just that by once again reducing our adjusted costs excluding transformation-related charges year on year. We will rigorously continue on this path. With our transformation significantly advanced, we will focus on achieving a cost/income ratio of 70 percent going forward. This more accurately reflects the sustainable margin which we are targeting than the absolute cost targets we set and achieved in previous years.\nReaching a cost/income ratio of 70 percent will also be the key lever to get to our primary objective for 2022: increasing our return on tangible equity to 8 percent in 2022. We reaffirmed both of these target ratios today. Given the positive developments in both revenues and credit risk they are within reach, as long as we keep our cost discipline.\nWe have already achieved a great deal in the transformation of our bank. However, it is a little like a marathon: the 30-kilometre (19-mile) mark is where it starts to really hurt. But we also know that it is worth pushing on. The progress we have made is thanks to your outstanding dedication and your discipline. We continue to count on you. We have already completed a large part of the way to 2022. Let’s complete the remaining journey just as successfully. \nBest wishes,\n\nChristian Sewing",
    "number_of_ratings": 3,
    "rating": 2.0,
    "likes": 36
}