{
    "url": "https://www.db.com/news/detail/20210720-deutsche-bank-und-postbank-starten-hilfsprogramm-ueber-300-millionen-euro-fuer-betroffene-der-hochwasserkatastrophe?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, July 20, 2021",
    "tags": [
        "Germany",
        "Corporate Citizenship",
        "Corporate products",
        "Digital banking & services"
    ],
    "title": "Deutsche Bank and Postbank launch EUR 300 million relief programme for flooding disaster victims",
    "body": "For businesses and the self-employed: Special loan programme with a volume of EUR 100 million\n\nFor private individuals: Special loan programme with a volume of EUR 200 million\n\nEmployees, Deutsche Bank Foundation and Deutsche Bank have donated more than EUR 850,000 to the German Red Cross thus far\nDeutsche Bank and Postbank are launching an extensive relief programme for individuals and businesses affected by the flooding disaster in Germany. The programme includes EUR 100 million of virtually interest-free special loans to businesses. Up to EUR 200 million of virtually interest-free loans are being made available to private individuals via Deutsche Bank and Postbank branches. An annual interest rate of 0.01 percent applies to all programmes.\n“Right now rapid relief with no red tape is what is needed”, said Karl von Rohr, President of Deutsche Bank[VB1] . “Deutsche Bank is using its national network to get the funds to households and businesses as soon as possible.”\nAid to businesses\nThe special loans totalling EUR 100 million for businesses and the self-employed are intended for the swift restoration and repair of destroyed or damaged business premises and production facilities, and the procurement of machinery and other necessary equipment. Deutsche Bank and Postbank commercial and corporate clients can apply for a special loan of up to EUR 150,000 on simplified terms and conditions for a term of up to eight years. Enquiries from people affected by the disaster about loans that do not fall under the special programme will also be given priority and processed without red tape.\nDeutsche Bank experts will also accept applications for German federal and state development bank aid programmes.\nAssistance to private individuals\nVia its three brands: Deutsche Bank, Postbank and BHW, Deutsche Bank is offering private individuals home loans for rebuilding purposes from funds totalling EUR 150 million. The maximum loan amount is EUR 150,000 for a fixed interest rate period of 10 years. Early redemption and repayment can be made free of charge at any time.\nDeutsche Bank is offering funds totalling EUR 50 million for personal loans under its aid programme. The term for such loans is 60 months. Postbank customers are also eligible.\n  All programmes apply to businesses and private individuals affected by the flooding disaster in Germany, subject to the credit check required by law.\nIn addition, Deutsche Bank Foundation is supporting the German Red Cross’ relief efforts in Germany's flooded regions with a donation of EUR 250,000 on top of the EUR 500,000 Deutsche Bank donated for deployments to flood zones in Germany, the Netherlands, Belgium and Luxembourg. And bank employees in Germany have now made donations totalling more than EUR 100,000 which are also earmarked for the German Red Cross.\n“I am very pleased about the generous donations from Deutsche Bank and Deutsche Bank Foundation,” said Christian Reuter, Secretary General and Chairman of the Board of the German Red Cross. “We are grateful that we can count on our longstanding partners in this emergency. Many people have lost nearly everything. For that reason, it is important that we help them quickly and without delay. The German Red Cross has deployed some 3,500 volunteers. The donations from the company, the foundation and their committed employees now enable us to offer these people even faster and extensive assistance.”\nFor further information, contact:\nDeutsche Bank AG\nCommunications                                        \nHeinrich Frömsdorf                                                           \nE-mail: heinrich.froemsdorf@db.com                                                   \n   About Deutsche Bank\nDeutsche Bank offers a variety of financial services, from payment services and lending through investment advice and asset management, to a focussed capital market business. It provides services to private clients, small and medium-sized enterprises, corporate groups, public sector bodies and institutional investors. Deutsche Bank is the leading German bank with strong European roots and a global network.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 39
}