{
    "url": "https://www.db.com/news/detail/20210719-export-import-bank-of-korea-signs-usd-30m-credit-facility-with-deutsche-bank-entering-digital-supply-chain-market?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 19, 2021",
    "tags": [
        "Asia-Pacific",
        "Capital markets"
    ],
    "title": "Export-Import Bank of Korea signs USD 30m credit facility with Deutsche Bank, entering digital supply chain market",
    "body": "The Export-Import Bank of Korea (KEXIM) and Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) announced today a USD 30m revolving credit facility supporting the competitiveness of the Korean export apparel industry.\nAs a part of this facility, KEXIM will acquire the export receivables of Korean apparel exporters generated from the supply of clothing to Gap Inc. (NYSE: GPS) from Deutsche Bank, GPS’s key trade finance bank. This collaboration will greatly benefit Korea’s apparel industry suppliers by supporting financing liquidity and reducing their cost of financing. Furthermore, as the entire digital supply chain finance process is paperless between suppliers, their buyers, and the financial institutions supporting them, operations are made more efficient with shortened processing times.\nThis marks the first time that KEXIM is entering the digital supply chain market. Going forward, KEXIM plans to support digital supply chain finance in earnest in order to help smooth operations for Korean suppliers and boost competitiveness for Korean industry.\nDeutsche Bank APAC Head of Corporate Bank and Fixed Income & Currencies David Lynne said, “As a global leader in supply chain finance, finding new ways to make cross-border trade easier and more efficient for our clients is core to our business. Collaborating with KEXIM on this groundbreaking solution, a first of its kind for an export credit agency, is a prime example of how we can support buyers with a more diversified pool of suppliers and help suppliers optimize their cash flows. Innovative approaches like these strengthen domestic industries and global supply chains simultaneously.”\n“We are delighted to be entering the financial supply chain market, and to be partnering with Deutsche Bank, an undisputed leader in this space. Healthy, efficient financial supply chains are crucial to the strength of the Korean export sector. We are keen to play a constructive role in supporting Korean exporters, directly and indirectly, in the financial supply chain and will increasingly explore opportunities to do so,” said Lee Jae-hong, Director General, Trade Finance Department, The Export-Import Bank of Korea.\nFor further information please contact:\nDeutsche Bank AG                                       \nMedia Relations                                           \nAmy Chang\nPhone: +852 2203 8434\nEmail: amy.chang@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 3
}