{
    "url": "https://www.db.com/news/detail/20210716-notalone-staff-in-philippines-kick-off-the-steps-challenge-in-apac?language_id=1",
    "language": "DE",
    "article_type": "Nachricht News",
    "publish_date": "July 16, 2021",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "#NotAlone: Staff in Philippines kick off the steps challenge in APAC",
    "body": "Around the APAC region, staff are stepping up to support the global CSR #NotAlone campaign.\nIn the Philippines, COVID-19 cases remain high, and there is growing anxiety amongst parents and students about the academic workload, financial instability, and health crisis. For children, there is a lack of recreational activities that would have provided relief from stress within their homes. There is also an immense academic strain driven by the sudden shift to virtual learning: adapting to the modern classroom set-up and dealing with the challenges of faulty mobile phones or tablets, slow or intermittent internet connection.\nFamilies and Children for Empowerment and Development (FCED) Foundation, a long-time charity partner of the bank, aims to provide psychosocial enhancement programmes to its student beneficiaries via three avenues: psycho-social development focused seminars, the establishment of recreational hubs in partnership with local leaders and barangays, and by providing a computer and printer to each of the 15 barangays, also known as wards or districts in English.\nIn addition to an initial donation from the bank, staff in Philippines enthusiastically took the steps challenge to help raise more funds. “My heart goes out to the youth who are struggling with stress and depression as they try to cope during this pandemic. That's why I choose to step up for the #NotAlone campaign,” says Charles-Malvin Ching, Chief Operating Officer, Deutsche Bank Group Manila.\nAt the end of the 15-day challenge, staff took a combined total of 43 million steps, raising a EUR 25,000. The initial target of 22.5 million was smashed in the first seven days, and steppers continued enthusiastically to secure more funding for charity. \nFunds will cover the costs of seminar workshops, art materials, reading materials, board games, computers, printers, papers, prepaid Wi-Fi, as well as professional fees for motivational speakers and stipends for the parent leaders who will be assisting in their respective barangays.\nDr. Nenita Cura, chairperson of (FCED) Foundation is grateful for the bank’s ongoing support: “The children are one of the most affected sector in the country today. The reality of poverty and the fear of COVID-19 is gradually affecting their physical and mental health wellbeing. The project will go a long way in their development and transformation.”\nOther countries in the APAC region will start their Stepping-Challenges in the upcoming weeks. Hong Kong and Japan are finishing up their challenges while Sri Lanka and Thailand will be next – find out more on db.com.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}