{
    "url": "https://www.db.com/news/detail/20210714-digital-yuan-what-is-it-and-how-does-it-work?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 14, 2021",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Digital yuan: what is it and how does it work?",
    "body": "China’s answer to the cryptocurrency challenge, the e-CNY central bank digital currency, is set for rapid take-off on its expected launch in 2022. Deutsche Bank’s research team examines the digital currency in detail and provides answers to common questions about e-CNY.\nWhat is e-CNY?\nThe e-CNY, or digital yuan, is a centralized, cash-like digital currency that is expected to be primarily used for retail payments in China. The People’s Bank of China (PBOC), the central bank, and e-CNY operating institutions have conducted large scale e-CNY pilot programs in multiple cities over the past few months.\nWhy did the PBOC introduce e-CNY?\nAccording to Deutsche Bank research, the PBOC's introduction of the e-CNY serves two different but related goals. The first, longer-term goal, is to create a digital currency that can compete with other digital currencies such as bitcoins, stablecoins, and other central banks digital currencies (CBDC), while ensuring that the renminbi continues to be the dominant currency in China. The second, more immediate goal is to reshape China's current payment system by providing a cash-like digital payment method: accessible to all, low cost, anonymous (to a certain extent), and which facilitates competition among payment service providers.\nHow does the e-CNY work?\nThe e-CNY is fully backed by the PBOC and put into operation by payment service providers. It allows greater anonymity and includes better personal information protection, yet still keeps sufficient records for tracing illegal activities such as money laundering and tax evasion.\nThe PBOC chose to define e-CNY as cash in circulation, or as M0 in the language of central banks. Defining e-CNY as M0, rather than M1 or M2, has a number of implications:\nFirstly, e-CNY will be a liability of the PBOC. In China's monetary system, M0 implies direct liability from the PBOC, while M1 and M2 include certain liabilities from commercial banks. This definition means e-CNY will be completely risk free.\nSecondly, the digital wallets that hold e-CNY will not be considered bank accounts. The PBOC's pilot programs so far require only a mobile phone number to have a e-CNY wallet.\nThirdly, no interest can be paid on e-CNY. Interest can be paid on M1 or M2 (bank deposits), but not on M0 (cash). This is important because most digital currencies, including some CBDCs currently being considered, have not ruled out interest payments.\nLastly, only banks can convert e-CNY into bank deposits and vice versa.\nAn important consideration behind the e-CNY's M0 definition is that it is likely to prevent disintermediation of banks. By defining e-CNY as M0 and banning interest payments, the PBOC likely envisages only a limited amount of e-CNY in circulation to replace cash, but not to replace bank deposits.\ne-CNY's two-tiered structure\nThe e-CNY will adopt a two tier structure, according to the PBOC. From an e-CNY user's perspective, though, the system actually has more than two layers (Figure below):\nThe e-CNY structure\n  The PBOC is at the top tier and plays a high-level role. To open an e-CNY account/digital wallet, the user will need to go to one of the tier 2 institutions. Tier 2 institutions so far include the 6 largest state-owned banks, and two internet banks (WeBank and MYBank). This can be done online or offline.\nOnce the e-CNY wallet is set up, the user will be able to enjoy a wide range of services provided, not just by the issuing bank, but also by many other banks and payment service providers. These are called \"tier 2.5\" institutions, which  cannot carry out e-CNY exchanges, but can provide payment and other services to e-CNY holders.\nAt the bottom tier are merchants, corporates and consumers. Peer-to-peer e-CNY transfers are easy to do between consumers, but merchants will likely work with tier 2 or tier 2.5 institutions to set up infrastructure for receiving e-CNY payments online and offline.\nUnder this structure, the PBOC delegates most responsibilities to the tier 2 institutions. Tier 2 institutions will provide customer service and protect customer privacy, exercise KYC duties, and invest in the hard and soft infrastructure for retail e-CNY use. This will be costly for tier 2 institutions but will be welcomed nonetheless because they will get the opportunity to enter the payment business, which is otherwise dominated by internet companies.\nControlled anonymity: a new era of privacy protection?\nThe PBOC describes e-CNY's privacy protection capabilities as \"controllable anonymity\". What does that mean? According to China Chief Economist, Yi Xiong, the e-CNY gives its users the option to hide their identity from counterparties, while allowing law enforcement (rather than individual government units) to have the ability to trace illegal transactions. e-CNY's anonymity feature will make it more difficult for online platforms to collect user information.\nImplications: What will happen with the e-CNY roll-out?\nThe e-CNY will likely be officially rolled out in 2022 after the Winter Olympics, if not sooner. Recent e-CNY pilot programs are already quite advanced in application.\n“The e-CNY will likely bring substantial changes to China's digital payment sector. It offers an entry point for China's big banks to break into a business segment that is currently dominated by big tech firms,” said Xiong. \nHe added that the e-CNY is expected to bring China's digital privacy protection into a new era, but the impact on monetary policy transmission will likely be small at least in the near term.\n A successful e-CNY roll-out could also accelerate the pace of currency digitalization globally. If the e-CNY becomes widely used in China, other central banks will likely see it as both proof of the feasibility of CBDCs and a sign of increased competition, leading them to redouble their efforts in developing their own digital currencies.\nThe development of digital yuan: a timeline",
    "number_of_ratings": 33,
    "rating": 4.7,
    "likes": 78
}