{
    "url": "https://www.db.com/news/detail/20210707-deutsche-bank-regains-top-3-ranking-in-euromoney-fx-survey?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 7, 2021",
    "tags": [
        "Awards",
        "Investment Banking"
    ],
    "title": "Deutsche Bank regains top-3 ranking in Euromoney FX Survey",
    "body": "Deutsche Bank rose from No 4 to No 3 in the Overall Market Share category in Euromoney’s 2021 Foreign Exchange Survey which was published today.\nDeutsche Bank ranked No 1 globally in the survey, the largest in the industry, when short dated swaps are included, up from second place last year.\n“This year, we have gained market share despite challenging conditions market-wide because of the outstanding commitment to excellent client service from everybody in this team,” said Russell LaScala, Global Head of FX at Deutsche Bank.\nThese remarkable results reflect a strong performance from Deutsche Bank across the board. Deutsche Bank rose up the rankings or maintained its position in first place in 13 out of 63 individual categories compared with 10 categories last year.\nIn total, Deutsche Bank improved in 34 individual categories compared with 2020.  \nOf particular importance, Deutsche Bank ranked first in:\nOptions market share, maintaining its top place finish in 2020 with market share of 27.38%\nSwaps market share, including short-dated swaps, maintaining its top place finish in 2020 with market share of 15.27%\nElectronic FX market share, including unadjusted swaps, up from second place in 2020 with market share of 12.19%\nBanks market share, maintaining its top place finish in 2020 with market share of 13.73%\nDeutsche Bank ranked first in options and swaps, including short-dated swaps, market share which is testament to the commitment of the FX franchise, which has this year worked hard to remain flexible to the needs of  clients in difficult conditions for global markets.\n“We have put in enormous effort to ensure that derivatives is an area in which we are world-leading and I believe we can remain a leader there in years to come,” comments LaScala.\nElectronic trading has been a long-term strategic priority at Deutsche Bank and placing first in electronic FX market share, including short-dated swaps, is a reflection of Deutsche Bank’s commitment in this area.\n“Deutsche Bank has made a significant investment in electronic FX trading to ensure we have a compelling offer that differentiates us from competitors and provides a strong foundation for future success,” said LaScala.\nThe Euromoney FX Survey is one of the most in depth quantitative and qualitative annual studies available on the FX markets. This year’s Euromoney survey canvased the views of over 2,000 market participants, including treasurers, traders and investors worldwide, who rate the banks they use to conduct their currency transactions in terms of both transaction volumes and quality of service.",
    "number_of_ratings": 2,
    "rating": 1.0,
    "likes": 24
}