{
    "url": "https://www.db.com/news/detail/20241120-deutsche-bank-beteiligt-sich-an-aleph-alpha?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 20, 2024",
    "tags": [
        "Digitalisation"
    ],
    "title": "Deutsche Bank invests in Aleph Alpha",
    "body": "The bank’s Corporate Venture Capital (CVC) group has invested in German AI company Aleph Alpha, which researches, develops and implements transformative AI such as large AI language and multimodal models\n\"We are delighted to support Aleph Alpha in advancing their AI solutions through our investment,\" said Bernd Leukert, Chief Technology, Data and Innovation Officer at Deutsche Bank. \"Aleph Alpha's focus on sovereign and explainable AI solutions opens a wide range of opportunities for the highly regulated financial industry to harness the potential of artificial intelligence responsibly and securely.\"\nThrough this strategic investment, Aleph Alpha will benefit not only from the capital investment but also from Deutsche Bank’s deep industry knowledge and extensive network.\nDeutsche Bank is also participating in a pilot project by Creance.ai, a joint venture between PwC Germany and Aleph Alpha. The project aims to explore how innovative generative AI (GenAI) can help manage complex compliance requirements more efficiently.\nThe project is using a specialised AI solution to validate contracts with Information and Communication Technology (ICT) service providers in light of the new EU regulation DORA (Digital Operational Resilience Act). This new regulation aims to harmonise the rules for operational resilience in the financial sector.\nThe Corporate Venture Capital programme is a core element of the bank's innovation agenda. It focuses on strategic venture capital investments in startups that leverage technology to either support and enable innovative services or increase the productivity of processes. The bank invests capital, expertise, and resources into the growth and success of its partners.",
    "number_of_ratings": 10,
    "rating": 4.1,
    "likes": 11
}