{
    "url": "https://www.db.com/news/detail/20241113-deutsche-bank-and-the-berliner-philharmoniker-extend-partnership-until-2030?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, November 13, 2024",
    "tags": [
        "Culture",
        "Education"
    ],
    "title": "Deutsche Bank and the Berliner Philharmoniker extend partnership until 2030",
    "body": "For the past 35 years, the two partners have pursued the shared goal of inspiring people worldwide through music, enabling cultural participation, and advancing innovative ideas. A milestone of this collaboration was the launch of the award-winning Education Program in 2002. This program introduces people of all ages and backgrounds to classical music, inspiring them to discover their creative potential and strengthening social cohesion. In 2009, Deutsche Bank also enabled the development of the Berliner Philharmoniker’s groundbreaking streaming platform, the Digital Concert Hall.\nThe unique strength of this partnership is also evident in the orchestra’s global performances, which the bank leverages for client events—involving members of the orchestra—and for the promotion of musical talent. During the Berliner Philharmoniker’s tours in Asia, the US, and Europe, masterclasses, musical visits to social institutions, and school concerts are organized. Large-scale projects, such as the recent BePhil Orchestra in Japan, where amateur musicians perform alongside the Berliner Philharmoniker under the leadership of its chief conductor, are also a vital part of the collaboration.\nChristian Sewing, CEO of Deutsche Bank, emphasised: “We are proud to continue this unique partnership. No other company has supported a world-class orchestra for as long or at this level—spanning all continents, in line with both organisations’ global commitment. Our partnership symbolises what we strive to offer our clients: reliability and the highest quality, in Germany and worldwide.”\nAndrea Zietzschmann, General Manager of the Berliner Philharmoniker, said: “Reliable partners are especially important in these times. We are even more pleased to have Deutsche Bank by our side in the future. We are aware that this level of support is unparalleled in private cultural sponsorship. Our sincere thanks go to Deutsche Bank, which has enabled us to realise groundbreaking projects, particularly our Education Program. Through this, we meet our aim not only to set artistic standards but also to demonstrate our social commitment.”\nChief Conductor Kirill Petrenko added: “I am deeply grateful that the partnership with Deutsche Bank has been extended for another five years. The Education Program is particularly close to my heart. It is now an essential part of our identity as an orchestra to inspire people from diverse backgrounds through music, especially allowing families to experience our concerts. I am very pleased that we can continue on this path with the support of Deutsche Bank.”",
    "number_of_ratings": 5,
    "rating": 5.0,
    "likes": 5
}