{
    "url": "https://www.db.com/news/detail/20241108-deutsche-bank-named-best-private-bank-for-entrepreneurs-and-best-private-bank-in-germany?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 8, 2024",
    "tags": [
        "Awards"
    ],
    "title": "Deutsche Bank named Best Private Bank for Entrepreneurs and Best Private Bank in Germany",
    "body": "Professional Wealth Management (PWM), the highly respected media title from the Financial Times group, has named Deutsche Bank the “Best Private Bank for Entrepreneurs” globally and “Best Private Bank in Germany” at the PWM / The Banker Global Private Banking Awards 2024.\n\nThese awards recognise the Private Bank’s transformation.\n\nHead of Private Bank Claudio de Sanctis said: “Winning ‘Best Private Bank for Entrepreneurs’ globally, and having our German wealth business recognised as the market leader for the third consecutive year, is testament to the hard work and dedication of our many teams who are building a world-class franchise and European leader.”\n\nIn Europe, the Private Bank has built a market-leading franchise serving entrepreneurs and their families, most particularly in Belgium, Italy and Spain.\n\nIn Italy and Spain, the franchise has successfully integrated Business Banking coverage for small- to mid-caps. This integrated approach ensures that the Private Bank can provide even more tailored support to entrepreneurs.\nHead of Private Bank Italy, Spain and Belgium, Iñigo Martos, said: \"Deutsche Bank’s tailored products and services meet diverse client needs through our Bank for Entrepreneurs lens. We provide holistic, high-quality service to entrepreneurial families, focusing on both their personal and business wealth. As a result, a significant part of our new business comes from synergies generated by the Bank for Entrepreneurs in key growth regions.”\nIn Germany, the bank has established a dedicated UHNW coverage unit to cater to the specific needs of large entrepreneurial clients.\n\nCommenting on the Germany award, Head of Wealth Management & Private Banking Germany, Raffael Gasser, said: \" The award is a great appreciation for the exceptionally strong performance of our team in times of high volatility. It is a motivation for us to continue to do the best for our clients in the future, while we continue to invest in the private banking, wealth management and UHNW proposition. \"\n\nThe awards were announced overnight in London at the PWM awards ceremony, which concluded the PWM Global Wealth Management Summit 2024.\n\nDeutsche Bank’s Private Bank is the Eurozone’s largest private bank, serving more than 20 million clients globally. Its Wealth Management and Private Banking businesses span 60 markets and 12 booking centres globally.",
    "number_of_ratings": 7,
    "rating": 4.6,
    "likes": 2
}