{
    "url": "https://www.db.com/news/detail/20241106-deutsche-bank-invests-EUR571-million-in-india-growth-strategy?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 6, 2024",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank invests in India growth strategy with EUR 571m capital increase",
    "body": "Deutsche Bank has infused capital in its India branch operations of INR 5,113 crore (€571 million) to fund its growth plans in the country. The above, along with retained earnings and other statutory components, increases the regulatory capital of Deutsche Bank AG India branches, to nearly INR 30,000 crores, a jump of 33% over 2023 levels.\nCapitalizing on India's growth trajectory\nWith India at the forefront of global investment, Deutsche Bank is committed to supporting the country’s growth, particularly in areas such as digital transformation, sustainable finance, technology, and infrastructure development.\nOver the last decade, the bank has significantly increased its capital investments, tripling the capital base for Deutsche Bank Group in India. The steady capital infusion into India reflects the bank’s strong commitment to growing its business in the country and further strengthening the capital adequacy ratio of Deutsche Bank’s India branches.\nDeutsche Bank CEO of Asia Pacific, Europe, Middle East & Africa (EMEA) and Germany and Member of the Management Board, Alexander von zur Muehlen said: “India is well positioned to benefit substantially from many of today’s most important trends – reshaped supply chains, digitization of industries, increased geopolitical frictions, global demographic changes, among others. Consequently, we see enormous potential for our deeply integrated, well diversified business in India.\nWe have boosted our capital allocation in India to enable our expansion and further deepen our presence in this critical growth market.  \nAlexander von zur Muehlen\n“This incremental capital into our India franchise is a strong validation of confidence in our business model and potential in this country. As a Global Hausbank, we continue to see opportunities for us to work ever more closely with our clients, to support them with best-in-class services and advice,” added Kaushik Shaparia, CEO, Deutsche Bank Group, India.\nThis capital will be used to support the further expansion of Deutsche Bank India across its businesses. The bank's franchise in the country includes Corporate Banking, Investment Banking, and Private Banking and has been consistently growing over the years. \nThe capital increase applies only to Deutsche Bank’s local India branches and excludes other entities operating in the country. This is the largest capital allocation the bank has made into India in recent years.\nDeutsche Bank has been present in India for nearly 45 years. Since then, it has grown to become one of the largest international banks in the country with a balance sheet size of INR 1,45, 235 crores as of 31 March 2024.\nFor further information, please contact:\nDeeptha Rajkumar\nPhone: +91 9819803395\nE-Mail: deeptha.rajkumar@db.com",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 8
}