{
    "url": "https://www.db.com/news/detail/20211105-deutsche-bank-named-best-private-bank-in-germany?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 5, 2021",
    "tags": [
        "Awards",
        "Private products"
    ],
    "title": "Deutsche Bank named Best Private Bank in Germany",
    "body": "Deutsche Bank Wealth Management has been named “Best Private Bank in Germany” by the Financial Times publications “Private Wealth Management” and “The Banker” in the Global Private Banking Awards 2021.\nThe publications underline that various factors led to these results, including customized solutions, on both the investment and lending side, a close collaboration across the bank, their own capital markets desk and the financial engineering expertise. The judges also praised Deutsche Bank's ability to meet both the business and personal needs of entrepreneurs.\nFrank Schriever, Head Wealth Management Germany, said: “This prestigious accolade is great testament to the team’s hard work in delivering international solutions, risk management and sustainable performance for our clients in a rapidly changing environment.”\nJudges also had praise for the integrated business model that is particularly suited to cover both the corporate and private needs of entrepreneurs which is a key growth driver and underlines the distinct value Wealth Management in Germany offers to entrepreneurs.\nSchriever added: “Deutsche Bank Wealth Management in Germany remains the clear market leader in a highly competitive environment. We offer our clients international expertise and access to our Corporate Bank and our Investment Bank in order to serve their private and business needs. At the same time, we are committed to becoming the bank of choice for clients who wish to make positive social change.”\nAlso highlighted were product offerings such as the Strategic Asset Allocation funds, an ETF-based fund range launched in April 2020, and the Strategic Income Allocation funds, which were launched in June this year and in which clients have invested strongly. “With clients demanding expertise in areas such as ESG, alternatives and technology, PWM’s awards celebrate success for those banks which stay one step ahead”.\n\nThe winners were decided by an independent panel of 16 judges from four continents.",
    "number_of_ratings": 6,
    "rating": 1.8,
    "likes": 13
}