{
    "url": "https://www.db.com/news/detail/20211105-deutsche-bank-launches-new-ocean-resilience-philanthropy-fund?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, November 5, 2021",
    "tags": [
        "Sustainability",
        "Wealth"
    ],
    "title": "Deutsche Bank launches new Ocean Resilience Philanthropy Fund",
    "body": "First project: Future Climate Coral Bank in the Maldives\nInitial commitment of 300,000 US dollars, with target of five million US dollars to be raised within five years\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today announced the launch of the Deutsche Bank Ocean Resilience Philanthropy Fund, a new global philanthropic fund dedicated to ocean conservation and coastal resilience. \nThis is the first philanthropic fund of its kind set up by a financial institution, giving clients and other stakeholders the opportunity to support ocean conservation efforts though a dedicated framework to facilitate donations.\nDeutsche Bank’s Global Head of the International Private Bank and CEO for Europe, the Middle East and Africa Claudio de Sanctis said, “We are committed to supporting ocean conservation and a sustainable blue economy. With the establishment of our new Ocean Resilience Philanthropy Fund, we are excited to give clients and colleagues the opportunity to invest in a better, more sustainable future for one of the world’s most precious resources. We are proud that our partnership with ORRAA, forged in May this year, is already creating a positive impact on ocean conservation with the launch of this new fund.”\nDeutsche Bank is a founding member of the Net-Zero Banking Alliance and the first bank to join the Ocean Risk and Resilience Action Alliance (ORRAA) as a full member. It is committing an initial 300,000 US dollars to launch the fund and aims to raise up to five million US dollars from clients and other stakeholders within the next five years.\nThe first initiative to be supported by the fund will be the Future Climate Coral Bank, a research project in the Maldives led by the Maldives Coral Institute (MCI) that is designed to identify coral species that are resilient to climate change and conserve them in a living gene bank. One of the world’s most climate-vulnerable countries, the Maldives has seen large-scale damage and destruction to its coral reefs over the past 20 years. The project will help the nation of islands to monitor and repair its reefs, maintain its fishing and tourism industries and protect itself from the growing threat of storm surges. Ultimately, it will help scientists to heal and strengthen coral reefs around the world.\nGlobal Head of Deutsche Bank’s Chief Investment Office Markus Müller said: “By creating this philanthropy fund, we are directing much-needed capital towards the development of nature-based solutions to protect and enhance our marine ecosystems. Whilst the development of the coral bank is first and foremost to build an archive of the most climate-resistant corals, it is – more importantly – designed to benefit future generations, providing knowledge to help other vulnerable coastal communities.”\nCallum Roberts, Chief Scientific Advisor, Maldives Coral Institute and Professor of Marine Conservation, University of Exeter said: \"No country on earth is more dependent on nature for its existence or at greater risk from climate change than the Maldives. Coral is the very reason for the country’s existence. But corals are dying as the sea warms, threatening the livelihoods and wellbeing of every citizen. The Maldives Coral Institute was founded to find ways to help corals prosper in our changing world. We are delighted to have the support of Deutsche Bank, investing in the future of corals and all those who depend on them.\"",
    "number_of_ratings": 3,
    "rating": 2.3,
    "likes": 22
}