{
    "url": "https://www.db.com/news/detail/20211104-corporate-climate-responsibility-after-cop26?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 4, 2021",
    "tags": [
        "Research",
        "Sustainability"
    ],
    "title": "Corporate climate responsibility after COP26",
    "body": "With the United Nations Climate Change Conference under way in Glasgow, Deutsche Bank Research has just published the results of a survey focusing on the time after COP26 when governments around the world will be looking to delegate much of the responsibility for achieving climate targets to corporates.\nPost-COP26 government policies will require corporates to spend more on reducing their carbon profile. And pressure is also coming from customers and investors; the survey shows that if companies receive bad press on their climate efforts, customers will often boycott their products. Likewise, companies that are already proactively implementing more climate-friendly strategies are benefitting from increased customer loyalty.  \nBut can corporates afford the transition? The analysis shows that the cost of change is a key concern for managers. Survey data highlights that those companies with the greatest carbon intensity (even within each sector) have lower cash reserves and lower profit margins. But it is possible.\nLuke Templeman, Thematic Analyst at Deutsche Bank Research, says: “Companies must be profitable to fund the changes necessary to decouple their profits from emissions. This is possible as climate-related financial products have gone mainstream, particularly since Covid-19.” \nTempleman points out in the new report that it is possible to decouple growth and emissions by creating business models that support it: nature-positive models, for instance, and financial solutions like ESG-based financial products and Assets-as-a-Service, both of which are growing in popularity. Besides greater profitability, companies that use them stand to benefit from better relations with governments, investors and customers – a win-win situation. \nRead the new report.\nFurther reading on Assets-as-a-Service (Available only to those registered to access dbResearch).",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 5
}