{
    "url": "https://www.db.com/news/detail/20211103-deutsche-bank-and-the-green-climate-fund-sign-agreement-at-cop26-to-invest-in-de-carbonization-solutions-for-sub-saharan-africa?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, November 3, 2021",
    "tags": [
        "Africa",
        "Sustainability"
    ],
    "title": "Deutsche Bank and the Green Climate Fund sign agreement at COP26 to invest in de-carbonization solutions for Sub-Saharan Africa",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) alongside the Green Climate Fund (GCF) today executed an agreement which commits the GCF to contribute USD 80 million as the seed and anchor investor to a renewable energy investment program. DWS, the independent asset manager majority-owned by Deutsche Bank, will be the executing entity and it has committed to contribute 3% of the anticipated USD 500 million investment facility. The program will be implemented in Sub-Saharan Africa by DWS’s Sustainable Investments team. The signing took place at an official ceremony held at COP26 in Glasgow hosted by Deutsche Bank, with representatives from all three institutions.\nThe green energy investment program is a blended finance and SFDR9 recognized vehicle. It targets investments in innovative energy solutions to support the de-carbonization of energy production for industry and households in Sub-Saharan African countries which have confirmed their support for the program. The program will focus on markets in which electricity supply is inefficient, excessively expensive, and insufficient to support fast economic growth. It will support the shift in electricity production away from large scale centralized power plants to decentralized, renewable energy production that is close to the point of consumption.\nThis program will invest in renewable energy production, allowing SMEs and consumers to access reliable and affordable energy. It has established set targets to monitor progress over the investment period which will measure contributions to the market shift in the target countries towards a greenhouse gas neutral energy supply.\nThe GCF – a critical element of the historic Paris Agreement - is the world’s largest climate fund, mandated to support developing countries raise and realize their Nationally Determined Contributions (NDC) ambitions towards low-emissions and climate-resilient development pathways. This program has been developed in close cooperation with the GCF to reflect its standards and policies and to maximize climate impacts. \nHenry Gonzalez, the Director of GCF‘s Private Sector Facility, said: This Funded Activity Agreement signing marks the start of the first program between GCF and Deutsche Bank, demonstrating our mutual commitment to mobilizing the private sector for climate action. Decentralized renewable energy is an essential solution on the African continent to reduce emissions in developing rural economies and to realize economic and social co-benefits. GCF is happy to act as the anchor investor in the program and looks forward to a productive partnership with Deutsche Bank in catalyzing private investment for climate action.\nAndrew Pidden, Head of Sustainable Investments at DWS, said: “We are thrilled to commence the active phase of our relationship with the GCF. It builds on our 20-year track-record of working with public sector investors and showcases the impact investment capability of DWS.  We remain committed to deliver on the GCF’s objectives and invest in a growing market, such as Africa, that is yet able to avoid using carbon-based energy sources as a primary basis for energy production.” He added: “The program will leverage the full capacity and experience of our Sustainable Investments team to manage blended finance vehicles as recognized by the OECD as effective tools to support transitions into more sustainable economies.”\nKamran Khan, Deutsche Bank Head of ESG for Asia Pacific, said: “Blended finance can have a catalytic impact on sustainable growth in emerging markets. Focused, commercially viable investments in developing economies like Sub-Saharan Africa require deep sector/regional experience and world-class impact investment expertise. We are proud to play a role in bringing the world’s largest climate fund to invest at scale in renewable energy to create a more sustainable future for Sub-Saharan Africa and contribute to regional economic growth.”\n\nFor further information please contact:\nDeutsche Bank AG                                                    \nMohanad Nahas\nPhone: +971(4)3611-754\nEmail: Mohanad.nahas@db.com\nDWS\nNick Bone\nPhone: +44(20)754-72603\nEmail: nick.bone@dws.com\nGreen Climate Fund\nSimon Pollock\nPhone: +82 032 458 6154\nEmail: spollock@gcfund.org\n ",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 12
}