{
    "url": "https://www.db.com/news/detail/20211103-christian-sewing-in-glasgow-we-must-find-ways-toward-a-more-sustainable-economy?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 3, 2021",
    "tags": [
        "Strategy",
        "Sustainability"
    ],
    "title": "Christian Sewing in Glasgow: \"We must find ways toward a more sustainable economy\"",
    "body": "Experts and CEOs discuss ESG strategies for companies and the important role of cities in the fight against the climate crisis at the 26th World Climate Conference.\nHow are German companies managing the transformation to greater sustainability - how far have they progressed, what do they still need to do, and what role do banks play? This question was the focus of Deutsche Bank's first day of events at the World Climate Change Conference in Glasgow on Tuesday. As an impulse for discussion, the Werte Stiftung presented a new study in cooperation with the Potsdam Institute for Climate Impact Research and the consultancy Bain & Company looking at how German CEOs drive sustainability.\nSustainability has moved high up the corporate agenda, according to a survey of 20 CEOs for the study. Nine out of 10 CEOs think that the issue of sustainability will be more important than digitalisation in the long term. All companies today include sustainability goals in their planning - and are working to develop new and sustainable solutions for their clients.\n\"The need for advice is enormous,” said Christian Sewing during a panel discussion at the event. “At every client meeting, whether with DAX and MDAX corporations or with family businesses, the topic of sustainability comes up today - along with the question of how we can support our corporate clients. With advice, but also by financing their sustainable transformation.\"\nBanks will play a crucial role in the transformation to a greener, socially inclusive and well-governed economy, Sewing said. \"We can offer solutions if we know the problem. That's why we work actively and closely with our clients.\"\nHe also called for a sense of proportion and not bans or even radical measures. By pushing too fast for transformation to achieve environmental goals you could risk losing the support of society, the S in ESG, he noted.\nA close transformation dialogue with clients is at the heart of Deutsche Bank's sustainability strategy. Schaeffler, one of the largest suppliers to the automotive and industrial sectors, is an example of such a client, with an in-depth dialogue already underway. In addition to questions about financing, ESG ratings, and innovative payment solutions, the discussions with Schaeffler also involve an exchange of ideas about how companies, banks, and other partners can work together to drive development toward a more sustainable economy and society.\nThis also gave rise to the idea of a joint event at the climate summit in Glasgow - and so Sewing, Schaeffler CEO Klaus Rosenfeld, and Philipp Rode from the London School of Economics spent the evening discussing the importance of cities in fighting climate change, a topic that unites all three partners.\nRode emphasized that the potential for reducing carbon dioxide emissions in cities is enormous, not least through the development of modern transport and mobility systems. Schaeffler is also working on this - for example, on lightweight hybrid vehicles such as electric bicycles.\nSewing stressed that technology and innovation are key to meeting the challenges facing many cities around the world. However, he said, it is not enough to have innovative products. \"We must find ways to ensure that the maximum number of cities, entrepreneurs and consumers – around the world -- can use these inventions as soon as possible.\"\n“The huge sums required for the green transformation cannot be financed with conventional loans,” he said. “Nor will government subsidies and funding programmes be sufficient to tackle this task. Large cities will only be able to finance investments in electricity, heating or transport systems with the help of investors in the capital markets.\"\nThe speeches and panel discussions from the first day of the Deutsche Bank event can be reviewed as recordings.\nA video interview with LSE urban researcher Philipp Rode can be watched.\nAll information on our events at the Climate Summit in Glasgow can be found here.",
    "number_of_ratings": 4,
    "rating": 1.0,
    "likes": 8
}