{
    "url": "https://www.db.com/news/detail/20211222-home-credit-philippines-and-deutsche-bank-sign-groundbreaking-esg-loan?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "December 22, 2021",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Groundbreaking ESG Loan for Home Credit Philippines",
    "body": "Deutsche Bank and global consumer finance provider Home Credit Philippines (Home Credit) announced today the closing of an innovative ESG-linked loan in the Philippines. This transaction represents an important step forward in the development of ESG-linked financing with robust targets related to “S” or social considerations.\nThe short-term loan facility establishes clear metrics and key performance indicators (KPIs) with respect to ESG considerations, as well as concrete targets for those metrics that Home Credit has committed to achieve over the term of the loan. The primary KPIs focus on expanding credit access to underserved communities in the Philippines, including female and first-time borrowers, and increased provision of financial literacy programs in the Philippines.\nThe transaction also features targets around Home Credit’s digitalisation efforts, committing them to providing at least 60% of their loans via digital channels, in order to provide a higher level of transparency to customers, to enable more equitable loan rates and terms to customers regardless of their economic or social background. In addition, the KPIs track data to confirm Home Credit’s commitment to protect the data privacy of its customers, and ensure that data is only used by Home Credit for agreed purposes.\nThese KPIs will be measured and verified by an independent third party advisor. The loan complies with the Sustainability-linked Loan Principles of the Asia Pacific Loan Market Association.\nJean Lafontaine, Group Head of Funding, Treasury, M&A and Investor Relations at Home Credit, “As a business, we are consistently looking at innovative funding solutions and this is our first ever ESG-linked loan at Group level and an important milestone. ESG is not something new to Home Credit Group and is part of our company DNA. We are delighted that our continued efforts to deliver greater financial inclusion in markets like the Philippines – our other markets more broadly – are being recognized. With the KPIs linked to this loan facility, we are even better placed to continue to deliver equitable and transparent access to financial services for the communities where we operate. This transaction reflects the trust that our partners have in our work to drive our ESG agenda.”\nKamran Khan, Deutsche Bank Head of ESG for Asia Pacific said, “This is a pioneering transaction reflecting the transitioning of consumer lending in Asia towards responsible and sustainable lending. It also evolves the ESG landscape by demonstrating that beyond environmental considerations, financing can also be meaningfully tied to social impact objectives, which in this case are strongly focused on financial inclusion. The parameters of the loan track and incentivise Home Credit’s commitment to provide loans to new market entrants, which are typically women and young adults obtaining credit for the first time. This is an emerging and important area of ESG, particularly in Asia; both the need and the opportunity to drive impact are great.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 9
}