{
    "url": "https://www.db.com/news/detail/20211220-inigo-martos-appointed-regional-chief-executive-officer-iberia-and-chief-country-officer-spain?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "December 20, 2021",
    "tags": [
        "Europe"
    ],
    "title": "Inigo Martos appointed Regional Chief Executive Officer Iberia and Chief Country Officer Spain",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today announced the appointment of Inigo Martos as Regional Chief Executive Officer (CEO) Iberia, Chief Country Officer (CCO) Spain, CEO of Deutsche Bank S.A.E. (Spain) and General Manager of Deutsche Bank AG Madrid Branch, subject to relevant approvals as of July 1, 2022. In addition, Inigo will be appointed as Head of the International Private Bank (IPB) Spain on January 1, 2022.\nClaudio de Sanctis, Global Head of the IPB and CEO EMEA said, “In Inigo Martos we have found an outstanding Chief Executive Officer to take our business in the Iberia region to the next level. Throughout his long career, Inigo has proven himself a strong and effective leader. As a recognised private banker and internationally experienced capital markets professional, he possesses all the skills and attributes needed to run our business as we strive to become the leading financial institution for entrepreneurs and their families. We wish him every success.”\nInigo joins Deutsche Bank with over 25 years of Wealth Management experience, most recently as Head of Iberia for Credit Suisse’s International Wealth Management business. Prior to this role he has held various senior leadership positions including Head of Southern Europe, LatAm and Brazil, Head of Assets and Investments for EMEA and Head of Product Management in Western Europe.\nAfter 17-years of consecutive service as CEO Iberia, CCO Spain, General Manager of Deutsche Bank AG Madrid Branch as well as CEO and Chairman Deutsche Bank S.A.E., Antonio Rodriguez-Pina will focus on his role as Chairman of Deutsche Bank S.A.E. effective July 1, 2022.\n“Antonio Rodriguez-Pina has been instrumental in developing the bank’s Spanish client business and positioning it for growth in the years ahead,” de Sanctis said. “He has been responsible for transforming Deutsche Bank's Spanish business, working in a strong and productive partnership with all of our business and infrastructure partners whilst engaging in an active and constructive dialogue with all stakeholder groups. We are pleased to continue working closely with Antonio and his deep set of client relationships in his role as Chairman. We wish him well as he transitions into the position and thank him for his dedication and service.”\nFernando Sousa, a Deutsche Banker for 31 years, most recently Head of the IPB in Spain, has announced his plans to retire on January 31, 2022.\nDe Sanctis paid tribute to Fernando; “We thank Fernando Sousa for 31 years of exemplary service to Deutsche Bank. Fernando has played a key role in building our retail, private and business banking franchises into one of the top foreign retail and private banks in Spain. Since the creation of the IPB, Fernando has helped to re-establish our Wealth Management business. He has positioned Deutsche Bank as a leader in quality of service in Spain, as well as being a front runner in launching the first fully digital bank within the IPB. We congratulate Fernando on his long and distinguished career and wish him well for the future.”\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}