{
    "url": "https://www.db.com/news/detail/20211217-deutsche-bank-wins-seven-cmd-debt-capital-market-awards?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 17, 2021",
    "tags": [
        "Awards",
        "Capital markets",
        "Corporate products"
    ],
    "title": "Deutsche Bank wins seven CMD debt capital market awards",
    "body": "Deutsche Bank has been awarded seven accolades at the Collaborative Market Data Portal (CMDportal) Awards 2022, which recognise the best performing bookrunners, MTN private placement dealers and issuers in debt capital markets. The bank’s Debt Capital Markets (DCM) business was honoured with six awards, including the top award for Best Overall Bond Dealer, whilst the bank’s Treasury team has been named Best Financial Issuer for the second consecutive year.\n“Based on the many significant transactions Deutsche Bank has placed this year, dominance across multiple industry sectors in Europe and abroad, as well market feedback and poll results, Deutsche Bank win an astounding six awards [in Debt Capital Markets] this year. Their focus on improving internal processes to achieve their realigned goals sees them provide some of the best funding solutions in DCM”, CMDportal said.\nAs well as Best Overall Bond Dealer, Deutsche Bank was also awarded Best European Bookrunner/Dealer; Best Sovereign, Supranational and Agency (SSA) Bookrunner/Dealer; Best SSA Euro Bookrunner/Dealer; Best Corporate Euro Bookrunner/Dealer; and Best Berliner Bookrunner/Dealer, given to “an institution that is active in the Euro denominated domestic German market and is the best at providing a full service to all types of borrowers and investors”.\nPraising the bank’s performance in SSA DCM, CMDportal said: “Deutsche Bank ranks among the top three bookrunners in the SSA and SSA euro league tables as they are one of the few houses worldwide who can offer SSA clients diverse funding solutions across different currencies and structures”. Regarding Corporate DCM, CMDportal said Deutsche Bank is the “dominant force in euro high-yield (HY) and investment-grade (IG) bonds.”\nFor the second year running, Deutsche Bank has been awarded Best Financial Issuer, with CMDportal commenting: “Deutsche Bank’s remarkable year has resulted in a high-ranking on league tables, winning results in our polls and positive interviews with market participants. For these achievements, Deutsche Bank has won Best FIG Issuer, which is one of our most prestigious issuer awards.”\nThe CMDportal awards methodology is based on detailed feedback from industry participants, including market polls and interviews with market participants, as well as league table data. Award winners are recognised for  their competitive strengths and performance over the year.",
    "number_of_ratings": 5,
    "rating": 2.6,
    "likes": 9
}