{
    "url": "https://www.db.com/news/detail/20200511-deutsche-bank-launches-tier-2-issuance-and-announces-public-tender-offer-for-senior-non-preferred-debt?language_id=1",
    "language": "EN",
    "article_type": "Ad-hoc Release",
    "publish_date": "May 11, 2020",
    "tags": [
        "Company",
        "Corporate products",
        "Private products"
    ],
    "title": "Deutsche Bank launches Tier 2 issuance and announces public tender offer for senior non-preferred debt",
    "body": "Frankfurt am Main, May 11, 2020 – 10:12 CEST – Deutsche Bank (XETRA: DBKGn.DE/NYSE: DB) launches a new euro-denominated Tier 2 issuance and announces a public tender offer for certain of its euro-denominated senior non-preferred securities. The target acceptance volume of the tender is 2.0 billion euros and the Tier 2 issuance will be of benchmark size.\nThe new Tier 2 issuance will increase Deutsche Bank’s total capital ratio and, as a consequence of the implementation of CRD V rules regarding the composition of P2R (Pillar 2 Requirement), improve its buffer versus regulatory capital requirements.\nThe public tender offer is designed to manage the Bank’s overall Minimum Requirement for Own Funds and Eligible Liabilities (MREL) supply by retiring various senior non-preferred securities, some of which lose their MREL recognition during 2020.\nIt encompasses the following euro-denominated securities issued by Deutsche Bank AG:\n0.375% January 2021 (ISIN: DE000DL19T18)\n1.625% February 2021 (ISIN: DE000DL19UQ0)\n1.250% September 2021 (ISIN: DE000DB7XJB9)\n3mE+65bp September 2021 (ISIN: DE000DB7XJC7)\n1.500% January 2022 (ISIN: DE000DL19TA6)\n1.875% February 2022 (ISIN: DE000DL19UR8)\n3mE+80bp May 2022 (ISIN: DE000DL19TQ2)\n2.375% January 2023 (ISIN: DE000DB5DCS4)\n1.125% March 2025 (ISIN: DE000DB7XJP9)\n2.625% February 2026 (ISIN: DE000DL19US6)\n1.750% January 2028 (ISIN: DE000DL19T26)\nThe offer is expected to expire on Friday, 15 May 2020.\nInformation is available on Deutsche Bank’s Investor Relations website under https://www.db.com/ir or by contacting +49 800 910-8000.\nRequests for the Tender Offer Memorandum may be directed to the Tender Agent: Lucid Issuer Services Limited (+ 44 20 7704 0880, db@lucid-is.com)\nContact:\nChristian Streckert\nPhone: +49 69 910 38079\nEmail: christian.streckert@db.com\nEduard Stipic\nPhone: +49 69 910 41864\nEmail: eduard.stipic@db.com\n_________________________________________________________________\nDeutsche Bank AG\nTaunusanlage 12\n60325 Frankfurt am Main\nGermany\nISIN: DE0005140008\nWKN: 514000\n\nListed: Regulated market in Berlin-Bremen, Duesseldorf, Frankfurt (Prime Standard), Hamburg, Hanover, Munich und Stuttgart; EUREX; NYSE\nThe International Securities Identification Numbers (ISINs) of further financial instruments issued by Deutsche Bank AG, and admitted to trading on a domestic organized market or for which such admission has been applied for, are listed in the attached PDFs.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}