{
    "url": "https://www.db.com/news/detail/20200508-deutsche-bank-partners-with-frieze-new-york-to-launch-first-virtual-art-fair?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 8, 2020",
    "tags": [
        "Art",
        "Company",
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank partners with Frieze New York to launch first virtual art fair",
    "body": "Deutsche Bank is partnering with Frieze to launch its first-ever virtual fair today, entitled Frieze Viewing Room, an ambitious new digital initiative introduced after the annual Frieze New York on Randall’s Island had to be cancelled due to the coronavirus.\nFrieze Viewing Room will enable online visitors to enter 200 virtual gallery spaces, purchase art, and experience the extraordinary video and narrative content on display for the coming week. They will be able to search for works by artist, price, medium, gallery and section, and even view the art on their own walls with the use of augmented reality (AR) technology.\nDeutsche Bank, which has been Global Lead Partner of Frieze since the second fair in London 17 years ago, will offer clients and guests access to its own Deutsche Bank Viewing Room, which will serve as the virtual version of the bank’s Deutsche Bank Wealth Management client lounge. Frieze holds annual fairs in London, New York and, since last year, Los Angeles.\n“We have been partners with Frieze since the inception of their extraordinary journey and have always admired and tried to emulate their capacity to be innovative,” said Claudio de Sanctis, Global Head of Deutsche Bank Wealth Management.\nHe added: “When we knew there could no longer be a physical event for Frieze New York, we were inspired to seize this difficult moment to create a new way of interacting with our clients and making a positive impact through art.”\nThis year marks the 150th anniversary of Deutsche Bank and the 40th year of its renowned corporate art collection.\nThe bank’s commitment to art has long included supporting new and emerging contemporary artists with its “Artist of the Year” award. It will be showcasing previous award winners at this year’s virtual Frieze with short videos on and artworks by artists Wangechi Mutu, Yto Barrada, Roman Ondak, Imran Qureshi, Victor Man, Koki Tanaka, Basim Magdy, Kemang Wa Lehulere and Caline Aoun.\n“We are very excited and proud to be part of the first virtual Frieze Art Fair. As a longstanding partner of Frieze we celebrate our mutual passion for contemporary art in the innovative digital realm. In Deutsche Bank’s Viewing Room today we give insights on our longstanding program “Artist of the Year” and let the artists tell you about their ideas,” said Friedhelm Hütte, Global Head of Art at Deutsche Bank.\nDeutsche Bank and Frieze will also present “Deutsche Bank Collection Live”, a virtual event with UK performance artist Tom Pope featuring a participatory performance entitled “Art Workout”.\nFrieze Viewing Room will go live on Friday, May 8, and runs through next week to Friday, May 15. The site can be accessed through this link or by downloading the mobile app and via the Frieze website.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}