{
    "url": "https://www.db.com/news/detail/20200506-four-wins-for-deutsche-bank-at-profit-und-loss-magazine-s-2020-digital-fx-awards?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 6, 2020",
    "tags": [
        "Awards",
        "Company",
        "Corporate products",
        "Private products"
    ],
    "title": "Four wins for Deutsche Bank at Profit & Loss Magazine's 2020 Digital FX awards",
    "body": "Deutsche Bank picked up four awards from Profit & Loss magazine at its annual awards event last week.\nThe bank won the 2020 P&L Innovation award for Digital FX and the awards for e-FX Excellence for Market Colour, Autobahn OTC Structure (AOS) and Autobahn Mobile. Autobahn is Deutsche Bank's award-winning electronic service offering, giving clients access to Deutsche Bank research, seamless electronic execution and liquidity across multiple asset classes and markets, as well as advanced transaction banking and post-trade services. The Market Colour App gives clients information about market activity, liquidity and volatility.\nThe awards represent a second year of success for Deutsche Bank, having picked up the industry Thought Leadership Award as well as Awards for Excellence for its FX Orders and Market Radar products in 2019.\nThe editorial panel highlighted “the impressive progress made by Deutsche Bank’s FX business” in its write up, singling out the Seismometer - an analytical tool that helps clients understand the nature of a sharp directional market move - and other analytical tools available in Market Colour, as being “a great example of how a bank can take genuinely unique and innovative thinking, and structure it into a technology solution for clients.”\nMaria Prata, Head of FX ecommerce Sales, said: “Following our wins in the Thought Leadership category last year, we are very pleased to win four awards this year. We have invested significantly in our digital FX platform over the last twelve months, working with our clients to grow our range of applications and extending the availability of these by launching Autobahn Mobile. The feedback we have received from clients has been very positive and it is gratifying to have this acknowledged by such a prestigious industry publication as Profit & Loss.”\nProfit & Loss is a leading industry title for the FX and derivatives markets. Awards winners are selected by the publication’s editorial team using specific criteria.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}