{
    "url": "https://www.db.com/news/detail/20200506-surge-protector-supporting-a-china-client-s-nearly-5x-rise-in-trading-volume?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 6, 2020",
    "tags": [
        "Capital markets",
        "Corporate products",
        "Investment Banking",
        "Private products"
    ],
    "title": "Surge Protector: Supporting a China client's nearly 5x rise in trading volume",
    "body": "With FX markets volatile and liquidity tight, clients are looking for more risk management support than ever before. For some clients, trading volumes are up; sometimes significantly. They’re looking to Deutsche Bank to help them manage their cash flows, provide settlement support, and share market intelligence that allows them to act nimbly, from home.\nSeamless support for huge trading spike\nBetween January and March, one of Deutsche Bank’s clients in China and a leading supplier in the food and consumer industry, saw FX trading volume surge by almost five times on the back of wider global market volatility. More than half of this activity happened outside of office hours or during public holidays, but the Investment Bank’s Risk Management Solutions team and trading desks across Mainland China, Hong Kong, London, and New York worked around the clock to support them.\nIn the client’s words: “Deutsche Bank’s FX team is such a strong support to us. In the middle of Easter break, we needed to secure a very good FX price, and the team went the extra mile to make this happen.”\nStrength in partnership\nWith work from home set-ups making access to real-time market info more challenging, the client also looked to Deutsche Bank to track market movements and identify deal windows. And when a good pricing window emerged over the Easter break, the Risk Management Solutions team was ready and delivered a total volume of nearly 100 million euros split between immediate FX spot trades and forward trades, on Easter Friday.\nAs a result of our complete package of support, the percentage of the client’s overall trading activities handled by Deutsche Bank increased from 25 percent before the COVID-19 outbreak to more than 40 percent today.\nMichelle Xu, Head of Risk Management Solutions Greater China, said: “Our constant support providing liquidity and market colour to clients has proven deeply valuable. Despite the global pandemic resulting in extreme market volatility and unprecedented operational challenges, clients have relied on the continuity of our service and are recognising the strength of our partnership.”\nUniquely Deutsche Bank\nIt’s not only the swift market intelligence that Deutsche Bank has been able to provide, serving as eyes and ears for clients in reading the markets. Clients also acknowledge that Deutsche Bank’s centralised liquidity pool – where the bank uses its own liquidity to help clients in times of tightening liquidity - has been instrumental in helping manage their cash flows, in particular citing our excellent settlement capability and competitive pricing.\nFor instance, Deutsche Bank’s ability to quote onshore pricing (prices that are only for local investors in Mainland China) to offshore clients in Hong Kong via back-to-back CNY solutions, which is unique to the bank, has further helped clients reduce hedging costs during surging market volatility since March.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}