{
    "url": "https://www.db.com/news/detail/20200505-karen-kuder-appointed-general-counsel-of-deutsche-bank?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 5, 2020",
    "tags": [
        "Company"
    ],
    "title": "Karen Kuder appointed General Counsel of Deutsche Bank",
    "body": "With immediate effect, Karen Kuder has been appointed General Counsel of Deutsche Bank and Global Head of the Legal department. She reports to Stefan Simon, designated Management Board member responsible for the Legal department and relations with both governments and regulatory authorities. Karen Kuder succeeds Florian Drinhausen, who, as announced at the end of April, will leave the bank on May 31, 2020.\n“In Karen Kuder, we have found an outstanding General Counsel within our own ranks,\" said Karl von Rohr, President and Management Board member responsible for legal and government issues, among other things. “Her appointment demonstrates that our bank has an excellent internal pool of candidates. We wish her all the best in her new role.\"\n“Karen Kuder knows the bank very well from many years of experience. She has proven herself in the past years in various challenges and therefore brings the full range of expertise necessary for managing the Legal department of a global bank. I look forward to our cooperation\", added Stefan Simon.\nKaren Kuder has been with Deutsche Bank for more than 20 years. Born in Zittau, Saxony in Germany, her experience includes proprietary mergers & acquisitions and as a senior advisor to the bank’s German corporate client business. Her focus was on lending law, including restructuring and insolvency law with broad experience also including secondments in the Risk department and DWS in London and Luxembourg. She also helped shape the European and German legislative process for the restructuring and resolution planning of banks after 2008 and was responsible for Deutsche Bank's banking regulatory law worldwide from 2016. In 2018, she became Chief Governance Officer with global responsibility for the bank’s governance framework.\nKaren Kuder joined Deutsche Bank in 1992 and trained as a bank clerk for two years in Dresden. She then studied law at the University of Augsburg and the Technical University of Dresden. She returned to Deutsche Bank in 2000 and received her doctorate from the Technical University of Darmstadt in 2006. She has published numerous articles on banking law. Since 2016 she has been a member of the EU Insolvency Expert Group, which supports the EU in introducing a harmonised insolvency law within the framework of the Capital Market Union.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}