{
    "url": "https://www.db.com/news/detail/20200504-i-told-all-our-clients-that-they-are-not-alone?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 4, 2020",
    "tags": [
        "Corporate products"
    ],
    "title": "\"I told all our clients that they are not alone\"",
    "body": "Ioanna Ostadaki, 29, will not easily forget the first few days KfW’s promotional programme was on offer. The very first day it was launched, Deutsche Bank received more than 5,300 coronavirus-related enquiries, of which 2,000 were specifically about loans.\n“The phones were ringing off the hook,” she said. “We had panicked clients on the other end and our own processes were not fully established at the beginning.” It was impossible for her to structure her work routine.\nOstadaki's greatest challenge has been calming clients down even though she herself has never been confronted with such a situation before. “I just told all of them that they are not alone, and that the bank and the state of Hesse is supporting them,” she replied when asked what has helped the most at this time.\n“We spoke about how their business was going and then I assured them that we will definitely find a way to get out of this crisis together.” That helped. “Many of them switched from their initial state of panic to work mode and sent us the documents necessary for a crisis loan,” Ostadaki said.\nJust three steps to a KfW loan\nClients can now simply enter the relevant information online on a dedicated website created for the purpose. They can find funds to match their needs, prepare their loan application and have it checked in just three steps.\nThe first step, for example, involves stating the number of employees at the company, its age and how much liquidity it needs. This information is important in order to decide whether a KfW promotional loan or an emergency loan granted by the German states is more suitable.\nThe second step requires clients to submit an online request to Deutsche Bank for the appropriate funding solution. Our loan experts assess the information in the final step. How long the check takes also depends on the information itself. For its instant loans, for instance, KfW only requires a client check (know your customer) and a simplified risk assessment by the client’s own bank; for its specialist loans, on the other hand, a lengthier risk assessment is performed.\nDeutsche Bank goes one step further to help clients find answers to their questions – it now also offers them a rule-based chatbot. Its “topic finder” shows clients how to find answers to questions on funding and liquidity support from the German federal government and the states. It also guides them in finding answers to questions on banking transactions, business travel and events. The chatbot thus relieves bank staff of a considerable workload.\nIn light of these offerings, client advisor Ioanna Ostadaki is confident that Deutsche Bank will also continue to provide crucial assistance to its clients. “We client advisors and loan specialists receive support from experts in all possible departments,” she said. “It is fantastic to see how much expertise we have in house to help our clients in these exceptional circumstances.”\nOstadaki also believes that, in addition to such expertise, the situation demands extraordinary commitment. For six weeks now, she has been even more driven than usual to meet client needs. At present, she is placing her own needs a notch or two below those of clients. “As a client advisor, I am experiencing first-hand how many great business models are in danger right now,” she said. “I want to prevent them from failing. That is what drives me.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 8
}