{
    "url": "https://www.db.com/news/detail/20200626-stylish-masks-with-a-long-term-impact?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 26, 2020",
    "tags": [
        "Company",
        "Sustainability"
    ],
    "title": "Stylish masks with a long-term impact",
    "body": "Run by the same family for generations, Mey normally produces fine lingerie and underwear. And Weitblick is a German household name for high-quality workwear. The coronavirus pandemic has had a major impact on both businesses, with Mey's sales plummeting by around 85 percent after retailers were ordered to close their doors at short notice. Weitblick's management was also concerned about keeping its seamstresses in work. The two companies reacted quickly and since converting production in March, they have been able to focus on sewing protective face masks.\nAnd that is how the two companies embarked on a collaboration with Deutsche Bank. Each of them applied independently to make cloth masks for the bank, and Mey and Weitblick were both chosen from more than 25 other companies who responded to the call for tender. The two firms are now ready to dispatch 90,000 stylish cloth masks to Deutsche Bank employees. Each face mask bears either a Deutsche Bank, Postbank, DWS or Wealth Management logo.\nThe selection criteria for the products were comfort and material as the masks are intended to be worn primarily when employees are in direct contact with clients, and should be as comfortable as possible when worn for extended periods. One hundred bank staff who work in branches and call centres put them to the test.\n“We have found two strong partners in Mey and Weitblick, both of whom quickly and impressively demonstrated their innovation potential,” said Philipp Gossow, Head of Private Clients Germany. “Moreover, both firms supply products that are both sustainable and meet high quality standards, which we would like to support.” It is very important that both staff and clients continue to be protected from potential infection by wearing cloth face masks. “In times like these especially we’ve been here for our clients and we’ll continue to do so – also in person at our branches“, Gossow added.\nMedical supplies\nMatthias Mey, Managing Partner of the Mey Group was increasingly receiving enquiries from medical facilities, hospitals and doctors' surgeries as the virus began to spread. “My wife works as an emergency care doctor, so I envisaged early on the lack of masks and medical clothing that we would be faced with,” he said.\nSo the company installed a new production line at the factory in Swabia’s Albstadt over a single weekend. “From the end of March, we operated on a two-shift basis to produce as many masks as possible,” he said. The company is now back to producing underwear and sleepwear. However, it still has plenty of masks in storage, ready for further sales.\nMey uses solely organic cotton for its cloth masks. And at Weitblick sustainability is one of its core values. “The decision to start producing masks is a practical demonstration of our corporate social responsibility,” said Weitblick’s Managing Director Felix Blumenauer, referring not only to the coronavirus pandemic but also to the company’s social and environmentally friendly standards.\nWeitblick is a family business based in Kleinostheim, about half an hour’s drive from Frankfurt. It launched its “Supporting Fairtrade Cotton” project at the end of 2019, which commits the company to purchasing initially one-third of its cotton supply from Fairtrade organisations, gradually increasing that share. In this case in particular, Fairtrade means that binding purchase quantities enable cotton farmers to better plan their activities and that the trading terms are fairer than normal. This serves to improve their living conditions and enables them to better comply with environmental and social standards. The Deutsche Bank masks are certified “Fairtrade”.\nThe next steps\nMey’s contribution to society goes beyond producing masks. It also began to make protective clothing for doctors and obtained special approval to market a protective face mask that is certified as a medical product for use in the medical sector. Matthias Mey summed up his company’s efforts by saying, “Crises like these have shown the importance of strong partnerships.”\nDeutsche Bank donated 575,000 surgical masks, acquired during the SARS epidemic, to public health authorities in Frankfurt, Berlin and Bonn in March. These masks meet the standard required for surgical use and were thoroughly checked for their effectiveness. The bank already drew on this stock in March to quickly provide Deutsche Bank employees in branches and other areas with disposable face masks before the lockdown. The advantage of the cloth masks now being delivered is that they can be reused, meaning they not only protect others but also reduce waste.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}