{
    "url": "https://www.db.com/news/detail/20200625-deutsche-bank-announces-changes-to-the-italian-franchise-and-to-the-management-board-of-deutsche-bank-s-p-a?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 25, 2020",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank announces changes to the Italian franchise and to the Management Board of Deutsche Bank S.p.A.",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) After a 20-year career with Deutsche Bank, including 12 years of consecutive service as Chief Country Officer Italy and Chief Executive Officer at Deutsche Bank S.p.A., Flavio Valeri has decided to leave Deutsche Bank to pursue new challenges.\n“Flavio Valeri has been instrumental in developing the bank’s Italian business and positioning it for growth in the years ahead,” said Werner Steinmueller, Chairman of the Deutsche Bank S.p.A. Supervisory Board. “Flavio has been responsible for restructuring and relaunching Deutsche Bank's Italian business, revitalising the company’s I.T. infrastructure and engaging in an active and constructive dialogue with all stakeholder groups.\n\"Flavio developed and launched the Deutsche Bank Italia Foundation and has been a champion of a number of social causes in Italy during his career. He deserves our gratitude for his tireless dedication to Deutsche Bank and its clients and we wish him well.”\nToday the Supervisory Board of Deutsche Bank S.p.A. appointed Roberto Parazzini as Chairman of the Management Board and CEO of Deutsche Bank S.p.A., subject to regulatory approval. Parazzini will also become Chief Country Officer of Deutsche Bank in Italy, and, effective July 1 2020, General Manager of Deutsche Bank AG Milan Branch.\nRoberto Parazzini joined Deutsche Bank in 1999 after studying Engineering at the Politecnico di Milano. Following a variety of roles, including Chief Operating Officer of Deutsche Bank Italy and Head of Asset and Wealth Management Italy, Parazzini has most recently been responsible for the Wealth Management business in Southern and Western Europe.\n“In Roberto Parazzini we have found an excellent Chief Country Officer in-house,” said Steinmueller. “Throughout his 20-year career at Deutsche Bank, Roberto has proven himself a strong and disciplined leader. As a recognised private banker and internationally experienced capital markets expert, he possesses all the skills and attributes needed to develop our Italian business. We wish him every success.”\nIn addition to the changes announced today, Serdar Oezkan has been appointed Chief Financial Officer (CFO) and Member of the Management Board of Deutsche Bank S.p.A., replacing Carmine Di Martino who will leave the bank.\nRoberto Cabiati, Chief Information Officer of Deutsche Bank Italy, has also been appointed as a new member of the Management Board of Deutsche Bank S.p.A.\nNew appointments\nSerdar Oezkan is an MBA Graduate from Ludwig Maximilans University in Munich. Over a 14-year career with Deutsche Bank, he has occupied various leadership roles within the bank’s finance unit in Frankfurt and New York, most recently leading the teams responsible for the delivery of Deutsche Bank’s financial statements.\nRoberto Cabiati graduated in Business Administration from the Bocconi University in Milan. Following experience at Banca Popolare di Milano and Accenture, Mr. Cabiati has worked for 23 consecutive years at Deutsche Bank Italy, where he has performed roles including Chief Information Officer, Chief Operating Officer for Private and Business Clients, Italy and Head of International Banking Services.\nSteinmueller said; “We welcome Serdar and Roberto to the Management Board of Deutsche Bank S.p.A., and thank Carmine DiMartino for 23 years of service to Deutsche Bank and wish him well.\nContact\nDeutsche Bank AG\nMedia Relations\nVincenzo Galimi\n+39 02 4024 4793\nEmail: vincenzo.galimi@db.com\nValerio Mancino\n +39 02 4024 3218\nEmail: valerio.mancino@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}