{
    "url": "https://www.db.com/news/detail/20200625-we-need-to-make-the-climate-risk-assessment-clear-and-explicit?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 25, 2020",
    "tags": [
        "Company",
        "Sustainability"
    ],
    "title": "“We need to make the climate risk assessment clear & explicit”",
    "body": "“Climate risk is a new and complex topic that is continuously evolving,” says Chris Jaques, Head of Enterprise Risk Portfolio Management and Stress Testing. “But you don’t often get the opportunity to create a framework from the ground up for a new type of risk. It’s an exciting challenge.”\nJaques, who joined Deutsche Bank seven years ago and has been focusing on climate risk for the past 18 months, is the Deputy Chair of the Group Enterprise Risk Committee, a team of senior leaders from across Risk disciplines. The Committee focuses on risk events and emerging trends that impact Deutsche Bank across multiple risk types. The Committee is empowered to approve the bank’s appetite for taking certain types of risks and also reviews stress testing scenarios and results across the Group.\nIn 2018, the Committee reviewed the potential Risk implications of climate change and mandated the Risk function to develop scenario analyses of certain carbon intensive sectors, such as oil and gas, to assess portfolio vulnerability to climate transition risks. In 2019, following a sharp increase in scrutiny from governments, regulators and investors on climate risk and wider sustainability issues, it established a dedicated working group to start building a climate risk management framework for Deutsche Bank.\n“Our working group is staffed by volunteers from all across Risk – colleagues who had a real personal interest in the topic, who wanted to help drive change in the bank and the industry,” says Jaques. “The group is formulating what the bank needs to do in terms of developing its governance, risk assessment and modelling capabilities, enabling us to manage climate risk on our own balance sheet.”\nAmong its core tasks, the ten-strong team analyses the transition risks that certain industries and sectors will face as a result of formal policies and behavioural changes in the global economy. For example, as more focus is placed on trying to slow the increase of global temperatures, in line with the Paris Accord, certain industries need to devise credible strategies to make the transition to lower carbon intensive models.\nWe need to make the climate risk assessment clear and explicit\nChris Jaques\n“The lack of data and agreed approaches to modelling presents challenges for this kind of analysis and, like our peers, we are still in a build phase,” says Jaques. “Nonetheless, we are moving quickly in developing our ability to estimate potential transition costs across carbon-intensive sectors.”\n“We’re looking to gain greater insight into our own portfolio’s exposure to climate risk in its different facets, and to build an internal risk appetite for climate risk,” Jaques says, explaining that the quantitative metrics will help reduce the carbon intensity of our portfolio over time. “This has to be in lock step with the business and their ambitions to build our client franchise through the fast expanding array of ESG products.\nJaques says that, as new and evolving as climate risk is, it needs to be deeply embedded into our existing risk disciplines and an integral part of our ‘business-as-usual risk assessment processes. “For example, if a highly carbon intensive, large emitter client needs to transition to a greener business model, they may need to invest significantly in their infrastructure. This is a sensible strategy for the client but may lead to an overall increase in the client’s leverage, which might in turn impact our internal view of their credit rating,” he explains.\n“So the different risk disciplines need to work collaboratively to understand the best model and methodology to use. Today, one could argue that climate risk is implicit in certain risk analysis, but moving forward, we need to make the climate risk assessment clear and explicit.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}