{
    "url": "https://www.db.com/news/detail/20200625-deutsche-bank-enables-secure-and-compliant-messaging-platforms-with-a-reach-of-3-billion-users-via-symphony?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 25, 2020",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "Deutsche Bank enables secure and compliant messaging platforms with a reach of 3+ billion users via Symphony",
    "body": "Deutsche Bank enables secure and compliant messaging platforms with a reach of 3+ billion users via Symphony:\nSymphony Connect Solution integrates WhatsApp into Deutsche Bank communication channels with clients\nIt follows the successful introduction of WeChat via the Symphony platform in November 2019\nThe WhatsApp integration addresses clients' needs to interact through their preferred channel, especially at a time when they need Deutsche Bank the most\nIt represents the latest example of co-innovation between Deutsche Bank and Symphony\nIn a drive to continuously simplify and improve its client interactions through secure and compliant channels, Deutsche Bank has become one of the first companies to enable the Symphony Connect Solution for secure chat and collaboration with its clients via WhatsApp. Following the successful introduction of the WeChat functionality in November 2019, more than 3 billion users can now securely and safely communicate with Deutsche Bank employees, who are restricted in the platforms they can use due to regulatory requirements.\nThrough Symphony, Deutsche Bank can communicate with clients anytime, anywhere via their preferred chat platform while meeting stringent security and compliance criteria, such as surveillance and data retention. This latest development, co-innovated with Symphony, expands Deutsche Bank’s diversification of its client interaction platforms, in addition to traditional methods such as email and telephone calls. The ongoing COVID-19 pandemic has brought into sharp focus how important it is for banks to stay in close contact with clients to provide advice and expertise during this challenging period.\n“An important part of our technology strategy is to enable our people to securely meet our clients at a time and place of their choice, and bringing together Symphony and WhatsApp is a truly innovative way to do so,” says Bernd Leukert, Chief Technology, Data and Innovation Officer at Deutsche Bank.\nStefan Hoops, Head of the Corporate Bank at Deutsche Bank, added: “Our existing and potential clients want to discuss their options with us. The integration of WhatsApp with Symphony means we, and other businesses in the bank, can make interactions with our clients even easier when they need us most.”\n“We are committed to providing technologies that are aligned with our customer’s strategy while addressing industry-wide challenges such as security and compliance. We are proud to have developed Symphony Connect Solutions that support Deutsche Bank’s digital offering,” said David Gurlé, Symphony founder and CEO.\nIntegration of Symphony and WhatsApp\nThe integration of WhatsApp follows last year’s successful introduction of WeChat via the Symphony platform. Deutsche Bank backed a partnership between Symphony and Tencent to connect its internal Symphony users to the WeChat network. Deutsche Bank was the first financial institution to have the WeChat integration live in production. Today, it is helping colleagues across Deutsche Bank’s Corporate, Investment and Private Banks engage with customers using WeChat, a particularly useful tool to support customer-connectivity during the COVID-19 pandemic.\nThe connectivity with Facebook’s WhatsApp is offered as part of the Symphony Connect Solutions suite, aimed at enabling customers to interact more easily with their clients, counterparties, and partners, which also includes an interoperability for WeChat, Community Connect and Customer Connect.\nDeutsche Bank is a founding consortium member of Symphony and has participated in a number of funding rounds since its inception helping to grow and scale the platform.\nFor further information please contact:\nDeutsche Bank AG\nSen Shanmugasivam\nPhone: +44 (0) 207 547 2838\nEmail: senthuran.shanmugasivam@db.com \nSymphony Communication Services\nOdette Maher\nPhone: +44 (0) 7747 420807\nEmail: odette.maher@symphony.com\nAbout Deutsche Bank\nDeutsche Bank provides retail and private banking, corporate and transaction banking, lending, asset and wealth management products and services as well as focused investment banking to private individuals, small and medium-sized companies, corporations, governments and institutional investors. Deutsche Bank is the leading bank in Germany with strong European roots and a global network.\nAbout Symphony\nEstablished in 2014, Symphony is the cloud-based messaging and collaboration platform that securely connects markets, organizations and individuals. Powered by a growing and open app ecosystem, and protected with customer-controlled encryption key infrastructure, Symphony’s communications platform increases workflow productivity while maintaining global regulatory compliance.\nAlready the platform of choice for the financial services industry, Symphony unifies the enterprise workflow to boost productivity in any information-centric business. Symphony currently has over 510,000 users from more than 340 companies worldwide, powering over 60 million monthly messages.\nFor more information, please visit: www.symphony.com.",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 15
}