{
    "url": "https://www.db.com/news/detail/20200625-deutsche-bank-and-olam-international-close-asia-s-first-fx-forward-using-esg-performance-targets?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 25, 2020",
    "tags": [
        "Company",
        "Sustainability"
    ],
    "title": "Deutsche Bank and Olam International close Asia's first FX Forward using ESG performance targets",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) and Olam International today announced the successful execution of Asia’s first FX derivative linked to environmental, social and governance (ESG) key performance indicators (KPIs).\nThe ESG-linked foreign exchange (Thai Baht/US dollar) forward enables Olam to lock-in a discount when it meets pre-defined ESG targets which supports the United Nations (UN) Sustainable Development Goals (SDGs).\nDeutsche Bank Head of Fixed Income and Currencies and Corporate Bank APAC and Chief Country Officer Singapore, David Lynne, said: “Supporting our clients’ transformation towards sustainability is a key plank in Deutsche Bank’s strategy. Deutsche Bank aims to lead the industry by creating innovative ESG financial solutions to accelerate the adoption of sustainable practices by our clients across the world.\nThe FX risk solution marries the requirement to hedge the FX risk arising from growing a crop in one country and selling it to another country, and supports Olam’s program to strengthen supply chain sustainability.\nOlam’s Managing Director and Group CFO, N Muthukumar said: “Olam is delighted to partner with Deutsche Bank to implement Asia’s first ESG FX solution. This innovative facility provides us with a hedge on our currency risk exposure and enables Olam to lock-in a discount when we meet pre-set ESG targets that are aligned with our sustainability strategy and the United Nations Sustainable Development Goals. This is yet another way we are living our Purpose of reimagining global agriculture and food systems.”\nThe sustainability-linked derivative follows the concepts enshrined in the Loan Market Association (LMA) Sustainability-linked Loan Principles (SLLP), and follows the EU Sustainable Finance taxonomy.\nDeutsche Bank Head of ESG APAC Kamran Khan said: “Green Finance has to date largely involved sustainability-linked loans, bonds and equities, where market standards are becoming standardized. This sustainability-linked derivative transaction leverages Deutsche Bank’s world-class execution expertise and commitment to ESG to open an important new path for the global Sustainable Finance market.”\nDeutsche Bank has had a longstanding commitment to sustainability. The bank has been a member of the UN Environment Programme Finance Initiative and signatory of its Declaration of Sustainable Development since 1992, achieved climate neutrality in operations since 2012, and has been a supporter of the Paris Climate Agreement since 2015. In 2019, the bank was a founding signatory of the UN Principles for Responsible Banking.\nSustainability is a key pillar in the bank’s transformation. It has committed that by 2025 its total volume of sustainable financing and investments will be at least EUR 200bn, and that its operations will be powered entirely by renewable energy sources. In Asia Pacific, the bank recently appointed a dedicated Head of ESG in a newly created role.\nAdditional information:\nThe client exports agriculture products from farms in Thailand to the rest of world. The client executed a 1yr USD/ THB FX forward to hedge their exports. The client sources these products from farms in Thailand in THB and sells them to customers who pay them in USD. This exposes the client to USD/THB currency risk.\nThe transaction KPIs will contribute to 10 of the 17 UN SDGs, including alleviating poverty (SDG 1); alleviating hunger (SDG 2); improving gender quality (SDG 5); improving clean water and sanitation (SDG 6); reducing inequalities (SGD 10); increasing responsible consumption and production (SDG 12); contributing to climate action (SDG 13); protecting life below water (SGD 14); protecting life on land (SGD 15) and increasing partnerships for the goals (SDG 17).",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}