{
    "url": "https://www.db.com/news/detail/20151126-designing-urban-infrastructure-investing-for-now-or-tomorrow?language_id=1",
    "language": "DE",
    "article_type": "Event",
    "publish_date": "November 26, 2015",
    "tags": [
        "Corporate Citizenship",
        "Sustainability"
    ],
    "title": "Designing Urban Infrastructure: investing for now or tomorrow?",
    "body": "November 26, 2015 \n18:30 – 20:00 GMT\nVenue: London School of Economics, Sheikh Zayed Lecture Theatre\nThe event will be live-streamed and presentations will be available on the website lsecities.net\n\nRio de Janeiro, Brazil © by Tuca Viera\nThe OECD estimates that around US$ 53 trillion is required for investment in transport, energy efficiency, telecommunications, and water and waste infrastructure over the next 15 years. Yet, as the world rapidly urbanises, investment in urban infrastructure is lagging behind. Lack of vision, loss of nerve, absence of public funds and low levels of interest from investors all exacerbate this.\nNonetheless some cities across the globe are demonstrating resilience and capacity for innovation. While there is a consensus that investment in physical and social infrastructure can increase productivity, facilitate connection and promote social good, there are severe challenges and barriers to investment.\nArchitect Norman Foster, who has been at the forefront of urban change in cities across the world, will focus on the role that design can play in tackling social, economic and environmental futures, providing the context for the examination of the broader challenges of using infrastructure to help improve quality of life and the environment in cities in the UK and abroad.\nWelcome:\nPaul Achleitner, Chairman of the Board of Trustees, Alfred Herrhausen Society (tbc)\nSpeaker:\nNorman Foster, Chairman and Founder, Foster + Partners, Chairman, The Norman Foster Foundation\nPanel:\nAndrew Adonis, Chairman, National Infrastructure Commission\nDeyan Sudjic, Director, Design Museum, London\nChair:\nRicky Burdett, Professor of Urban Studies and Director, LSE Cities/Urban Age, London School of Economics and Political Science\nGlobal Debates series to celebrate ten years of the Urban Age programme\nLSE Cities and Deutsche Bank’s Alfred Herrhausen Society, in association with Guardian Cities, is holding a series of public Global Debates to celebrate ten years of the Urban Age programme. The debates will discuss five core themes that have been the focus of research and debate at the Urban Age since 2005.\nOverview Events:\nNarratives of Inclusion: can cities help us live together?\nThursday 3 December 6.30 – 8.00pm\nAbout Urban Age\nNot unlike urbanisation itself, the Urban Age project is about the flows of ideas, people, information and resources.\n\nAt its centre lies the intellectual question of how the physical and social are interconnected in cities.\n\nBy investigating the urban dynamics in different regions of the world – with vastly diverse patterns, scale and speed of urbanisation – the Urban Age attempts to both chronicle and reflect on what it means to live in the contemporary city. Since 2005, the project has held conferences in 13 different cities in four continents and developed an interdisciplinary methodology that forms the core of its research and outreach activities. ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}