{
    "url": "https://www.db.com/news/detail/20151125-the-politics-of-equity-who-owns-the-city?language_id=1",
    "language": "DE",
    "article_type": "Event",
    "publish_date": "November 25, 2015",
    "tags": [
        "Corporate Citizenship",
        "Sustainability"
    ],
    "title": "The Politics of Equity: who owns the city?",
    "body": "November 25, 2015 \n18:30 – 20:00 GMT\nVenue: London School of Economics, Sheikh Zayed Lecture Theatre\nThe event will be live-streamed and presentations will be available on the website lsecities.net\n\nLuanda, Angola © by Paulo Moreira\nSince 2006, over 134 million hectares of African land – roughly the size of France, Spain and Germany – has been bought by foreign investors, the region where urban growth is most expected in the next 20 years. At the same time large swathes of global cities like London, New York and Paris are owned or being developed by foreign sovereign wealth funds and international corporate investors.\nLeading urban sociologist Saskia Sassen – who identified the global cities dynamic – argues that these new and tacit patterns of ownership are having a negative impact on the ‘cityness’, vibrancy and accessibility of urban systems by cutting off parts of the city from public use. Could this form of investment and speculation in cities and buildings be causing de-urbanisation? These issues will be debated with policymakers and leaders who have been involved in reshaping the structure of urban ownership and investment.\nSpeaker:\nSaskia Sassen, Robert S. Lynd Professor of Sociology, Columbia University, author Global Cities and Expulsions\nPanel:\nJean-Louis Missika, Deputy Mayor of Paris in charge of urbanism, architecture, the projects of Greater Paris, economic development and attractiveness\nAnthony Williams, Mayor of Washington DC 1999-2007, CEO and Executive Director, Federal City Council, Washington DC\nChair:\nCraig Calhoun, President and Director, London School of Economics and Political Science\nGlobal Debates series to celebrate ten years of the Urban Age programme\nLSE Cities and Deutsche Bank’s Alfred Herrhausen Society, in association with Guardian Cities, is holding a series of public Global Debates to celebrate ten years of the Urban Age programme. The debates will discuss five core themes that have been the focus of research and debate at the Urban Age since 2005.\nOverview Events:\nDesigning Urban Infrastructure: investing for now or tomorrow?\nNovember 26, 2015 18:30 - 20:00 GMT\n\nNarratives of Inclusion: can cities help us live together?\nThursday 3,2015 18:30 - 20:00 GMT",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}