{
    "url": "https://www.db.com/news/detail/20151124-jackson-pollock-s-mural-comes-to-germany?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "November 24, 2015",
    "tags": [
        "Art"
    ],
    "title": "Jackson Pollock's “Mural” comes to Germany",
    "body": "Jackson Pollock’s “Mural” (1943), one of the twentieth century's most historic and influential paintings, is travelling to Germany after its monumental cleaning campaign at the Getty Conservation Institute, Los Angeles. The exhibition “Jackson Pollock’s ‘Mural’: Energy Made Visible” focuses upon this seismic masterpiece and sets it in the context of more than forty other pieces by artists and photographers including Lee Krasner, Roberto Matta, Aaron Siskind, Gjon Mili, Barbara Morgan, Robert Motherwell, and Andy Warhol.\nOrganized by the University of Iowa Museum of Art (UIMA), the exhibition will feature at the Deutsche Bank KunstHalle from November 25, 2015, through April 10, 2016. \"This show offers a fresh insight into Jackson Pollock’s achievement, its roots and its vast impact on subsequent art”, says Sean O’Harrow, director of the UIMA. \"Pollock’s art during the period of World War II would lay the foundations for the radical abstractions that soon followed.\"\nDavid Anfam – senior consulting curator at the Clyfford Still Museum in Denver and the preeminent authority on Abstract Expressionism – is the exhibition’s curator. “After its conservation by the Getty,” says Dr. Anfam, “Pollock’s ‘Mural’ has in effect been restored to its original, breathtaking power and intensity.” Crucially, the conservation treatment removed a varnish that had been applied in 1973 and which subsequently became discoloured, altering the painting’s entire appearance. Furthermore, the Getty built a new stretcher for “Mural” and researched Pollock’s complex painting technique.\nMeasuring 8’ 1¼ ” x 19’ 10”, the immensely dynamic “Mural” is the largest painting Pollock ever created and it continues to cast a long shadow over the course of American art down to the present day. “Mural” established a new sense of epic scale, gesture, bold colourism and audacity for the incipient Abstract Expressionist movement, anticipating the classic “poured” abstractions that Pollock began just four years later.\nA little history\nSetting “Mural” into context, the selection includes several other Pollock canvases of the wartime period, including the enigmatic “Portrait of H.M.”, as well as works by Krasner (Pollock’s wife), David Smith, and Motherwell, whose Elegy to the Spanish Republic No. 126 (1965-75) was specifically conceived as a homage to Pollock’s towering painterly panorama.\nCrucially, the selection also sheds new light on Pollock’s relationship to photography, especially during the World War II era. At that time, such photographers as Herbert Matter, Barbara Morgan, Aaron Siskind, and Gjon Mili explored an imagery of rapid movement and Pollock certainly knew their work. In sum, “Mural” embodied what Pollock later described as him key aim to make visible “energy and motion.”\nPeggy Guggenheim, the leading collector of modern art in New York during the 1940s, was eager to showcase in her Manhattan townhouse a symbol of support for the new American brand of art she was beginning to champion in her Art of This Century gallery. Consequently, she commissioned Pollock to create a mural for the entrance hall of her apartment. At the suggestion of Guggenheim’s friend and advisor Marcel Duchamp, it was painted on canvas, not the wall itself, so it would be, unlike many previous American murals, portable.\nPollock wrote of his commission that it was “...with no strings as to what or how I paint it. I am going to paint it in oil on canvas. They are giving me a show November 16 and I want to have the painting finished for the show. I’ve had to tear out the partition between the front and middle room to get the damned thing up. I have it stretched now. It looks pretty big, but exciting as all hell.”\nMoving to Europe\nWhen Guggenheim decided to move back to Europe in 1947, she wanted to give the painting to an institution that she felt shared her approach to art and artists. Guggenheim, recognizing the significance of the university’s forward-thinking studio art program, wrote to Prof. Lester Longman, head of the University of Iowa School of Art and Art History, in 1948. Finally, in 1951, the painting arrived in Iowa.\nApproximately half of the art works come from the collection of the UIMA. Other loans come from institutions such as the Museum of Modern Art, the Peggy Guggenheim Collection, Venice, and the Kunsthalle Bielefeld, as well as private collectors.“Jackson Pollock’s ‘Mural’: Energy Made Visible” arrives in Germany from its presentation at the Peggy Guggenheim Collection in Italy this summer. After its sojourn in Berlin, the exhibition will travel to the Museo Picasso in Málaga, Spain in 2016.\nThe exhibition tour is accompanied by a fully-illustrated book by David Anfam, published by Thames & Hudson.\nPhoto material on the exhibition can be downloaded free of charge for press purposes at Deutsche Bank KunstHalle.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}