{
    "url": "https://www.db.com/news/detail/20151123-steering-urban-growth-can-planning-and-architecture-manage?language_id=1",
    "language": "DE",
    "article_type": "Event",
    "publish_date": "November 23, 2015",
    "tags": [
        "Corporate Citizenship",
        "Sustainability"
    ],
    "title": "Steering Urban Growth: can planning and architecture manage?",
    "body": "November 23, 2015\n18:30 – 20:00 GMT\nVenue: London School of Economics, Sheikh Zayed Lecture Theatre\nThe event will be live-streamed and presentations will be available on the website lsecities.net \n\nCaracas, Venezuela. © Image courtesy of U-TT at ETH Zürich\nMore urban areas will be constructed during first three decades of this century than all of history, placing enormous pressure on politicians, planners and architects. If properly steered, urban growth can drive wealth creation through improved productivity, better planning and greater equity. The reality of the urban condition, instead, reveals that in many parts of the world urbanisation has become more spatially fragmented, les environmentally responsive and more socially divisive.\nCities have become more sprawled and less dense. Do planners have the political mandate to steer urbanisation in a sustainable direction? The head of UN Habitat Joan Clos, who is coordinating the world’s most influential urban policy convention Habitat III in 2016, will exchange global experiences with practicing architects and researchers to identify whether the design and planning professions are up to the task of designing a new generation of cities that contribute to wealth creation and social equity.\nWelcome:\nUte Weiland, Deputy Director, Alfred Herrhausen Society\nSpeakers:\nJoan Clos, Executive Director, UN Habitat, Secretary-General of the Habitat III Conference\nAlejandro Aravena, Founder Elemental, Santiago, Chile and Director, Venice Architecture Biennale, 2016\nPanel:\nBeatrice Galilee, Daniel Brodsky Associate Curator of Architecture and Design, the Metropolitan Museum of Art, New York\nRicky Burdett, Professor of Urban Studies and Director, LSE Cities/Urban Age, London School of Economics and Political Science\nChair:\nJosé Castillo, Principal, Arquitectura 911sc, Mexico City and Visiting Professor Graduate School of Design, Harvard University\nGlobal Debates series to celebrate ten years of the Urban Age programme\nLSE Cities and Deutsche Bank’s Alfred Herrhausen Society, in association with Guardian Cities, is holding a series of public Global Debates to celebrate ten years of the Urban Age programme. The debates will discuss five core themes that have been the focus of research and debate at the Urban Age since 2005.\nOverview Events:\nThe Politics of Equity: who owns the city?\nNovember 25, 2015 18:30 - 20:00 GMT\nDesigning Urban Infrastructure: investing for now or tomorrow?\nNovember 26, 2015 18:30 - 20:00 GMT\nNarratives of Inclusion: can cities help us live together?\nThursday 3,2015 18:30 - 20:00 GMT\n  About Urban Age\nNot unlike urbanisation itself, the Urban Age project is about the flows of ideas, people, information and resources.\nAt its centre lies the intellectual question of how the physical and social are interconnected in cities.\n\nBy investigating the urban dynamics in different regions of the world – with vastly diverse patterns, scale and speed of urbanisation – the Urban Age attempts to both chronicle and reflect on what it means to live in the contemporary city.\nSince 2005, the project has held conferences in 13 different cities in four continents and developed an interdisciplinary methodology that forms the core of its research and outreach activities.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}