{
    "url": "https://www.db.com/news/detail/20151119-confronting-climate-change-can-cities-be-the-solution?language_id=1",
    "language": "DE",
    "article_type": "Event",
    "publish_date": "November 19, 2015",
    "tags": [
        "Corporate Citizenship",
        "Sustainability"
    ],
    "title": "Confronting Climate Change: can cities be the solution?",
    "body": "Mexico City, Mexico © by Armin Linke\nIn the run-up to the Paris Climate Conference (COP21), the debate will highlight the fundamental role that cities can play in reducing global energy demand and limiting carbon emissions. It will challenge national and international decision-makers and institutions to recognise that action at the metropolitan level can have a direct impact on the health and environmental stability of the planet, as well as promoting green jobs and social equity.\nChina and India’s urban footprints are expected to be six times larger in 2030 than in 2000, while many African cities are among the fastest growing, ushering in urbanisation to the world’s least urban continent. The World Bank has recently pledged up to US$ 29 billion in financial assistance to poorer nations to cope with climate change.\nThe debate will confront some of the tough questions facing decision-makers – should climate change be addressed through adaptation (should we learn to live with water and flooding like the Dutch?) or mitigation (should we reduce greenhouse gas emissions by planning more connected and compact cities, and making more efficient lifestyle choices?).\nThe world’s most respected climate change economist Nicholas Stern will confront these new realities with urban experts and policymakers working across the globe.\nWelcome\nRicky Burdett, Professor of Urban Studies and Director, LSE Cities/Urban Age, London School of Economics and Political Science\nSpeakers\nNicholas Stern, IG Patel Professor of Economics and Government and Chairman of the Grantham Institute for the Economics of Climate Change, London School of Economics and Political Science, author of the Stern Review on the Economics of Climate Change (2006)\nKaren Seto, Professor of Geography and Urbanization, Yale University; adviser to the Intergovernmental Panel on Climate Change (IPCC)\nPanel\nBruce Katz, Director of the Metropolitan Policy Program, and Vice-President, Brookings Institution\nPhilipp Rode, Executive Director, LSE Cities/Urban Age and Senior Research Fellow, London School of Economics and Political Science\nChair\nTessa Jowell, former MP and UK Government Secretary of State, Professor in Practice, London School of Economics and Political Science\nGlobal Debates series to celebrate ten years of the Urban Age programme\nLSE Cities and Deutsche Bank’s Alfred Herrhausen Society, in association with Guardian Cities, is holding a series of public Global Debates to celebrate ten years of the Urban Age programme. The debates will discuss five core themes that have been the focus of research and debate at the Urban Age since 2005.\nOverview Events:\nSteering Urban Growth: can planning and architecture manage?\nNovember 23, 2015 18:30 - 20:00 GMT\nThe Politics of Equity: who owns the city?\nNovember 25, 2015 18:30 - 20:00 GMT\nDesigning Urban Infrastructure: investing for now or tomorrow?\nNovember 26, 2015 18:30 - 20:00 GMT\nNarratives of Inclusion: can cities help us live together?\nDecember 3, 2015 18:30 - 20:00 GMT\nAbout Urban Age\nNot unlike urbanisation itself, the Urban Age project is about the flows of ideas, people, information and resources. At its centre lies the intellectual question of how the physical and social are interconnected in cities.\nBy investigating the urban dynamics in different regions of the world – with vastly diverse patterns, scale and speed of urbanisation – the Urban Age attempts to both chronicle and reflect on what it means to live in the contemporary city. Since 2005, the project has held conferences in 13 different cities in four continents and developed an interdisciplinary methodology that forms the core of its research and outreach activities.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}