{
    "url": "https://www.db.com/news/detail/20151118-alfred-herrhausen-society-global-debates-to-celebrate-urban-age-10-in-london?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 18, 2015",
    "tags": [
        "Corporate Citizenship",
        "Sustainability"
    ],
    "title": "Alfred Herrhausen Society: Global debates to celebrate Urban Age 10 in London",
    "body": "LSE Cities and Deutsche Bank’s Alfred Herrhausen Society, in association with Guardian Cities, is holding a series of public Global Debates to celebrate ten years of the Urban Age\nprogramme.\n\nThe debates will discuss five core themes that have been the focus of research and debate at the Urban Age since 2005. These include the role that cities play in high-level international and national policy debates on climate change, sustainability and infrastructure, to more grounded concerns on how to regulate, design and manage cities and neighbourhoods that are more inclusive, tolerant and open.\n\nSpeakers include leading environmental and urban experts, mayors and policy-makers, architects, writers, sociologists and urban thinkers who will offer a global perspective on the social and spatial dynamics of 21st century urbanisation. The Urban Age Global Debates are open to the public and will take place in the Sheikh Zayed Lecture Theatre at the London School of Economics. They will be live-streamed and presentations will be available on our website.\nFor more information see lsecities.net\nAbout Urban Age\nNot unlike urbanisation itself, the Urban Age project is about the flows of ideas, people, information and resources. At its centre lies the intellectual question of how the physical and social are interconnected in cities.\nBy investigating the urban dynamics in different regions of the world – with vastly diverse patterns, scale and speed of urbanisation – the Urban Age attempts to both chronicle and reflect on what it means to live in the contemporary city.\nSince 2005, the project has held conferences in 13 different cities in four continents and developed an interdisciplinary methodology that forms the core of its research and outreach activities.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}