{
    "url": "https://www.db.com/news/detail/20151113-konzept-06-an-inverted-look-at-global-housing?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 13, 2015",
    "tags": [
        "Research"
    ],
    "title": "An inverted look at global housing",
    "body": "Can lightning strike twice in the same place? Less than a decade after a housing market crash caused the biggest financial crisis in generations, global property prices are booming once again.\nHowever, beyond the chatter about how impossibly expensive the likes of London and New York have become, the topic draws far less attention than it merits from policymakers and investors alike.\nHence our four feature stories in this issue of Konzept take you on a round the world tour of the most vexing issues related to housing.\nOur lead feature explores how falling homeownership is transforming the traditional American dream, and the wide-ranging implications of this trend persisting in the foreseeable future. If renting homes is catching on in America, it has long been the preferred choice in Germany. Hence, our second feature details the recent legislative intervention to cap rents in some German cities and its likely undesirable long-term consequences.\nNext stop London, where house prices always rise – or so many have come to believe. Our feature on prime London property details the gathering risks to such cavalier assumptions. And finally Japan, where despite real estate prices still being a fraction of their peak levels in 1990, a confluence of factors including Tokyo hosting the 2020 Olympics is contributing to a nascent property bubble once again.\nAway from housing, this Konzept issue covers the recent immigration crisis in Europe arguing that it provides Germany a unique opportunity to transform and secure her economic future. Talking of the future, two other articles look at how traditional business models will cope with disruptive technological advances, as banks battle blockchains and the staid old television takes on online video. The prospects of consolidation in the banking industry in Spain and Italy are discussed. As is the concept of Confidence accounting – find out what it is inside Konzept #06.\nAbout Konzept:\nKonzept is a research magazine published at regular intervals that addresses the fundamental issues driving the world of economics and finance: it provides a platform for Deutsche Bank analysts to share their findings with clients and the wider world.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}