{
    "url": "https://www.db.com/news/detail/20151112-deutsche-bank-appoints-alasdair-warren-as-head-of-corporate-und-investment-banking-europe-middle-east-and-africa?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "November 12, 2015",
    "tags": [
        "Company",
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Deutsche Bank appoints Alasdair Warren as Head of Corporate & Investment Banking Europe, Middle East and Africa",
    "body": "Deutsche Bank announced today that Alasdair Warren will join the bank as Head of Corporate & Investment Banking (CIB) in Europe, Middle East and Africa (EMEA), effective spring 2016. Warren joins from Goldman Sachs where he was a Partner and Global Co-Head of the Financial Sponsors Group. Warren will be based in London and will report to Jeff Urwin, Head of Corporate & Investment Banking.\nUrwin said: “Alasdair has an impressive record of leading diverse businesses across capital markets and advisory. He brings with him industry-renowned expertise and a strong track record of building client relationships. His appointment signals our ambition to selectively invest and establish a market leading Corporate & Investment Banking business.”\nWarren said: “I am delighted to be joining Deutsche Bank at such an exciting point, where there is a great opportunity to build on what is an outstanding business. I have competed with Deutsche Bank on numerous occasions in the past and have always been impressed by the strength of its people and product offering.”\nEffective January 1, 2016, Corporate & Investment Banking will be created by combining the Corporate Finance business in CB&S and Global Transaction Banking (GTB), as announced last month.\nPrior to his current role at Goldman, Alasdair was Head of the Financial Sponsors Group in EMEA and Head of EMEA Equity Capital Markets and Equity Derivatives in addition to leading Goldman’s UK investment banking business. Alasdair joined Goldman Sachs as a managing director from Citigroup in 2005 and was named Partner in 2008. He has a number of deep relationships across EMEA primarily in the Financial Sponsor and NRG sectors. Warren earned a BSc (Hons) in Geology from The University of Nottingham. \n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}