{
    "url": "https://www.db.com/news/detail/20231129-deutsche-bank-private-bank-cio-outlook-2024-finding-growth?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "November 29, 2023",
    "tags": [
        "Capital markets",
        "Research"
    ],
    "title": "Deutsche Bank Private Bank CIO Outlook 2024: Finding Growth",
    "body": "Chief Investment Office presents twelve key themes that will lay the foundation for investments in 2024\nModerate growth is expected in industrialized economies whereas Asia remains the global growth engine\nCentral banks’ rates are unlikely to return to previous extreme low levels\nToday Deutsche Bank Private Bank’s Chief Investment Office (CIO) released its twelve key themes underpinning investment conditions in the new year.\nDespite the many current global challenges, prospects appear reasonably good for the main asset classes in 2024. But the big issue remains economic growth. Markets need to be convinced that growth will pick up again later in 2024. Investors also need to look forward to the risks and opportunities provided by more structural economic change.\nGlobal Chief Investment Officer Christian Nolting\nThe 12 key themes for next year are:\n(Geo)politics – Power play\nDomestic political developments are increasingly shaping foreign policy agendas – and 2024 will be the biggest election year in history.\nEconomy – Investing creates potential\nExpect only moderate growth in industrialised economies in 2024. The long-term challenge remains the delivery of investments to enhance economic competitiveness and fight climate change.\nInflation – Stage victory\nInflation is moderating but will stay above central bank target levels in 2024. This battle will take time to win.\nBonds – Real rates matter\nHigher yields have put bonds back centre-stage for investors – and investment grade could be the star. Prefer corporates over government bonds due to yield pick-up and sound fundamentals.\nFX – Be careful what you wish for\nProbably not a big year for FX moves, but the underlying reasons for currency strength will stay important: it’s not always beneficial.\nStocks – Growth comes at a price\nRobust earnings growth is expected globally in 2024. Expectations of higher rates for longer may however put a lid on valuations expansion.\nSectors – Banking on tech\nU.S. growth stocks are probably still the way to go for the long term. European and Japanese financials could appeal too, as well as consumer discretionary, industrials and energy.\nCommodities – Terms of trade\nOil prices likely to rise, despite only moderate economic growth. Supply/demand impact more evident for industrial metals.\nAlternatives – Asset-backed value\nStill plenty of reasons to like alternatives, which may also be a good source of portfolio diversification. Infrastructure has many merits.\nESG – We are in this together.\nESG investment has gone mainstream, with performance implications. Energy transition may point the way to investing in the sustainable economy.\nRisks – De-risking risks\nBe aware that measures to create stability may just create new risks. Rates are still on our radar.\nPortfolio – Balanced bull\nThe longer-term focus has to be on growth. Reconsider bonds, monitor equity risks and always diversify.\nStefanie Holtze-Jen, CIO for Asia Pacific, said: “Asia remains the growth engine of the global economy, with growth rates above developed economies. Our GDP forecast for China of 4.7% is based on continued growth-enhancing monetary and fiscal policy support, which should create a generally favourable backdrop for domestic investment, employment and thus private consumption in 2024. South East Asia’s power economies of India and Indonesia are also contributing to Asia’s momentum.”\nDirk Steffen, CIO for Europe, Middle East and Africa, said: “Europe is clearly in a soft patch, however we don’t see a recession. Regardless, full employment and persisting wage pressure will lead the ECB to stay vigilant. European companies are in a very good position, though. We like European discretionary consumer companies that cater to secular global consumer trends. Furthermore, Europe's industrial companies play a major role in the green transformation, while financials benefit from the radically changed rate environment.”\nDeepak Puri, CIO for the Americas, said: “The US economy continues to surprise on the upside but as we enter 2024 a bit of caution and conservatism is warranted. Financial conditions will remain tight and the effects of one of the most aggressive policy tightening programs may further complicate matters. We forecast an easing policy cycle by the second quarter of next year. In a nutshell, a slowing economy, policy easing and election year dynamics along with an ever-increasing role of AI will play a key role in investor positioning and asset class returns.”\nThe full CIO Outlook 2024 report will be published on December 7, 2023 on deutschewealth.com.",
    "number_of_ratings": 11,
    "rating": 4.7,
    "likes": 8
}