{
    "url": "https://www.db.com/news/detail/20231114-deutsche-bank-appoints-vathany-vijayaratna-as-ceo-for-deutsche-bank-uk-and-ireland?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "November 14, 2023",
    "tags": [
        "Personnel announcements"
    ],
    "title": "Deutsche Bank appoints Vathany Vijayaratna as CEO for Deutsche Bank UK and Ireland",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today announced the appointment of Vathany Vijayaratna as Chief Executive Officer (CEO) of Deutsche Bank UK and Ireland (UKI), subject to UK regulatory approval.\nSince joining Deutsche Bank in 2002, Vathany has held a range of roles in her career with the bank, mostly within Structuring in Fixed Income and Currencies (FIC). She was appointed Global Head of FIC Structuring in 2018, before taking on the role of Head of Non-Financial Risk for the Investment Bank in 2022.\nIn her new role, Vathany will oversee the bank’s operations in the UK and Ireland across all divisions and be responsible for further developing its franchise in the region. She will report to Fabrizio Campelli, Management Board member responsible for the Corporate and Investment Bank and for the UKI region.\nCommenting on the appointment, Fabrizio Campelli said: “The UKI has been a key region for Deutsche Bank for over 150 years. We see significant opportunities to grow our business further, and that’s why we are investing in the UKI through our recent acquisition of Numis and the development of our expanded new London headquarters at 21 Moorfields, as well as our investment in technology and people. Vathany has demonstrated all the skills required to take our franchise forward: a deep understanding of the bank and its capabilities, strong knowledge of non-financial risk management and 20 years’ experience of working with clients around the world across a range of asset classes. Throughout her long career with Deutsche Bank, Vathany has proven herself a strong and effective leader and we wish her every success.”\nVathany Vijayaratna said “Deutsche Bank’s connection to the UK and Ireland is a longstanding and deep one, built over 150 years of serving our clients in the region. I am honoured to take on the role of UKI CEO and look forward to working with our outstanding team to deliver on the opportunities for growth in the region and support our clients’ needs.”\nDeutsche Bank celebrated its 150th anniversary in the UK on March 8, 2023. The bank's UK journey began with the opening of its London Agency, which was its first European foreign branch. Today, Deutsche Bank employs more than 7,000 people in the UK and is one of the largest employers in the City of London. Deutsche Bank has had a presence in Ireland since 1991 and employs approximately 200 people in its offices in 2 Grand Canal Square.\nFor further information please contact:\nDeutsche Bank AG                                     \nMedia Relations                                         \nCharlie Olivier: +44 20 754-57866\nEmail:  charlie.olivier@db.com\nJo Court: 07879 272651\nEmail: joanne.court@db.com",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 4
}