{
    "url": "https://www.db.com/news/detail/20231111-how-new-south-wales-australia-successfully-managed-plastic-pollution?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "Singapore, November 9, 2023",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "How New South Wales, Australia successfully managed plastic pollution",
    "body": "In 2022, New South Wales, Australia, introduced a range of innovative measures to address the plastic pollution problem in the state. We caught up with James Griffin MP, the state’s former Environment Minister, on the sidelines of Responsible Investor Asia 2023 - an annual Asia focused ESG conference sponsored by Deutsche Bank - to discuss how under his leadership New South Wales became a leader in the fight against plastic pollution.\nYou can also read the full transcript of the video here: \nQ: What challenges did you face with plastic pollution in New South Wales?\n\"We had to think about how we could effectively solve the issue of plastic pollution and meet our target that we set in the state of New South Wales to not only reduce the consumption or use of plastic, but triple the amount of recycling of plastic that we had in our state.\"\nQ: How did you meet the plastic challenge?\n\"So what we set out to do was create a scheme whereby consumers would receive a ten cent refund for a bottle or ten that they would bring.\nAnd it was essentially a reverse vending machine. So you would bring your used carton or can and place it into the machine.\nThat waste was then taken to a recycling facility where it was turned into pellets and then reused in a manufacturing setting. But that involved a collaborative approach between the citizens as well as producers of plastic bottles and aluminum cans, and also a great deal of capital upfront to ensure that we could create this new world class facility in New South Wales.\"\nQ: How did you partner with the private sector in this initiative?\nWhat we did was have a frank and fearless discussion with the producers of these beverages and bottles and cans and understand what a win-win outcome would look like.\nJames Griffin\n\"In this circumstance they could receive the off-take or the waste that was then recycled into a valuable commodity or material. And at the front end, consumers could participate and receive money that they put to charities and organizations.\nSo it was about understanding the regulatory and political need to solve an environmental problem, and the opportunity to have a clear eyed discussion with the private sector about what good looked like to them and what opportunities existed for them.\"",
    "number_of_ratings": 4,
    "rating": 3.3,
    "likes": 5
}