{
    "url": "https://www.db.com/news/detail/20231102-financing-taiwan-s-largest-wind-farm-to-date?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 2, 2023",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Financing Taiwan’s largest wind farm to date",
    "body": "Deutsche Bank today announced it has completed a bespoke deal-contingent interest rate hedge and a tailored financing for Hai Long, Taiwan’s largest offshore wind project to date. Once completed, the wind farm will supply the equivalent of the electricity consumed by more than 1 million households in Taiwan (roughly 10% of its population) annually. Hai Long is expected to play an important role in helping Taiwan achieve its goal of constructing 5.7 GW of offshore windfarms by 2025, and net-zero greenhouse gas emissions by 2050. \nHai Long is a 1.0 gigawatt (GW) offshore wind project developed and owned by Northland Power Inc (Canada) and Mitsui & Co (Japan). This transaction represents the largest offshore wind project financing in the region. The total project cost is forecasted to be approximately USD 6.5 billion, of which approximately USD 3.6 billion is being raised through project financing with support from ECAs from six different countries, and a number of international and local financial institutions.\nThe project is Northland’s first offshore wind project in Asia and the fifth in its offshore wind portfolio. Deutsche Bank previously financed the construction of Northland’s first ever offshore windfarm in The Netherlands. Upon the project’s financial closing, Gentari International Renewables Pte Ltd, a wholly owned subsidiary of Petronas, will acquire a 29.4 percent indirect equity interest in Hai Long. Northland will own 30.6 percent and continue with the lead role in construction and operation.\nThe deal is Deutsche Bank’s fourth large scale project financing and hedging transaction in the offshore wind sector in Taiwan, further demonstrating the bank’s broad product offering and strong track record in renewables in Asia Pacific. Deutsche Bank has financed nearly 3 GW of wind power capacity for Taiwan thus far. This represents over 50% of Taiwan’s ambitious target for offshore wind energy by 2025.\n“Deutsche Bank is proud to be a go-to financial partner in Taiwan’s transition to renewable energy,” said Cynthia Chan, Deutsche Bank Chief Executive Officer for Taiwan. “Our tailored project finance and risk management solutions for our clients have been instrumental in the buildout of Taiwan’s renewable energy sector. To date, we have helped finance nearly 3 GW of wind power capacity for Taiwan across 4 large-scale transactions. Each transaction is unique and highly complex, involving multiple jurisdictions and a wide range of product requirements.\"\nWe are pleased to bring the full strength of our global network and award-winning structuring capability to bear in supporting these projects, and Taiwan’s broader decarbonization objectives. \nCynthia Chan",
    "number_of_ratings": 9,
    "rating": 3.6,
    "likes": 16
}