{
    "url": "https://www.db.com/news/detail/20200430-alexander-von-zur-muehlen-succeeds-werner-steinmueller-as-ceo-for-asia-pacific-and-member-of-the-deutsche-bank-management-board?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 30, 2020",
    "tags": [
        "Company",
        "Management & Leadership",
        "Strategy"
    ],
    "title": "Alexander von zur Mühlen succeeds Werner Steinmüller as CEO for Asia Pacific and member of the Deutsche Bank Management Board",
    "body": "The Supervisory Board of Deutsche Bank has appointed Alexander von zur Mühlen to the Management Board of Deutsche Bank AG effective August 1, 2020. He will take charge of the bank’s Asia Pacific business when Werner Steinmüller retires from the Management Board on July 31. Steinmüller will continue to serve the bank in an advisory role until year-end.\n“In his nearly 30 years of service at Deutsche Bank Werner Steinmüller has been instrumental in developing significant areas of the Group. Both the transaction bank, which he managed for several years, and most recently the APAC business are crucial to Deutsche Bank’s future,” said Supervisory Board Chairman Paul Achleitner. “Werner deserves our gratitude for his tireless dedication to Deutsche Bank and its clients. We wish him all the very best for the future.”\nAlexander von zur Mühlen joined Deutsche Bank in 1998 after studying business management. Following a variety of roles in investment banking, lastly as Co-Head of Debt Capital Markets in Europe, he was appointed Group Treasurer in 2009. In this function he managed the bank’s capital, liquidity and funding. In 2017 he was appointed Co-Head of Global Capital Markets and one year later named Global Head of Group Strategy, in summer 2018. In this function he played a key role in exploring a potential merger with Commerzbank at the start of 2019 as well as in preparing the strategy that was announced in summer 2019.\nAchleitner added: “In Alexander von zur Mühlen we have found an excellent in-house successor to Werner Steinmüller. As a recognised strategist and internationally experienced capital markets expert, he possesses all the skills and attributes needed to develop our Asia Pacific business and further advance our regional strategy. We wish him every success in his new position on the Management Board.”",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 2
}