{
    "url": "https://www.db.com/news/detail/20200429-q12020-results-message-from-christian-sewing-to-staff?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 29, 2020",
    "tags": [
        "Company",
        "Financial Results",
        "Management & Leadership"
    ],
    "title": "Q12020 results – Message from Christian Sewing to staff",
    "body": "Dear Colleagues,\nThe first quarter was defined, in part, by the most severe pandemic in recent history. We can be very satisfied with our bank’s performance in this environment. It is a testament to how much our clients appreciate our advice and our financial solutions in this coronavirus crisis that our revenues and results are substantially ahead of market expectations. We also made further progress in our transformation and are fully on track on costs.\nBefore we discuss the numbers, I would like to thank all of you for your continued hard work. Since March at the latest, many of you have been working in a profoundly changed environment, often with more to do than before the pandemic. On behalf of the entire Management Board, I’d like to say how proud we are of what we have all achieved together over the recent weeks and months. At this time of crisis we are at our best – for our clients across the whole world.\nYour performance has brought us to financial success this quarter. Group profit before tax was 206 million euros in the first quarter, despite bank levies of 503 million euros. After tax the bank reported a profit of 66 million euros.\nI am particularly proud of our performance in the Core Bank, that is to say, all of our businesses we want to continue. It increased its adjusted pre-tax profit by 32 percent year on year to 1.1 billion euros. One of the main drivers was a 7 percent increase in Core Bank revenues to 6.4 billion euros while remaining disciplined on reducing costs. Let me mention a few highlights:\nIn the Private Bank, revenues rose 2 percent year on year to 2.2 billion euros, driven by 9 percent revenue growth in Wealth Management. This partly reflects strategic hiring in previous years, which is now paying off. In the Private Bank Germany and Private and Commercial Business International fee income from investment products broadly offset the ongoing interest rate headwinds. Both in-branch and mobile staff have actively supported clients through challenging circumstances. Deutsche Bank’s mobile sales network (Mobiler Vertrieb), with more than 1,200 agents, handled more demand than at any time in its 32-year history, with sales up 34 percent year on year.\nIn the Investment Bank, revenues were 2.3 billion euros, up 18 percent year on year. We managed to grow revenues in a good number of our businesses, by 13 percent for instance in Fixed Income & Currencies. We also gained market share in several areas. In Germany, for example, we reclaimed the No.1 spot in corporate finance (source: Dealogic). Occupying this leading position in our home market is particularly important to us. The positive momentum continued recently. In the past four weeks we have helped place investment grade bonds worth over 50 billion euros in Europe and we have been involved in nearly half of all European corporate investment grade bond issues. And we have helped US investment grade clients to issue over 100 billion dollars of bonds over that same period.\nIn the Corporate Bank, revenues were essentially flat year on year despite negative interest rates in Europe and lower rates in the US. We saw 9 percent growth in corporate lending and are confident that we can win further market share in this environment, being a reliable partner with a broad range of products. In Germany we helped develop the government-sponsored loan programme and have so far supported over 5,200 clients applying for KfW loans worth approximately 4.4 billion euros. We have earmarked 20 billion euros for overall new credit extension to corporate clients.\nIn Asset Management, revenues were essentially flat versus the prior year; growth in management fees of 9 percent was offset by negative effects related to guarantee products. Despite the crisis, net asset outflows were a relatively modest 2 billion euros, after inflows of 25 billion euros during 2019.\nSo the first quarter confirms once again that we set the right strategic course last year. Our business model is robust and resilient, and this is particularly evident in these turbulent times.\nDespite the global crisis and the massive effort it has required, we also made good progress with our own transformation. Adjusted costs ex-transformation charges and bank levies decreased by 7 percent to 4.9 billion euros – the ninth successive year-on-year reduction in adjusted costs. We reaffirm our full-year cost target of 19.5 billion euros.\nWe continue to operate on very solid foundations. Although many corporates drew down their credit lines at the beginning of the coronavirus crisis, our liquidity remained strong at 205 billion euros at the end of the quarter, comfortably above regulatory requirements. Provision for credit losses increased notably, but our loan book is low-risk and well diversified. Our Common Equity Tier 1 capital ratio was 12.8 percent at quarter-end, substantially above regulatory requirements which we exceeded by approximately 240 basis points.\nWe have, however, made a conscious decision to allow our capital ratio to fall modestly and temporarily below our 12.5 percent target if credit demand by our clients remains strong. We need this flexibility to strengthen our market position further and to contribute to economic recovery. We want to be part of the solution. I need you to know, though, that we have not given up on the 12.5 percent marker; it remains our target. If we fall below this level, then it should only be temporarily.\nWe have to make sure that we can serve our clients in a way not many other banks can – as a ‘global Hausbank’. This time of crisis is showing us more clearly what our clients expect of us. And we are now working together in our bank in a way we couldn’t previously have imagined: non-bureaucratic, open and direct. It is precisely these lessons that we will take with us once the crisis is over – lessons that will not only help us reduce costs but also increase our revenues.\nAt the same time, we have a responsibility to play our part in helping the economy and society to weather what is probably the deepest crisis in post-war history. This is about more than just providing support for our clients; it is about social responsibility.\nMany of you are supporting your local communities in a number of ways from sewing masks to helping young people with home study. And we are particularly proud of how generously you have been supporting our matched-giving campaign for food and shelter charities. You have already donated more than 600,000 euros globally, and our bank will not only double this commitment, but we also donated 500,000 euros to get the ball rolling.\nThis brings us up to 1.7 million euros already – and the initiative is far from over. The money will go to charities we’ve been working with for many years. You can find the details here.\nWe on the Management Board and the Group Management Committee know that we can count on you. You have proven that again in recent weeks, so let me thank you once more. I wish you and your families all the very best and continued good health. Please take care of yourselves and those around you.\nBest wishes,\nChristian Sewing",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}