{
    "url": "https://www.db.com/news/detail/20200429-deutsche-bank-reports-profitable-quarter-driven-by-revenue-growth-in-core-businesses-strategic-transformation-on-track?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 29, 2020",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank reports profitable quarter driven by revenue growth in core businesses – strategic transformation on track",
    "body": "Balance sheet strength maintained while meeting client demand for credit\nCommon Equity Tier 1 (CET1) capital ratio of 12.8%, approximately 240 basis points above current regulatory requirements, despite regulatory inflation, COVID-19 impacts and business growth\nLiquidity reserves remain strong at 205 billion euros with a Liquidity Coverage Ratio of 133%, 43 billion euros above regulatory requirements\nLoans increased by 25 billion euros, up 6% in the quarter\nProvision for credit losses of 506 million euros, of which approximately 50% due to COVID-19\nGroup profit driven by Core Bank revenue and profit growth\nGroup profit before tax of 206 million euros after bank levies of 503 million euros, transformation-related effects of 172 million euros and costs of ongoing Capital Release Unit wind-down\nAdjusted profit before tax up 13% year-on-year to 303 million euros\nNet profit of 66 million euros\nCore Bank adjusted profit before tax up 32% to 1.1 billion euros, driven by revenue growth and cost reduction\nCore Bank revenues ex-specific items up 7% to 6.4 billion euros\nContinued cost reduction and execution of transformation strategy\nAdjusted costs ex-transformation charges and bank levies of 4.9 billion euros, down 7%, 9th consecutive quarter of year-on-year reductions\n73% of total anticipated transformation-related effects now absorbed\nCapital Release Unit: leverage exposure further reduced by 9 billion euros to 118 billion euros\nHelping clients meet the challenge of COVID-19\nThe Corporate Bank: supporting over 5,200 clients applying for credit worth approximately 4.4 billion euros under the KfW-sponsored loan programme and earmarked 20 billion euros for overall new credit extension to corporate clients\nInvestment Bank: helping companies and government clients raise over 150 billion euros of debt financing since mid-March\nPrivate Bank: continuing to serve clients through ~1,100 Deutsche Bank and Postbank branches, with 2 billion euros in new client loans in the quarter\nAsset Management: engagement with clients up 50% through DWS Direkt, with client website volume up 25%\nChristian Sewing, Chief Executive Officer, said: “In the current crisis, we have shown robust numbers and demonstrated strong performance in support of our clients across all core businesses. Conservative balance sheet management enables us to navigate the current environment from a position of strength as the leading bank in Europe's strongest economy. I want to say a huge thank you to our employees, who have shown outstanding dedication and flexibility. I am proud of the way we have been there for our clients, our communities and for each other.”\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) reported a profitable first quarter of 2020 while growing revenues in its Core Bank and maintaining balance sheet strength. Capital remained substantially above regulatory minimum levels, while credit provisions grew from low levels in the prior year, reflecting a deteriorating macro-economic environment impacted by COVID-19.\nGroup profit before tax was 206 million euros, despite bank levies of 503 million euros and pre-tax transformation-related effects of 172 million euros. These effects comprised transformation charges of 84 million euros and restructuring and severance of 88 million euros. First-quarter net income was 66 million euros.\nThe bank continued its strategic transformation as planned. Revenue and expense performance in the Core Bank reflected continued momentum and execution of strategic priorities. Of the total transformation-related effects anticipated between 2019 and 2022, 73% have now been recognised. The number of employees on a Full Time Equivalent (FTE) basis declined by 930 to 86,667 at the end of the quarter.\nProvision for credit losses was 506 million euros, or 44 basis points of loans, and included approximately 260 million euros related to COVID-19. Provision for credit losses taken in the quarter increased allowance for loan losses to 4.3 billion euros, equivalent to 95 basis points of total loans. The full-year 2020 outlook is for provision of credit losses of 35-45 basis points of loans.\nThe Core Bank, which excludes the Capital Release Unit, reported adjusted profit before tax of 1.1 billion euros, up 32%, driven by 7% growth in revenues ex-specific items and a 4% reduction in adjusted costs ex-transformation charges.\nThe Capital Release Unit recognised a pre-tax loss of 767 million euros which was in line with internal expectations. The unit continued to make progress with asset reduction despite challenging conditions. Leverage exposure was reduced by 9 billion euros to 118 billion euros in the quarter, while risk weighted assets were down 2 billion euros to 44 billion euros.\n\nSupporting clients through unprecedented challenges\nAll Deutsche Bank’s core businesses supported clients through exceptionally challenging market conditions. The Corporate Bank is supporting approximately 5,200 applications, with a volume of 4.4 billion euros, from customers related to the German government-sponsored KfW loan programme. Across its German network, Deutsche Bank has trained around 3,000 staff to provide specialist advice to clients on KfW and COVID-19 related topics. The Corporate Bank also earmarked 20 billion euros for new credit extension to companies.\nThe Investment Bank has helped companies, governments and agencies raise more than 150 billion euros in debt to finance their activities since the outbreak of COVID-19 in mid-March 2020.\nThe Private Bank continues to provide direct access to clients through 290 Deutsche Bank and all 800 Postbank branches, more than any other German bank, supported by advisors providing advice by telephone and online. Daily logins reached approximately 2.5 million per day, call centre volume has risen by around 30%, and securities transactions processed for clients peaked at more than double average volumes. Deutsche Bank’s German mobile distribution network (Mobiler Vertrieb), with more than 1,200 agents, handled more demand and served clients more intensively than at any time in its 32-year history, with sales up 34% year on year.\nAsset Management has advised clients through its DWS Direkt channel which saw volumes 50% above average, while volumes of digital activity, through the DWS website and social media channels, rose by 25% and 32% respectively.\nDeutsche Bank has been active in helping communities around the world meet the challenge of COVID-19. The bank donated 575,000 medical masks to the municipalities of Frankfurt, Berlin and Bonn. In addition to making a 500,000 euro donation, the bank is matching employee donations of over 600,000 euros to Food & Shelter charities around the world to support some of those most impacted by the pandemic. In India, Deutsche Bank has provided isolation rooms and family survival kits, and partnered with the Akshaya Patra Foundation to provide 1 million meals to homeless and daily wage labourers in four cities.\n\nBalance sheet strength despite growth in lending\nConservative balance sheet management enabled Deutsche Bank to support clients through extremely challenging economic and financial market conditions during the quarter. Risk weighted assets grew by 17 billion euros to 341 billion euros, partly reflecting growth in loans of 25 billion euros or 6%.\nThe CET1 capital ratio was 12.8% at quarter-end, compared to 13.6% at the end of 2019, and approximately 240 basis points above regulatory requirements. This development was driven by:\nA reduction of approximately 30 basis points from the new securitization framework which took effect on January 1, 2020;\nCOVID-19 related impacts, largely expected to be temporary, of approximately 40 basis points mainly driven by client drawdowns and higher prudent valuation reserves;\nApproximately 10 basis points from regular business growth.\nLiquidity reserves remained strong at 205 billion euros at the end of the quarter, down by 8% from 222 billion euros. This development largely reflected drawdowns on committed facilities as the bank supported demand from clients. However, the Liquidity Coverage Ratio, at 133%, remains 43 billion euros or 33%, above regulatory requirements.\nProvision for credit losses was 44 basis points of loans, reflecting conservative underwriting standards, strong risk management and a low-risk, well-diversified loan portfolio but higher year on year driven by the aforementioned impact of COVID-19. Investment Bank provision for credit losses was 111 basis points of loans, driven by rating migrations, increased drawdowns on committed credit facilities and updates to the macro-economic outlook.\n\nRevenue growth in core businesses despite challenging conditions late in the quarter\nGroup revenues were 6.4 billion euros, flat year-on-year, despite the bank’s exit from equities trading in July 2019. Revenues in the Core Bank were 6.4 billion euros, up 7% year-on-year both on a reported basis and excluding specific items, reflecting delivery on the bank’s transformation strategy.\nIn the Corporate Bank, revenues were 1.3 billion euros, essentially flat year on year. Continued progress on strategic execution, including deposit repricing measures, helped to offset the impact of ongoing interest rate headwinds.\nIn the Investment Bank, revenues were 2.3 billion euros, up 18%. This was driven by 13% growth in Fixed Income & Currencies, with strong growth in Foreign Exchange and Rates which more than offset significantly lower revenues in Credit. In Rates, Deutsche Bank gained market share and ranked second in electronic US Treasury trading in March (source: Bloomberg).\nOrigination & Advisory revenues were up 8%, as growth in Debt Origination more than offset lower revenues in Advisory. Deutsche Bank recaptured the No. 1 position in corporate finance in Germany with a market share of just under 14%, its highest since 2014 (source: Dealogic).\nIn the Private Bank, revenues rose 2% year-on-year to 2.2 billion euros, driven by 9% revenue growth in Wealth Management, or 17% excluding gains related to workout activities, which partly reflected strategic hiring in previous periods; in the Private Bank Germany and Private & Commercial Business International, fee income from investment products largely offset interest rate headwinds.\nIn Asset Management, revenues were essentially flat versus the prior year, as 9% growth in management fees was offset by negative changes in the fair value of guarantees driven by lower interest rates. Net asset outflows were a relatively modest 2 billion euros, after inflows of 25 billion euros during 2019.\n\nSustained progress on cost reduction in line with strategy\nNoninterest expenses were 5.6 billion euros in the first quarter, down 5% versus the prior year. Adjusted costs were 5.5 billion euros, down 7%.\nAdjusted costs ex-transformation charges were 5.5 billion euros in the quarter, down 8% year-on-year. Adjusted costs included bank levies primarily relating to Deutsche Bank’s contribution to the Single Resolution Fund of 503 million euros, and 98 million euros of reimbursable expenses associated with the transfer of the bank’s Prime Finance platform to BNP Paribas.\nAdjusted costs ex-transformation charges and bank levies were 4.9 billion euros, representing the ninth successive quarterly year on year reduction. Deutsche Bank reaffirmed its 2020 target of 19.5 billion euros in adjusted costs ex-transformation charges and reimbursable expenses associated with the BNP Paribas transfer. A reduction in compensation and benefits expenses was driven by workforce reductions, while reduced IT expenses reflected lower software amortisation. Bank levies in the quarter declined 17% versus the prior year period.\nCorporate Bank\nFirst-quarter net revenues were 1.3 billion euros, essentially flat year on year.\nGlobal Transaction Banking revenues of 968 million euros declined by 2%. Cash Management revenues were essentially flat, as the impact of reductions in interest rates in the U.S. and the ongoing negative rates in Europe were partly offset by deposit repricing and ECB deposit tiering.\nTrade Finance and Lending revenues were also essentially flat, with solid lending volumes and wider spreads at the end of the quarter. Securities Services revenues declined reflecting the absence of a gain in the prior year period while Trust & Agency Services revenues were also lower, driven by the impact of U.S. interest rate cuts and lower client activity.\nCommercial Banking revenues of 358 million euros were essentially flat, as higher volumes in Commercial Lending and higher payment fees were offset by lower deposit revenues.\nFirst-quarter noninterest expenses of 1,088 million euros increased by 8% primarily driven by higher internal service cost allocations and higher transformation charges. Adjusted costs, excluding transformation charges increased by 4% mainly reflecting higher internal service cost allocations.\nProvision for credit losses was 106 million euros in the first quarter 2020, mainly related to a small number of idiosyncratic events as well as the worsening outlook due to COVID-19.\nProfit before tax was 132 million euros in the first quarter, with a post-tax return on tangible equity of 3%. Excluding transformation charges, restructuring and severance, the Corporate Bank generated a profit before tax of 168 million euros.\nInvestment Bank\nFirst-quarter net revenues were 2.3 billion euros, an 18% increase from the prior year period. Excluding specific revenue items, revenues increased by 15%.\nFixed Income & Currency (FIC) Sales & Trading revenues were 1.9 billion euros, up 13%, and up 16% excluding specific revenue items. Revenues across Rates, Foreign Exchange and Emerging Markets increased significantly, benefitting from increased volatility, strong client flows and effective risk management. Credit revenues were significantly lower, driven by challenging market conditions at the end of the quarter.\nOrigination & Advisory revenues of 458 million euros increased by 8% driven by significantly higher Debt Origination revenues partially offset by significantly lower Advisory revenues as market volumes declined. Deutsche Bank has increased market share in Germany and EMEA according to Dealogic.\nNoninterest expenses declined by 15% to 1.5 billion euros in the quarter. Adjusted costs, excluding transformation charges also declined by 15% versus the prior year quarter and included 134 million euros of bank levies. The reduction in noninterest expenses was principally driven by lower service cost allocations as well as lower bank levies.\nProvision for credit losses was significantly higher at 111 basis points of loans driven by rating migrations, increased drawdowns on committed credit facilities and updates to the macro-economic outlook.\nProfit before tax was 622 million euros in the quarter with a post-tax return on tangible equity of 8%.\n\n\nPrivate Bank\nFirst-quarter net revenues of 2.2 billion euros increased by 2% versus the prior year period. Excluding specific revenue items, net revenues grew by 3%.\nRevenues in the Private Bank Germany declined by 1% as continued deposit margin compression as well as higher funding and liquidity cost allocations were broadly offset by growth in investment product revenues and loan volumes. The Private Bank Germany generated loan growth in the eighth consecutive quarter with almost 2 billion euros in net new client loans, mainly in mortgages.\nPrivate and Commercial Business International revenues increased by 3% as growth in loan and investment product revenues, combined with repricing measures, more than offset the interest rate headwinds and first impacts of COVID-19 on client activity, mainly in Italy and Spain.\nWealth Management revenues increased by 9%, or 17% excluding gains in the prior year period related to Sal. Oppenheim workout activities. The growth was driven by a strong performance across all regions in particular in capital market products in Emerging Markets in the first two months of the year. Revenues also benefitted from targeted hiring and net inflows in investment products of 3 billion euros in the quarter.\nAssets under Management declined by 40 billion euros in the quarter on negative market performance. The businesses generated net inflows of 4 billion euros in investment products during the quarter.\nNoninterest expenses of 1.9 billion euros, increased by 5% reflecting higher restructuring and severance charges. Adjusted costs excluding transformation charges were 1.8 billion euros, down 2% despite negative impacts from changes in internal service cost allocations. The decline reflected benefits from reorganisation measures and workforce reductions in prior periods. The Private Bank Germany achieved approximately 70 million euros of merger-related cost synergies in the quarter.\nProvision for credit losses increased to 139 million euros or 24 basis points of loans, returning to more normalised levels with limited COVID-19 impact in the quarter. Profit before tax was 132 million euros in the first quarter. Adjusted for specific revenue items, restructuring and severance as well as transformation charges, profit before tax improved to 197 million euros.\n\n\n\nAsset Management\nFirst-quarter net revenues of 519 million euros were essentially flat year on year. Management fees increased year on year by 9% despite the decline in the market. We recorded a loss of 51 million in other revenues, predominately due to the negative change in fair value of guarantees mainly driven by the reduction in interest rates\nFirst-quarter outflows were 2 billion euros as strong inflows early in the quarter were more than offset by the industry-wide outflows seen in March. Net outflows in Fixed Income and Passive in the quarter were partly offset by net inflows in Cash, Equity and Alternatives.\nAssets under Management, at 700 billion euros, declined significantly in the quarter, mainly driven by negative market performance.\nNoninterest expenses were 374 million euros in the first quarter, down 6% year on year. Adjusted costs excluding transformation charges of 366 million euros declined by 7% mainly reflecting ongoing cost saving initiatives as well as benefits from lower volumes and lower variable compensation in the first quarter of 2020.\nProfit before tax was 110 million euros in the first quarter a 14% increase from the prior year period.\n\nCorporate & Other\nCorporate & Other reported a pre-tax loss of 24 million euros in the first quarter 2020, compared to a loss before tax of 15 million euros in the prior year period. Positive movements in valuation and timing were offset by movements in a number of smaller items. Funding and liquidity charges also increased slightly, consistent with the changes in funds transfer pricing described in prior periods.\n\nCapital Release Unit\nNet revenues were negative 59 million euros in the first quarter as funding and credit valuation adjustments and de-risking costs were partly offset by hedging and risk management gains and income from the BNP Paribas agreement.\nNoninterest expenses were 694 million euros in the quarter, compared to 946 million euros in the prior year period. Noninterest expenses were broadly stable compared to the fourth quarter of 2019 reflecting the 247 million euros of bank levies booked in the first quarter.\nExcluding bank levies and transformation charges, adjusted costs declined by 83 million euros from the prior quarter driven by lower cost allocations and lower direct non-compensation costs.\nLoss before income taxes was 767 million euros in the quarter compared to a 541 million euro loss in the prior year period.\nLeverage exposure of 118 billion euros declined from 127 billion euros at year-end 2019 as de-risking impacts were partly offset by market driven increases.\nRisk weighted assets were 44 billion euros, down from 46 billion euros at year-end 2019 as de-risking impacts were partly offset by market driven increases.\n\n\n\nBasis of Accounting\nResults are prepared in accordance with International Financial Reporting Standards (IFRS) as endorsed by the European Union, including, from the first quarter of 2020, application of portfolio fair value hedge accounting for non-maturing deposits (the “EU carve-out”). For the period ended March 31, 2020, the EU carve-out had a positive impact of 132 million euros on net revenues and profit before tax and of 70 million euros on profit post tax.\nThe bank’s regulatory capital and ratios thereof are also reported on the basis of IFRS as endorsed by the EU using the EU carve-out. The impact on profit after tax also impacts the calculation of CET1 capital and had a positive impact of about 2 basis points as of March 31, 2020. In any given period, the net effect of the EU carve-out can be positive or negative, depending on the fair market value changes in the positions being hedged and the hedge instruments.\nUse of Non-GAAP Financial Measures\nThis document and other documents we have published or may publish contain non-GAAP financial measures. Non-GAAP financial measures are measures of our historical or future performance, financial position or cash flows that contain adjustments that exclude or include amounts that are included or excluded, as the case may be, from the most directly comparable measure calculated and presented in accordance with IFRS in our financial statements. Examples of our non-GAAP financial measures, and the most directly comparable IFRS financial measures, are as follows:\nAdjusted profit (loss) before tax is calculated by adjusting the profit (loss) before tax under IFRS for specific revenue items, transformation charges, impairments of goodwill and other intangibles, as well as restructuring and severance expenses.\nSpecific revenue items generally fall outside the usual nature or scope of the business and are likely to distort an accurate assessment of the divisional operating performance.\nAdjusted costs are calculated by deducting (i) impairment of goodwill and other intangible assets, (ii) litigation charges, net and (iii) restructuring and severance from noninterest expenses under IFRS.\nTransformation charges are costs included in adjusted costs that are directly related to Deutsche Bank’s transformation as a result of the new strategy announced on 7 July 2019. Such charges include the transformation-related impairment of software and real estate, the quarterly amortization on software related to the Equities Sales and Trading business and other transformation charges like onerous contract provisions or legal and consulting fees related to the strategy execution.\nTransformation-related effects are financial impacts resulting from the new strategy announced on July 7, 2019. These include transformation charges, goodwill impairments in the second quarter 2019, as well as restructuring and severance expenses from the third quarter 2019 onwards. In addition to the aforementioned pre-tax items, transformation-related effects on a post-tax basis include pro-forma tax effects on the aforementioned items and deferred tax asset valuation adjustments in connection with the transformation of the Group.\nFor descriptions of non-GAAP financial measures and the adjustments made to the most directly comparable IFRS financial measures to obtain them, please refer to 17-25 of the first quarter 2020 Financial Data Supplement published on the Deutsche Bank website, www.db.com/quarterly-results\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nSebastian Kraemer-Bach\nPhone: +49 69 910 43330\nEmail: sebastian.kraemer-bach@db.com\nEduard Stipic\nPhone: +49 69 910 41864\nEmail: eduard.stipic@db.com\nCharlie Olivier\nPhone: +44 20 7545 7866\nEmail: charlie.olivier@db.com\nInvestor Relations\n+49 800 910-8000 (Frankfurt)\ndb.ir@db.com\nAn analyst call to discuss first-quarter 2020 financial results will take place at 13:00 CET today. A Financial Data Supplement (FDS), presentation and audio-webcast for the analyst conference call are available at:\nwww.db.com/quarterly-results\nA fixed income investor call will take place on, April 30, 2020, at 15:00 CET. This conference call will be transmitted via internet: www.db.com/quarterly-results\n  About Deutsche Bank\nDeutsche Bank provides retail and private banking, corporate and transaction banking, lending, asset and wealth management products and services as well as focused investment banking to private individuals, small and medium-sized companies, corporations, governments and institutional investors. Deutsche Bank is the leading bank in Germany with strong European roots and a global network.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}