{
    "url": "https://www.db.com/news/detail/20200429-florian-drinhausen-to-leave-deutsche-bank?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 29, 2020",
    "tags": [
        "Company"
    ],
    "title": "Florian Drinhausen to leave Deutsche Bank",
    "body": "The General Counsel of Deutsche Bank, Florian Drinhausen, will leave the company on 31 May 2020 by mutual agreement. The Bank will decide on a successor in the position of General Counsel in the near future. Until then, the legal department will be managed directly by the designated Chief Legal Officer Stefan Simon. Drinhausen had been with the company since 2014.\n\"With Florian Drinhausen’s departure, Deutsche Bank is losing a valued colleague,\" said Christian Sewing, Chairman of the Management Board of Deutsche Bank. \"With his experience and expertise, Florian Drinhausen has made a significant contribution to bringing to a close the complex legal disputes of the past and reducing the bank's legal risks. We are sorry that he is leaving Deutsche Bank and wish him all the best for the future.\n\"Florian Drinhausen is an important leader and an outstanding lawyer,\" added Karl von Rohr, President and Management Board member responsible for legal and governance issues, among other things. \"I value his legal acumen, his solution-oriented approach, and his courage and ability to always find a viable way forward – even in the most difficult situations. Florian Drinhausen rendered great service to Deutsche Bank during his tenure. For this, we thank him very much.\"\nDrinhausen joined Deutsche Bank in 2014 from the law firm Linklaters. He was initially responsible for the Europe, Middle East and Africa regions as General Counsel. In 2016, he also assumed responsibility for the bank's governance structures, and in 2018 he was appointed Head of the Legal Department and General Counsel. In this function he also advised clients on particularly complex transactions. Under his leadership, the legal department developed a clearer governance structure for Deutsche Bank Group and made great progress in digitizing the processes in the legal department. At the same time, Drinhausen reduced the costs of external legal advice and ensured the conclusion of numerous complex legal proceedings of the bank.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}