{
    "url": "https://www.db.com/news/detail/20200428-how-uk-charity-of-the-year-hospice-uk-continues-to-ensure-frontline-heroes-can-provide-safe-shelter-during-the-coronavirus-pandemic?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 28, 2020",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "How UK Charity of the Year, Hospice UK, continues to ensure frontline heroes can provide safe shelter during the coronavirus pandemic",
    "body": " As the coronavirus outbreak continues across the UK, hospices and care staff are providing beds, specialist clinical support and a safe shelter for some of the most vulnerable patients. In doing so they offer much needed relief to the NHS, as well as a safe haven for almost a quarter of a million people every year at the end of their lives. As the toll of the virus unfolds, this number is only set to increase over the coming weeks.\nIn response to the crisis, Hospice UK, the bank’s UK Charity of the Year for 2020-21, is ensuring vulnerable patients can be cared for in the safe haven of a local hospice and receive expert care. The charity estimates a donation of 100 pounds could help fund weekly coronavirus crisis response video conferences, supporting more than 300 frontline staff give the highest quality care and safe shelter for many patients in this challenging time.\n\nJonny, from Fixed Income & Currencies, knows the importance of Hospice UK’s work “End of life care is not something the NHS is setup for, even in normal times.\nWhen my father was diagnosed with terminal cancer we were lucky to get him into a local hospice in Blackpool, where a truly challenging time was softened by the incredible round the clock care and safe haven he had. My father passed away with dignity and we will be forever indebted to the incredible work and safe shelter that his and all other hospices across the UK provide for patients and their families in times of need.\"\nHospice UK is one of the selected partners that benefits from our Corporate Social Responsibility Covid-19 relief campaign, which encourages all Deutsche Bank employees to support food and shelter charities that serve their most vulnerable neighbours, including low-income children and families, the elderly, and individuals experiencing homelessness.\nThe bank has set the ball rolling with a total of 500,000 euro in up-front donations to these long-standing CSR partner charities and will match all employee donations towards them.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}