{
    "url": "https://www.db.com/news/detail/20200424-deutsche-bank-s-dcm-success-continues-leading-two-new-european-sovereign-issuances-in-one-day?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 24, 2020",
    "tags": [
        "Capital markets",
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Deutsche Bank's DCM success continues leading two new European Sovereign issuances in one day",
    "body": "Following the busiest four weeks ever for Deutsche Bank‘s Debt Capital Market (DCM) team, the momentum has not slowed as the bank led another two major issuances for two European Sovereigns in one day this week.\nThe first transaction, launched on Tuesday, was the record breaking 16 billion euro dual tranche bond for the Republic of Italy. The issuance, which Deutsche Bank acted as a joint lead bookrunner, was the Republic's first syndication since the country was hit hard by the coronavirus in late February. The sovereign succeeded in launching the transaction as a 16 billion euro two-tranche offering; selling a 10 billion euro 5-year tranche at 1.85%, and 6 billion euro 30-year tranche at 2.45% coupons. Split between a new five-year line and a tap of its 2.45% note due in 2050, the demand for the Sovereign’s debt passed the 110 billion euro mark, crushing all previous eurozone sovereign syndication records.\nOn the same day, Deutsche Bank led Luxembourg’s historic 2.5 billion euro dual tranche bond issuance with negative interest rates to finance the fight against Covid-19. The sovereign launched the transaction as a 2.5 billion euro deal selling a 1.5 billion euro 5-year note due in 2025 and a 1 billion euro 10-year note due in 2030.\nCommenting on the transactions, Neal Ganatra, who is responsible for Supranational, Sovereign and Agencies (SSA) DCM syndicate in EMEA, said: “European sovereign issuances reached 140 billion euro this year, an increase of 88% from the same period last year. Investors’ appetite is strong and their willingness to support Governments in their fight against the pandemic is remarkable. Despite all the challenges, the resilience that our team showed delivering these issuances for our European sovereign clients is a testament of our capabilities and of the bank’s position as a part of the solution to restore the global economy.”\nDeutsche Bank’s DCM team is having a standout year. The bank finished the first quarter in the number one position in all European debt, up from number three position last year. It was the bank’s best quarter for investment grade bond issuance globally since the first quarter of 2017. Overall, the bank bookran 103 investment grade bond transactions worth more than 150 billion euros in volume. In the sovereign space in the last two weeks alone, the team co-lead a 4.5 billion US dollar triple-tranche bond for the Republic of Indonesia, a 10 billion US dollar triple-tranche bond for the State of Qatar, a 2.25 billion euro multi-tranche bond for the Republic of Slovenia and 13 billion Australian dollars bond for the Australian Office of Financial Management, in addition to the two issuances for the Republic of Italy and Luxembourg mentioned above.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}