{
    "url": "https://www.db.com/news/detail/20200423-formation-of-sustainable-finance-team-within-capital-markets?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 23, 2020",
    "tags": [
        "Corporate products",
        "Sustainability"
    ],
    "title": "Formation of Sustainable Finance team within Capital Markets",
    "body": " Given the increased focus on Environmental, Social & Governance (ESG) matters from Investment Bank clients, a dedicated Sustainable Finance team has been formed within Capital Markets as part of Deutsche Bank’s broader strategy to offer ESG products and solutions to all client groups.\nTrisha Taneja will join from Sustainalytics in April 2020 and head the Sustainable Finance team, which will be a valuable resource available to clients and global coverage teams to better understand the impact of ESG on market access and business development.\nOperating within the existing Capital Solutions & Sustainable Financing (CS&SF) group led by Boris Kopp, the new team will partner closely with a network of regional and sectoral ‘ESG champions’ to be announced in due course, while aligning with other IB and bank-wide initiatives to ensure a consistent messaging and approach.\n“Being able to offer global clients further ESG product expertise, regulatory guidance and investor perspectives will be key a differentiator, opening the door to broader strategic dialogue and ensuring Deutsche Bank is viewed as market leader on this important subject,” said Henrik Johnsson, Global Co-Head of Capital markets and Co-Head of Investment Bank, EMEA, and Frazer Ross, Head of DCM syndicate, EMEA.\nAdditional team members:\nFederica Calvetti will add responsibility for ESG DCM dialogue, while retaining her current DCM coverage responsibilities, for which she will continue to report to Mark Lewellen.\nHenrike Pfannenberg will continue and expand on the role she has been doing previously within the ICG group, specifically focused on how investors drive the ESG topic.\nTamara Atanasova and Kevin Laubach will remain within Capital Solutions while continuing to cover ESG dialogue with clients subject to financial regulation (bank, insurance & asset managers).",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 3
}