{
    "url": "https://www.db.com/news/detail/20200423-sundp-revises-outlook-for-certain-banks-to-reflect-impact-of-coronavirus?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 23, 2020",
    "tags": [
        "Company"
    ],
    "title": "S&P revises outlook for certain banks to reflect impact of Coronavirus",
    "body": "Today, the rating agency S&P published its assessment of a number of banks, including Deutsche Bank, to reflect the potential impact of the Coronavirus.\nAs part of this assessment, S&P has revised downward its ratings outlook on a number of prominent UK, French, Benelux and German banks, and downgraded Commerzbank’s long-term issuer credit rating. It has changed Deutsche Bank´s rating outlook to “negative\" from \"stable\", but affirmed the 'BBB+/A-2' issuer credit and senior preferred rating of the bank.\nOn the overall economic situation, S&P commented: “Despite governments' measures to contain the COVID-19 pandemic, European economies, including Germany and others that Deutsche Bank is exposed to, face an unprecedented challenge.” S&P currently expects the European Union economy to contract by 7% in 2020.\nS&P recognised Deutsche Bank’s strong balance sheet and business model: “We are revising the outlook on the bank and its core operating subsidiaries to negative, but affirming our 'BBB+/A-2' issuer credit ratings because we expect the bank to emerge from this deep, but short-term cyclical downturn with a reasonably resilient balance sheet and a more efficient and focused business and operating model.”\nS&P commented on Deutsche Bank`s transformation strategy and management performance: “We have affirmed the ratings on the bank because, even under this revised base case, we consider management's restructuring plan to be fundamentally on track. We believe that management will likely deliver a significantly improved business and operating model, bringing it close to covering its cost of capital by 2022. However, the negative outlook acknowledges substantial downside risks.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}