{
    "url": "https://www.db.com/news/detail/20200421-covid-19-csr-community-relief-hamburg-charity-budnianer-s-corona-relief-fund?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 21, 2020",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "COVID-19 CSR community relief: Hamburg charity BUDNIANER's Corona relief fund",
    "body": "Joining forces in the neighbourhood! This has been BUDNIANER HILFE‘s motto since 1997. In normal times, it focuses on helping young people in Hamburg, Germany fulfil their potential, especially those who are disenfranchised due to their social or economic background or health issues.\nBut these are not normal times: the Corona crisis is damaging the livelihoods of many. Those who are already marginalised are losing their jobs, and family incomes don’t last until the end of the month.\nPlaces that provide shelter or food for disadvantaged children or the homeless have had to close their doors, because they can no longer rely on the donations of food or basic necessities that enable them to help others.\nThis is why BUDNIANER HILFE has recently extended its portfolio and launched a relief fund that supports other charities, e.g. food banks, soup kitchens or initiatives for the homeless.\nThey pass on 100 percent of donations to these partners, giving direct and tangible help for those with the most pressing needs. Ralf Below, a member of the Corporate Bank’s Collections, Recoveries & Workout Corporates Germany team, was instrumental in making this happen. As a longstanding volunteer for homelessness initiatives, he knows about the struggles they face – now more than ever.\nIn light of the Corona pandemic, Ralf now serves as a volunteer “StraßenHELD” - Street Hero - and gives “Street Donations” such as 20 euro notes to homeless people. Wearing gloves, he deposits the notes below a rock and always ensures the recommended social distancing of 2 metres. And in spite of this distance, he experiences moments of closeness and conversations at eye level:\n“Happy faces among the homeless across all different parts of Hamburg. One even said `you saved my ass today`. Even if everything is pretty awful – this initiative has put a smile on my soul.”\nThe COVID-19 relief campaign encourages all Deutsche Bank employees to support food and shelter charities that serve their most vulnerable neighbours, including low-income children and families, the elderly, and individuals experiencing homelessness. The bank has set the ball rolling with a total of 500,000 euro in up-front donations to these long-standing CSR partner charities and will match all employee donations towards them.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}