{
    "url": "https://www.db.com/news/detail/20210329-a-message-from-christian-sewing-concerning-changes-to-the-management-board?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "March 29, 2021",
    "tags": [
        "Company",
        "Management & Leadership",
        "Strategy"
    ],
    "title": "A message from Christian Sewing concerning changes to the Management Board",
    "body": "Dear Colleagues,\nWe have just announced changes in the Management Board to align our leadership team to the third phase of our transformation.\nWhat has been decided?\nWe have achieved a tremendous amount together in the last three years. We first stabilised our bank, and then we transformed it. We have refocused our business on the areas where we enjoy a leading position and, with the utmost rigour, we reduced costs and strengthened our balance sheet. We built a firm basis for sustainable profitability.\nWe are now realigning our management team accordingly. We want to focus even more closely on our clients, our businesses and our cross-divisional strategic priorities. At the same time, we will not compromise on costs and risks. We will further strengthen our controls and our dialogue with regulators. In short: we’re creating the leadership structure that best supports this next phase of our strategy execution.\nWhat does that mean in concrete terms?\nAfter almost two years in a dual role, I will hand over Management Board-level responsibility for the Corporate Bank and the Investment Bank to Fabrizio Campelli. I have been truly impressed by our fantastic teams in these businesses as we have developed our concept of a ‘Global Hausbank’, together with investment banking capabilities which are unique among European banks. I am delighted that Fabrizio will succeed me in this role, continuing along this path and driving the initiatives that count. His extensive experience in transformation and business will help him create two even more powerful business divisions with a more efficient infrastructure, working closely with Stefan Hoops as well as Mark Fedorcik and Ram Nayak.\nFollowing Fabrizio’s move, responsibility for the Chief Transformation Office (CTO) is transferred to Rebecca Short who will join the Management Board. She has been a member of our bank’s senior management for many years, currently serving as Head of Group Planning & Performance Management and Member of the Group Management Committee (GMC). Rebecca has contributed significantly to the achievement of our targets over the past few years. She will ensure that we will not let up in our efforts to deliver on our transformation agenda. Rebecca will also assume responsibility for Global Procurement from the Chief Operating Office (COO) and the Capital Release Unit (CRU).\nCOO will no longer be a separate Management Board function going forward. In this context, the business-related parts of COO that support the Investment Bank and the Corporate Bank, which were previously run in a centralised organisation, will move closer to their respective businesses under Fabrizio’s leadership. He will drive a closer front-to-back alignment of business and operations which has proven effective in the Private Bank and our asset manager, DWS. This move will help us deliver continuous efficiency gains while strengthening controls.\nMichael Ilgner, Global Head of HR, will additionally oversee Global Real Estate going forward to adapt the bank’s real estate strategy to the future working environment. Bernd Leukert, Management Board member responsible for Technology, Data and Innovation (TDI), will take responsibility for the remaining COO areas; large parts of these already work in close cooperation with TDI.\nSadly, our current COO, Frank Kuhnke, will leave Deutsche Bank in the course of this reorganisation. In the course of an impressive 35-year career, Frank has always worked with great passion and delivered successfully for our bank. I want to thank Frank wholeheartedly for the many years of trusted partnership. In particular, I would like to acknowledge the great work he has done during his time as a Management Board member. With his tireless dedication since 2018, Frank has made a significant contribution to stabilising our bank and enabling our transformation.\nThere will also be a change in the Chief Risk Office which represents the end of an era for our institution: Stuart Lewis has informed us of his intention to leave Deutsche Bank by the Annual General Meeting 2022 – after more than 25 years, including ten on the Management Board. There is still a lot of time for farewell addresses and to decide on Stuart's successor in the coming months.\nIn the light of Stuart’s upcoming departure and to ensure an orderly transition, we will now transfer the responsibility for Compliance and the Anti-Financial Crime to our Chief Administrative Officer, Stefan Simon, who will combine these areas with Legal and Regulatory Affairs. This enables us to bring together those areas which are particularly impacted by legal requirements and require a close and unified dialogue with our regulators. We have invested a great deal in our controls over the past few years and have made significant progress under Stuart’s leadership. We know that we must continue to invest and improve further – and Stefan's job will be to do just that.\nWe will also be changing the representation of the Private Bank on the GMC. Lars Stoy, who currently manages the Postbank brand in our home market, will assume responsibility for the Private Bank Germany, reporting to our bank’s President, Karl von Rohr, and becoming a member of the GMC. Lars assumes the position that Karl took on last year from Manfred Knof. In recent months, Lars has been part of Karl's management team, which has set the strategic course of our retail business in our home market. Now is the right time to hand over responsibility for this core business, enabling Karl to dedicate more time to his duties as President and his responsibilities for the Germany and EMEA regions, for the Private Bank as a whole, and for Asset Management.\nAll these changes will take effect on May 1, 2021. For me personally, this reorganisation of the Management Board means that I will have more scope to focus on strategic topics and our management priorities: client centricity, sustainability and technology. As CEO it is also very important to me that we continue to develop our talent and our leadership culture. I look forward to working on these priorities with Michael Ilgner, our Global Head of HR, who will report to me going forward.\nLast but not least, I am pleased that the contract of Asoka Woehrmann as CEO of DWS has been renewed until October 2024. He will deliver continuity, dynamism and passion that is difficult to match. Asoka has decisively shaped DWS. I look forward to continuing to work with him.\nAt the same time, the Supervisory Board of Deutsche Bank has offered me a new contract, which runs until 2026. I am grateful for their trust. It is an honour for us to continue working with you and serving our bank. \nThank you very much.\nChristian Sewing",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 9
}