{
    "url": "https://www.db.com/news/detail/20210317-deutsche-bank-issues-its-second-green-bond?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "March 17, 2021",
    "tags": [
        "Sustainability"
    ],
    "title": "Deutsche Bank issues its second green bond",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) has successfully placed its second green bond, raising 800 million US dollars. The Senior Preferred bond has a tenor of 5 years and a coupon of 1.686 percent. The issue attracted total demand from investors of 2.9 billion US dollars, with final demand of 2.1 billion dollars after the bank tightened pricing by more than 20 basis points.\nThis issuance enables Deutsche Bank to establish a pricing point in the US dollar senior preferred debt market. It marks the bank’s first senior-preferred green bond for the US market and responds to rising demand from Deutsche Bank’s US investors for ESG assets.\nThe proceeds will be used to further Deutsche Bank’s sustainability strategy by financing clients’ projects, including the development of energy efficient commercial real estate. The issue contributes to multiple UN Sustainable Development Goals and demonstrates Deutsche Bank’s ability to build up a reliable pipeline of eligible assets. Deutsche Bank aims to take further opportunities to refinance green assets going forward.\n\"We are very pleased at the success of our second green bond\", said Dixit Joshi, Group Treasurer. \"This issuance underlines our commitment to sustainable financing and enables us to continue to deliver on our targets. Green financing is now an integral part of Deutsche Bank’s funding strategy.”\nThe bond is Deutsche Bank’s fourth issuance of 2021, across three currencies. The bank has already completed a significant portion of its 2021 issuance plan and was recently named “2020 Financial Issuer of the Year” by International Financing Review.\nThe bond was issued under Deutsche Bank's Green Financing Framework. This is aligned to the International Capital Market Association (ICMA) Green Bond Principles and to Deutsche Bank’s overall Sustainable Finance Framework, which identifies activities contributing to the bank’s sustainable finance target. The bank’s Green Financing Framework takes account of the recommendations for technical screening criteria of the Technical Expert Group for the EU Taxonomy.\n\"Green\" assets include loans and investments in companies, assets or projects in the fields of renewable energy, energy efficiency, and buildings constructed according to ecological and sustainable standards. Since its previous green bond, Deutsche Bank has updated its framework to widen the scope of financing instruments available and tighten its minimum certification requirements for green buildings.\nAs an example of its Sustainable Finance Framework, Deutsche Bank recently completed the world’s first green hedging transaction backed by second party opinion on an underlying green hedge framework with Continuum, a green energy developer in India.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 7
}