{
    "url": "https://www.db.com/news/detail/20210317-deutsche-bank-joins-the-partnership-for-carbon-accounting-financials?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "March 17, 2021",
    "tags": [
        "Corporate Citizenship",
        "Sustainability"
    ],
    "title": "Deutsche Bank joins the Partnership for Carbon Accounting Financials",
    "body": "What is PCAF, and why are we joining?\nThe Partnership for Carbon Accounting Financials (PCAF) is a collective effort to harmonise the way banks and other financial institutions account for greenhouse gas emissions financed by their loans and investments. In November 2020, PCAF published its own accounting and reporting standard for greenhouse gas emissions associated with loans or investments for the financial industry.\nDeutsche Bank’s sustainability strategy, backed up by ambitious and transparent targets, is a core part of our transformation. Clear accounting and disclosure on greenhouse gas emissions, and reliable comparisons with our peers, are a key enabler of this strategy. Joining PCAF helps us deliver this.\n“Reporting the carbon footprint of loan portfolios is rapidly becoming an industry standard among banks,” says Gerald Podobnik, CFO of the Corporate Bank and a member of the Sustainable Finance Committee of the German government. “Joining PCAF enables banks to report emissions on a comparable basis. As sustainable financing scales up, transparency and standardisation are all-important.”\nHow is this a step forward?\nDeutsche Bank is a signatory to the German financial sector’s Commitment on Climate Action. We’ve pledged to align our lending portfolios with the targets of the Paris Agreement on Climate Change. We’re assessing the greenhouse gas emissions linked to investments and our loan portfolio. PCAF helps us do that in a standardised manner. We also monitor the direct emissions from our own operations and we’ve been climate-neutral since 2012.\nWhat are the benefits for Deutsche Bank?\nPCAF enables us to measure and disclose emissions related to our business in a way that’s comparable with our peers. As we execute our strategy, and help our clients transition to a lower carbon footprint, we can make decisions based on consistent, comparable data. Our stakeholders can rely on consistent data to monitor our progress. \n“Being able to consistently identify carbon intensity and emissions concentrations in our portfolios is an important part of our risk management,” said Chris Jaques, Head of Credit and Enterprise Risk Portfolio Management and Stress Testing. “Our ambition is to make rapid progress in this field.”\nWe benefit from joining PCAF in a number of specific ways:\nWe gain an industry-standard methodology to measure the emissions of our activities\nIt helps us prepare for public disclosure of the greenhouse gas intensity of our business, which provides transparency for external stakeholders\nThe PCAF methodology is similar to the approach we have developed internally, so adoption of this methodology is a natural step for Deutsche Bank\nWho else is in PCAF?\nMore than 100 institutions, including around 80 banks, with combined assets of more than 21 trillion dollars. Members include many leading international banks such as Barclays, Morgan Stanley, Citi, Bank of America, ABN AMRO or Lloyds.\nWhat’s the timing?\nJoining PCAF requires us to commit to disclose the greenhouse gas emissions in our loan portfolio by the end of 2023, using PCAF methodology. We aim to achieve that well before then.\n   ",
    "number_of_ratings": 3,
    "rating": 3.7,
    "likes": 19
}