{
    "url": "https://www.db.com/news/detail/20210316-deutsche-bank-executes-world-s-first-green-hedge-with-continuum?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "March 16, 2021",
    "tags": [
        "Asia-Pacific",
        "Capital markets",
        "Sustainability"
    ],
    "title": "Deutsche Bank executes world’s first green hedge with Continuum",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) and Continuum Energy Levanter Pte Ltd, a subsidiary of Continuum Green Energy (Continuum), today announced they have executed the world’s first green hedging transaction with a second party opinion based on a specially designed green hedge framework.\nDeutsche Bank and Continuum worked together to develop a green hedge framework to support the implementation of Continuum’s green bond framework. External reviewer, Cicero Green, issued the Second Party Opinion on the green bond and the green hedge frameworks.\nDeutsche Bank Head of Sustainable and Special Solutions Asia, Rahul Jain said: “This hedge structure has the potential to set new standards for increased transparency and risk management particularly for Emerging Markets hard currency green bond issuances.”\nThe FX hedge solution is for a 6 years tenor in US dollars/Indian Rupees on notional of US$185 million, linked to Continuum’s green bond US dollar primary issuance and based on their green bond framework.\n“With new green debt issuance in Emerging Markets (EM) continuing to grow, investors are increasingly looking for ways to distinguish well managed, quality green issuers from the rest.  This solution sets a high water mark for disclosure and transparency for green bond investors. By adopting this green hedge framework, Continuum will increase transparency for investors by combining metrics and reporting of a project’s ESG impact as well as providing important reference points for financial risk management,” Jain added.\nBond proceeds are used for renewable energy projects in India, which exposes the company to US dollars / Indian Rupees FX risks. The green hedge framework provides a methodology for Continuum to risk manage their currency exposure while providing additional transparency for the green bond holders.\nDeutsche Bank was the lead bookrunner and green structuring agent for Continuum’s 144A/RegS green bond which priced in February this year.\nContinuum Green Energy Chief Executive Officer Arvind Bansal said: “This is a highly innovative and elegant financial risk management solution for our USD green bond where proceeds are invested in greenfield renewable energy projects in India. Our underlying green project revenues are generated in Indian Rupee while the principal and interest are to be repaid in US Dollar, giving rise to currency risks. The green hedge manages the currency exposure, ensuring the underlying green projects are financially sustainable, while ensuring investors receive their returns on the green bond.” \nDeutsche Bank’s Head of ESG for Asia Pacific, Kamran Khan said, “A key global priority today is to ensure that new investments in EM are increasingly ESG-compliant. This is because the bulk of new global investment in infrastructure, manufacturing and other industries is taking place in EM. Deutsche Bank is committed to developing new, innovative financial products and services which incentivise the shift towards sustainability. We are particularly pleased with the unique Deutsche Bank signature on this transaction evident in the inclusion of sustainability reporting and the sophisticated financial structuring of the hedging solution linking with a green hedge framework.”\nSustainability is a core pillar in Deutsche Bank’s transformation strategy and the bank is committed to supporting clients as they transition for the zero carbon economy.  Last year in Asia Pacific Deutsche Bank structured Asia’s first currency hedge linked to sustainability key performance indicators.  This hedge structure was assessed and approved against Deutsche Bank’s Sustainable Finance Framework.\nFor further information please contact:\nDeutsche Bank AG                                      \nMedia Relations                                           \nSarah Stabler\nEmail: sarah.stabler@db.com\nPhone: +65 9116 9970",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 6
}