{
    "url": "https://www.db.com/news/detail/20170629-are-you-a-fast-enough-fish?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 29, 2017",
    "tags": [
        "Company",
        "Research",
        "Strategy"
    ],
    "title": "Are you a fast enough fish?",
    "body": "“In today’s world, it is no longer the large fish that will eat the small fish, but rather the fast fish that will eat the slow fish,” reflected Founder and Executive Chairman of the World Economic Forum Klaus Schwab, in his opening address at the World Economic Forum in Dalian, referring to the pressures nations and enterprises alike are facing to constantly innovate.\nHeads of state, global industry leaders, and other technology pioneers, science and arts scholars and media have gathered in Dalian this week to discuss a range of topics around this year’s theme – Achieving Inclusive Growth in the Fourth Industrial Revolution. Other key participants include: Young Scientists, the new class of 2017 Technology Pioneers, and representatives from arts and culture, academia and the media. Representing the Forum’s communities are: Social Entrepreneurs, Global Shapers and Young Global Leaders. Deutsche Bank delegates were featured prominently as speakers at the event.\nSpeaking on a panel, Chief Data Officer and Head of Strategy & Innovation JP Rangaswami reminded the audience that banks today are becoming more and more technology driven, and also called out the unique opportunity for innovation in the financial industry in China. “China has scale unlike anywhere else. Smartphone users exceed twice the population of the US. The unbanked population is larger than the whole of the US. Given high smartphone and mobile technology penetration nation-wide, and a willingness to use mobile payments and even insurance, the opportunity for extending banking coverage through leap-frogging technology is huge.”\nHe added, “What we will see soon for the first time is the learnings of Chinese fintech companies being exported at scale. The innovation here is amazing. There are things I can learn from China and apply to our bank.”\nAPAC Head of Global Transaction Banking Lisa Robins touched on similar themes in her panel, focusing on the tricky balance of globalisation and data security. “As a new age of digital trade dawns and supply chains get more global and dispersed, nations need to avoid the temptation to build digital fortresses,” she said. “We must promote partnership and inter-nation cooperation in managing global data flows, and at the very least ensure continued interoperability across borders.”\n  Chinese Premier Li Keqiang also addressed the delegation at the conference, stressing the need for continued global cooperation and the importance of harnessing the power of economic globalisation for sustainable growth, while acknowledging challenges. “Just as if we sprain our ankles on an uneven road, we should not blame the road and stop walking; so must we approach globalisation. As a Chinese saying goes, the sea is vast as it admits all rivers. We must stay committed to globalisation.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}