{
    "url": "https://www.db.com/news/detail/20170626-deutsche-bank-sponsors-north-carolina-chamber-2017-workplace-diversity-und-inclusion-conference?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 26, 2017",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "Deutsche Bank sponsors North Carolina Chamber 2017 Workplace Diversity & Inclusion Conference",
    "body": "Deutsche Bank recently sponsored the North Carolina Chamber 2017 Workplace Diversity & Inclusion Conference, an inaugural event highlighting topics including recruiting for diversity, fostering a culture of inclusion and understanding unconscious bias.\nTwenty employees attended to show support and reinforce the importance of diversity and inclusion at Deutsche Bank. Kathryn Burdett, Americas Head of Diversity & Inclusion, spoke on a “Practicing Inclusion” panel which discussed how an inclusive environment engages all employees and leads to a more productive workplace. Burdett said: “Practicing inclusion is about talent optimization. We want a work environment where all employees can thrive and succeed based on merit.”\nThe discussion included examples of Deutsche Bank’s reverse mentoring program between the NextGen Network, an employee resource group (ERG) focused on generational diversity, and Global Transaction Banking. The program strengthened intergenerational connections and collaboration between groups like Veterans on Wall Street, an ERG supporting the work experience for military veterans at the bank, and dbPride, an ERG that provides an inclusive work environment for LGBT employees. Burdett was joined by fellow panelists from BASF, AT&T and Lenovo.\nBackground\nOther participants included Dan Minto, Head of Cary, NC, Deutsche Bank; Leslie Slover, Regional Head of Jacksonville, FL and Cary, NC, Deutsche Bank; the Cary Operating Committee and the chairs of the Cary chapters of dbPride, Family Network, Multicultural Partnership, NextGen, Veterans on Wall Street, and Women on Wall Street employee resource groups.\n“It was important to me that we supported this conference and engaged in the conversation,” said Minto. “We must unite with the business community in North Carolina to highlight the value of diversity and inclusion and share best practices to advance progress.”\nDeutsche Bank is committed to building an inclusive work environment. In 2016, the bank froze expansion plans in North Carolina in response to state-wide legislation that invalidated existing protections of lesbian, gay, bisexual and transgender fellow citizens in some municipalities and prevented municipalities from adopting such protections in the future.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}