{
    "url": "https://www.db.com/news/detail/20170626-deutsche-bank-celebrates-its-25th-anniversary-in-vietnam?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "June 26, 2017",
    "tags": [
        "Company",
        "Corporate products",
        "History",
        "Private products"
    ],
    "title": "Deutsche Bank celebrates its 25th anniversary in Vietnam",
    "body": "Deutsche Bank today celebrates its 25th anniversary in Vietnam, where the bank offers a comprehensive range of award-winning services from corporate finance and transaction banking, to sales and trading.\nIn 2016, Deutsche Bank served as Joint Global Coordinator to market VietJet’s Initial Public Offering internationally. In doing so, the bank helped its client reach international institutional equity investors and access capital for growth. As Vietnam’s first internationally marketed IPO and Deutsche Bank’s first ever Vietnam IPO, the transaction broke new ground on several levels.\nIn 2015 and 2014, the bank was named Best Foreign Cash Management Bank in Vietnam as well as the Best overall Domestic Cash Management Services by Asiamoney magazine. Notably, Deutsche Bank was first in the market to offer an invoice-based collections solutions for managing cash receivables more efficiently with 100% automated and secured straight through processing.\nDeutsche Bank was named Best M&A house by finance trade publication The Asset in 2016, by advising on the acquisition of retailer Big C Vietnam by Central Group and investment in Masan Consumer by Singha Asia. In equity capital markets, the bank is among the largest market access providers to global institutional and retail investors.\nDeutsche Bank also offers clients access to sales and trading in asset classes such as foreign exchange, fixed income and money markets. With a leading FX platform, it is one of the top five USD/EUR FX trading houses in Vietnam by volume.\nJens Ruebbert, Chief Country Officer – Vietnam at Deutsche Bank said: “We are proud of what we do to help our clients prosper, as they create jobs and opportunities for the people of Vietnam, and ultimately help the economy to grow. After 25 years of presence in this country, we hope to continue to grow our franchise and remain committed to servicing our clients. We also believe that it is important to contribute to the communities in which we operate and we aim to do so with our active corporate social responsibility programme, which has a focus on helping children in need.”\nIn May 2017, Deutsche Bank’s Jens Ruebbert launched the Orbis Flying Eye Hospital programme in Can Tho, Vietnam. It is the world’s only eye hospital on a plane. Many of the estimated three million Vietnamese children who suffer blindness or visual impairment don’t have access to professional eye care as they stay in remote areas where medical care is not easily available.\nSince 2014, the bank also been supporting visually impaired children living at the Huynh De Nhu Nghia Blind Center and sponsored heart operations and heart intervention treatment for children at Ho Chi Minh Children’s Hospital 1, in addition to donating critical medical equipment to the hospital’s Heart Intensive Care Unit in 2015.\nFor further information, please contact:\nDeutsche Bank AG\nPress & Media Relations\nKarène Dufour\nPhone: +852 2203 7846\nE-mail: karene.dufour@db.com\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nThis press release has been approved and/or communicated by Deutsche Bank AG or by its subsidiaries and/or affiliates (“DB”). Deutsche Bank AG is authorised under German Banking Law (competent authority: BaFin - Federal Financial Supervisory Authority) and by the Prudential Regulation Authority and subject to limited regulation by the Financial Conduct Authority and Prudential Regulation Authority. Details about the extent of our authorisation and regulation by the Prudential Regulation Authority, and regulation by the Financial Conduct Authority are available from us on request. Securities and investment banking activities in the United States are performed by Deutsche Bank Securities Inc., member NYSE, NASD and SIPC, and its broker-dealer affiliates. Lending and other commercial banking activities in the United States are performed by Deutsche Bank AG, and its banking affiliates. Copyright (C) 2017 Deutsche Bank AG",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}