{
    "url": "https://www.db.com/news/detail/20170620-deutsche-bank-names-richard-weber-head-of-anti-financial-crime-for-the-americas-irwin-nack-as-deputy?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "June 20, 2017",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank names Richard Weber Head of Anti-Financial Crime for the Americas, Irwin Nack as Deputy",
    "body": "Deutsche Bank appointed Richard Weber as Managing Director and Head of Anti-Financial Crime (AFC) for the Americas and Irwin Nack as Managing Director and Deputy Head of Anti-Financial Crime for the Americas.\nWeber will start on June 26 and will report to Philippe Vollot, Global Head of Anti-Financial Crime & Group Anti-Money Laundering Officer, and to Stuart Clarke, COO for the Americas. Weber will also join the Global AFC Executive Committee. Nack started at the bank in May and will report to Weber.\n“I am honored and delighted that Richard and Irwin have accepted such critical and important positions at the bank,” said Vollot. “Their additions represent a material enhancement to our AFC program and demonstrate the bank’s commitment to fighting financial crime. Their arrival will reinforce the overall talent pool within the Chief Regulatory Office division and enhance the control environment.”\nDeutsche Bank added 170 employees in the Anti-Financial Crime division in 2016 and expects to hire more than 600 additional staff in 2017.\nWeber joins Deutsche Bank from the Internal Revenue Service, a bureau of the US Department of the Treasury, where he served as Chief of the Criminal Investigation Division (IRS-CI) for the past five years. Before IRS-CI, Weber was the Deputy Chief of the Investigation Division and Chief of the Major Economic Crimes Bureau in the Manhattan District Attorney’s Office. He previously served as Chief of the Asset Forfeiture and Money Laundering Section at the US Department of Justice and as an Assistant United States Attorney in the Eastern District of New York.\nWeber has more than 25 years of experience and is regarded as an expert on financial crime matters. He is the recipient of the 2015 Presidential Rank Award, the highest civil service recognition that is awarded in the federal government. He is also a two-time recipient of the Attorney General’s John Marshall Award, the highest honor for Justice Department lawyers.\nNack joins Deutsche Bank from the Bank of Tokyo-Mitsubishi UFJ where he most recently was Head of Global Financial Crimes Advisory. He was previously the bank's Chief Compliance Officer for the Americas, a role he assumed after serving as Head of Bank Secrecy Act / Anti-Money Laundering (BSA/AML) for the Americas.\nNack has more than 20 years of anti-financial crime experience and is an expert in AML. Earlier in his career, he served as Investigative Counsel for the New York State Banking Department, the predecessor agency to the New York State Department of Financial Services and was as a prosecutor in the Manhattan District Attorney’s Office. He spent five years in the Manhattan DA’s Office as a trial attorney prosecuting all levels of misdemeanor and felony criminal offences and subsequently transferred to the Investigations Division where he investigated and prosecuted complex financial crime cases.\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement. Such factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission. Such factors are described in detail in our SEC Form 20-F of 11 March 2016 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}