{
    "url": "https://www.db.com/news/detail/20170619-new-report-showcases-benefits-of-bringing-autistic-people-into-the-workplace?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 19, 2017",
    "tags": [
        "Corporate Citizenship",
        "Education"
    ],
    "title": "New report showcases benefits of bringing autistic people into the workplace",
    "body": "Deutsche Bank and one of its current UK Charities of the Year, Autistica, along with the Centre for Research in Autism and Education at UCL have released a report on the outcomes of an autism internship scheme at the bank. The report highlights the benefits and challenges of the pilot scheme and suggests recommendations for other employers looking to embrace neurodiversity in the workplace.\nThe graduate internship launched at the bank in 2016 and ran for three months. Of the eight autistic interns that started the scheme, five had their placement extended and continue to work within the bank.\nAutistic adults experience higher levels of unemployment than almost any other group in the UK. According to a 2016 National Autistic Society survey just 16 percent have full-time jobs and more than a quarter of all autistic graduates are unemployed. Yet many can and indeed want to work.\nJon Spiers, CEO at Autistica explains: “As one of Deutsche Bank’s UK Charities of the Year, we wanted to do much more than raise money: we wanted to change attitudes. Senior leaders at the bank already knew that the strengths associated with autism - attention to detail, focus and pattern spotting - could be beneficial to the business. By working together, we made their processes and workplace more inclusive to those with different ways of working.”\nAlex Wilson, Director, Portfolio Management, Treasury, who originated the scheme at Deutsche Bank, explains: “In commissioning this report, we wanted to maximise our learning, so we could continue developing this scheme alongside our more established graduate programmes. The report has provided excellent recommendations that we will incorporate into our 2017 internship and we hope other employers can use its findings as they explore opportunities to employ autistic people.”\nThis report will form part of an employment toolkit which Autistica will be offering to other companies. It is the charity’s aim to give autistic people the same employment opportunities as anyone else, and to make many more companies like Deutsche Bank realise the huge untapped talent of autistic people.\nThe 2017 internship scheme that will look to place autistic individuals in both the London and Birmingham offices is open for applications today.\nThe Executive Summary of An Internship Programme for Autistic Graduates at Deutsche Bank, UK. By Remington A, Pellicano L.is available Internship Programme for Autistic Graduates at Deutsche Bank.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}