{
    "url": "https://www.db.com/news/detail/20170612-deutsche-bank-wealth-management-announces-plans-to-hire-100-client-managers-and-invest-in-digital-technology?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "June 12, 2017",
    "tags": [
        "Corporate products",
        "Wealth"
    ],
    "title": "Deutsche Bank Wealth Management announces plans to hire 100 client managers and invest in digital technology",
    "body": "Deutsche Bank Wealth Management announced today that it plans to hire around 100 new client-facing employees in high-growth markets worldwide this year and to substantially increase its investments in digital capabilities over the next 18 months.,\nThe wealth management business of Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) aims to build out client coverage of high net worth individuals in Asia-Pacific, accounting for about half of total hires, with the rest accounted for by managers covering entrepreneurs in the US and ultra-high net worth clients in the UK, Middle East and other parts of the Europe, Middle East and Africa (EMEA) region.\nThe business will also invest an additional EUR 65m in new client-focused digital technology, including building a digital core offering that includes features such as customised Chief Investment Office news and portfolio health checks. In addition, it will make further investments over the next 18 months in upgrading systems and processes that directly impact clients.\nDeutsche Bank Wealth Management is making significant investments in growth, targeted at opening up brand new relationships in high-growth markets and in meeting the needs of our clients to interact with them in new digital ways.\nFabrizio Campelli, Global Head of Deutsche Bank Wealth Management\n“Deutsche Bank Wealth Management has a unique proposition for its clients as a German, European and truly global institution that is able to give seamless expert advice to its clients, their families and their businesses,” Campelli said. “We are ready to innovate with bespoke solutions like no one else and we connect our clients to one of the world’s leading capital-markets institutions.”\nDeutsche Bank Wealth Management separated from Asset & Wealth Management in late 2015, becoming part of the Private & Commercial Bank (PCB). The investments will help bolster the growth element of the business’s “Protect, Transform and Grow” strategy introduced at the start of 2016. The “Protect” phase included exiting higher risk countries and relationships, while “Transform” is focusing on platform modernisation, efficiency and a new technology infrastructure.\nDeutsche Bank said in its strategic update in March this year that it sees “very attractive growth opportunities” for Wealth Management, building on the strong home market in Germany and a sizeable presence in Europe, the Middle East, North America and Asia Pacific (APAC).",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}