{
    "url": "https://www.db.com/news/detail/20241029-cash-via-barcode-postbank-introduces-digital-cash-supply?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, October 29, 2024",
    "tags": [
        "Germany",
        "Digital banking & services",
        "Digitalisation",
        "Private products"
    ],
    "title": "Cash via barcode – Postbank introduces digital cash supply",
    "body": "Postbank customers will be able to deposit or withdraw around 1,000 euros per day at well over 10,000 locations in Germany from November\nThis will significantly expand the network for free cash withdrawals, even outside the major metropolitan areas\nCompared to well-known cashback methods, significantly higher amounts can be withdrawn and deposited\nDeutsche Bank to follow in 2025\nStarting in November, Postbank customers will be able to withdraw or deposit around 1,000 euros per day at 12,500 retail locations in Germany. The service is available in the Postbank app under \"Cash code\". There, customers can generate a barcode that they can use to withdraw or deposit their money within two hours at a participating retailer. The barcode only has to be shown at the checkout. Nearby locations are displayed in the app.\nPostbank and Deutsche Bank already offer their customers nationwide, free cash withdrawals via their own ATMs and cooperations with other banks, as well as Shell.\n\"With the cash code, we are expanding our deposit and withdrawal service from bank counters and ATMs to a nationwide network of over 12,000 supermarkets and pharmacy locations. Customers can withdraw significantly higher amounts than with previous cashback offers and also deposit cash, which is particularly important for our business customers. This makes the cash code another building block of our strategy to digitize simple banking services and products,\" says Dominik Hennen, Head of Personal Banking Germany at Deutsche Bank.\nThe service is available at many well-known retailers such as REWE, Penny, DM, Rossmann and others throughout Germany. It is offered in cooperation with Grenke Bank AG and Paysafe and has numerous advantages over the existing well-known cashback procedure.\nCustomers can withdraw significantly higher amounts of up to 999.99 euros per day, five times as much as with many of the previous offers. Another new feature is that customers can also deposit amounts of up to the same amount.\nTo use the service, all you need is a current account. The transaction is carried out purely via the barcode, which is scanned at the partner's checkout. Unlike the previous cashback offers, neither a purchase nor the presentation of a Girocard is necessary. The amount also does not have to be mentioned, which meets many customer requests for more discretion. \n\"This new service will be available to the majority of Postbank customers from November and will be gradually made available to other customers, for example those with joint accounts. In the second half of 2025, it will also be offered in the Deutsche Bank mobile app. This makes Postbank and Deutsche Bank the first banks with a large branch network to offer this additional digital cash service option in Germany,\" adds Thorsten Peppler, COO Personal Banking Germany.",
    "number_of_ratings": 35,
    "rating": 3.3,
    "likes": 20
}