{
    "url": "https://www.db.com/news/detail/20241023-deutsche-bank-statement-regarding-postbank-court-case?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 23, 2024",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank statement regarding Postbank court case",
    "body": "Deutsche Bank made the following statement following the judgment by the Higher Regional Court of Cologne: \n“We will now analyze the judgment.\nDeutsche Bank has booked provisions covering all outstanding claims by the plaintiffs including interest claims accrued to date. Therefore, the bank considers itself essentially fully protected; any additional financial impact would be limited to further interest accruing currently approximately EUR 2 million per month. \nToday’s ruling does not have an impact on any of the previously agreed settlements. Deutsche Bank has settled with a total of 70% plaintiffs in the Postbank takeover litigation matter, representing 62% of the total claims by value. These numbers include the settlements announced on August 21, 2024, and September 5, 2024. Among them is the settlement with Effecten-Spiegel AG, whose case was one of two proceedings before the Higher Regional Court of Cologne. Today's ruling was issued in the other proceeding. Thus, significant risks from the overall complex were already reduced for the bank in advance of today's decision.\nAs announced in August, Deutsche Bank expected a positive impact on its pre-tax earnings from the settlements already reached. The corresponding release of provisions of approximately 440 million euros is reflected in the results published today for the third quarter.\nThe Court has not allowed a further appeal to the German Federal Court. Deutsche Bank will assess whether to file a non-admission complaint (motion for leave to appeal) after receiving the written reasoning for the decision.\"",
    "number_of_ratings": 7,
    "rating": 4.1,
    "likes": 2
}