{
    "url": "https://www.db.com/news/detail/20241023-deutsche-bank-reports-on-the-third-quarter-of-2024?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 23, 2024",
    "tags": [
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank reports third-quarter 2024 profit before tax of € 2.3 billion",
    "body": "Third-quarter profit growth driven by approximately € 440 million partial release of Postbank-related litigation provisions, combined with operating momentum\nProfit before tax of € 2.3 billion with post-tax profit of € 1.7 billion\nPost-tax RoTE1 of 10.2% and cost/income ratio of 63%\nOperating results, excluding Postbank-related litigation release, increase year on year to a third-quarter record level\nProfit before tax of € 1.8 billion, up 6%; post-tax profit up 8% to € 1.3 billon\nPost-tax RoTE1 of 7.6%, up from 7.3%, and cost/income ratio of 69%, down from 72%, compared to prior year quarter\nSustained revenue and business growth\nNet revenues up 5% year on year to € 7.5 billion\nCommissions and fee income up 5% year on year to € 2.5 billion\nNet inflows of € 27 billion across Private Bank and Asset Management\nContinued operating cost discipline\nAdjusted costs of € 5.0 billion, up 2% year on year, in line with 2024 quarterly guidance for the third consecutive quarter\nNoninterest expenses down 8% year on year to € 4.7 billion, or € 5.2 billion, flat year on year, ex-Postbank litigation release\nCommon Equity Tier 1 (CET1) capital ratio rises to 13.8%\nAuthorization sought for further share repurchases\nProvision for credit losses of €494 million\nBaseline asset quality remains stable\nImpact of transitory effects expected to moderate in future quarters\nCommercial real estate provisions down 34% quarter on quarter\nFirst nine months of 2024: strong operating performance\nProfit before tax of € 4.7 billion, down 5% year on year, or € 5.6 billion, up 13%, excluding Postbank takeover litigation provision (‘litigation impact’)\nNet revenues up 3% to € 22.9 billion, in line with full-year 2024 guidance\nAdjusted costs down 1% to € 15.1 billion, in line with 2024 guidance\nNoninterest expenses up 3% to € 16.8 billion, or € 15.8 billion, down 2%, ex-Postbank litigation impact\nPost-tax RoTE1 of 6.0%, or 7.8% ex-Postbank litigation impact, compared to post-tax RoTE1 of 7.0% in the prior year period\nCost/income ratio of 73%, or 69% ex-Postbank litigation impact, compared to a cost/income ratio of 73% in the prior year period\nIn these three months, we made important progress in putting legacy litigation matters behind us, while also producing a record third-quarter profit in our operating business. This reflects our strong franchise, positive momentum across our businesses, and sustained cost discipline. Our Global Hausbank is ideally positioned to help clients navigate the uncertainties in today’s environment, and this reinforces our confidence that we will continue on our path of profitable growth and exceed our original goals for capital distributions to shareholders. We have now sought authorization for further share repurchases. \nChristian Sewing, Chief Executive Officer\nDeutsche Bank (XETRA: DBGn.DB / NYSE: DB) today announced profit before tax of € 2.3 billion for the third quarter of 2024, up 31% year on year. This included a partial release of approximately € 440 million in litigation provisions driven by progress on settlements relating to the bank’s takeover of Postbank AG. Excluding the Postbank litigation release, profit before tax was € 1.8 billion, up 6%, compared to profit before tax of € 1.7 billion in the third quarter of 2023 and a third-quarter record. Post-tax profit was € 1.7 billion, up 39% year on year, or € 1.3 billion excluding the Postbank litigation release, up 8%, compared to post-tax profit of € 1.2 billion in the prior year quarter.\nThird quarter post-tax return on average tangible shareholders’ equity (RoTE1) was 10.2%, or 7.6% if adjusted for the Postbank litigation release, up from RoTE1 of 7.3% in the prior year quarter. Post-tax return on average shareholders’ equity (RoE)1 was 9.1%, compared to 6.5% in the prior year quarter. The cost/income ratio was 63%, or 69% if adjusted for the Postbank litigation release, down from a cost/income ratio of 72% in the prior year quarter.\nFor the first nine months of 2024, profit before tax was € 4.7 billion, down 5% year on year, or € 5.6 billion, up 13%, excluding the nine-month Postbank litigation impact of approximately € 900 million. Post-tax profit was € 3.2 billion, down 8%, or € 3.9 billion, up 14% excluding the Postbank litigation impact, compared to post-tax profit of € 3.5 billion in the prior year period. Post-tax RoTE1 was 6.0%, or 7.8% excluding the Postbank litigation impact, compared to RoTE1 of 7.0% in the prior year period. Post-tax RoE1 was 5.4%, compared to 6.3% in the prior year period. The cost/income ratio was 73%, or 69% excluding the Postbank litigation impact, compared to a cost/income ratio of 73% in the prior year period.\n“Our nine-month 2024 results underline Deutsche Bank’s operating strength,” added James von Moltke, Chief Financial Officer. ”We have consistently delivered on our guidance for both revenue growth and cost discipline; our capital and balance sheet are strong, and overall loan book quality remains solid. Looking ahead, this gives us confidence that we will meet our € 30 billion revenue guidance for the year 2024 and that our continued revenue momentum, cost efficiencies, capital strength and moderating credit provisions all put us on track to deliver on our 2025 goals.”\nContinued delivery of the Global Hausbank strategy\nDeutsche Bank made progress on all dimensions of its accelerated Global Hausbank strategy in the third quarter:\nRevenue growth: Revenues grew 5% year on year to € 7.5 billion in the quarter, with 5% growth in commissions and fee income, as net interest income in the key segments of the banking book2 was broadly stable year on year. The bank’s compound annual revenue growth rate over the last 12 months compared with the full year 2021 was 5.6% at the end of the quarter, within the bank’s raised target range of between 5.5% and 6.5%.\nOperational efficiency: The bank made further progress on its € 2.5 billion Operational Efficiency program which includes optimization of the platform in Germany and workforce reductions, notably in non-client-facing roles. In the third quarter, total savings either realized or expected from measures completed reached € 1.7 billion, including € 1.5 billion in savings realized. Workforce reductions related to the program reached a cumulative total of approximately 3,300 full-time equivalents (FTEs), including approximately 600 during the third quarter, more than 90% of the planned total through year end 2024. In addition, contract external staff have been reduced by approximately 1,400, notably through internalisations, in the first nine months of 2024.\nCapital efficiency: Deutsche Bank delivered RWA equivalent benefits of a further € 3 billion during the third quarter through data and process improvements. As a result, cumulative RWA reductions from capital efficiency measures reached € 22 billion, marking further progress towards the bank’s raised goal of € 25-30 billion by the end of 2025. Deutsche Bank continues to pursue additional opportunities to exceed this goal.\nRevenues: on track towards 2024 guidance\nNet revenues were € 7.5 billion in the third quarter, up 5% over the third quarter of 2023. Commissions and fee income grew 5% year on year to € 2.5 billion, reflecting strong performance of fee and commissions-based businesses, and net interest income in the key segments of the banking book2 was broadly stable in an environment of further normalisation of interest rates as anticipated. For the first nine months, revenues rose 3% to € 22.9 billion, driven by commissions and fee income which grew 9% to € 7.7 billion, in line with the expected glide path toward the bank’s full-year 2024 guidance for revenues of around € 30 billion.\nRevenue development in the bank’s operating businesses was as follows:\nCorporate Bank net revenues were € 1.8 billion, down 3% compared to the third quarter of 2023. Net interest income was € 1.2 billion, down slightly year on year, reflecting normalizing deposit margins, mostly offset by growth in deposit volumes and higher loan net interest income. Commissions and fee income grew 4% to € 611 million, driven by growth in the Institutional Client Services business. Corporate Treasury Services revenues were € 1.0 billion, down 3% year on year, while Institutional Client Services revenues rose 3% to € 485 million. Business Banking revenues declined 9% year on year to € 328 million, reflecting lower net interest income compared to the strong levels of the prior year quarter. For the first nine months, net revenues declined 3% to € 5.6 billion. Corporate Treasury Services revenues were down 5% to € 3.2 billion, while Institutional Client Services revenues grew 5% to € 1.5 billion and Business Banking revenues declined 5% to € 1.0 billion.\nInvestment Bank net revenues were € 2.5 billion, up 11% over the third quarter of 2023, with growth across both Fixed Income and Currencies (FIC) and Origination & Advisory. Revenues in FIC increased 11% to € 2.1 billion, with Credit Trading revenues significantly higher due to strength in Distressed and continued growth in the Flow business, reflecting investments in prior periods. Emerging Markets revenues were also significantly higher, reflecting growth across regions. Rates revenues were lower year on year in a market environment which remained uncertain, while Foreign Exchange revenues were higher, supported by continued strength in the Spot business. Financing revenues were essentially stable year on year. Origination & Advisory revenues were € 401 million, up 24% year on year with growth across business lines, as Deutsche Bank maintained its #1 ranking in Germany in the year to date. Debt Origination revenues were up 20%, reflecting a growing industry fee pool, and Advisory revenues were up 32% year on year, reflecting market share gains (source: Dealogic) as the business benefitted from prior investments. For the first nine months, Investment Bank revenues grew 12% to € 8.2 billion, driven primarily by growth of 58% in Origination & Advisory revenues to € 1.5 billion. Deutsche Bank’s share of a growing global Origination & Advisory fee pool increased by around 50 basis points compared to the full year 2023 (source: Dealogic). FIC revenues rose 5% to € 6.7 billion, with growth in FIC ex. Financing led by strength in Credit Trading, while Financing revenues also grew 5% to € 2.4 billion. In the Euromoney FX Awards for 2024, Deutsche Bank was named Best FX Bank for both Western Europe and Asia Pacific.\nPrivate Bank net revenues were € 2.3 billion, essentially flat year on year. Net interest income declined by 6% in an environment of stabilizing interest rates; this was partly offset by growth in investment products, reflecting the Private Bank’s strategy of growing noninterest income. Revenues in Personal Banking were down 5% year on year. This development reflected the impact of higher hedging and funding costs, partly driven by the discontinuation of remuneration for minimum reserves by the ECB, as well as lower lending revenues, partly reflecting a negative nonrecurring effect. These impacts were partly offset by growth in deposit revenues. Revenues in Wealth Management & Private Banking grew by 5% year on year, as double-digit growth in both lending and investment products more than offset a decline in deposit revenues. Assets under management grew by a further € 13 billion including net inflows of € 8 billion, consisting of € 5 billion in deposits and € 3 billion in investment products. For the first nine months, Private Bank net revenues were € 7.0 billion, down 2% year on year. A 6% year-on-year decline in Personal Banking revenues, to € 3.9 billion, was partly offset by 3% growth in Wealth Management & Private Banking revenues to € 3.1 billion. Assets under management rose to € 625 billion, their highest ever level and up by € 47 billion in the first nine months, driven partly by net inflows of € 27 billion, up from € 17 billion in the first nine months of 2023.\nAsset Management net revenues were € 660 million in the third quarter, up 11% over the third quarter of 2023. Management fees were € 626 million, up 6%, driven both by Active and Passive products and partly reflecting continued inflows into Passive products. Performance and transaction fees were € 12 million, down from € 19 million in the prior year quarter, driven by lower fees in Alternatives. Assets under management were a record € 963 billion at the end of the third quarter, compared to € 933 billion at the end of the previous quarter, driven by net inflows of € 18 billion, the second highest for any quarter, primarily in Passive and Fixed Income products, and the positive impact of rising market levels. For the first nine months, net revenues were € 1.9 billion, up 8% year on year, driven by 5% growth in management fees to € 1.8 billion, which more than offset a decline in performance and transaction fees to € 40 million, from € 87 million in the prior year period. Assets under management of € 963 billion were € 103 billion higher than at the end of third quarter of 2023.\nExpenses: adjusted costs remain in line with quarterly guidance for 2024\nNoninterest expenses were € 4.7 billion in the third quarter, down 8% from € 5.2 billion in the third quarter of 2023. This development primarily reflected the aforementioned Postbank litigation release of approximately € 440 million. Total nonoperating costs1 were € 302 million negative; the Postbank litigation release was partly offset by € 88 million in litigation provisions relating to other matters and € 42 million in restructuring and severance charges in the quarter. Excluding the Postbank litigation release, noninterest expenses were € 5.2 billion, essentially flat compared to the prior year quarter.\nAdjusted costs were € 5.0 billion in the third quarter, in line with the bank’s 2024 quarterly adjusted cost guidance for the third consecutive quarter and up 2% compared to the third quarter of 2023. As anticipated, compensation and benefits expenses were higher due to wage growth, strategic growth initiatives including hiring, the acquisition of Numis and higher accruals for variable compensation; this was partly offset by lower technology costs, reflecting the bank’s efforts to streamline its technology platform, and reductions in professional services fees.\nThe workforce was 90,236 internal full-time equivalents (FTEs) at the end of the third quarter, a rise of 766 during the quarter. This development reflected over 1,000 graduate hires who joined the bank during the quarter, other strategic hires, and the continued internalisation of external staff. These effects more than offset leavers, including through operational efficiency measures, in the quarter.\nFor the first nine months, noninterest expenses were € 16.8 billion, up 3% over the prior year period. Excluding the Postbank litigation impact, noninterest expenses were € 15.8 billion, 2% lower than noninterest expenses in the prior year period. Adjusted costs were down 1% to € 15.1 billion, in line with the bank’s guidance for adjusted costs of € 5 billion per quarter during 2024.\nProvision for credit losses: solid underlying asset quality\nProvision for credit losses was € 494 million in the quarter, up from € 245 million in the prior year quarter and up slightly from € 476 million in the second quarter of 2024. Provisions for performing loans (Stage 1 and 2) were € 12 million, down from € 35 million in the previous quarter. This reflected softer macro-economic forecasts and the recalibration of overlays, partially offset by portfolio movements since the second quarter. Provision for non-performing loans (Stage 3) were € 482 million, up from € 441 million in the previous quarter. The quarter-on-quarter increase was driven predominantly by the Private Bank and included residual effects from remaining impacts from Postbank integration which are expected to normalize in the coming quarters, while overall portfolio quality remained largely stable. Provisions relating to commercial real estate were down 34% compared to the previous quarter and included provisions relating to expected sales in the fourth quarter.\nFor the first nine months, provision for credit losses was € 1.4 billion, up from € 1.0 billion year on year. This development was substantially driven by certain larger corporate events, for which provisions are partly mitigated by offsetting hedges; residual impacts from the Postbank integration which are expected to decrease significantly going forward; and higher provisions in commercial real estate compared to the first nine months of 2023. The bank sees signs of stabilization in commercial real estate and expects this to support a further reduction in provisions in future quarters.\nSolid capital, liquidity and funding metrics\nThe Common Equity Tier 1 (CET1) capital ratio was 13.8% in the quarter, up from 13.5% in the previous quarter. This development reflected strong third-quarter earnings and the bank’s adoption of transitional rules for unrealized gains and losses of certain debt instruments. These positive impacts more than offset higher risk weighted assets (RWA), predominantly higher market risk and credit risk RWA, net of reductions from the aforementioned capital efficiency measures as part of the accelerated execution of the Global Hausbank strategy. Deutsche Bank recently sought ECB authorization for further share repurchases.\nThe Leverage ratio was 4.6% in the quarter, stable compared to the previous quarter. The positive impact of the capital change in the quarter was offset by the impact of higher leverage exposures driven by trading assets during the quarter.\nThe Liquidity Coverage Ratio was 135% at the end of the quarter, stable compared to the end of the previous quarter, above the regulatory requirement of 100% and representing a surplus of € 60 billion. The Net Stable Funding Ratio was 122%, above the bank’s guidance range of 115-120% and representing a surplus over requirements of € 112 billion. Deposits rose by € 9 billion to € 650 billion during the quarter.\nSustainable Finance: cumulative volumes since 2020 reach € 352 billion\nSustainable Financing and ESG investment volumes ex-DWS3 were € 30 billion in the quarter, bringing the cumulative total since January 1, 2020 to € 352 billion. Volumes in the third quarter included a € 10 billion one-time contribution following the integration of ESG criteria into Deutsche Bank’s German pension plans which is recognized in Corporate & Other (C&O). Third-quarter volumes across the bank’s businesses were as follows:\nCorporate Bank: € 2 billion in sustainable financing, raising the business’s cumulative total since January 1, 2020 to € 65 billion\nInvestment Bank: € 15 billion, comprising € 4 billion in sustainable financing and € 11 billion in capital market issuance, raising the division’s cumulative total since January 1, 2020 to € 211 billion\nPrivate Bank: € 3 billion growth in ESG assets under management and new client lending, raising the Private Bank’s cumulative total since January 1, 2020 to € 66 billion\nIn the third quarter, notable transactions included:\nParticipation in a € 3.0 billion sustainability-linked revolving credit facility for Uniper SE, including CO2 reduction targets and expansion of renewable energies\nA € 227 million financing package, serving as lender, facility agent, and sole mandated lead arranger to the Republic of Senegal, represented by the Ministry of Economy, Planning & Cooperation. This project involves the supply, installation, and maintenance of 100,000 solar-powered streetlamps, covering 4,000 kilometers and saving 22,500 tons of CO2 emissions per year\nA $ 300 million senior secured revolving credit facility as coordinated lead arranger for Swift Current Energy, a leading North American clean energy platform. The facility provides Swift Current Energy with flexible growth capital for its pipeline of wind, solar and energy storage projects\nThe role of Joint ESG Coordinator on the City of Munich’s inaugural € 300 million 7-year green bond, also marking the first time a German city has issued a green bond. Proceeds will be allocated to eligible green projects in the City of Munich’s Green Bond Framework\nThe role of Joint Lead Manager on Kreditanstalt für Wiederaufbau’s (KfW) € 3 billion 5-year green bond. KfW will use an amount equal to the bond proceeds to finance new Eligible Green Projects according to the “Green Bonds, Made by KfW” framework, which has received a Second Opinion by Morningstar Sustainalytics\nESG Ratings improvements: during the third quarter, Deutsche Bank’s MSCI ESG rating was upgraded from A to AA. Furthermore, in October, the bank improved its S&P Global Sustainable1 rating by 12 points from 54 points out of 100 to 66; this positions Deutsche Bank currently among the highest 10% of the category “Diversified Financial Services and Capital Markets.” In 2024 to date, Deutsche Bank’s progress in its sustainability efforts has been recognized in five improvements from leading independent agencies, as follows:\nS&P Global Sustainable1: Deutsche Bank’s Corporate Sustainability Assessment (CSA) score improved from 54 to 66 out of 100\nMSCI: In September, the bank’s rating was upgraded from A (7.1) to AA (8.5), positioning Deutsche Bank within the top 20% of its subindustry category (Investment Banking & Brokerage)\nSustainalytics: in August, the bank improved its score 27.9 to 22.9, placing Deutsche Bank at the lower end of the ‘Medium Risk’ group\nCDP, formerly Carbon Disclosure Project: in February, Deutsche Bank maintained a stable B/Management rating with an increase in 7 of 12 sub-categories, scoring ‘A’ in 8\nISS ESG: in January, Deutsche Bank was upgraded from C/Prime to C+ /Prime\nGroup results at a glance\n¹ For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ on pp 15-20 of the third quarter 2024 Financial Data Supplement and “Non-GAAP financial measures” on pp. 56 – 62 of the Earnings Report of September 30, 2024, respectively\n² Business segments for which net interest income from banking book activities represent a material part of the overall revenue\n³ Cumulative ESG volumes include sustainable financing (flow) and investments (stock) in the Corporate Bank, Investment Bank, Private Bank and Corporate & Other from January 1, 2020 to date. Products in scope include capital market issuance (bookrunner share only), sustainable financing, period-end assets under management and period-end pension plan assets (gross assets). Cumulative volumes and targets do not include ESG assets under management within DWS, which are reported separately by DWS.\nESG Classification\nWe defined our sustainable financing and investment activities in the “Sustainable Financing Framework – Deutsche Bank Group” which is available at investor-relations.db.com. Given the cumulative definition of our target, in cases where validation against the Framework cannot be completed before the end of the reporting quarter, volumes are reported upon completion of the validation in subsequent quarters. In Asset Management, for details on ESG product classification of DWS, please refer to the section “Our Responsibility – Sustainable Action – Our Product Suite” in DWS Annual Report 2023.\nFurther details on third quarter performance in Deutsche Bank’s businesses are available in the Earnings Report of September 30, 2024.\nAnalyst call\nAn analyst call to discuss third quarter 2024 financial results will take place at 11:00 CEST today. An Earnings Report, Financial Data Supplement (FDS), presentation and audio webcast for the analyst conference call are available at: www.db.com/quarterly-results\nA fixed income investor call will take place on October 24, 2024, at 15:00 CEST. This conference call will be transmitted via internet: www.db.com/quarterly-results ",
    "number_of_ratings": 15,
    "rating": 4.1,
    "likes": 21
}