{
    "url": "https://www.db.com/news/detail/20200630-deutsche-bank-signs-climate-commitment?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 30, 2020",
    "tags": [
        "Company",
        "Strategy",
        "Sustainability"
    ],
    "title": "Deutsche Bank signs climate commitment",
    "body": "Today Deutsche Bank signed the climate commitment of the German financial sector. By doing so, we pledge to align our credit and investment portfolios with the goals of the Paris Agreement.\n“Banks play a crucial role in the fight against climate change. Because it is up to us to provide the funds for the transformation of the global economy through financing and investment products. We accept this challenge,” said Christian Sewing explaining the decision.\nThis initiative, launched by several banks, aims to contribute to climate protection and to support the sustainable, future-oriented development of the economy. This brings the German financial sector closer to the goal set by the German Federal Government at the beginning of 2019 of making Germany one of the leading locations for sustainable finance.\nIn future, the companies involved will disclose which emissions are associated with their credit and investment portfolios. In addition, they undertake to align their respective products and services as well as their commitments and initiatives in such a way that global warming is limited to well below 2 degrees - and if possible to no more than 1.5 degrees.\nTo this end, each signatory will develop and introduce mutually accepted methods of measuring climate impact by the end of 2022 and then regulate them in accordance with national and international climate targets. The participants intend to support each other in collecting the necessary emissions data. In addition, they want to jointly develop measurement methods and appropriate approaches to manage banking business in line with the goals. All signatories will report on their progress annually.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 3
}