{
    "url": "https://www.db.com/news/detail/20200625-db-usa-corporation-results-of-the-federal-reserve-s-2020-dodd-frank-act-stress-tests-and-comprehensive-capital-analysis-and-review?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "June 25, 2020",
    "tags": [
        "Company"
    ],
    "title": "DB USA Corporation: Results of the Federal Reserve's 2020 Dodd-Frank Act Stress Tests and Comprehensive Capital Analysis and Review",
    "body": "The Board of Governors of the Federal Reserve System (the Federal Reserve) this afternoon announced the results of the 2020 Dodd-Frank Act Stress Tests (DFAST) and Comprehensive Capital Analysis and Review (CCAR) for DB USA Corporation (DBUSA).\nThe Federal Reserve did not object to the DBUSA capital plan on a quantitative or qualitative basis.\nOn a quantitative basis, the Federal Reserve found that even in a severely adverse economic scenario, DBUSA’s Common Equity Tier 1 capital would comfortably exceed the regulatory minimum of 4.5% and would not fall below 18.4% at any time over the nine-quarter planning horizon. The Federal Reserve also found that DBUSA’s Tier 1 Leverage Ratio would remain well above the regulatory minimum of 4% and would not fall below 7.4%. All other minimum regulatory capital ratios were also exceeded.\nDB USA Corporation Capital Ratios: Actual and Stressed, Versus DFAST(1)  Participants\n Capital Ratios Required\nMinimum Actual\n4Q19  ‘Severely Adverse’\nNine-Quarter Minimum  DFAST\n‘Severely Adverse’\nNine-Quarter Minimum(2)\nCommon Equity Tier 1 Capital Ratio  4.5%  26.2%  18.4%  9.9%\nTier 1 Capital Ratio  6.0%  37.7%  30.9%  11.4%\nTotal Capital Ratio  8.0%  37.7%  31.4%  14.0%\nTier 1 Leverage Ratio  4.0%  9.8%  7.4%  7.1%\nSupplementary Leverage Ratio(3)  3.0%  9.1%  6.9%  5.6%\n(1) The Federal Reserve’s Dodd-Frank Act Stress Tests (DFAST).\n(2) Combined nine-quarter minimum for all 33 DFAST-participating firms evaluated under a ‘severely adverse’ scenario in 2020.\n(3) Calculated for firms subject to Category I, II, or III standards.\nDBUSA is Deutsche Bank AG’s principal US intermediate holding company (IHC) and had USD 117 billion in assets as of March 31, 2020. DBUSA represents approximately 7% of the assets of Deutsche Bank AG and 35% of the assets of the combined US operations of Deutsche Bank AG. DBUSA primarily consists of Deutsche Bank Securities Inc., an SEC-registered broker dealer; Deutsche Bank Trust Company Americas, an FDIC-insured bank; and DB USA Core Corporation, a US service corporation.\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations   \nDaniel Hunter\nEmail: daniel.hunter@db.com\nPhone: +1 212 250 0991\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}