{
    "url": "https://www.db.com/news/detail/20200620-world-refugee-day-nadia-s-story-i-ll-learn-the-rules-then-i-ll-change-them?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 20, 2020",
    "tags": [
        "Corporate Citizenship",
        "Education",
        "Employee engagement"
    ],
    "title": "Nadia's story: “I'll learn the rules, then I'll change them”",
    "body": "Nadia Rangira left Rwanda for Hong Kong when she was just 11 years old. She arrived in Hong Kong with her two younger siblings, aged nine and five, finally reuniting with her parents who had fled persecution one year earlier. Unable to get the required travel documents to go with them straight away, Nadia had waited with her brother and sister in Uganda, separated from all that they knew. Only 10 years old at the time, she had been solely responsible for their safety and for keeping hope alive that they would all be reunited with their parents one day.\nFast forward ten years, and with the help of the Christian Action-Centre for Refugees and Deutsche Bank’s part sponsorship of her university studies through our CSR Born to be programme, Nadia has nearly finished year one of a Law degree and is working as a part-time Paralegal at an international law firm, Clifford Chance.\nHere Nadia tells us more about her experience and why she sees her refugee status as a badge of honour.\nIn her own words:\nArriving in Hong Kong …\nAfter a gruelling 24 hour journey from the small village where we were hiding, I caught my first glimpse of Hong Kong from the windows of the airport bus. The neon lights, the tall buildings, it looked like another planet to us. There were two boys in the next seats looking at us like they’d never seen anyone like us before! I remember thinking then that this world was so different. Seeing our parents was of course very emotional.\nProud of who I am …\nMy life in Hong Kong has been amazing. Being a refugee has given me opportunities I would never have had otherwise. I started school three months after we arrived through a scholarship then received another to do my A-levels at United World College.\nI was too scared to tell anyone at school that I was a refugee. I was sure I would be treated differently and I didn't want to be a poster child. Now I’ll tell anyone who will listen. Being a refugee has changed my life, I’m proud of it and I want to help others change their lives too. Inspiration can bring hope.\nChanging the game …\nAfter high school I received a scholarship to study law in the US but because of my refugee status, it didn't work out. My mother worked hard to pay for each application so it was tough. But it made me realise again what a privilege education was, so I became one of the young ambassadors of the Christian Action-Centre for Refugees to campaign for education rights for refugees and to share my story.\nThat’s when I was introduced to Clifford Chance and offered my dream job! With Deutsche Bank’s help I’m now studying for an Open University Law Degree that I could never have afforded otherwise. I want to be a human rights lawyer to help families like ours. You've got to learn the game to change the rules.\n  Deutsche Bank supports the integration of refugees around the world. Our bank promotes a diverse and open society, supported by our employees, making a #PositiveImpact in the community.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}