{
    "url": "https://www.db.com/news/detail/20200610-deutsche-bank-to-create-international-private-bank?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "June 10, 2020",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Deutsche Bank to create International Private Bank",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) announced today that it will combine its Wealth Management and Private & Commercial Business International units into a new International Private Bank, serving 3.4 million private, wealth and commercial clients.\nThe International Private Bank will bring together Wealth Management’s globally connected clients across Germany, Europe, the Americas, Asia and the Middle East and Africa, along with private clients and small and medium-sized enterprises in Italy, Spain, Belgium and India. The business will have around 250 billion euros of assets under management and a combined revenue of approximately 3 billion euros.\nClaudio de Sanctis, most recently Global Head of Wealth Management, will become Head of the International Private Bank and CEO EMEA.\nKarl von Rohr, Deutsche Bank’s President and Head of the Private Bank, said: “This exciting combination is the next step in the Private Bank’s transformation announced last July. I am delighted that Claudio will lead our new growth pillar. He has made a major contribution since joining Deutsche Bank in December 2018 and possesses all the qualities and energy needed to lead this strategically vital business for Deutsche Bank.”\nDe Sanctis said: “With the International Private Bank, we will create a truly global organisation with a unique focus on serving entrepreneurial individuals and families with European connectivity as well as a personal banking powerhouse in major Eurozone markets. Combining our internationally focused Private Bank businesses will allow us to develop our market share within and across local markets. We will be able to provide greater access for private banking clients to our wealth management capabilities and to combine forces to offer superior digital services to our private, wealth and commercial clients.”\nAshok Aram, Head of Private & Commercial Business International and CEO EMEA, has decided to leave Deutsche Bank for personal reasons. Aram joined the company in 1995 and has held a variety of senior leadership roles in Tokyo, Singapore, Frankfurt, New York, London and Dubai.\n“Ashok has a strong track record of growing Deutsche Bank’s businesses in a variety of areas across the bank and has been instrumental in leading Private & Commercial Business International to renewed success,” said von Rohr. “He is an outstanding leader and excellent client relationship manager. I would like to thank him for his guidance, courage and dedication to our institution. I regret that he is leaving Deutsche Bank and wish him all the best for the future.”\nTogether with Deutsche Bank’s domestic Private Bank Germany, which will remain unchanged in its scope, the International Private Bank will form the Private Bank, one of four business divisions in the institution’s Core Bank.",
    "number_of_ratings": 2,
    "rating": 4.5,
    "likes": 4
}