{
    "url": "https://www.db.com/news/detail/20230126-deutsche-bank-named-flow-market-maker-of-the-year-in-the-2023-risk-awards?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 26, 2023",
    "tags": [
        "Awards",
        "Investment Banking"
    ],
    "title": "Deutsche Bank named Flow Market Maker of the Year in the 2023 Risk Awards",
    "body": "Thanks to our leading-edge technology, outstanding client coverage and enduring market presence, our FIC business has been awarded Risk’s Flow Market Maker of the Year.\nDeutsche Bank has scooped Risk’s Flow Market Maker of the Year award for 2023.  The Risk Awards are the longest-running awards for firms and individuals involved in risk transfer markets and in risk management, and follow a rigorous three month process which includes canvassing client views. The bank’s FIC business was selected thanks to our leading edge technology, outstanding client coverage and enduring market presence off the back of nine straight quarters of out-performance versus peer average.\nRam Nayak, Co-Head of the Investment Bank and Global Head of Fixed Income and Currencies, said: “We’ve invested strategically in our platforms and our people.  Smart algos are enabling clients to manage risk in a more intelligent and convenient way and we’re winning business as a result.  In recent times of unprecedented volatility, we’ve focused on providing consistent liquidity to our clients. At these times, the breadth and composition of our FIC franchise is a key differentiator.”\nRussell LaScala, Global Head of FX, said:  “Last year, clients rightly paid closer attention to their FX hedging and risk.  2022 markets were incredibly volatile and in response to client demand, we’ve been providing well-priced liquidity even under distressed conditions. We’ve taken huge market share in trading forwards and swaps as a result.  In recent years we have built out our G10 currencies offering, and we’re now looking to extend the same level of support to clients seeking liquidity for non-deliverable emerging-market currencies.”\nPanayiotis Stergiou, Global Head of Institutional Client Group and Co-Head of FIC Structuring, said: “2022 saw unprecedented volatility.  Banks had to make markets and we worked hard to provide liquidity consistently. At these times the breadth and composition of the Deutsche Bank FIC franchise is a differentiator. This allows us to provide liquidity to our clients and won us further market share.  In more ‘normal’ Liquidity, clients want to execute in new and more convenient ways. \n\"We’ve invested in our flow execution service across our secondary market flow businesses. Using new or improved technologies to drive simplicity and speed of execution from the moment a client engages with us, how we make the price, to the sale/trader workflow and how it books for risk, reporting and control systems. The changes we made in early 2021 to have a dedicated and specialised flow and liquidity coverage model, together with our investments on the quant and trading teams has positioned Deutsche Bank as a market-leading flow market maker.”\nKemal Askar, Global Head of Rates, said:  “We’ve become more systematic and data-oriented in the last 12 months, streamlining the client experience through transformed electronic coverage processes. That means we can provide a more consistent and competitive electronic offering to clients, which has also consolidated our position during periods of heightened volatility in the rates markets. With a carefully considered risk appetite and balance sheet, we can warehouse risk in a way that allows us to act as a significant liquidity provider, especially during periods of market stress.”",
    "number_of_ratings": 7,
    "rating": 3.3,
    "likes": 15
}