{
    "url": "https://www.db.com/news/detail/20230112-robotic-process-automation-for-corporate-clients-in-china?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "January 12, 2023",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Robotic Process Automation for corporate clients in China",
    "body": "Deutsche Bank and its Blue Water Fintech Lab recently launched a Robotic Process Automation (RPA) commercialization program by introducing a multibank Data Processing and Reconciliation Solution, its first commercial product.\nDeutsche Bank is the first international bank in China to offer this innovative solution to its corporate clients through a direct service model.\nThe RPA tool aims to help corporate treasurers automate and streamline complex processes, making it easier for them to provide management with real-time data and actionable insights for decisive strategies.\nChintan Shah, Deutsche Bank’s Head of Corporate Coverage for APAC and Head of Cash Sales, said “Having invested significantly in our technology and our own digital transformation over the past few years, we firmly believe that it will power the development of innovative services, deliver new digital solutions and help us move even closer to our clients by embedding our services in their platforms.”\nRachel Whelan, Deutsche Bank’s APAC head of Cash management, said “The evolving state of digital finance means business customers expect more modern technologies a part of their corporate banking engagements. Our new RPA solution allows clients to manage automated reconciliations and makes the business process lean and efficient. This is a first step in supporting our clients on their digital transformation journey.”\nYi Zhu, Head of China Innovation and Fintech Products of Corporate Bank, said “We listen closely to clients’ needs in rolling out fintech solutions. Adopting a two-step strategy from proof of concept (POC) to commercialization, we have successfully extended from bank channels to clients' supply chains and transformed from technology empowerment to value empowerment. It is our goal to create a win-win ecosystem between banks and enterprises by integrating resources and new technology.”\nThe first batch of pilot clients span a range of different industries:\nAmanda Shi Head of China Treasury department, Thyssenkrupp Elevator (China): “Deutsche Bank's RPA program and end-to-end service capabilities provide us with an extraordinary digital experience. The solution embedded with intelligent hardware has greatly improved the automation of financial management. We look forward to more innovative digital products brought by the RPA program”.\nJunyong Lu, Treasury Head, SPH Keyuan Xinhai Pharmaceutical: “As a pilot user of Deutsche Bank's RPA program, we have participated in the entire process of solution build-out, from POC to commercialization. We are impressed by Deutsche Bank's rapid product iteration and service capabilities, and we look forward to deepening our business relationship riding on the successful launch of this innovative digital solution. \"\nHongxia, Wang, General manager, Treasury department PowerChina International Group: “China's state asset regulator will continue to push State-owned enterprises (SOEs) to adopt sophisticated treasury management systems. Deutsche Bank's RPA program has helped us improve our digital treasury management capabilities, laying a good foundation for closer cooperation in the future.”\nAccording to data from the pilot program, 60-80 hours of manpower can be saved every month through these automated tools. The solution can process tens of thousands of financial documents at the same time, and significantly shorten reconciliation time from 2-3 days to within one hour. It also helps avoid data problems caused by manual entry errors.\nKey features include:\nCustomized reconciliation logic to meet different clients’ unique requirements\nConfigurable Interface to align with client’s dashboard or business intelligence (BI) platform\nPre-built connectors to deliver extraction and transformation capabilities for major client enterprise resource planning (ERP) or Treasury Management systems with no interface development required\nAutomated transaction data extraction and conversion from e-banking platform\nAutomated multi channels (e-statement/e-wallet/MT940, etc) Integration\n100% automated reconciliation process with no human intervention \nFully API Enabled\nArtificial Intelligence-Enhanced automation with extended capabilities",
    "number_of_ratings": 4,
    "rating": 3.5,
    "likes": 11
}