{
    "url": "https://www.db.com/news/detail/20240522-former-deutsche-bank-chief-executive-rolf-breuer-has-passed-away?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 23, 2024",
    "tags": [
        "Company"
    ],
    "title": "Former Deutsche Bank chief executive Rolf Breuer has passed away",
    "body": "Rolf-E. Breuer, former CEO and Chairman of Deutsche Bank, passed away on Wednesday. Employees, members of the Management Board and Supervisory Board mourn his death. The 86-year-old passed away in the presence of family, following a long illness.\nBreuer spent most of his professional life at Deutsche Bank. He started as a trainee at the Mainz branch of the then Süddeutsche Bank – one of the successor institutions of Deutsche Bank in the post-war years – and completed it in 1958 in the Munich branch of the re-established Deutsche Bank. After obtaining a doctorate in law, and internships at two local banks in London and Paris, he returned to Deutsche Bank in 1966. He was promoted to head of the stock exchange department in 1974 and was appointed to the Management Board in 1985.\nIn 1997, Breuer succeeded Hilmar Kopper as CEO of Deutsche Bank. During his term as CEO, which lasted until May 2002, Deutsche Bank completed its largest acquisition. The takeover of Bankers Trust in 1999 significantly strengthened the bank’s position in the US and on international capital markets. In October 2001 under Breuer's leadership, Deutsche Bank shares were listed on the New York Stock Exchange. He served as Chairman of the Supervisory Board from 2002-2006.\nAlexander Wynaendts, Chairman of the Supervisory Board of Deutsche Bank, paid tribute to his achievements: \"Rolf Breuer’s importance for Deutsche Bank cannot be overestimated. With the acquisition of Bankers Trust, he made a significant contribution to building a Deutsche Bank that can now support its clients worldwide in all financial matters, with the necessary global network and expertise. With Rolf Breuer, Deutsche Bank is losing one of its most influential personalities. My thoughts are with his wife and family.\"\nDuring his career, Breuer was particularly committed to strengthening Germany as a financial centre, which earned him the nickname \"Mr Financial Centre.\" This commitment was also reflected in numerous positions: He served as Chairman of the Supervisory Board of Deutsche Börse AG, Chairman of the Stock Exchange Council of the Frankfurt Stock Exchange, initiator and member of the board of Aktionskreis Finanzplatz e.V., a foundation promoting Germany as a financial centre, and President of the Association of German Banks. He was instrumental in the founding of the Centre of Financial Studies at the Goethe University Frankfurt, which was recognised in 2020 in his appointment as honorary senator by the university. In 2005, the city of Frankfurt awarded him its badge of honour.\nChristian Sewing, CEO, said: \"I remember Rolf Breuer as an 'old school' banker in the best sense of the word, with a classic appearance, but also with enormous strategic vision. Above all, big clients and international business were close to his heart, because he saw them as the basis for a strong German economy. Both areas grew significantly in his time. And with his promotion of our financial centre, he also made an important contribution to the positive development of the economy as a whole.\"\n\"We also remember his cultural commitment – for the Academy of Arts in Berlin, the Alte Oper and the Kunsthalle Schirn in Frankfurt as well as the Cultural Foundation of the Länder and the State of Hesse,” Sewing said. “On behalf of all employees and on behalf of the Management Board, I would like to express our deepest sympathy to his wife and family.\"",
    "number_of_ratings": 18,
    "rating": 4.3,
    "likes": 12
}