{
    "url": "https://www.db.com/news/detail/20240521-raising-diverse-voices-in-the-art-world-with-frieze?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 21, 2024",
    "tags": [
        "Art",
        "Diversity",
        "Wealth"
    ],
    "title": "Raising Diverse Voices in the Art World with Frieze",
    "body": "Building on a commitment to lifting the voices of underrepresented communities in the U.K.’s art-gallery ecosystem, Deutsche Bank and Frieze are excited to announce the selection of Birmingham-based public institution Ikon Gallery as their partner for the 2024 Emerging Curator’s Fellowship. The initiative supports Black and people of color (POC) curators through 12-month, full-time, paid fellowships within leading arts organizations.\nThe selection of Ikon Gallery marks the fifth year of the program in the U.K. Previous institutions to have hosted the fellowship include the Baltic Centre for Contemporary Art in Gateshead, Chisenhale Gallery in London, The Whitworth Gallery in Manchester, and V&A East in London.\nMary Findlay, International Art Curator, Deutsche Bank said, \"We are delighted that Ikon Gallery in Birmingham has been selected to receive funding for an emerging curator fellow, following an incredibly strong application. Ikon will support the fellow in a variety of ways, including a research grant and director mentorship. The fellowship reflects Frieze and Deutsche Bank’s joint commitment to supporting diversity and social mobility by creating a new generation of POC curators.\"\nDeutsche Bank is one of the largest employers in the banking sector in Birmingham. It has had operations in the City for over 15 years and now has over 1000 employees there.\nThe choice of Ikon has already received attention in art-world media, with a recent article in Elephant making note that of the five selected institutions to-date, three of them have now been outside of London.\nMelanie Pocock, Ikon’s artistic director of exhibitions, sees a special importance in the choice of a Birmingham cultural institution. “Our location in Birmingham – one of the first super-diverse cities in the U.K. – provides a culturally rich and dynamic context for the fellow to develop their skills and practice across exhibition making, public and collaborative programming,\" she said.\nIkon Gallery will receive a £45,000 grant to cover the fellowship costs, and recruitment for this year’s fellow will begin in the summer of 2024.\nDeutsche Bank is the Global Lead Partner for Frieze, with 2024 marking the 21st year of the partnership. As part of its Art & Culture commitment, Deutsche Bank has supported and collected the work of cutting-edge, international artists for more than 40 years. A global leader in corporate art programs, the bank also runs an Artist of the Year program, as well as its own cultural center in Berlin, the PalaisPopulaire.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}