{
    "url": "https://www.db.com/news/detail/20240521-deutsche-bank-singapore-receives-sgenable-s-platinum-enabling-mark-for-disability-inclusion?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 21, 2024",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank Singapore receives SG Enable’s Platinum Enabling Mark for disability inclusion",
    "body": "Deutsche Bank has been honored with the Platinum Enabling Mark by SG Enable, a pinnacle of recognition for its disability-inclusive practices in Singapore. This award is the highest tier of national-level accreditation for disability inclusion. It celebrates the bank’s unwavering commitment to fostering an inclusive workplace and creating equal employment opportunities for persons with disabilities.\nAt the forefront of Deutsche Bank’s inclusivity initiatives is dbEnable, the bank’s employee resource group whose goal is to create an environment that increases the participation and contribution of people with disabilities in the workplace.\ndbEnable’s Work Placement Program is provides students with disabilities with professional experience across various divisions within the bank. This initiative is run over a 10-week period offering structured training and helping students develop practical skills required to develop a successful career. It also ensures that the students are integrated into meaningful projects, contributing to the bank’s innovative solutions. Through the programme, students have been hired into permanent positions at Deutsche Bank and other major corporations.  \nLast year, Deutsche Bank introduced the Neurodiversity@work program in Singapore, collaborating with the Autism Resource Center to onboard six autistic individuals into Operations roles.\nThe bank has implemented a range of coaching and awareness initiatives to drive an inclusive culture and support employees with both visible and invisible disabilities. These efforts are part of a broader strategy to empower all employees and encourage a supportive work environment. Deutsche Bank is also taking progressive steps to expand hiring efforts for people with disabilities across the region.\nDeutsche Bank was a founding member of the Singapore Business Network on Disability (SBNoD). The bank has joined forces with other like-minded businesses to share best practices and experiences, collectively working towards a more inclusive society by promoting the inclusion of people with disabilities. The network raises disability awareness, provides  job opportunities, and promotes inclusivity in the community.\nSG Enable is the focal agency for disability inclusion in Singapore.",
    "number_of_ratings": 9,
    "rating": 4.7,
    "likes": 9
}