{
    "url": "https://www.db.com/news/detail/20240514-deutsche-bank-joins-project-guardian-to-explore-asset-tokenization-applications?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 14, 2024",
    "tags": [
        "Technology, Data & Innovation",
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank joins Project Guardian to explore asset tokenization applications",
    "body": "Deutsche Bank today announced it has joined the Monetary Authority of Singapore’s (MAS) Project Guardian (as part of the asset and wealth management workstream). The collaborative initiative is dedicated to testing the feasibility of asset tokenization applications in regulated financial markets.\nProject Guardian is a multi-year project involving global policymakers (including the United Kingdom’s FCA, Switzerland’s FINMA and Japan’s FSA) and financial services industry representatives.\nAs part of the asset and wealth management workstream, the bank will test an open architecture and interoperable blockchain platform to service tokenized and digital funds. It will then propose protocol standards and identify best practice to contribute to industry progress.\nAnand Rengarajan, Head of Securities Services for Asia Pacific and the Middle East and Global Head of Sales said: “We are committed to being a leader in driving the development and adoption of digital assets in Singapore and Asia Pacific.\"\nContributing to Project Guardian will bolster our efforts to help shape the new frontier of asset servicing, and strongly position us to contribute to industry progress, and not only anticipate our clients’ needs but exceed their expectations. \nAnand Rengarajan\nMike Clarke, Global Head of Securities Services Product Management said: “Collaborating with leading fintechs and digital natives is key to engineering technologically advanced asset servicing products. This will not only enhance our competitiveness but empower us to create more value. Through Project Guardian, and our work on relevant standardization areas, we hope to elevate the sound and tangible benefits that technology and collaboration can bring to clients and the industry. \nBoon-Hiong Chan, Deutsche Bank’s Asia Pacific Head of Securities & Technology Advocacy and Industry Applied Innovation Lead, will be the bank’s lead for Project Guardian. It will closely work with Memento Blockchain (a decentralized finance and hyper-chain zero-knowledge specialist), with whom it previously executed the proof-of-concept DAMA 1 in 2023. These new efforts will deliver DAMA 2. Interop Labs, the initial developer of the Axelar network (a Web3 interoperability platform) will also join the bank’s efforts.\nDeutsche Bank AG                                       \nMedia Relations                                           \nKate Fields\nPhone: +852 2203 5094\nEmail: kate.fields@db.com\n ",
    "number_of_ratings": 5,
    "rating": 4.8,
    "likes": 14
}