{
    "url": "https://www.db.com/news/detail/20221230-deutsche-bank-publishes-2023-srep-requirements?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "December 30, 2022",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank publishes 2023 SREP requirements",
    "body": "Deutsche Bank AG (XETRA: DBKGn.DE / NYSE: DB) has been informed by the European Central Bank (ECB) of its decision regarding prudential capital requirements to be maintained from 1 January 2023 onwards, following the 2022 Supervisory Review and Evaluation Process (SREP). The ECB’s decision requires Deutsche Bank, on a consolidated basis, to maintain a Pillar 2 requirement (P2R) of 2.70% of which at least 1.52% must be covered by Common Equity Tier 1 (CET 1) capital, and 2.03% by Tier 1 capital. Consequently, on 1 January 2023, Deutsche Bank’s Pillar 2 requirement will increase by 20bps of which 11bps need to be covered with CET 1 capital and 15bps with Tier 1 capital. The increase is driven by the ECB's newly introduced separate assessment of risks stemming from leveraged finance activities.\nThe ECB’s decision will require Deutsche Bank, on a consolidated basis, to maintain a Common Equity Tier 1 (CET 1) capital ratio of at least 10.55% compared to 10.43% per 30 September 2022. This new CET 1 capital requirement comprises: the minimum Pillar 1 requirement of 4.50%; the Pillar 2 requirement of 1.52%; the capital conservation buffer of 2.50%; a countercyclical buffer of 0.03% (assumed unchanged from 30 September 2022); and the requirement arising from the maximum of the buffers from Deutsche Bank’s designation as a Global Systemically Important Institution (G-SII) or as an Other Systemically Important Institution (O-SII) of 2.00%.\nThis requirement sets the level below which Deutsche Bank would be required to calculate a Maximum Distributable Amount (MDA). The MDA is used to determine restrictions on distributions, notably in the form of dividends on CET 1 capital, new variable remuneration and coupon payments to holders of Additional Tier 1 instruments.\nThe ECB has also set new minimum requirements for other capital definitions. 2023 requirements of 12.56% are set for Deutsche Bank’s Tier 1 capital ratio (vs. 12.41% per 30 September 2022) and 15.23% for the Total capital ratio (vs.15.03% per 30 September 2022). In comparison, Deutsche Bank’s last reported consolidated capital ratios were 13.33% CET 1 capital ratio, 15.29% Tier 1 capital ratio and 18.07% Total capital ratio, as of 30 September 2022.\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nFrank Hartmann\nPhone: +49 69 910 42744\nEduard Stipic\nPhone: +49 69 910 41864\ndb.media@db.com\nInvestor Relations\n+49 800 910-8000\ndb.ir@db.com",
    "number_of_ratings": 74,
    "rating": 4.5,
    "likes": 921
}