{
    "url": "https://www.db.com/news/detail/20221213-navigating-towards-a-greener-future?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "December 13, 2022",
    "tags": [
        "Sustainability"
    ],
    "title": "Navigating towards a greener future",
    "body": "Nine out of ten goods traded globally are transported by ship. Without shipping, we would not live in a globalised world. The problem with ships, though, is that they mainly run on fossil fuels and are a massive contributor to global CO2 emissions. The challenge is now on to plot a greener and, ultimately, carbon-free course.\nThe revolutionary twenty-foot box\nOnce upon a time, a ship would spend more time in the port being loaded and unloaded than it did at sea. But thanks to the ingenious invention of the standard container in 1954, today’s vessels hold larger quantities of goods in stackable boxes that can be quickly unloaded directly onto trains and trucks at the port. As a result, the costs for transport by sea have fallen considerably in recent years.\nToday, the standardised container is available for a wide variety of products and raw materials: for liquids or gas mixtures, with refrigeration and for standard cargo such as televisions, semiconductors or children's toys. As the shipping industry has grown, so too have the ships – from around 180 metres long in the 1960s to 400 metres long today, with space for more than 20,000 standard containers.\nIn 2019, the year before the Covid pandemic, the global container transport volume was 150 million TEUs (Twenty Foot Equivalent Unit; one TEU is equivalent to a 20-foot container). Although fewer containers were shipped in 2020, container transport volume rose again. Good for the economy – bad for the environment.\nOcean liners are mainly powered by heavy oil or marine fuel and contribute significantly to global CO2 emissions. Transporting goods and commodities worldwide by ship is still more energy efficient than, say, by air, but the harm it causes to the environment cannot be ignored: shipping now accounts for 2.7 percent of human-caused greenhouse gases emissions each year – about as much as Germany emits in total in the same time. Or to put it another way: if international shipping were a country, only five countries would emit more CO2.\nIf the industry continues to grow at this pace until the middle of the century, experts predict an increase in harmful greenhouse gases by up to two hundred and fifty percent. This means we would fail to achieve the 2015 Paris Climate Agreement goals to limit global warming to below two degrees Celsius by 2100.\nCO2-neutral by 2050 – will it succeed?\nThe need for a change of course is clear to most industry representatives, and German ship owners are taking a leading role here, calling within the International Marine Organization (IMO) for international shipping to become climate-neutral by 2050. \"Our clients in the industry have set ambitious sustainability targets,\" confirms Bastian Dühmert, industry expert at Deutsche Bank's Corporate Bank. \"Shipping is at a turning point. In addition to the development of alternative fuels and engines, it is important that there are uniform rules for all market participants.\"\nSince large container ships cannot be operated electrically like cars, and even slower sailing or improved ship operations won’t bring the necessary CO2 savings, the key lies in developing new fuels whose combustion releases little to no greenhouse gases. The current focus is on green ammonia and methanol. \"Their availability is still the problem,\" explains Michael Kastl, Treasurer of Hapag-Lloyd. Likewise, the infrastructure for loading and refueling ships along the trade routes has not yet been developed. The Hamburg Port has just taken its first step with its plans to build a new ammonia terminal by 2026.\nInterim solutions en route to a green future\nUntil these new fuels are available, industry giants like Hapag-Lloyd are relying on technologies to bridge the gap. The company has ordered twelve new ships to be powered by LNG (Liquified Natural Gas) and aims to be CO2-neutral as early as 2045. Deutsche Bank has supported the company here in issuing a green bond.\n\"LNG is available in sufficient quantities, the infrastructure is there and we can use it immediately,\" said Kastl. “With the twelve ships alone, Hapag-Lloyd can reduce its CO2 emissions by up to 20 percent in the short term. At two billion euros, the investment costs are no small matter, even for a successful shipping company, but the vessels could eventually be converted to CO2-neutral propulsion technologies later on.\" Deutsche Bank was joint global coordinator for Hapag-Lloyd's inaugural € 300 million green bond. The bond is linked to the achievement of carbon reduction targets for 2025.\nExpensive fuels, expensive ships: sustainability as a competitive disadvantage?\nLow-emission fuels will initially be more expensive, so ship owners are demanding that these disadvantages be offset and that the same rules apply to all. One idea is the global CO2 tax of 75 US dollars for each tonne of CO2 released, which the IMF calculates could reduce ship emissions by a quarter by 2040. The hope is that the higher the levies on CO2 emissions and the cheaper new technologies are, the more likely ship owners will be to replace their fleets with low-emission propulsion systems.\nThe EU is a trailblazer within the International Marine Organization and has pushed for a CO2 levy that will already be imposed in 2023 for all ship owners crossing EU waters. The first shipping companies are already investing in environmentally friendly ships. \"Private investments will only really increase when it is clear that customers are willing to pay for environmentally friendly transports and the technology is mature – after all, ships have a lifetime of 20 years and longer,\" says Bastian Dühmert. CO2-neutral transport will become the new normal.\nA transition to sustainable shipping is costly\nAccording to a study by the Global Maritime Forum, the shipping industry will have to invest somewhere between 1 and 1.4 trillion US dollars between 2030 and 2050 to halve its emissions by 2050. Complete decarbonisation would require about 1.4 to 1.9 trillion US dollars over the same period. For Michael Kastl, the direction is clear despite the necessary high investments: \"Our customers will demand CO2-neutral transport of their goods and only shipping companies that can ensure this in the long term will survive.\" And while certain products may end up costing more, he is convinced: “CO2-neutral transport will soon become the new normal\".\nFor a deeper dive into the container shipping industry and Hapag Lloyd’s remarkable history and journey towards cleaner marine fuel, do read the flow case study entitled “Seafarers of net zero\".",
    "number_of_ratings": 46,
    "rating": 4.5,
    "likes": 55
}