{
    "url": "https://www.db.com/news/detail/20221207-deutsche-bank-partners-with-nvidia-to-embed-ai-into-financial-services?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "December 7, 2022",
    "tags": [
        "Digital banking & services"
    ],
    "title": "Deutsche Bank Partners with NVIDIA to embed AI into Financial Services",
    "body": "Multi-year innovation partnership aims to accelerate the use of AI to improve financial services\nCompanies developing a range of applications, including intelligent avatars, speech AI, and fraud detection\nDeutsche Bank and NVIDIA to develop applications to improve risk management, boost efficiency and enhance customer service using NVIDIA AI Enterprise software\nPartnership will expand the bank’s internal AI center of excellence to develop, foster and promote Explainable and Responsible AI in the financial services industry\nDeutsche Bank today announced a multi-year innovation partnership with NVIDIA to accelerate the use of artificial intelligence (AI) and machine learning (ML) in the financial services sector.\nCombining Deutsche Bank’s financial industry expertise with NVIDIA’s leadership in AI and accelerated computing will hasten the development of a broad range of regulatory-compliant AI-powered services. The partnership will support Deutsche Bank’s cloud transformation journey, for example by using AI and ML to simplify and accelerate cloud migration decisions.\n“AI, ML and data will be a game changer in banking, and our partnership with NVIDIA is further evidence that we are committed to redefining what is possible for our clients,” said Christian Sewing, CEO, Deutsche Bank.\n“This partnership is a significant step forward in our AI and ML ambitions. It will help us take a leading position in the usage of these technologies in financial services,” added Bernd Leukert, Deutsche Bank’s Management Board Member responsible for Technology, Data and Innovation.\n“Accelerated computing and AI are at a tipping point, and we’re bringing them to the world’s enterprises through the cloud,” said Jensen Huang, founder and CEO, NVIDIA. “Every aspect of future business will be supercharged with insight and intelligence running at the speed of light. Together with Deutsche Bank, we are modernizing and reimagining the way financial services are operated and delivered.”\nThe collaboration follows months of exploratory work in which the companies tested a number of potential use cases, with a focus on three in particular: risk model development, high-performance computing, and the creation of a branded virtual avatar.\nNext-generation risk management through accelerated compute\nAccelerated computing enables traders to manage risk and run more scenarios faster and at scale while also improving energy efficiency. Supported by NVIDIA’s AI, ML and accelerated compute knowledge, the partnership will enrich Deutsche Bank’s leadership in risk management, improve efficiency and enhance customer service.\nTo enable this work, Deutsche Bank plans to leverage NVIDIA AI Enterprise, an end-to-end software suite for streamlining AI development and deployment that can run in the cloud or in the data center. With this flexibility, Deutsche Bank’s AI developers, data scientists and IT professionals will be able to run NVIDIA AI workflows on-premises as well as on Google Cloud, Deutsche Bank’s public cloud provider. \nRedefining customer service with interactive avatars\nDeutsche Bank is working to develop next-generation user experiences with NVIDIA Omniverse Enterprise, an open computing platform for building and operating metaverse applications, and AI models and services that makes it easier to build and customize lifelike virtual assistants and digital humans.\nWith NVIDIA Omniverse, the bank’s teams have developed an early concept of a 3D virtual avatar aimed at helping employees navigate internal systems and respond to HR-related questions. Future use cases will explore immersive experiences with banking clients.\nDeriving insights out of unstructured data\nExtracting key information from unstructured data has long been a challenge for organizations, especially those in financial services. Existing large language models do not perform well on financial texts. Deutsche Bank and NVIDIA are testing a collection of large language models called Financial Transformers. These will run AI and ML models and achieve outcomes such as early warning signs on the counterparty of a financial transaction, faster data retrieval and identifying data-quality issues.\nThe innovation partnership is an integral part of Deutsche Bank’s ongoing technology transformation. Deutsche Bank will expand an internal AI center of excellence, accelerated through the partnership, to support the experimentation and development of AI and ML services and professional skills development. The center will also develop, foster and promote explainable and responsible AI to expand the understanding of model predictions in financial services applications, and exploration in the areas of AI and accelerated computing.",
    "number_of_ratings": 63,
    "rating": 3.6,
    "likes": 64
}