{
    "url": "https://www.db.com/news/detail/20180924-deutsche-bank-cooperates-with-trade-technologies-inc-setting-the-course-for-digitalization-of-the-trade-document-business?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 24, 2018",
    "tags": [
        "Capital markets",
        "Corporate products",
        "Digitalisation",
        "Investment Banking",
        "Private products",
        "Research"
    ],
    "title": "Deutsche Bank cooperates with Trade Technologies Inc.",
    "body": "Deutsche Bank has signed a cooperation agreement with Trade Technologies Inc. aiming to extend their long-lasting partnership to Europe and especially to Germany.\nTrade Technologies is the global leader for Internet-based software solutions and document preparation services for traditional trade finance products. Their first location in Germany is now being established in Stuttgart.\nA key element of the cooperation is the enhanced support for exporters using documentary letters of credit and collection orders to secure payments. In this regard Trade Technologies organises the document preparation which includes the coordination with third parties, e.g. freight forwarders, insurance companies and Chambers of Commerce.\nExisting client mandates with Deutsche Bank, using a similar service known as „Global Trade Management“, shall be transferred gradually to Trade Technologies.\nDaniel Schmand, Head of Trade Finance at Deutsche Bank says: „We always want to offer our customers the best available solutions. The digital platform developed by Trade Technologies is an excellent expansion of our offering for corporate customers. As a result our Product Specialists can further strengthen their focus on risk advisory.”\nKirk Lundburg, President & CEO of Trade Technologies Inc., says: „We are delighted to extend our existing partnership with Deutsche Bank. We want to offer to companies in Germany and Europe a suite of technology and services that simplify and streamline the processing of its trade business and take forward the automation of trade document business overall.”\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Contact\nFrank Hartmann\nPhone: +49 69 910 42744\nE-mail: frank.hartmann@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}