{
    "url": "https://www.db.com/news/detail/20180924-10-years-after-lehman-a-more-stable-financial-system-says-dws-klaus-kaldemorgen?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 24, 2018",
    "tags": [
        "Company",
        "History"
    ],
    "title": "10 years after Lehman: a more stable financial system, says DWS' Klaus Kaldemorgen",
    "body": "DWS fund manager Klaus Kaldemorgen clearly remembers the weekend 10 years ago when Lehman Brothers collapsed.\n“The working week started very early for us,” he recalls in an interview with Germany’s FONDS professionell. “The biggest worry for me was the impact on our portfolios. How many bonds were we holding? Did we have certificates that Lehman had issued and would we have sufficient collateral for historical securities lending to Lehman?”\nWhile the news of the downfall of Lehman Brothers may not have been a surprise to many, Kaldemorgen – one of Europe’s best-known and most experienced fund managers – says the magnitude of the ripple effect certainly was.\nAt the time, we gave a television interview and estimated the damage as a result of the Lehman collapse would run to around 50 billion US dollars. In fact, at that point everyone was only looking at the direct consequences from bankruptcy. The collateral damage turned out to be many times higher than that because of the immense loss of trust in how capital markets functioned.\nKaldemorgen says that while the US was relatively swift in implementing measures to deal with the crisis, it took considerably longer in Europe. “I suspect that at the very start decision-makers in Europe thought the financial crisis was an American problem and would only have to be resolved over there. How wrong they were!”\nDespite this, Kaldemorgen believes that the more stringent equity capital requirements that have since been introduced have contributed to a more stable financial system. “Post-Lehmann the flood of new regulation seeped into every corner of the financial industry. In certain cases, we can see a degree of regulation rage which under the circumstances might be understandable.”\nBut while the flow-on from Lehman’s collapse can still be felt around the world, Kaldemorgen believes the greatest threat to financial stability today is a serious financial recession. “In Europe especially, many countries have almost no scope to increase their deficits significantly. Meanwhile ECB monetary policy remains in crisis mode and therefore cannot generate any positive stimuli in terms of monetary policy.”\nHe adds: “In the long term this crisis will not be resolved through loose monetary policy, but instead by improving the competitiveness of European states as well as the whole European banking system.”\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}