{
    "url": "https://www.db.com/news/detail/20180924-how-blockchain-technology-is-changing-the-financial-industry-10-theses?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 24, 2018",
    "tags": [
        "Corporate products",
        "Cryptocurrencies",
        "Digitalisation",
        "Research"
    ],
    "title": "How blockchain technology is changing the financial industry",
    "body": "Countless articles, news blogs, and internet forums have dealt with blockchain technology in the past few years. It's time to sum up these efforts. How (r)evolutionary is blockchain technology? What are its limits? And above all, how can customers, companies, and in particular the financial industry benefit from it? Let’s take a look in more detail.\n1. Blockchain technology is – still – in its infancy.\nThere is still a lot of testing and trial and error in the area of blockchain technology – at banks as well as in the IT sector, at logistics firms, and in government institutions. The hype of the past few years may now be subsiding a little. Now is the time for blockchain makers to deliver. Many compare the disruptive potential of the technology with the internet at the beginning of the 90s. The findings to date are promising, even if – as back then with the internet – concrete everyday uses for it have yet to materialize. But ultimately there is probably no service that could not be affected by the blockchain revolution. The basis of trust is formed thanks to the decentralized and unalterable storage of information – something previously only large administrators could accomplish. In the future, when it comes to transferring property or \"cementing\" the truth in general, blockchain technology can play to its strengths.\n2. Blockchain technology offers an opportunity for the financial industry,\nwith the potential to turn the banking business upside down. The transformation of banks into infrastructure and technology providers could be dramatically accelerated. One potential playing field is commodity trade financing. But other areas of business such as the execution of securities transactions, corporate financing, syndicated loans, and bond issues could come into focus in the next few years. In addition, blockchain applications have the potential to fundamentally alter the core processes of the banking business and simplify bank-wide management in the process. One consequence of this development is that banks will thereby gain more time for their core business, i.e. advising their customers.\n3. Banks can use blockchains in a wide variety of ways.\nExactly how would blockchains work in day-to-day business operations? First, they can simplify ongoing operations by automating the reconciliation of positions and accounts. Second, they accelerate clearing and trade processing, i.e. settlement. Subsequent adjustments are avoided. The high level of transparency also helps a bank to satisfy regulatory requirements more efficiently. Third, the technology also reduces the risk that a business partner cannot meet or insufficiently satisfies its obligations; the terms and conditions of a transaction are transparent and unalterably defined. Therefore – fourth – the risk of fraud also declines, because the decentralized register stores the entire history of a transaction and the origin of the traded assets. Fifth: Blockchain technology saves costs, because interim steps and diversions are dispensed with when all parties work with a common register.\n4. More can be achieved by working together – especially with blockchains.\nThe magic word in the world of permissioned ledgers is \"coopetition\". Banks that cooperate while competing with each other build a blockchain ecosystem together that increases process efficiency in each bank. If they are successful, the substantial investments to construct the ecosystem are offset not only by streamlined, cost-efficient internal IT processes but also by collaboration between the banks. The construction of such blockchain ecosystems is precisely the goal of the various consortia in which Deutsche Bank participates:\nIn the project Utility Settlement Coin (USC), we, together with our partners, are merging the advantages of digital and traditional currency. The aim is to facilitate transactions using blockchains – at first between other banks and later between enterprises.\nAnother exciting, already productive blockchain application is the international platform we.trade in which nine banks are currently participating: As one of the founding members, we are working closely together with other European banks to simplify national and international trade for small and medium-sized enterprises. The goal is to simplify national and international trade financing for enterprises, so that trade transactions can be executed more efficiently and securely.\nThe open-source initiative, Hyperledger, which comprises more than 170 members, also strives to collectively advance blockchain technology. Our membership gives us access to a thriving worldwide community of developers and open-source technologies for enterprises. Many of our customers also actively participate in Hyperledger.\nAnd in the R3 consortium, along with other financial companies , we are testing where and how we can mutually utilize blockchains in areas such as digital identification or in capital market transactions.\n5. Blockchain technology is becoming an important building block of electronic identities.\nHaving an identity is a fundamental human right. It confirms for others where we live and work, ensures us access to healthcare and education, gives us the right to vote – and thus permits us to be a visible member of society. Typically, completely different sets of data exist for one and the same person, for example at the civil registration office, with the cell phone provider, or the doctor’s office. In countries such as Estonia and India there are current efforts to store this data and/or access to this data on a blockchain. Governments and public administrations can provide such solutions, but even they cannot necessarily view all the data sets themselves. Thus, users maintain a high level of control over their data and can decide who can have access. Every data set created can be positively identified thanks to blockchain technology, whereby the unauthorized forwarding of data can be traced at all times.\n6. Blockchain can help to regain control.\nIf users retain control of their data, thanks to blockchain they can decide for themselves (again) in the future how their data is used and, if applicable, whether they would like to make it available for a price. This is in contrast with the current situation, as large technology companies collect data from users and sell some of it to other companies – as a condition of the contract formed between the users and providers of social networks.\n7. The financial market could be made more democratic with blockchain technology,\nsuch as with ICOs (initial coin offerings). The entities behind such offerings include start-ups that collect funds through crowdsourcing from private and institutional investors, who in return receive \"tokens\" that can be subsequently traded. The concept certainly has the potential to enable even conventional companies to raise capital. How these tokens are to be handled from a regulatory perspective is still under discussion, but it is entirely possible that the model will become established in the near future, especially considering that its advantages are obvious. On the one hand, there are advantages for entrepreneurs who gain easier access to venture capital, spend less time at roadshows, and have to pay a lower risk premium for the capital thanks to the marketability of the tokens. On the other hand, advantages are seen for private investors who can participate early on in a successful idea and profit from it. At the moment, this is still something to dream about. Many – possibly very many – ICOs are likely to show low returns or become insolvent early on.\n8. Digital fiat currencies can fully map a trade.\nThe founders of blockchain technology intended from the very beginning to create an online-capable payment process. Assuming that future payments over the internet are settled using crypto-euros, the settlement of contracts (smart contracts) can likewise be mapped using a blockchain; for example, transactions and the transfer of ownership of securities. First attempts at this have already been made, for example at USC. The fact that in this case real currencies are being mapped on blockchains makes it possible to minimize currency and counterparty risks and to reduce costs.\n9. Rules and standards will also be necessary in the future.\nArtificial intelligence, central transaction registers and the digitalization of value-creating processes offer a range of benefits – both for companies as well as for society as a whole. Because our technological world is interconnected now more than ever before, regulations, statutory frameworks and reliable production technology are not optional, but instead must be strictly observed. The center established by the World Economic Forum (WEF) for the fourth industrial revolution, of which we are a partner, has the goal of achieving stable, predictable, and transparent regulation. Through collaboration between governments, legislators, regulatory authorities, industry representatives, and academics a framework is to be established that makes it possible to optimally utilize these technologies.\n10. Blockchains are not a panacea for the banking business.\nI am convinced that blockchains are not the answer to all banking operation issues. The fact that new applications are constantly being floated for blockchains does not mean that all ideas for implementation presented are also feasible on a day-to-day basis and should be taken seriously by us. Blockchains are a thoroughly exciting development, but are still \"only\" one of many digital trends – others include, for instance, artificial intelligence, cloud computing, and open interfaces. We observe all of these trends and help to shape them. At the same time, we are convinced that core traditional functions of banks will also be needed in the future – from extending loans to managing risk for our customers. In other words: Blockchain technology can help financial institutions concentrate on aspects that generate value and utility for their customers.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}