{
    "url": "https://www.db.com/news/detail/20180920-deutsche-bank-and-mit-extend-their-research-alliance?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 20, 2018",
    "tags": [
        "Research"
    ],
    "title": "Deutsche Bank and MIT extend their research alliance",
    "body": "Deutsche Bank becomes founding member of the MIT Initiative on the Digital Economy (IDE)\nMIT IDE Co-Director Andrew McAfee: “Companies underestimate the intensity and speed of technological change”\nMarkus Pertlwieser, CDO Private & Commercial Clients, Deutsche Bank: “We continue to extend our knowledge and expertise as a leading platform provider in European Banking”\n  Deutsche Bank and the Massachusetts Institute of Technology (MIT) are broadening their collaboration in the field of economic and technological research. Both parties signed an agreement to this effect in Boston on September 18. Deutsche Bank will become a founding member of the MIT Initiative on the Digital Economy (IDE), and thus considerably expand its collaboration that was initiated in 2016 with the renowned technical university.\nThe alliance has now been renewed for three more years. The bank and the Institute want to jointly analyse how platform economy firms are organised, managed, and operate profitably. Special attention will be focused on the conditions whereby banks can transform from product vendors and service companies into platform providers.\n“Many companies underestimate the intensity and speed of this technological change. Due to our strong industry relationships, MIT IDE has a good understanding of the challenges companies currently face. With this relationship, Deutsche Bank can leverage MIT IDE research in order to be better equipped for the opportunities presented by digitalisation,” said Andrew McAfee at the signing of the alliance. The MIT Sloan Principal Research Scientist is co-Director of the IDE.\nThis even closer collaboration with MIT IDE will help us to extend our knowledge and expertise as a leading platform provider in the European banking business. Over the past two years we have already learned a lot about how platforms achieve success in other parts of the world and other industries, and have woven this knowledge directly into our digital innovations.\nMarkus Pertlwieser, Chief Digital Officer (CDO) for Private & Commercial Clients at Deutsche Bank\nA key research area for the engagement is platform business models in the financial industry: What is required to structure, manage, and make them profitable? Which network effects – that is, how platform providers and users spur each other on – are the key features in the banking environment? Other objectives are projects that look at artificial intelligence in the banking industry and the impact of “open banking” strategies on the valuation of financial institutions.\nThe bank will also offer MIT IDE researchers access to its commercial clients for the purposes of conducting scientific analysis on digitalisation and its impact on business models in various industries in Germany. As a result, these commercial clients may gain exposure to MIT IDE’s research. Additional projects and research areas are to be developed jointly.\nThe bank and MIT IDE are also planning to hold joint events, such as at the World Economic Forum in Davos in 2019. In addition, the two partners will exchange personnel and ideas over the course of the collaboration: Deutsche Bank staff will be able to work alongside MIT teams in conducting research, while MIT IDE researchers will be invited to visit Deutsche Bank for research purposes. Last but not least, the bank will be able to work with MIT’s students and graduates for possible recruitment opportunities.\nIn addition to the research collaboration, Deutsche Bank is also participating in the MIT IDE “Inclusive Innovation Challenge (IIC)”. In this competition the Institute grants 1.6 million US dollars in funding to firms all over the world who are developing new models for employment and work in order to advance economic inclusion of all social strata – also with the aid of new technology. Deutsche Bank will support the companies and their ideas that increase prosperity for all, and thus boost the acceptance of technological innovations.\n  MIT IDE\nMedia Contact\nShannon Farrelly, farrelly@mit.edu\nDeutsche Bank AG\nMedia Contact\nChristoph Blumenthal\nTel.: +49 69 910 47048\nE-Mail: christoph.blumenthal@db.com\nDr Markus Weik\nTel.: +49 69 910 41349\nE-Mail: Markus.Weik@db.com\n  About MIT IDE\nThe MIT IDE, which is based in the Massachusetts Institute of Technology (MIT) Sloan School of Management, addresses the impact of digital technologies on business, the economy, and society. Drawing upon MIT Sloan's strengths in technology and innovation and its internationally recognized faculty, the Initiative analyzes the broad sociological changes brought about by digital technology. Working with public and private sector partners, the MIT IDE conducts groundbreaking research in the areas of productivity, employment, and inequality; big data and human AI; new digital business models; and social analytics and digital experimentation. The MIT IDE sponsors fellows; hosts the global MIT Inclusive Innovation Challenge, conferences, and roundtables; and supports other events that bring thought leaders together to inspire new ideas. The MIT IDE believes that challenges posed by the digital economy are not only solvable, but that technology will create new opportunities for people and businesses to thrive. These activities are more fully described at ide.mit.edu.\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\n     ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}