{
    "url": "https://www.db.com/news/detail/20180919-more-and-more-students-are-choosing-to-work-for-deutsche-bank?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 19, 2018",
    "tags": [
        "Careers",
        "Company",
        "Strategy"
    ],
    "title": "More and more students are choosing to work for Deutsche Bank",
    "body": "This year’s survey ranks Deutsche Bank No. 23 in the list of most attractive employers globally – up five spots from No. 28 in 2017. The bank now comes in as the No. 5 investment bank and remains the highest-ranking non-US investment bank. Universum surveys over 225,000 business, engineering, and IT students each year to find out about their ideal employers, career aspirations and job search methodologies.\nThere are a number of notable achievements for the bank in this year’s results. After four years of Deutsche Bank falling in the rankings, we have successfully reversed the trend. This positive trend is visible in most of our main regions. In the UK, business students ranked Deutsche Bank No. 23 (up from last year’s No. 31 spot), while students in Germany ranked the bank No. 26 (up from No. 33). In the US, we moved from No. 63 up to No. 47.\n“The changes we have made to our employer brand and graduate recruitment strategies are all starting to have an effect,” says Faye Woodhead, Head of Employer Brand and Graduate Programmes. “These rankings are testament to the story we are telling about what it is like to work at Deutsche Bank.”\nMore IT and engineering students find the bank attractive\nDeutsche Bank has broadened its target audience beyond traditional finance and business schools to attract graduates from engineering and IT – the highest sought-after pool of talent across all industries. With a tech-specific campaign, global online events and interactions with some of the bank’s senior managers, the new strategy has been successful: Deutsche Bank moved up the rankings this year, not only globally but also in the UK, Italy, France, China and Brazil.\nA career at Deutsche Bank – what immediately comes to mind?\nWhen asked what they associate with Deutsche Bank, students cited key elements as being the bank’s international nature, its focus on careers and its ever-growing stability. “This provides a great opportunity for us in our story telling to potential candidates and hires,” says Woodhead. “Those of us who already work for the bank often take these associations for granted, or we underestimate how important they are for people outside the company, looking in.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}