{
    "url": "https://www.db.com/news/detail/20180912-deutsche-bank-opening-the-palaispopulaire-in-berlin?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 12, 2018",
    "tags": [
        "Art",
        "Corporate Citizenship",
        "Culture",
        "Sports"
    ],
    "title": "Deutsche Bank Opening the PalaisPopulaire in Berlin",
    "body": "On September 27, 2018, Deutsche Bank is opening the PalaisPopulaire in Berlin. In the heart of the historic center of the German capital, at Unter den Linden 5, the former Prinzessinnenpalais has been expanded into a modern and innovative platform in the last few months. In a minimalist reduced design, the new Deutsche Bank building enables people to experience art, culture, and sports under one roof.\nIn 2016, the bank created the Art, Culture & Sports department in order to bundle its longstanding commitment to these areas in one independent unit. The goal is to create synergies and thus to enable employees, customers, and the general public to have cross-disciplinary cultural experiences. The PalaisPopulaire is an expression of this thinking.\nThorsten Strauss, Global Head Art, Culture & Sports of the bank, says: “The new house offers room for new and lateral thinking. As an open house, the PalaisPopulaire helps us transcend borders—not only between the fields of art, culture, and sports, but also between people and living environments.”\nThe PalaisPopulaire offers a wide-ranging program that brings together diverse aspects of contemporary culture under one roof: art, literature, sports, performance, and dance. The extensive educational program encompasses guided tours, workshops, and innovative digital offers. An important focus is talk series with curators, athletes, culture makers, and artists.\n“We are making a program that is accessible to everyone but that also incorporates complex issues of social relevance,” says Svenja von Reichenbach, director of the PalaisPopulaire.\nIn the new building, the bank has expanded its space for contemporary and current art, now offering more than 750 square meters (of a total of 3,000 in the building). In the future, the Deutsche Bank Collection will have a permanent venue at the PalaisPopulaire, where ever-new thematic exhibitions can be mounted. The opening show is The World on Paper, which, with 300 works on paper by 133 artists from 34 countries, documents the collection’s global orientation.\nIn addition, the PalaisPopulaire will host large solo exhibitions of Deutsche Bank’s “Artist of the Year.” The aim is to present up-and-coming positions on the global art scene to a wide audience. The house also showcases activities of Deutsche Bank’s renowned partner institutions, including Tate London, the Legion of Honor Museum in San Francisco, the Berliner Philharmoniker, and the German Sports Aid Foundation.\nSays Thorsten Strauss: “But above all the new platform reflects Deutsche Bank’s commitment to Berlin, the city where it was founded. And the PalaisPopulaire emphasizes the importance of art, culture, and sports in society.”\nPress photos can be found at http://www.photo-files.de/db-palaispopulaire/\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Contact\nKlaus Winker\nTel: +49 69 910 32249\nE-Mail: klaus.winker@db.com\n  About Deutsche Bank’s Art, Culture & Sports\nThe Art, Culture & Sports unit bundles Deutsche Bank’s funding programs and develops them further conceptually. Together with the divisions, the unit provides the bank’s customers with new access to the art, culture, and sports world.\nWith its commitment to contemporary art, Deutsche Bank has set standards worldwide, whether with its art collection, one of the world’s most important collections of contemporary works on paper and photographs, or with its international exhibition program.\nFor many years, the bank has had a presence at selected art fairs such as Frieze London and New York and, starting in 2019, it will also have a presence at Frieze Los Angeles.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 48
}