{
    "url": "https://www.db.com/news/detail/20180911-10-years-after-lehman-we-ve-done-a-lot-to-strengthen-the-financial-system-says-sylvie-matherat?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 11, 2018",
    "tags": [
        "Investment Banking",
        "Research"
    ],
    "title": "10 years after Lehman: we've done a lot to strengthen the financial system, says Sylvie Matherat",
    "body": "The financial industry has done a lot to prevent the contagion effects that have contributed to the Lehman collapse and the financial crisis in 2008, and to strengthen the financial industry as a whole, said Sylvie Matherat in an interview with German press agency dpa.\n10 years on, the industry is considerably more stable, she said, adding that Deutsche Bank has “left the biggest legal disputes from the past behind us”. “We’re now continuing to improve our internal controls. We’ve already achieved quite a lot here.”\nRead the full dpa article from September 10, 2018 below.\nLehman won’t be repeated\nDeutsche Bank Management Board member Sylvie Matherat\n(dpa-AFX; 10 September 2018) 10 years on from the Lehman bankruptcy, the financial world is considerably more stable according to Deutsche Bank Management Board member Sylvie Matherat. She doesn’t believe that such an event will be repeated again, Matherat told Deutsche Presse-Agentur and financial news agency dpa-AFX in an interview. “We’ve done a lot since then to stop those sorts of contagion effects and to strengthen the financial system as a whole.”\nThe bankruptcy of US investment bank Lehman Brothers shocked the financial world in mid-September 2008. Banks no longer trusted each other; several institutions faltered. At the height of the trouble, governments stabilised the situation with billions in aid and central banks played their part with a flood of cheap money.\nMatherat, who worked for a supervisory authority for many years, said the causes of the crisis included that “in some areas, the bankers thought too short-term. Accounting rules that allowed quick profits to be achieved in the short term didn’t offer good incentives.” Her suggestion: “We should discuss whether the concentration on quarterly results might tempt people into short-term thinking. We should think longer term and get away from the short-term view.”\nWhile Europe’s banks still haven’t cleared up the legacy of the financial crisis, the US competition is back making high profits again.\nIt was a good decision by the US government to make banks accept government aid. They did the right thing when they said: we don’t want to lose any time checking whether a bank needs government aid.\nAs for Deutsche Bank, most of the big legal disputes from the time before the 2007/2008 financial crisis have been dealt with, Matherat confirms. “We’ve left the biggest legal disputes from the past behind us,” she says. “We’re now continuing to improve our internal controls. We’ve already achieved quite a lot here.”\nAnother consequence of the crisis is that regulators and supervisory authorities tightened the reins. The financial sector has since had to follow much stricter rules. Matherat, who has been Deutsche Bank’s Chief Regulatory Officer since November 2015, says that she doesn’t think that the sector is over-regulated. “However, the overall situation should be evaluated. There are not necessarily too many regulations, but whether all the rules are really useful and particularly how they work in combination should be questioned,” Matherat, urged.\nThe fact that, for example, efforts are repeatedly made in the US to undermine stricter rules for banks doesn’t worry Matherat too much. “I don’t think that there’ll be a wave of deregulation in the financial sector. It was hard enough to introduce the current regulations.\nApart from the fact that the rules introduced have brought additional certainty, no one who’s experienced it wants to go through the same painful processes in order to undo it all again,” said Matherat. “I expect legislators to remove some of the obstacles to the implementation of the rules that currently exist, but I don’t anticipate general deregulation.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}