{
    "url": "https://www.db.com/news/detail/20180910-10-years-after-lehman-banks-have-cleaned-up-their-act-considerably?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 10, 2018",
    "tags": [
        "Company",
        "Research"
    ],
    "title": "10 years after Lehman: Banks have cleaned up their act considerably",
    "body": "When US investment bank Lehman Brothers filed for bankruptcy on September 15, 2008, this not only led to a dramatic escalation of the global financial crisis that had already been rumbling on for a year; it was also the catalyst for a comprehensive re-regulation of the financial sector. 10 years later the sector has changed fundamentally, but to differing degrees from region to region.\nIn the US, banks currently appear to be in a better state than ever before. Profits are around 25 percent higher than before the financial crisis, while revenues are about one-third higher. The interest margin and net interest income have been rising since the Fed started to tighten its monetary policy back in 2015. Lending volumes to the private sector have nevertheless risen by 28 percent since 2011. Bank stocks are trading above their book value on average.\nThings are far less rosy in Europe, also because of the additional bur10 years after Lehmanden caused by the European debt crisis. This triggered a second recession which ended in late 2013, whereas the US economy had already returned to growth in 2010. Although 2017 was the second best year in the last decade, European bank profits were around 50 percent lower than their pre-crisis peak. Even nominal revenues still remain stubbornly below their 2006 level despite economic growth and inflation. The ECB’s zero and negative interest rates constitute a growing burden for banks. Again, the time lag to the US is striking: while asset purchases in the euro area continue to this day and rates are expected to rise not before late next year, the Fed hiked rates first in late 2015 – a large gap of 4 years. Nevertheless, lending volumes to households and corporates in the euro area have barely expanded since 2011. This is another reason why banks’ total assets relative to GDP declined from 344 percent in 2011 to just 272 percent. In addition most bank stocks are trading at a marked discount to their book value.\nBanks have, however, cleaned up their act considerably. Common Equity Tier 1 capital ratios in Europe have more than doubled to 14 percent since 2008, despite stricter definitions of common equity and increased risk weightings for various asset classes.\nThe vast majority of banks now easily comply with liquidity standards such as the Liquidity Coverage Ratio (LCR) and have a more solid revenue mix – the proportion of trading income has dropped sharply, while net interest income has climbed to more than 50 percent of total revenue. In risk management the banks in all major regions conduct regular stress tests to check their resilience against macroeconomic and financial market shocks. Overall, the banking sector in Europe has not grown in recent years, and it is less profitable. It is, however, also far more robust than before the financial crisis.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}