{
    "url": "https://www.db.com/news/detail/20160516-deutsche-bank-hires-thomas-piquemal-to-head-global-munda?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "May 16, 2016",
    "tags": [
        "Asset Management",
        "Corporate products"
    ],
    "title": "Deutsche Bank hires Thomas Piquemal to head Global M&A",
    "body": "Deutsche Bank announced today that Thomas Piquemal, 47, will join the Bank as Global Head of Mergers & Acquisitions, effective May 17. Piquemal was until March Group Senior Executive Vice President for Finance at EDF Group, the world’s largest integrated electricity company. Piquemal will be based in Paris and report to Jeff Urwin, Head of Corporate & Investment Banking. He will also become Chairman of Corporate & Investment Banking in France.\nUrwin said: “Thomas brings to Deutsche Bank a unique combination of skills gained from over seven years as a leading finance director and nearly a decade and a half as a corporate finance advisor to clients and their boards. His appointment underscores our commitment to investing in our global M&A franchise and to sustaining our position as a leading corporate finance advisor.”\nPiquemal said: “I am delighted to join Deutsche Bank and to dedicate myself to supporting its commitment to client-focused service. I am greatly looking forward to working together with my new colleagues, whose excellence and talent I have known for many years.”\nPrior to his role at EDF from February 2010 to March 2016, Piquemal was Group Chief Financial Officer at Veolia Environment from 2009 to 2010 and a Partner at Lazard Frères where he worked from 1995 to 2009.\nDeutsche Bank is a leading global M&A advisor. In recent months, Deutsche Bank has advised Anheuser-Busch InBev on its $125 billion acquisition of SABMiller; Dell Inc. and Silver Lake Partners on their $67 billion acquisition of EMC Corporation; and Marriott International on its $14 billion acquisition of Starwood Hotels & Resorts Worldwide.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}