{
    "url": "https://www.db.com/news/detail/20160503-deutsche-bank-recognized-in-first-ever-bloomberg-financial-services-gender-equality-index?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "May 3, 2016",
    "tags": [
        "Careers",
        "Company",
        "Diversity",
        "Strategy"
    ],
    "title": "Deutsche Bank recognized in first-ever Bloomberg Financial Services Gender-Equality Index",
    "body": "Deutsche Bank today announced that it has been recognized in the inaugural Bloomberg Financial Services Gender-Equality Index (BFGEI). The Bank is one of 26 firms that are members of the BFGEI.\nThe new index recognizes companies that have made strong commitments to gender equality and provides investors and organizations with standardized aggregate data across company gender statistics, employee policies, gender-conscious product offerings, as well as their external community support and engagement.\n\n“We are committed to an inclusive culture that respects and embraces the diversity of our employees, clients and communities,”\n“We are very pleased that our commitment to fostering gender equality and the advancement of women in the workplace has been recognized by Bloomberg,”\nJohn Cryan, Co-Chief Executive Officer at Deutsche Bank.\n\nIn order to be considered, the firms submitted a survey created by Bloomberg in partnership with third-party experts, including Women’s World Banking, Catalyst and Working Mother Media. Those included in this year’s index scored at or above 60 points, a global threshold established by Bloomberg to reflect disclosure and the achievement or adoption of best-in-class statistics and policies.\n\n“We hope the BFGEI encourages more firms to disclose and discuss gender equality in the workplace,” said Bloomberg L.P. Chairman Peter T. Grauer. “Better support for female employees is crucial to building and developing a diverse workforce – and it’s key to remaining competitive in today’s global business environment.”\n\nFor a number of years, Deutsche Bank has actively promoted equal participation of women and men. In 2011, the Bank signed a voluntary declaration to substantially raise the proportion of female managers by the end of 2018. As of 2015, the number of female Managing Directors and Directors increased by 14% since 2011.\nThe Bank launched its Accomplished Top Leaders Advancement Strategy (ATLAS) program in 2009 and the Women Global Leaders (WGL) program in 2010, which both seek to increase the number of women in senior positions. More than 50% of the participants of these programs have since been promoted or have taken on more responsibility.\nProactive moves\nDeutsche Bank is also continuing its efforts to advance women in the workplace under new gender quota legislation introduced in Germany in 2015. The percentage of women on Deutsche Bank’s Supervisory Board stood at 35% at the end of 2015, above the new statutory requirement of 30% for listed and co-determined German companies. In addition, Sylvie Matherat, Chief Regulatory Officer, was appointed to the Management Board on November 1, 2015 and Kim Hammonds, Chief Operating Officer, is planned to join the Management Board in 2016.\n\nMore information on Deutsche Bank’s diversity and gender equality agenda and data is available in the Bank’s Human Resources Report 2015.\nFor further information, please contact:\nDeutsche Bank AG\nPress & Media Relations\nHannah Fuchs\nPhone: +1 212 250 4070\nE-Mail: hannah.fuchs@db.com\nKlaus Thoma\nPhone: +49 (69) 910 33405\nE-Mail: klaus.thoma@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}