{
    "url": "https://www.db.com/news/detail/20230529-deutsche-bank-boosts-investment-in-vietnam-to-support-growth?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 29, 2023",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank boosts investment in Vietnam to support growth",
    "body": "Deutsche Bank has today announced a capital allocation increase for its Ho Chi Minh City branch of USD 100 million, bringing the total to more than USD 200 million. The increased capital will support the bank’s growth in the country and allow it to undertake more activity for its clients.\nDeutsche Bank has a long and proud 30-year history in Vietnam, a key growth driver for the ASEAN region, after launching its presence in the country in 1992. The business in Vietnam continues to play an increasingly important role in the success of the bank’s Asia Pacific franchise, having doubled its revenues over the past two years.\nDeutsche Bank provides a range of corporate and investment banking solutions to multinational companies, large local corporates and financial institutions in Vietnam. These services include cash management, FX, custody, trade finance, corporate finance and advisory solutions.\nSince 2017, Deutsche Bank has raised more than USD 1 billion in debt, loan and equity capital annually for Vietnamese corporates. It has established a track record for leading notable capital markets and structured finance transactions in the domestic market.\nThis capital investment in Vietnam is reflective of our confidence in this market’s rapid development and long-term growth trajectory.\nAlexander von zur Muehlen, Deutsche Bank Asia Pacific CEO and Member of the Management Board. \n\"Vietnam is an increasingly strategic market for our clients and therefore an important part of our regional platform. We are proud of the strong local business we have built so far over our decades of experience in this fast-growing market. We look forward to continuing to expand our business here alongside our clients over the years to come,\" Alexander von zur Muehlen added. \nDeutsche Bank Chief Country Officer for Vietnam Huynh Buu Quang said: “This important investment will further reinforce our broad capabilities and enable us to do even more for our clients. We are very well placed to achieve our long-term goal of becoming the leading foreign bank in Vietnam.”",
    "number_of_ratings": 3,
    "rating": 3.7,
    "likes": 6
}