{
    "url": "https://www.db.com/news/detail/20230525-deutsche-bank-recognised-for-excellence-in-trade-finance-and-lending-and-cash-management-in-asia-pacific?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "Singapore, May 25, 2023",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank recognised for excellence in trade finance and lending and cash management in Asia Pacific",
    "body": "Deutsche Bank was recognised for excellence in corporate banking solutions at The Asset Triple A Treasurise (Treasury, Trade, Supply Chain, Risk, ESG) awards this week. The bank won a total of 68 awards including three marquee awards in Asia Pacific: Best Risk Management Bank, Best Structured Trade Finance Bank, and Best in Treasury & Working Capital for New Economy clients.\nThe bank was also named Best Transaction Bank in India and China, and Best in Treasury & Cash Management Bank in South Asia.\nAward highlights\nIncludes 46 client solutions awards, reflecting the bank’s innovative and client centered mindset, deep understanding of client needs and local regulations, and continued investment in technology.\nBreadth and complexity of Deutsche Bank’s trade services recognized - from standard documentary credit and vital working capital and supply chain solutions on the one end, to project finance, strategic lending, structured export finance, and natural resource finance on the other.\nWin for risk management reflects the bank’s ability to deliver a comprehensive suite of solutions to meet the objectives and address the challenges that corporates and treasurers face in challenging macro conditions, including rising interest rates.\nBest in for treasury and working capital for new economy clients underlines the market leading strength of our cash management platform and ability to expertly service a strategically important client segment.\nThe Asset recognised Deutsche Bank’s strength in individual markets too, with wins in cash management in India and South Korea, and trade finance in Australia, Singapore and China.\nOle Matthiesen, Head of Corporate Bank for APAC and Global Head of Cash Management said: “This outstanding performance reflects our outstanding team. These awards underscore the strength of our platform, the effectiveness of our strategy, and the power of our Global Hausbank. We will continue to work closely with our clients to deliver innovative, best-in class solutions that help unlock potential for their business in Asia Pacific and beyond.”\nThe Asset’s rigorous evaluation process includes client feedback from the publication’s Annual Treasury Review Survey, in-depth client interviews, and detailed awards pitches.  \n ",
    "number_of_ratings": 7,
    "rating": 4.9,
    "likes": 8
}