{
    "url": "https://www.db.com/news/detail/20230524-wind-of-change?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 23, 2023",
    "tags": [
        "Sustainability"
    ],
    "title": "Can we power the planet on renewables alone?",
    "body": "The International Energy Agency estimates that wind energy could cover more than a third of the world's global energy demand in the future and reduce CO2 emissions by a quarter by 2050 – an important contribution to stopping global warming.  \nCan wind, sun or water keep the 21st century economy going? How realistic and how financially feasible is that?  We spoke to Beatriz Crisóstomos, Head of Innovation at Iberdrola, and Gregor Winkler, a coverage banker from our Corporate Bank. \nThe advantage of wind energy is that it is permanently available, at low cost. Although the construction of new wind farms is initially expensive, operating costs are comparatively low. And their technology is now considered very mature. \nPioneers from the Basque Country\nWhy did Iberdrola decide to focus on wind energy 20 years ago?\n \"We analysed new technologies and turbine technology seemed to us to be well advanced at the time. We wanted to be at the forefront,\" Crisóstomos says. In fact, Iberdrola put all its eggs in one basket, investing heavily in research and development and gradually shutting down its conventional power plants – a bold move that has paid off:  today, the company is a leading provider of renewable energy and supplies sustainable electricity to 100 million people in 16 countries.\nTailwind from the public sector  \nRenewable energy gained political momentum with the Paris Agreement of 2015. For the first time, countries were setting binding CO2 reduction targets.  In the 2019 European Green Deal, the EU Commission reaffirmed renewable energies’ key role in helping Europe meet climate targets, also stating concrete figures for wind energy: by 2030, for example, offshore wind capacity is expected to be at least 60 gigawatts. In comparison, in 2021 it was 14.6 gigawatts. By 2050, it is set to increase to 300 gigawatts – a fivefold increase in 20 years.\nHigh need for private investment\nWith plans that big, large, long-term investments in equipment and technology are necessary – something  the public sector cannot cover alone. \"We definitely need more private investment,\" Winkler explains. He is certain that investors are today more interested in ESG investments (i.e. investments that are made with ecological and social aspects in mind as well as good corporate governance) and sees great potential to attract new investors.\nWithout reliable grids, there can be no revolution in the energy sector\nAccording to Beatriz Crisóstomos, Head of Innovation Iberdrola, stable grids and storage options are crucial to reliably supply companies and households with energy. \"We have to make sure that we can transport the energy anywhere at any time. Digitalization is also helping us here; we are developing smart grids.\"   With this technology, a central control system coordinates generation, storage and consumption to an optimum, balancing power fluctuations in the grid – especially those coming from renewable energies.\nOver the next two years, Iberdrola plans to invest 27 billion euros in grid expansion and storage alone. Crisóstomos sees Europe as a leader in wind energy: \"Here we can see what our future can look like,\" she says.  What does she wish for? Faster approval procedures for wind farms. \"We have to hurry,\" she adds.\nOr, with Don Quixote in mind: don’t be afraid of the windmills!",
    "number_of_ratings": 27,
    "rating": 4.8,
    "likes": 41
}