{
    "url": "https://www.db.com/news/detail/20230523-ai-will-change-the-world-for-better-and-for-worse-deutsche-bank-research-launches-ai-series?language_id=1",
    "language": "EN",
    "article_type": "News Research",
    "publish_date": "May 23, 2023",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "“AI will change the world – for better and for worse”",
    "body": "“Generative AI will change the world for better and for worse,” writes David Folkerts-Landau, Global Head of Deutsche Bank Research, kicking off a lively series of reports on artificial intelligence (AI) this week. “For once, the hype is (mostly) justified.”\nSix months after the release of ChatGPT (quite literally) created headlines around the world, the Deutsche Bank Research team takes stock and cuts through the noise to analyse the latest developments, the potential impact on jobs and the direction of future innovation with the aim of becoming a leading source for analysis on the implications of AI.\nFolkerts-Landau writes about\nPDF\nhow AI will lead to waves of repercussions for society, including further concentrating economic power in a handful of technology companies, launching myriad new industries and overturning our understanding of the truth.\nMeanwhile, Jim Reid, Head of Global Economics and Thematic Research, analyses the lessons of history to conclude that recent advances, like many before, are likely to spell\nPDF\ngood news for jobs in the long run, but maybe not before some significant upheaval. Adrian Cox, Thematic Strategist, provides\nPDF\na primer to explain how generative AI works, how to use a chatbot and what issues are keeping businesses, regulators and scientists awake at night.\nFILE\nA newly launched public microsite gives readers a regularly updated one-stop shop for AI reports and other related analysis. It also includes Podzept podcasts and dbInSights videos.\nIs generative AI one of the most important topics of our time? Check out the \nFILE\nsite and decide for yourself.",
    "number_of_ratings": 4,
    "rating": 4.8,
    "likes": 3
}