{
    "url": "https://www.db.com/news/detail/20230516-meet-our-esg-experts-claire-coustar?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 16, 2023",
    "tags": [
        "Sustainability"
    ],
    "title": "Meet our ESG experts: Claire Coustar",
    "body": "What’s on your radar on right now? \nGeopolitical and economic factors – in particular energy and supply chain security and inflationary pressures – have been accelerating clean energy transition investment since last year. Governments have become more proactive in implementing industrial policies supporting this energy transition. The US Inflation Reduction Act and subsequent Chips and Science Act, for example, have catapulted the race for onshoring of clean energy and the critical component parts of the clean energy supply chain.\nAnd what about the EU?\nThe EU responded to the energy crisis triggered by the Russian invasion with RePowerEU, which was highly effective in replacing Russian gas and shows what can be done when government and industry come together. All this means that a focus on investment into green energy, which can support energy security, continues to be a dominant theme in our business.\nWhat role does our Fixed Income & Currencies business play in our overall ESG strategy? \nWe specialise in asset backed and project finance lending and warehousing, including granular and non-granular renewable loans in wind, solar, and energy efficient real estate. Such assets formed the pillar of Deutsche Bank’s green bond programme. We also play a critical role in the manufacturing of green investment products for our retail and institutional client base. Our trading and sales businesses provide the balance sheet, market liquidity and global institutional client reach that enables us to be successful originators of green, social, sustainable and sustainability linked bonds and loans. And through our emerging market businesses, we support the Just Energy Transition for our high emitting clients.\nHow does your team manage and implement this strategy?\nMy role is to develop and implement the ESG strategy, client engagement, product development, growing sustainable business and governance within the businesses. We have established an ESG Competency and Solutions team with dedicated ESG expertise to support these efforts and work closely with ESG champions in our sales, trading, and structuring teams as well as our colleagues in risk, sustainability and control functions.\nWhat new products are you offering, and how do they support Deutsche Bank’s Net Zero Banking / Sustainability goals?\nWe are developing new products across several areas, here are just two examples: In social lending, we are active in affordable housing, senior care homes and lending for underserved and underbanked communities, and we have social lending in emerging markets for health, education, waste and water management. We also aim to expand our Green bond to include a social bond issuance platform, leveraging on some of these balance sheet assets.\nNature investing is a very new market but we are seeing growing investor appetite to allocate funding to nature positive products\nClaire Coustar\nAre there any real new asset classes?\nNature investing is a very new market but we are seeing growing investor appetite to allocate funding to nature positive products. Examples are indices and funds with investment rules linked to nature and biodiversity metrices, sustainability-linked bonds and loans with ESG Key Performance Indicators linked to reduced deforestation, private equity funds with nature positive investment mandates and the growing nature based voluntary carbon markets. At the same time, governments and multinational development banks are turning to capital market solutions to help implement their biodiversity framework goals. Together, this means we will see more nature related issuance in both bonds and loans.\nWe will see more nature related issuance in both bonds and loans\nHow do you collaborate with other business areas to steer clients towards low-carbon models?\nWe created a Transition Hub between the Investment Bank and the Corporate Bank to establish consistent principles and knowledge sharing across our client portfolio. This helps our clients understand what they should be implementing in terms of targets, policies, revenue and capex transition etc., to place themselves on the best possible pathway to a net zero transition. We link these efforts with external collaboration with for example, the GFANZ transition workstream and other topical stakeholder groups discussions to advance decarbonisation.\nWhat are three of your biggest challenges right now?\nRisk managing the rapidly evolving regulatory ESG landscape; supporting our clients in understanding how best to access the markets – which can range from understanding investor expectation on what a credible transition looks like to helping early- stage clean energy companies position their story for accessing the private markets; and finally, target setting and transitioning our own lending portfolio.\nWhere do you expect to see the most progress in FIC over the next two years?\nFIC is central to the movement of capital flows and to free up balance sheets of companies, banks and governments, so I expect us to deepen our engagement with clients, both on the investor and issuer side. Our job is to help them understand and better navigate the ESG landscape and market expectation on what ‘good’ entails. Supporting product innovation and access to the capital markets for our clients is something at which we excel. With respect to climate, nature, social and other ESG topics, I expect to see our role continue to progress as trusted advisor and solutions provider to our clients.  \nI am proud that we are now considering a client’s carbon footprint in our business selection process (...)\nYou’ve been in this role since 2021. What are you especially proud of achieving?\nI am proud that we are now considering a client’s carbon footprint in our business selection process, and of the level of understanding our teams have about the structural shift in our global economy, which will be a result of the energy transition. And I am proud of the many passionate professionals I work with who have made the integration of ESG in our client discussions, product offering, and control setup a ‘must have’ – not a ‘nice to have’.",
    "number_of_ratings": 18,
    "rating": 2.4,
    "likes": 18
}