{
    "url": "https://www.db.com/news/detail/20230509-deutsche-bank-named-market-maker-for-china-s-northbound-swap-connect-programme?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 9, 2023",
    "tags": [
        "Investment Bank",
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank named market maker for China’s Northbound Swap Connect programme",
    "body": "Deutsche Bank has today announced that it has been named a market maker for Northbound Swap Connect, which officially launches on May 15, 2023. The initiative will be the first stage of mutual access between Hong Kong and China interest rate swap markets.\nThe launch of Swap Connect will signify the opening of China’s financial derivatives market. It will provide overseas investors with access to an important hedging tool for investing in the China Interbank Bond Market (CIBM) and reducing risk related to interest rates.\nSwap Connect will also mark an important step in the internationalization of the renminbi (RMB). As further progress to Bond Connect, the initiative reinforces the role that Hong Kong plays in connecting China with international investors.\nRose Zhu, Chief Country Officer for China said: “We are proud to be named a market maker for Swap Connect, which will be a huge leap forward in developing the domestic derivatives and bond markets. Leveraging our cross-border strengths, we look forward to playing an active role in helping international investors get a head start via Swap Connect. We remain committed to helping accelerate the opening up of China’s financial markets and RMB internationalization.”\nLillian Tao, Head of Macro & GEM Sales for China said: “Early on, we received many enquiries and have seen strong interest in participating in Swap Connect. This has been despite its complex fusion of China, Hong Kong and western financial infrastructure. This indicates an increased sophistication and openness amongst international investors, and we are observing an appetite for further deregulation in areas including domestic repurchasing, futures and options.”\nDeutsche Bank AG                                       \nMedia Relations                                           \nAmy Chang\nPhone: +852 2203 8434\nEmail: amy.chang@db.com             \nKate Fields\nPhone: +852 2203 5094\nEmail: kate.fields@db.com",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 6
}