{
    "url": "https://www.db.com/news/detail/20170905-thomas-nielsen-joins-deutsche-bank-as-chief-digital-officer-for-global-transaction-banking?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 5, 2017",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "Thomas Nielsen joins Deutsche Bank as Chief Digital Officer for Global Transaction Banking",
    "body": "Deutsche Bank has appointed former Tesco Chief Digital Officer Thomas Nielsen as Chief Digital Officer to drive the bank”s Global Transaction Banking digitalization strategy.\nData and technology are key to innovation, in particular for financial services. The consumer sector has been driving this for many years” said Deutsche Bank’s John Gibbons, Head of Global Transaction Banking. “Thomas Nielsen's experience in developing and rolling out digital solutions in the consumer space will be vitally important as we seek to accelerate the delivery of digital products and services for our global corporate and institutional clients.\"\nThomas Nielsen brings 25 years of experience in the fields of technology, operations and digital transformation - spanning engineering, product management, user experience and data science across a broad range of e-commerce, data and retail solutions.\n“Deutsche Bank’s leadership in global transaction banking provides a strong platform and a unique opportunity to leverage technology and digital innovation to deliver a new set of products and solutions to clients around the world”, said Nielsen. “I am excited to be part of this journey and help Deutsche Bank and its clients grow its business via digital channels.”\nMost recently, Thomas Nielsen served as Chief Digital Officer with Tesco PLC, the U.K.’s largest multi-channel retailer, where he was responsible for a digital portfolio of platforms, websites, and apps, including Clubcard, Tesco’s loyalty program of 16 million active members. Thomas Nielsen was also responsible for Tesco’s overall digital transformation agenda as well as its digital marketing activities.\nPrior to Tesco, he spent more than 20 years in the US, predominantly in Silicon Valley and Seattle where he held executive positions at Brightcove, RealNetworks, Adobe, and Microsoft.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}