{
    "url": "https://www.db.com/news/detail/20170905-deutsche-bank-dominates-european-corporate-debt-issuance?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 5, 2017",
    "tags": [
        "Europe",
        "Capital markets"
    ],
    "title": "Deutsche Bank dominates European corporate debt issuance",
    "body": "Corporate debt market\nDeutsche Bank dominated the European corporate debt market in August, leading 63 percent of total issuance in euros, more than any other bank, according to Dealogic. Volumes were boosted by a flurry of issuers coming to market on the last day of the month, with Deutsche Bank leading six of the seven deals that day alone.\nOn August 31 Deutsche Bank led deals for Kimberly Clark, Scania, Balder, Philips, Grenke Leasing and CNH Industrial. Kimberly Clark issued 500 million euros in its first ever euro bond, while CNH Industrial came to market with its inaugural investment grade bond.\nPhilips attracted 6 billion euros of demand for its 1 billion euro deal, its first euro issue since 2000. Deutsche Bank was sole global co-ordinator on a 500 million euro bond and structuring advisor on a 350 million euro hybrid bond from Balder. Hybrids are essentially low-ranked bonds with some equity characteristics. They typically pay a higher yield than normal bonds, making them attractive to investors in the current low interest rate environment.\nEarlier transactions\nEarlier in the month Deutsche Bank led three transactions for British American Tobacco: a 3.1 billion euro bond, a 450 million pound bond and a 17.25 billion dollar bond, the largest US dollar bond by a non-US corporate (known as a Yankee bond) in history. The money raised was used to complete the financing for British American Tobacco’s purchase of the remaining 57.8 percent stake of Reynolds American which it did not previously own, a deal on which Deutsche Bank was joint lead financial adviser.\nOutlook\nAugust has historically been a quiet month for bond issuance, but for the last two years Deutsche Bank has been advising clients to take advantage of record low rates, and also issue before the rush of deals which is traditionally seen in September.\nFrazer Ross, Head of Investment Grade Credit Syndicate EMEA, said: “The transactions we’ve led over the past couple of weeks have been very successful. There is plenty of cash to be put to work post the summer lull and deals are trading positively post pricing. Supply is expected to continue to be active through September and October to take advantage of the window in advance of a potential ECB announcement on tapering.”\nDeutsche Bank ranks second in the euro corporate debt league table year to date, according to Dealogic. The bank has ranked in the top two for all but one year since the inception of the euro in 1999.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}