{
    "url": "https://www.db.com/news/detail/20170905-nicolas-moreau-opens-trading-at-the-lse-to-mark-10-years-of-xtrackers-etfs?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 5, 2017",
    "tags": [
        "Asset Management"
    ],
    "title": "Nicolas Moreau opens trading at the LSE to mark 10 years of Xtrackers ETFs",
    "body": "Nicolas Moreau (pictured, left), Head of Deutsche Asset Management and Member of the Management Board, opened trading on the London Stock Exchange (LSE) today to celebrate the 10-year anniversary of the listing of the first Xtrackers exchange-traded funds (ETFs).\nDeutsche AM is the largest Europe-based provider of ETFs with multiple listings on the LSE. ETFs are listed mutual funds that combine the benefits of on-exchange trading with the diversity of an investment fund. They typically passively track investment indices.\nXtrackers has an extensive range of emerging markets ETFs and currency-hedged ETFs, and has been first to market in a number of areas – such as providing exposure to China’s domestic A-shares market in ETF format, for example.\nAfter the market opened, the LSE’s chief executive Nikhil Rathi gave a short speech recognising a decade of successful Xtrackers ETFs listings at the exchange. This was followed by a short speech from Nicolas Moreau.\n“We have been on a remarkable journey since the launch of those first ETFs back in 2007,” said Moreau. “From humble beginnings, our Xtrackers ETFs and exchange-traded commodity ranges have grown in scale and scope, and today we are proud to be one of the leading European asset managers with these products.”\nHe added: “We hope that the next 10 years will be even more successful than the last, and we look forward to a continued excellent relationship with the London Stock Exchange and to listing more of our ETFs here in the future.”\nThe opening ceremony at the London Stock Exchange",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}