{
    "url": "https://www.db.com/news/detail/20170901-juergen-fitschen-to-head-deutsche-bank-foundation?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 1, 2017",
    "tags": [
        "Company",
        "Corporate Citizenship"
    ],
    "title": "Jürgen Fitschen to head Deutsche Bank Foundation",
    "body": "Appointed by the Management Board of Deutsche Bank AG, Jürgen Fitschen is the new Chairman of Deutsche Bank Foundation. Fitschen was Co-Chief Executive Officer of Deutsche Bank until May 2016 since which time he has continued to support the bank as an advisor.\nAs of September 2, Fitschen will succeed Clemens Börsig as head of the Foundation. Previously Chief Financial Officer and later Chairman of the Supervisory Board of Deutsche Bank, Börsig has headed the Foundation since January 2013 and is now stepping down from his duties. Michael Münch (Deputy Chairman) and Claudia Lange will both remain members of the Foundation’s Board.\nDeutsche Bank Chief Executive Officer John Cryan said: “We are delighted that Jürgen Fitschen has agreed to head Deutsche Bank Foundation. During his career, not only has he given tremendous service to the bank; he has also been very closely involved with our corporate social responsibility initiatives. On behalf of the Management Board, I would also like to thank Clemens Börsig for the major part he has played in the Foundation’s successful work over the past years.”\nDeutsche Bank Foundation initiates and supports projects that give young people in particular the opportunity to experience new and unfamiliar fields of activity, helping them to develop their own special talents. The Foundation also encourages young artists to explore new avenues and to hone their skills. A number of the Foundation’s projects focus specifically on integrating refugees, while others promote equal opportunities for disadvantaged sections of society. And with strong partners at its side, the Foundation is also committed to supporting international disaster relief efforts.\n  About Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 0
}