{
    "url": "https://www.db.com/news/detail/20171026-a-message-from-john-cryan-on-deutsche-bank-s-third-quarter-financial-results-2017?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 26, 2017",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "A message from John Cryan on Deutsche Bank's third quarter financial results 2017",
    "body": "Dear Colleagues,\nAfter a few months over the summer of what must have felt a bit like radio silence on my part, you will have noticed today that we have created a flurry of news items, coinciding with the publication of our third-quarter results. I’ll come to the results shortly, but I wanted to start with a few remarks on the messages that Christian Sewing and Frank Strauß have issued just now.\nWe have successfully concluded a key “cornerstone agreement” with all relevant stakeholders that governs the way that we intend to integrate our German private and commercial banking operations and how we will start a new digital-only offering targeting the millennial generation. With these announcements we are reaffirming what we promised to deliver back in March. There will still be a lot of work ahead of us, and we still need to conclude a number of detailed social compacts (Interessenausgleiche), but I am confident that all of the parties involved will continue to cooperate successfully to achieve the best results in the long-term interests of the bank.\nWe are kicking off the execution phase of the combination of Deutsche Bank and Postbank with a clear and detailed plan that reflects the terms of the cornerstone agreement. And we can draw on valuable experience here: in the past two years we proved that we can successfully restructure the private and commercial client business in Germany – both at Postbank and Deutsche Bank. Both banks have successfully executed their restructuring programmes. With more than 20 million clients, two well established brands and the new digital bank by its side, the private and commercial bank will be the market leader in key areas in Germany – and it will go on the attack.\nAs part of the restructuring we will integrate the business of our Sal. Oppenheim unit into Deutsche Bank. Portfolio management will migrate to Deutsche Asset Management, while wealthy clients will be served in future by our Wealth Management business. This was a difficult step for us. Unfortunately we never succeeded in restoring the brand’s strength after it had been severely damaged prior to the acquisition in 2009.\nI want to thank all of you who have been involved in these extensive discussions, which have been conducted with commendable confidentiality and professionalism.\nOn the other big project that we announced in March – the IPO of our asset management business – we are making progress. Preparations for the IPO are well under way. The legal separation is proceeding well. We are confident that we can place a minority shareholding in the market in the previously communicated timeframe, market conditions permitting.\nIn our Corporate & Investment Bank we are well on track to integrate our capital markets businesses with Corporate Finance and Global Transaction Banking. This integration will better position us to solve our clients’ complex problems as we are no longer covering them through discrete product silos.\nTurning to our results, there are some positive signs that we are heading in the right direction. Between July and September we earned 649 million euros after income taxes, which is more than most analysts had expected. This is a 133 percent improvement over the third quarter of last year. A major driver of the improvement has been the expenses lines. Our adjusted costs were 6 percent lower than they were a year ago – notwithstanding the fact that we have set aside more money for our employees’ variable compensation.\nWe can perhaps be less satisfied with our revenues, which fell by 10 percent to 6.8 billion euros. Adjusted for exchange rate movements, revenues declined by 7 percent. The business environment in the third quarter of this year was very subdued by comparison with the prior year. Low activity on the financial markets affected the entire industry so we were certainly not alone.\nDespite the weak market environment, I continue to be optimistic for our prospects. This is based largely on facts that are not reflected in our reported figures. In the many conversations I have with clients I hear that they have a strong desire to do business with us. We can rarely have succeeded in making so much progress in just one quarter in building our new business pipelines. They are currently pleasingly strong. We also remain positively exposed to an increase in interest rates in euros, and you may have seen that especially in the Private & Commercial Bank we have mitigated the costs of negative short-term rates, for example through marketing our broad range of non-deposit products.\nWe are also already reaping the fruits of the ambitious reorganisation which we started in October 2015. Here are some of our most recent successes:\nWhile the revenue environment was challenging in the Corporate & Investment Bank, we improved our competitive position in key asset classes and regions. According to a recent Coalition report, we have succeeded in advancing one position in the global fixed-income business and have regained our outright top 2 position in European investment banking in the first half of 2017. In other words, we are recovering step by step from the events of last autumn.\nA similar picture emerges in Corporate Finance: while revenues declined, we have an active and growing pipeline and this should be reflected in next year’s earnings. In Germany, we have already succeeded in expanding our position as a market leader.\nThe Private & Commercial Bank achieved successes too. Revenues in our mid-cap business as well as revenues from investment and insurance products in private banking increased by 5 percent year-on-year. We had more than 2,000 net new commercial clients year-to-date.\nDeutsche Asset Management has already booked inflows of 14 billion euros since the start of the year – here we also reversed the trend of last year.\nWe are exploring new ways to improve client access to our products and services. We have only recently put more than 150,000 lines of app connectivity code from Autobahn, our award-winning trading platform, into the public domain – a groundbreaking step that will connect thousands of industry applications for our clients.\nWe can also be proud of what our Legal team has accomplished in respect of the bank’s litigation cases. They have quietly resolved several important cases. Of the 20 cases that accounted for approximately 90 percent of our financial litigation risks at the start of 2016, we have since either partially or completely closed 13 – with only a marginal incremental cost impact this year.\nAll of this speaks for itself. I have always said that the reorganisation of our bank would take years, not quarters. Nevertheless, it is good to see that your hard work is gradually paying off. This is your success.\nThank you for your continued dedication.\nWith best wishes,\nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}