{
    "url": "https://www.db.com/news/detail/20171025-deutsche-bank-agrees-to-sell-non-us-global-trust-solutions-to-butterfield?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 25, 2017",
    "tags": [
        "Company",
        "Corporate products",
        "Wealth"
    ],
    "title": "Deutsche Bank agrees to sell non-US Global Trust Solutions to Butterfield",
    "body": "The agreement excludes Deutsche Bank’s US domestic trust business, which remains a core part of its Wealth Management offering. Terms of the agreement were not disclosed.\nUpon completion of the transaction, which is subject to regulatory approvals, Butterfield will take over the ongoing management and administration of the GTS portfolio, comprising approximately 1,000 trust structures for some 900 private clients. Butterfield is also offering positions to all employees who are fully dedicated to GTS in the Cayman Islands, Guernsey, Switzerland, Singapore and Mauritius. This will ensure continuity of service for clients.\nButterfield will partner with Deutsche Bank to provide trust solutions to Deutsche Bank’s clients on an ongoing basis. The transaction is expected to close in the first half of 2018, subject to customary closing conditions.\nButterfield is a well-known leader in the trust industry and we look forward to partnering with it and other providers to offer clients a broader range of trust solutions. The divestiture represents an important step in our strategy of simplifying our business and positioning Wealth Management for growth in our core markets.\nFabrizio Campelli, Global Head of Deutsche Bank Wealth Management\nAs announced in June, Deutsche Bank’s Wealth Management division plans to hire around 100 new client-facing employees in high-growth markets worldwide this year and to substantially increase its investments in digital capabilities.\nThe business aims to build out client coverage of high net worth individuals in Asia-Pacific, accounting for about half of total hires, with the rest accounted for by managers covering entrepreneurs in the US and ultra-high net worth clients in the UK, Middle East and other parts of the Europe, Middle East and Africa (EMEA) region.\nThe business will also invest an additional EUR 65m in new client-focused digital technology, including building a digital core offering that includes features such as customised Chief Investment Office news and portfolio health checks.\nButterfield has been providing trust and fiduciary services to international clients for more than 80 years. Its award winning trust business comprises over 200 professionals, based in the Bahamas, Bermuda, the Cayman Islands, Guernsey and Switzerland, who provide estate and succession planning services, efficient coordination of family affairs, and administration of complex holding structures for a wide variety of financial and non-financial assets.\nAs of 30 September 2017, Butterfield Trust had Assets Under Administration of approximately USD 95.2 billion.\nMichael Collins, Butterfield’s Chairman and Chief Executive Officer, said: “Trust is a core business for us, and the acquisition of the Deutsche Bank Global Trust Solutions business enables us to add scale and professional bench strength to our trust operations in Switzerland, Guernsey and Cayman. It also provides us with a physical presence in Asia, which we view as a growth market for Butterfield. We look forward to welcoming GTS clients and staff to Butterfield and to the development of the new business from an ongoing partnership with Deutsche Bank’s Wealth Management team.”\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Contact\nDon Hunter\nPhone: +44 20 754 14120\nE-mail: don.hunter@db.com\nTim Oliver Ambrosius\nPhone: +49 69 910 42648\nE-mail: tim-oliver.ambrosius@db.com\nAdrian Cox\nPhone: +44 20 754 17775\nE-mail: adrian.cox@db.com\n\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement. Such factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission. Such factors are described in detail in our SEC Form 20-F of 20 March 2017 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}