{
    "url": "https://www.db.com/news/detail/20171019-deutsche-bank-wealth-management-hosts-millennial-clients-at-innovation-summit-in-la-s-silicon-beach?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 19, 2017",
    "tags": [
        "Corporate products",
        "Digitalisation",
        "Research",
        "Wealth"
    ],
    "title": "Deutsche Bank Wealth Management hosts millennial clients at Innovation Summit in LA's \"Silicon Beach\"",
    "body": "Deutsche Bank Wealth Management has been introducing around 100 young clients and guests from around the world to technology entrepreneurs and investors at its second annual Innovation Summit in Los Angeles’ “Silicon Beach” this week.\nThe three-day private event, organised in collaboration with the global corporate venture firm BCG Digital Ventures, included investor panels, discussions with experts on industry trends, and “Shark Tank” pitch sessions for start-ups, as well as visits to innovative organisations including XPRIZE.\nFabrizio Campelli, Global Head of Deutsche Bank Wealth Management, said: “Our Innovation Summit is a unique opportunity for some of our most entrepreneurial Next Generation clients to explore cutting-edge ideas and technology in one of the world’s most dynamic cities. This week is all about making connections with their peers from around the world along with a fascinating group of investors, entrepreneurs and innovators.”\nSpeakers included Dr. Leon Alkalai, Engineering Fellow at California Institute of Technology (Caltech)’s Jet Propulsion Laboratory (JPL) and Founder of AstroLabs; Peter Diamandis, Founder and Chairman of XPRIZE and Co-Founder of the Singularity University; Daniel S. Goldin, CEO of KnuEdge and former Administrator of NASA; Sean Rad, Co-Founder and Chairman of Tinder; and Jeff Schumacher, CEO and Founder of BCG Digital Ventures; as well as Deutsche Bank Chief Risk Officer and Member of the Management Board Stuart Lewis.\nWe believe corporate institutions will own the next phase of innovation in the market. Digital Ventures is a foundry that aims to bring together world-class corporates with world-class talent -- and that's the ethos of this event.\nJeff Schumacher, CEO and Founder of Manhattan Beach-headquartered BCG Digital Ventures\nThe wealth management business of Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) held its first Next Generation Innovation Summit last year in Silicon Valley, California, the latest extension to a programme for young members of client families that dates back around 15 years.\n\"It's really exciting to work with the Next Generation to explore and navigate the countless opportunities that innovation creates,\" said Salman Mahdi, Vice Chairman at Deutsche Bank Wealth Management. \"Now with over 500 alumni in our Next Generation programme, we truly have strong and lasting bonds with an incredibly diverse and talented group of tomorrow's leaders.\"\nThe US West Coast is one of Deutsche Bank Wealth Management's main areas of focus in global plans to hire around 100 client-facing executives this year.\nOther investments Deutsche Bank Wealth Management has announced this year include an additional 65 million euros in new client-focused technology by the end of 2018. At the Innovation Summit this week, it launched a private social network for its Next Generation clients offering a broad range of opportunities for networking and sharing information.\nOver the past year, Deutsche Bank itself has made further strides with a number of technological initiatives. It is using artificial intelligence to automate repeated tasks, has contributed to open source for the first time and is taking part in verimi, a cross-industry registration, identification and data platform. In March, it opened its fourth Innovation Lab in New York to help discover, evaluate and test new financial technology ideas.\nThe Digital Factory in Frankfurt has delivered a number of innovations for the retail bank, including account opening in 7 minutes and services like multi-bank aggregation. The bank reached its “mobile moment” in September, the point where the majority of retail customers log into their account via a mobile device.\nLeveraging its global network and expertise from across Deutsche Bank, Deutsche Bank Wealth Management provides capital markets expertise and international solutions tailored to the individual needs of clients such as entrepreneurs and Next Generation affluent family members.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}