{
    "url": "https://www.db.com/news/detail/20171016-deutsche-bank-launches-first-paperless-import-payment-solution-in-india?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 16, 2017",
    "tags": [
        "Corporate products",
        "Digitalisation",
        "Entrepreneurship",
        "Investment Banking",
        "Private products",
        "Research"
    ],
    "title": "Deutsche Bank launches first paperless import payment solution in India",
    "body": "Deutsche Bank’s TradePay uses the Reserve Bank of India’s Import Data Processing and Monitoring System (IDPMS) to verify import payments by checking them against details made available by the client on the system, eliminating the need for clients to share any physical documentation. The data is then enriched by the client to meet regulatory requirements, validated by Deutsche Bank and converted into a payment-ready state.\nThereafter, clients can book FX contracts electronically through TradePay, thereby streamlining the payment process. The payment authorisation can be done directly on TradePay or via the importer’s ERP system. As a result, this digitised workflow solution can help to reduce complexities and delays in the supply chain, enhance controls and transparency of payments and increase speed of settlement, while meeting regulatory requirements.\nAnjali Mohanty, Head of Global Transaction Banking – India at Deutsche Bank, said: “The role of treasurers has increasingly become more strategic. They are looking to their bankers for solutions, such as TradePay, that helps them gain more efficiencies and future-proof their business.”\nLisa Robins, Asia Pacific Head of Global Transaction Banking at Deutsche Bank, added: “By developing innovative solutions such as TradePay, we aim to play a role in the next phase of evolution for the transaction banking industry. We are delighted to have launched this product in India, where digitalisation is advancing rapidly.”\nFor further information, please contact:\nDeutsche Bank AG\nPress & Media Relations\nKarène Dufour\nPhone: +852 2203 7846\nE-mail: karene.dufour@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}