{
    "url": "https://www.db.com/news/detail/20171009-deutsche-bank-to-opt-in-as-a-systematic-internaliser-under-mifid-ii?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 9, 2017",
    "tags": [
        "Company",
        "Corporate products",
        "Private products",
        "Strategy"
    ],
    "title": "Deutsche Bank to opt-in as a Systematic Internaliser under MiFID II",
    "body": "Deutsche Bank has announced that it will voluntarily designate itself as a “Systematic Internaliser” (SI) for fixed income, foreign exchange and equity related products under MiFID II rules from January 3, 2018.\nThe move will help clients to comply with MiFID II trade reporting requirements which come into force next year.\nUnder MiFID II, from January 3, 2018 onwards executions subject to European Union law fall under a new post-trade transparency regime extended from cash equity trades to those in equity derivative, foreign exchange and fixed income instruments. The responsibilities for fulfilling the reporting requirements vary and those responsibilities can lie with Deutsche Bank’s clients. By being registered as an SI, the post-trade reporting responsibility will be with Deutsche Bank and not their clients.\nAll banks whose trading activity is greater than pre-defined ratio’s must register themselves a Systematic Internaliser by September 1, 2018. But until they are registered, they cannot relieve their clients of this reporting obligation, which starts on January 3, 2018. By voluntarily opting into the Systematic Internaliser regime Deutsche Bank is creating certainty for their clients by removing their post trade reporting obligation by the time MiFID II becomes effective.\nAlthough several firms had previously opted to register as a Systematic Internaliser for cash equities, Deutsche Bank is the first to declare its intent to also do so for equity derivatives, fixed income products and foreign exchange.\n“By registering early as a Systematic Internaliser, we will be in a position to help clients by taking on post-trade reporting duties as soon as the obligations come into force on January 3, 2018. For clients this removes one of the challenges to comply with the new regulation and creates certainty when trading with Deutsche Bank” explains Mario Muth, Head of Fixed Income Electronic Sales and Head of Fixed Income Market Structure at Deutsche Bank.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}