{
    "url": "https://www.db.com/news/detail/20240927-east-west-win-as-deutsche-bank-scoops-best-bank-for-fx-in-asia-pacific-and-western-europe?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "September 27, 2024",
    "tags": [
        "Investment Bank",
        "Awards"
    ],
    "title": "East-West Win as Deutsche Bank Scoops Best Bank for FX in Asia Pacific and Western Europe",
    "body": "Today, Euromoney announced that Deutsche Bank is the best bank for foreign exchange in Asia Pacific and Western Europe. \nThe Euromoney Foreign Exchange Survey has been a respected benchmark in the wholesale FX market for over 45 years. Once again, a panel of industry experts representing banks, providers, and buy-side corporations rigorously evaluated contenders against a range of measures.\nOllie Jerome, head of FX Product EMEA said: “We’re seeing clients using FX services differently – the whole sector is evolving and banks have to innovate to keep pace with changing client needs. Big institutions have in house teams to trade currencies, but there’s a shift across mid-size and smaller asset managers in Europe, where increasing regulation and cost to execute means FX is becoming burdensome. Clients here want semi-customisable, low cost, outsourced solutions. They want faster, more transparent, more efficient execution. We’ve positioned to meet those needs, particularly for the many clients who are looking for a European bank for FX trading.”\nAshok Das, Head, Global Emerging Markets & FIC Macro Trading, Asia, said “Deutsche Bank entered the APAC region in 1872, and today we’re one of the few banks with a wide onshore presence in Asia. Clients rely on us for regulatory knowledge, market expertise and product capability, as one of the largest, and longest-standing, market makers across asset classes in many Asia-Pacific countries. The region is vibrant, and complex.  Our clients are not just based in Asia-Pacific – we serve clients with operations or business needs in Asia-Pacific from other parts of the world. In the last year, clients tell us this has been particularly powerful as they deal with the impact of high interest rates and inflation that drove significant margin compression and the need to reduce P&L volatility in their balance sheets. Their needs are evolving rapidly and we continue to innovate to keep pace and drive new solutions.”\nContact:\nJo Court\n+44 (0) 7879 272651\njoanne.court@db.com ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}