{
    "url": "https://www.db.com/news/detail/20240918-deutsche?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, September 18, 2024",
    "tags": [
        "Germany",
        "Digital banking & services",
        "Private products"
    ],
    "title": "Deutsche Bank strengthens its comprehensive advisory approach and invests in digitalization",
    "body": "Increased capacity for advice via video and telephone and expansion to other customer groups\nUpgrading branches with modern ATMs and community events in an optimized branch network\nFurther investments in digitalization of services and modernization of the app\nMeasures are already budgeted for and will contribute to achieving cost targets\nDeutsche Bank is strengthening its comprehensive advisory approach for private clients in its home market. To do this, it is increasing its capacity for advice via video and telephone and investing in equipping its branches in an optimised branch network.\n\"Deutsche Bank remains the bank for clients looking for high-quality advice. Personal advice is and will remain central – whether in the branches or by video and telephone,\" says Dominik Hennen, Head of Personal Banking Germany at Deutsche Bank. \"We are focusing on attractive branches, which we want to anchor even more firmly in society.\" To this end, the bank will invite customers to more regular events in its branches. Deutsche Bank is also continuing to invest in branch equipment, for example new ATMs.\nThe range of personal advice is supported by a significantly increased capacity for advice via video and telephone. With this the bank is responding to the needs of its customers, who are increasingly using this form of advice as a convenient alternative with extended consultation hours. Teams from nine locations already advise personal banking clients in the broad private client business. Now that successful tests are underway at two locations, this form of advice is to be offered nationwide to wealthier clients in the private banking segment in the future.\nThe consulting approach is supported by significant investments in digitalization. In 2025, Deutsche Bank's app will be comprehensively renewed and supplemented with further digital services. \"Our customers expect a modern and fully digitized offering, but at the same time want the possibility of personal advice via the access channel of their choice. By completing more and more simple banking transactions digitally, we can concentrate fully on advising our customers through personal contact,\" says Hennen.\nIn addition, the bank is further optimizing its branch network. In doing so, it is increasingly relying on new formats such as so-called private banking centers, which are geared towards advising wealthier clients. The experience at existing locations, which concentrates entirely on advising pre-registered private banking clients, has been very positive. At the same time, there will be adjustments to the branch network, with a mid-double-digit number of smaller branches to be closed. Deutsche Bank will continue to have a nationwide presence with a nationwide branch network. In response to the changes in the branch network, Deutsche Bank will soon enter into negotiations with the Works Council on a balance of interests.\nWith the measures now planned, Deutsche Bank is continuing to consistently implement its long-term strategy in the private client segment communicated last year. All measures have already been taken into account in financial planning and also contribute to achieving the bank's cost targets. ",
    "number_of_ratings": 12,
    "rating": 4.1,
    "likes": 7
}