{
    "url": "https://www.db.com/news/detail/20240904-christian-sewing-s-keynote-at-the-handelsblatt-banking-summit-2024?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 4, 2024",
    "tags": [
        "Company"
    ],
    "title": "Christian Sewing's keynote at the Handelsblatt Banking Summit 2024",
    "body": "Ladies and gentlemen,\nI am pleased to be with you again today – in the \"year of decisions,\" as you put it.\nIt’s a very fitting description given the global super election year, which will reach its peak in November in the USA, but also in view of the challenging geopolitical environment, which requires resolute decisions – especially in Europe and in Germany.\n\nChristian Sewing during his interview with editor Sebastian Matthes at the Handelsblatt Banking Summit 2024\nWe are all still under the shadow of the state elections in Saxony and Thuringia at the weekend.The surge in voters supporting extremist parties is disappointing and I would have wished for a different outcome – as I’m sure many of you would have, too. I don't want to talk about possible political constellations now, but we urgently need to talk about what the election result and its causes mean for our location and its reputation with investors. The election results are a wake-up call to start pushing back. We must show people that the solutions to their most pressing problems are to be found in the middle of society and not at its fringes. This clearly includes ensuring that Germany remains competitive in the long term, securing lasting prosperity and preventing us from falling behind internationally.\n\nFor some time now, the rest of the world has been looking at Germany with growing scepticism. Investors doubt our ability to reform, but also our performance and our will to perform. This is alarming enough, but political stability is now an added concern. This – combined with our country’s excellent companies – has always been one of the strongest arguments for investing here in Germany – one that would compensate for other disadvantages Germany had. Now, however, it’s an argument that is being questioned.\nThe ability to grow is the basis of our prosperity and the basis for our welfare state to function. We need to finally start implementing reforms for future growth. What better time for a breakthrough than now?\nChristian Sewing\nAnd it's not just investors who are demanding answers; voters are, too. Their uncertainty and their desire for sustainable concepts - something they do not see in the established parties – are what makes these kind of election results possible in the first place. And as different as the needs and concerns of voters and investors may be, there is one – actually very simple – answer that is central to both groups: growth.\nThe ability to grow is the basis of our prosperity and the basis for our welfare state to function. We need to finally start implementing reforms for future growth. What better time for a breakthrough than now? The key words here are clear: affordable energy, reduced bureaucracy, appropriate regulation, modern infrastructure and better financing conditions.\n\nReforms alone are not enough, though. For me, it is crucial that we agree again that growth is something positive, a necessity even. It’s an understanding that I miss in many places – in Germany and Europe alike. Potential growth of 0.4 percent, as seen by the German Council of Economic Experts, must not be our goal. We need many times that to keep up.\nThis will only succeed if we change our attitude to work, if we are prepared to work more and harder. Ultimately, we need more incentives that reward work and performance. If this includes a minimum wage of 15 euros then we should look into it. Equally, though, or even more, we must understand that we need to lengthen the working week and delay retirement. We won’t make it with an average of 28 hours a week and retirement at 63.\nThere must be a change of thinking – and this is also where the economy and we as banks are called upon. We need to precisely demand this shift – loudly and clearly. After all, we’re talking about the reputation and future viability of Germany as a place to do business and invest. And we all bear responsibility for that.\n\nWHERE DO BANKS STAND?\nI am convinced that the financial sector is an indispensable factor for staying competitive. Banks and capital markets are crucial when it comes to managing risk, financing investments and, ultimately, enabling growth. And we must do all we can to live up to this role even better.\nI don't want to deny the progress that our industry has made in recent years. Today, our banks are in excellent shape, they’re robust and we have increased profitability considerably. What’s more, we have proven that when our clients need us, we are there for them.\nBut we can't rest on our laurels. We have to make sure that we keep up with the dominant trends of our time.\n\nTrend 1: Digitalization\nFirst and foremost, this applies to technology. Modern technologies such as artificial intelligence, blockchain and cloud computing all offer opportunities that will fundamentally change the banking business. In many key businesses, we will become platform companies that create ecosystems to seamlessly connect clients, partners and services. After all, recent years have shown that fintechs are in no way a substitute for banks – but they can often only develop their potential in partnerships with banks.\nThis transformation not only means the digitalization of existing processes; it requires a complete rethink of the banking experience. And it means being more open to new technologies and to using them consistently.\nThe examples are numerous, ranging from tailored investment recommendations thanks to the exponential growth of data to significant improvements in securities and currency trading. In this segment, where standardised processes are used to process transactions, technology has always been the key to success. By integrating real-time analytics, machine learning and automation, we can further optimise operations in the future, reduce risk and deliver significant value to our clients.\nThe potential is enormous. To exploit it, however, it is not enough to introduce the technology. We also need to empower our employees to take advantage of the technological possibilities. Our people, their experience and their expertise are our most important asset. So it goes without saying that their training and development must have the highest priority.\n\nTrend 2: Volatility\nInvesting in the quality and competence of our employees is also so important because their advice will be much more in demand in the coming years as volatility, which I see as the second big trend, will remain a challenge. We can’t deny that the world will remain complicated, and in terms of geopolitics there’s a good chance of it becoming even more so. At times like these, first-class advice is the be-all and end-all. This goes far beyond product knowledge. Our clients also need competent risk managers to protect their assets against volatility, climate and cyber risks. They are increasingly looking for holistic advice. Corporate clients are currently tending to consolidate their banking relationships. They want less, but deeper relationships with a global perspective.\nThe ensuing market shifts become even more pronounced as banks have to make extensive investments to be able to meet their clients’ needs. This plays into the hands of the industry’s big players, making it all the more important that in Europe, too, we have big banks that can meet this demand. It is therefore clear just how vital it is that banks with a global positioning like Deutsche Bank continue to strengthen their global network, combined with local expertise.\n\nTrend 3: Sustainability\nAnother trend that we need to continue to build expertise in is sustainability. Granted, the topic has moved somewhat out of focus as other dramatic news dominates. Nevertheless, sustainable financing and ESG investments increased again in the first half of the year compared to the previous year. This shows that our clients understand that the green transformation of our economy has become even more urgent. And we as banks have the task of accompanying them in this process and, in particular, supporting companies with high CO₂ emissions in their transformation. This is the only way we too will be able to achieve our net-zero targets.\n\nTrend 4: Public debt\nIn addition to rapid technological progress, ongoing volatility and the need for ecological transformation, there is a fourth trend that will shape the coming years and give us banks an even more central role – and that is the high level of public debt. This is happening at the same time as the need to finance in defence, artificial intelligence or green tech is increasing considerably – something the public sector cannot tackle alone.\nThis makes us banks all the more in demand, with our own balance sheets and with other credit instruments, in particular raising funds in the capital markets – something which is becoming increasingly important. It is our task to prepare for this, but we also need support. We need regulation that does not tie up more and more capital that we then lack to support the economy. And it is high time for politicians to support the European Union’s capital markets union not only with words, but also with actions – not because it benefits us banks, but because there is no better growth programme for Europe than the capital markets union.\n\nCONCLUSION\nLadies and gentlemen, many of the topics I have touched on in the past few minutes will be explored in greater depth over the next two days – here at the Banking Summit as well as at the accompanying conference on artificial intelligence in banking. There is one thing we should never forget when talking about the future of our industry: the financial sector is a strategically important industry. We are the backbone of our economy. And all of us in this room have a shared responsibility to live up to this important role.\nAt the same time, we must emphasise this even more strongly in Berlin and Brussels, and as President of the German and European Banking Association, I see this as a central task. We must make it clear that without a strong financial industry, Europe will have even more difficulties in the current geopolitical situation. We must also make it clear that without globally relevant banks, we will become too dependent on foreign providers. And we must make it clear that international investors will give us a wide berth in the future if we don't have a financial centre that can compete with New York, London and Singapore.\nTogether, we can work to ensure that Europe's financial industry has a bright and successful future. And all of us here should work at making Frankfurt the centre of this industry.\nThank you very much.",
    "number_of_ratings": 7,
    "rating": 5.0,
    "likes": 16
}