{
    "url": "https://www.db.com/news/detail/20240425-deutsche-bank-reports-on-the-first-quarter-results-of-2024?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 25, 2024",
    "tags": [
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank reports 10% year-on-year growth in profit before tax to € 2.0 billion in the first quarter of 2024",
    "body": "Profit growth over prior year quarter drives progress towards key targets\nProfit before tax rises 10% to € 2.0 billion, net profit up 10% to € 1.5 billion\nPost-tax return on average tangible shareholders’ equity (RoTE)¹ rises to 8.7%, from 8.3% in the prior year quarter\nCost/income ratio improves to 68%, from 71% in prior year quarter\nRevenues resilient in a stabilizing interest rate environment\nNet revenues grow 1% year on year to € 7.8 billion, primarily driven by growth of 11% in commissions and fee income\nStrength in Fixed Income & Currencies with market share gains in Origination & Advisory\nAssets under management grow by € 72 billion, including net inflows of € 19 billion, across the Private Bank and Asset Management\nDelivery on cost commitments\nNoninterest expenses down 3% year on year to € 5.3 billion\nAdjusted costs reduced by 6% to € 5.0 billion, in line with 2024 guidance\nSolid capital supports shareholder distributions; credit risk remains contained\nCommon Equity Tier 1 (CET1) capital ratio of 13.4% after deductions for shareholder distributions and business-driven growth in risk weighted assets (RWAs)\nLeverage ratio of 4.5%, in line with previous quarter\nProvision for credit losses of € 439 million, down 10% from € 488 million in fourth quarter of 2023; full-year guidance reaffirmed at higher end of range of 25-30 basis points of average loans\nContinued delivery of Global Hausbank strategy in the quarter\nRevenue growth: compound annual growth of 6.0% since 2021, in line with raised target of 5.5-6.5% through 2021-2025\nOperational efficiency: savings realized or expected from measures completed increase to € 1.4 billion, towards the goal of € 2.5 billion\nCapital efficiency: € 15 billion of RWA reductions achieved to date, out of a target of € 25-30 billion by end-2025\nThis quarter we achieved double-digit profit growth, and our highest first quarter profit since 2013, through disciplined execution of our Global Hausbank strategy. We again generated solid revenue momentum in an environment of normalizing interest rates, thanks to a well-balanced business model. As promised, we delivered on our cost target and we are determined to maintain this discipline. Our strong capital base enables us to increase distributions to shareholders while supporting business growth. On all dimensions, we are firmly committed to continued delivery on our path towards our 2025 goals. \nChristian Sewing, Chief Executive Officer\nDeutsche Bank (XETRA: DBGn.DB / NYSE: DB) today announced profit before tax of € 2.0 billion for the first quarter of 2024, up 10% year on year. Post-tax profit was also up 10% year on year, to € 1.5 billion.\nDeutsche Bank’s target ratios improved compared to the first quarter of 2023. Post-tax return on average tangible shareholders’ equity (RoTE)¹ was 8.7%, up from 8.3% in the first quarter of 2023, as profit growth more than offset higher tangible shareholders’ equity driven by organic capital generation. Post-tax return on average shareholders’ equity (RoE)¹ was 7.8% in the quarter, up from 7.4% in the prior year quarter. The cost/income ratio improved to 68%, from 71% in the prior year quarter. Diluted earnings per share improved to € 0.69, from € 0.61 in the prior year quarter.\n“This was a quarter of delivery on commitments,” said James von Moltke, Chief Financial Officer. “Our revenue and franchise momentum reflects our investments in capital-light businesses and close partnership across the Group to support clients. Tight management of costs, capital and balance sheet, combined with continued investments in technology and controls, is the result of execution discipline right across our platform.”\nContinued delivery of the Global Hausbank strategy\nDeutsche Bank maintained its momentum in executing on its Global Hausbank strategy during the first quarter. This included:\nRevenue growth: revenues grew by 1% in the first quarter of 2024, as 11% year on year growth in commissions and fee income more than offset lower net interest income as interest rates stabilized. The bank’s compound annual revenue growth rate since 2021 over the last twelve months was 6.0% at the end of the first quarter, within the bank’s raised target range of between 5.5% and 6.5%. Assets under management grew by € 72 billion across the Private Bank and Asset Management during the quarter, including net inflows of € 19 billion, which is expected to support future revenue growth in these businesses.\nOperational efficiency: in reducing noninterest expenses to € 5.3 billion, the bank also reduced adjusted costs to € 5.0 billion in the first quarter, in line with its target quarterly run-rate objective for 2024. Deutsche Bank made further progress on its € 2.5 billion Operational Efficiency program during the quarter, including optimization of the bank’s platform in Germany and workforce reduction, particularly in non-client facing roles. Savings either realized or expected from completed efficiency measures grew to € 1.4 billion, including approximately € 1.0 billion in realized savings to date.\nCapital efficiency: Deutsche Bank delivered RWA reductions of a further € 2 billion during the quarter through securitization and data and process improvements. As a result, cumulative RWA reductions from capital efficiency measures reached € 15 billion, representing further progress toward the bank’s objective of € 25-30 billion in optimizations by 2025. The bank made progress on its share repurchase program launched on March 4, 2024; as at April 19, 2024, the bank had repurchased 20.6 million shares for a total of € 283 million. The bank anticipates materially completing the current program by the end of the first half of 2024.\nRevenue growth in challenging conditions\nNet revenues were € 7.8 billion, up 1% over the prior year quarter at Group level and up 3% overall in the bank’s four operating businesses². Growth of 11% in commissions and fee income, reflecting management’s objective to grow capital-light business areas, was partly offset by a year-on-year decline in net interest income, as anticipated, in an environment of stabilizing interest rates. Revenue development in the bank’s businesses was as follows:\nCorporate Bank net revenues were € 1.9 billion, down 5% year on year compared with the first quarter of 2023 which marked the revenue peak of the current interest rate cycle. Net interest income was lower year on year as expected, reflecting normalizing deposit revenues, lower loan net interest income and the discontinuation of minimum reserve remuneration by the ECB. This development was partly offset by a rise in commissions and fee income. Revenues in Corporate Treasury Services were € 1.1 billion, a decline of 10%, partly offset by growth of 4% in Institutional Client Services revenues to € 463 million, and 3% growth in Business Banking revenues to € 346 million. Deutsche Bank ranked no. 1 in 17 categories in the 2024 Euromoney Trade Finance Survey, up from 14 in 2023, including Best Trade Finance Bank in Germany for the 12th year running and Best Trade Finance Bank in Western Europe for the 7th consecutive year.\nInvestment Bank net revenues were € 3.0 billion, up 13% over the first quarter of 2023. Fixed Income & Currencies (FIC) revenues were up 7% to € 2.5 billion. This development was driven in part by 14% year on year growth in Financing revenues to € 805 million, largely reflecting strong securitization and issuance activity. Credit Trading revenues grew significantly year on year, reflecting the benefits of investments in prior periods. Emerging Markets revenues were significantly higher, with growth across regions, and Latin America seeing strong client activity driven by the investments. Foreign Exchange revenues were also higher, driven in part by the non-recurrence of the extreme interest rate volatility and market dislocations in March 2023 which impacted the prior year quarter, and as the benefits of a refocused business model materialize. Growth in these areas more than offset a decline in Rates revenues from the very high levels of the prior year quarter. Origination & Advisory revenues grew 54% to € 503 million, the highest level for 9 quarters, driven by Debt Origination revenues which rose 67% year on year to € 355 million, reflecting a recovery in the leveraged debt market and robust investment grade issuance. This growth also reflected improved market activity and market share gains; Deutsche Bank’s share of global Origination & Advisory improved by around 70 basis points over the year 2023 to 2.6% in the quarter (source: Dealogic).\nPrivate Bank net revenues were € 2.4 billion, down 2% year on year, as slightly lower net interest income was partly offset by growth in investment products, in line with the business’s strategy to grow noninterest income. Revenues in Personal Banking were down 4% year on year, reflecting higher hedging costs and higher funding costs including the impact of the discontinuation of minimum reserve remuneration, partly offset by higher deposit revenues. Revenues in Wealth Management & Private Banking remained stable year on year as lower deposit revenues were offset by growth in lending and investment product revenues. Assets under management grew by € 27 billion during the quarter to € 606 billion, their highest level since the formation of the Private Bank in 2018. Growth was driven in part by net inflows of € 12 billion, the highest for 12 quarters, including € 6 billion in investment products in Wealth Management & Private Banking. In the Euromoney Global Private Banking Awards 2024, announced at the end of the quarter, Deutsche Bank won 15 awards including World’s Best for Entrepreneurs, World’s Best for Ultra High Net Worth and Germany’s Best Domestic Private Bank.\nAsset Management net revenues were € 617 million, up 5% over the prior year quarter. Management fees grew by 4% to € 592 million, predominantly in liquid products, driven by an increase in average assets under management. Performance & Transaction fees grew 56% to € 17 million, reflecting higher transaction fees in Alternatives. Net inflows were € 8 billion, or € 9 billion ex-Cash, and were driven predominantly by Passive products. Net inflows included € 2 billion into Environmental, Social and Governance (ESG) products. Assets under management grew by € 45 billion to € 941 billion during the quarter, € 101 billion higher than at the end of the prior year quarter, reflecting consecutive quarters of positive net inflows and rising market levels.\nExpenses: delivery in line with commitment on quarterly adjusted costs\nNoninterest expenses were € 5.3 billion in the quarter, down 3% compared to the prior year quarter. A 6% reduction in adjusted costs to € 5.0 billion, consistent with the bank’s guidance for the quarterly run-rate in 2024, more than offset higher nonoperating costs versus the prior year quarter.\nAdjusted costs of € 5.0 billion, down 6%, primarily reflected lower bank levies, which more than offset a rise of 9% in compensation and benefits expenses compared to the prior year quarter. This development was driven in part by an increase of 3,611 full-time equivalents (FTEs) in the internal workforce compared to the first quarter of 2023, reflecting investments in business growth, including the acquisition of Numis in the UK, together with further investments in technology and controls and the continued internalization of external staff. Investments and internalizations were partly offset by headcount reductions as part of the bank’s Operational Efficiency program.\nNonoperating costs were € 262 million, up from € 89 million in the first quarter of 2023. Litigation charges were € 166 million, up from € 66 million in the prior year quarter, and restructuring and severance charges were € 95 million, compared to € 23 million in the prior year quarter and driven in part by the implementation of the bank’s Operational Efficiency program.\nCredit provisions lower quarter on quarter, with full-year guidance reaffirmed\nProvision for credit losses was € 439 million, or 37 basis points of average loans, down from € 488 million in the fourth quarter of 2023. Provision for non-performing (Stage 3) loans was € 471 million, up 3% from € 457 million in the previous quarter, driven by provisions in the Private Bank, including provisions relating to the operational backlog which are expected partly to reverse in future quarters as the backlog is processed; and in the Investment Bank which, as previously communicated, continues to be affected by provisions on commercial real estate exposures.\nThis development was more than offset by net releases of performing (Stage 1 and 2) loans of € 32 million, driven by improved macro-economic forecasts as well as model recalibration effects, compared to provisions of € 30 million in the previous quarter. For the full year 2024, provisions for credit losses are expected to remain at the higher end of the previously communicated guidance range of 25-30 basis points of average loans.\nSolid capital ratio supports distributions to shareholders and business growth\nThe Common Equity Tier 1 (CET1) capital ratio was 13.4% at the end of the first quarter of 2024, compared to 13.7% at the end of the fourth quarter of 2023. Organic capital generation through strong first-quarter earnings partly offset deductions for the € 675 million share buyback program approved by the ECB in January 2024, and for future capital distributions in line with the bank’s commitment to a 50% payout ratio in respect of the financial year 2024, together with an RWA increase of € 5 billion to € 355 billion in the quarter, largely driven by business growth.  \nThe Leverage ratio was 4.5% at the end of the first quarter, essentially unchanged from the end of the previous quarter. Leverage exposure was € 1,254 billion, also essentially unchanged, as higher trading related exposures were offset by lower cash balances.\nThe Liquidity Coverage Ratio was 136% at the end of the quarter, compared to 140% at the end of the fourth quarter of 2023, above the regulatory requirement of 100% and representing a surplus of € 58 billion. High Quality Liquid Assets were € 222 billion at the end of the quarter, up slightly from the end of the previous quarter. The Net Stable Funding Ratio was 123%, above the bank’s target range of 115-120%, representing a surplus of € 112 billion above required levels. Customer deposits rose by € 13 billion to € 635 billion during the quarter.\nFor Deutsche Bank’s Annual General Meeting on May 16, 2024, the Management Board and the Supervisory Board have proposed the payment of a cash dividend of € 0.45 per share in respect of the financial year 2023, up 50% over 2022.\nSustainable Finance: cumulative volumes since 2020 reach € 300 billion\nEnvironmental, Social and Governance (ESG)-related financing and investment volumes ex-DWS³ were € 21 billion in the quarter, bringing the cumulative total since January 1, 2020 to € 300 billion. In the first quarter of 2024, Deutsche Bank’s businesses contributed as follows:\nCorporate Bank: € 6 billion in sustainable financing, raising the business’s cumulative total since January 1, 2020 to € 59 billion\nInvestment Bank: € 13 billion, comprising € 3 billion in sustainable financing and € 9 billion in capital market issuance, raising the division’s cumulative total since January 1, 2020 to € 179 billion\nPrivate Bank: € 3 billion growth in ESG assets under management and new client lending, raising the Private Bank’s cumulative total since January 1, 2020 to € 62 billion\nDuring the first quarter, Deutsche Bank participated in a € 4.4 billion non-recourse project financing for Automotive Cells Company to enable the development of three gigafactories for lithium-ion battery cell production across Europe. The bank also published its revised Sustainable Finance Framework, which includes updated criteria for classifying financings as sustainable, as well as a new Sustainable Instruments Framework for the issuance of social bonds. The rating agency ISS ESG granted this framework its highest possible assessment grade.\nDeutsche Bank received a rating upgrade from the non-profit rating agency CDP (formerly Carbon Disclosure), indicating that the bank is above industry average in all categories. At the bank’s 2024 Annual General Meeting, management will discuss with shareholders its proposal to link parts of Management Board compensation for 2024 to the carbon emission sectoral targets for the corporate loan portfolio.  \nGroup results at a glance\n¹ For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ on pp 15-20 of the first quarter 2024 Financial Data Supplement and “Non-GAAP financial measures” on pp. 50-53 of the Earnings Report, as of March 31, 2024, respectively.\n² The Corporate Bank; the Investment Bank; the Private Bank; and Asset Management\n³ Cumulative ESG volumes include sustainable financing (flow) and investments (stock) in the Corporate Bank, Investment Bank and Private Bank from January 1, 2020 to date, as set forth in Deutsche Bank’s Sustainability Deep Dive of May 20, 2021. Products in scope include capital market issuance (bookrunner share only), sustainable financing and period-end assets under management. Cumulative volumes and targets do not include ESG assets under management within DWS, which are reported separately by DWS.\nESG Classification\nWe defined our sustainable financing and investment activities in the “Sustainable Financing Framework – Deutsche Bank Group” which is available at investor-relations.db.com. Given the cumulative definition of our target, in cases where validation against the Framework cannot be completed before the end of the reporting quarter, volumes are reported upon completion of the validation in subsequent quarters. In Asset Management, DWS introduced its ESG Product Classification Framework (“ESG Framework”) in 2021 taking into account relevant legislation (including Regulation (EU) 2019/2088 – SFDR), market standards and internal developments. The ESG Framework is further described in the Annual Report 2021 of DWS under the heading ”Our Product Suite – Key Highlights / ESG Product Classification Framework” which is available at https://group.dws.com/ir/reports-and-events/annual-report/. There is no change in the ESG Framework in the first quarter of 2024. DWS will continue to develop and refine its ESG Framework in accordance with evolving regulation and market practice.\nFurther details on first quarter performance in Deutsche Bank’s businesses are available in the Earnings Report of March 31, 2024.\nAnalyst call\nAn analyst call to discuss first-quarter 2024 financial results will take place at 11:00 CEST today. An Earnings Report, Financial Data Supplement (FDS), presentation and audio webcast for the analyst conference call are available at: www.db.com/quarterly-results\nA fixed income investor call will take place on April 26, 2024, at 15:00 CEST. This conference call will be transmitted via internet: www.db.com/quarterly-results\nRead the \nPDF\nfull media release as PDF document.",
    "number_of_ratings": 13,
    "rating": 5.0,
    "likes": 24
}