{
    "url": "https://www.db.com/news/detail/20240425-deutsche-bank-wins-best-structured-trade-finance-best-new-economy-and-best-nbfi-bank-in-apac?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 25, 2024",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank wins Best Structured Trade Finance, Best New Economy and Best NBFI Bank in APAC",
    "body": "Deutsche Bank won “Best Structured Trade Finance Bank in APAC” and “Best Risk Management Bank”, among several other recognitions, at the 2024 The Asset awards, for its ability to provide the holistic solutions its clients need to navigate turbulent markets and drive innovation and excellence across their operations.\nThe bank’s success in growing business with ‘new economy’ clients in Asia Pacific also caught the judge’s attention, with wins for “Best in Treasury and Working Capital-New Economy” and “Best in Treasury and Working Capital-Non Bank Financial Institutions”. \n“Our ability to deliver holistic solutions to our clients successfully and consistently, underscores our standing in Asia Pacific as a robust European alternative with a truly global network.\"\nOle Matthiessen, Deutsche Bank's Global Head of Cash Management and Corporate Bank for APAC and MEA \n“The focus on growing our Corporate Bank as the backbone of Deutsche Bank is paying off, as is doubling down on our growth regions like ASEAN and key markets like North Asia and South Asia.”\nThe Asset recognised the Corporate Bank’s strong performance across the full spectrum of its services and for a strategy that positions it for continued and sustainable growth.\nThe publication called out 45 client solutions as the best in the industry, including providing the Best Cash Management Solution in 13 markets and Best Trade Finance Solution in seven, showing particular strength in South Asia and ASEAN. \nMatthew Moodey, Deutsche Bank’s Head of Trade Finance & Lending for Asia Pacific, took home Structured Trade Finance Banker of the Year, and in recognition of the bank’s deep bench of talent, 19 other colleagues and teams across the region.\nThe Asset’s rigorous evaluation process includes client feedback from the publication’s Annual Benchmark Survey, in-depth client interviews, and detailed awards pitches.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 2
}