{
    "url": "https://www.db.com/news/detail/20240424-euroclear-appoints-deutsche-bank-as-cash-settlement-and-foreign-exchange-bank-in-south-korea?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 24, 2024",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Euroclear Appoints Deutsche Bank as Cash Settlement and Foreign Exchange Bank in South Korea",
    "body": "Deutsche Bank has today announced it has been appointed by Euroclear Bank SA/NV as Cash Settlement and Foreign Exchange Bank (under Euroclear direct link) with the Korea Securities Depository (KSD). The mandate is to support South Korean government bond activity for Korea Treasury Bonds (KTBs) and Monetary Stabilization Bonds (MSBs).\nThis new appointment builds on Deutsche Bank’s relationship with Euroclear, which spans multiple markets and products across both the Corporate and Investment Bank. This mandate is particularly significant given the potential inclusion of South Korea in the World Government Bond Index.\nDeutsche Bank has a 46-year history in South Korea, Asia’s fourth largest economy, and provides a full range of solutions to multinational companies, large local corporates and financial institutions in the country. Last year, Deutsche Bank increased its capital allocation for its Seoul branch by €150 million, to grow the business and undertake more activity for its clients, underscoring the bank’s commitment to South Korea.\nDeutsche Bank’s Securities Services business has a presence in over 30 markets globally, and it’s focusing on its core strengths and fundamentals, including client-centric solutions and market differentiation. South Korea is one of the bank’s key markets in Asia, and it sees high potential for growth given recent market changes and increasing client interest.\nPaul Maley, Global Head of Securities Services and Regional Head of Corporate Bank for the Americas said: “We are grateful for Euroclear’s strong and ongoing trust in Deutsche Bank. This new mandate highlights our significant market expertise in Asia, and the crucial role that we play in underpinning the financial flows for global investors.”\nHyun-Nam Park, South Korea Branch Manager said: “We are delighted to extend our partnership with Euroclear in South Korea. This new appointment is a milestone for our local business, and we are proud to support the South Korean bond market, which is becoming increasingly important globally.”\nPeter Sneyers, Euroclear Bank CEO added: “As a Financial Market Infrastructure, our role is to support and drive efficiencies to grow the global marketplace. We have been working closely with the Korean capital market and our network with the common objective to provide a solution for international investors to access efficient and safe settlement of local Korean government bonds. This signifies another important step to us achieving our shared goal.”\nDeutsche Bank AG                                       \nMedia Relations                                           \n  Kate Fields\nPhone: +852 2203 5094\nEmail: kate.fields@db.com",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 2
}