{
    "url": "https://www.db.com/news/detail/20240411-deutsche-bank-issues-largest-panda-bond-for-a-financial-institution-since-2018?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 11, 2024",
    "tags": [
        "Investment Banking"
    ],
    "title": "Deutsche Bank Issues Largest Panda Bond for a Financial Institution since 2018",
    "body": "Deutsche Bank announced today that it has issued its third panda bond, raising3 billion renminbi (415 million US dollars) via 2-year Senior Preferred notes. The transaction attracted an orderbook of over 8 billion renminbi (1.1 billion US dollars). It drew robust investor demand and priced attractively versus existing Deutsche Bank debt.\nThis marks the largest panda bond issuance by a financial institution since 2018. The proceeds of this transaction will be used for general business activities and development.\nPanda bonds are bonds issued by foreign entities in mainland China, allowing them to tap into the domestic RMB bond market.\nDeutsche Bank’s CEO for Asia Pacific, Europe, Middle East & Africa (EMEA) and Germany and Member of the Management Board, Alexander von zur Muehlen said: “Deutsche Bank is proud of its longstanding track record of driving international participation in China’s onshore bond market, both through supporting our clients with landmark transactions and executing our own funding strategy.\"\nDeutsche Bank continues to play an active role in supporting the internationalization of the RMB and continuous opening-up of the capital markets in China. As a result, the bank has been the leading foreign bank for NAFMII-registered bonds¹ in the China interbank bond market for the past four consecutive years, including local and panda bond issuers.\n2023 saw historic levels of issuance for the panda bond market, with activity set to continue throughout this year.\nSamuel Fischer, Deutsche Bank Head of China Onshore Debt Capital Markets said: “It has been a positive start to the year for the panda bond market, with RMB 61 billion² of issuance in the first three months. We continue to see strong levels of interest from both European and Emerging Market issuers, looking to tap into the market.”\nFollowing the bank’s successful issuances throughout 2023, this marks the third issuance from the bank which adheres to the pre-approved program by the People’s Bank of China (the “PBOC”). The program allows Deutsche Bank to issue RMB bonds in an aggregate principal amount of up to 8 billion renminbi (1.13 billion US dollars) periodically in up to two years, upon approval from China’s interbank bond market (CIBM).\nThis issuance follows Deutsche Bank’s successful return to the Singapore Dollar bond market last month.\n*Note:  Various US dollars figures in this article are converted based on time of the transactions.\n\n¹National Association of Financial Market Institutional Investors (NAFMII) is a self-regulatory organisation that promotes the development of China’s Over-The-Counter (OTC) market, where securities are trade via a broker dealer instead of on a centralised exchange.\n²Data source : Wind",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 2
}