{
    "url": "https://www.db.com/news/detail/20170529-king-of-spain-awards-deutsche-bank-with-medal-of-honour?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 29, 2017",
    "tags": [
        "Awards",
        "Company"
    ],
    "title": "King of Spain awards Deutsche Bank with medal of honour",
    "body": "Honouring Deutsche Bank’s long history in his country, King Felipe VI presented the bank with a medal of honour from the German Chamber of Commerce in Spain.\nOrganised by the German Chamber of Commerce in Spain as part of its centenary celebrations, the gala dinner on May 25 was the perfect backdrop to honour ten German companies, each of them looking back on more than a century of business in the country. José Manuel Mora-Figueroa, COO of Deutsche Bank Spain, received the award along with representatives from nine other major German companies, including ThyssenKrupp (in Spain since 1876), Carl Zeiss (1892), Deutz (1893), Siemens (1895), Bayer (1899), Linde (1907) and Bosch (1908).\nAddressing more than 400 guests, public figures and senior managers from Spanish and German companies, King Felipe said: \"Germany and Spain are friends who share values and interests and who have a similar perspective with regard to the challenges of a global economy\". He continued: \"Today our two countries agree that the only way forward is to strengthen European structures and continue to promote an open Europe for trade.”\nThe King acknowledged the extremely positive nature of Spanish-German business relations. He underlined that German companies established in Spain \"are successful business stories\" directly employing 170,000 people. Furthermore, he said, Germans make up the third-largest group of tourists to the country, with over 11 million having visited in 2016. “A truly impressive figure”, he stated, “which means that .about 13 percent of the German population came to Spain last year.\"\nDeutsche Bank opened its first offices in Spain in 1889. Learn more about Deutsche Bank in Spain at https://www.db.com/spain.\nImages Copyright: His Majesty House",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}