{
    "url": "https://www.db.com/news/detail/20170515-what-will-cities-look-like-in-100-years-ufa-and-deutsche-bank-launch-city-video-future-video-art-competition?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 15, 2017",
    "tags": [
        "Art",
        "Corporate Citizenship"
    ],
    "title": "What will cities look like in 100 years?",
    "body": "Starting today, UFA and Deutsche Bank are inviting artists and art enthusiasts to join the ‘city video future’ competition by producing videos about what cities will look like in 100 years. Participants can upload their entries online for judging by a panel of experts.\nThe video art competition marks the 100th anniversary of UFA’s founding. The studio’s birth is closely associated with Fritz Lang’s vision of a futuristic city, the classic silent film “Metropolis”. ‘city video future’ is also the third edition of the MACHT KUNST (MAKE ART) campaign. Twice in the past, Deutsche Bank has called on artists and art enthusiasts in Berlin to contribute their own paintings, works on paper and photographs (2013) or models for a sculpture (2015) for a 24-hour public exhibition at the bank’s KunstHalle venue. Each time, the response has been huge.\n“This time, we are asking video artists, art students and avid amateur film-makers from around the world to produce and submit their own videos. The videos should display artistic skill and deal with the city of the future from a social, political or economic perspective,” said Josephine Ackerman, Deputy Global Head Art, Culture & Sports at Deutsche Bank.\nWolf Bauer and Nico Hofmann, Co-CEOs of UFA: “We are proud to be a part of MACHT KUNST in our anniversary year and really look forward to seeing the submissions. Through this fantastic campaign to support art, Deutsche Bank is offering creative talents a forum to take on contemporary issues in an artistic, multi-perspective context for the third time.\nWe are delighted about the focus on video as an art form to mark our anniversary. This year’s motto, city video future, also calls to mind the film classic ‘Metropolis’, which in its day created a vision involving a city of the future and is closely associated with the early days of our company’s history.”\nAbout the competition:\nThe video entries can be uploaded in all common formats from 15 May to 30 June 2017 by visiting www.machtkunst-berlin.de/en/. Videos must be between 100 seconds and 10 minutes long to be considered. A panel of experts will first select a shortlist of the 20 best video entries to be presented to the public at Deutsche Bank’s atrium on Unter den Linden in Berlin during the 20th Long Night of Museums on 19 and 20 August 2017.\nThe judges will select the three winning videos from this shortlist. In addition to cash prizes of Euro 7,000, Euro 5,000 or Euro 3,000, the first-prize winner will receive a year of mentoring by a high-profile UFA producer. UFA and Deutsche Bank will also be presenting an audience award (a high-end digital camera) to a winner selected by visitors online and during the shortlist exhibition.\nThe judges’ three favourites will be revealed at the bank’s atrium in Berlin during the exhibition opening on 19 August 2017. The winner of the audience award will be announced on 28 August 2017.\n\n\nFor further information, please contact:\nDeutsche Bank AG\nMedia contact\nKlaus Winker\nTel: 069 910 32249\nEmail: klaus.winker@db.com \nUFA\nPR & Marketing\nAnja Käumle\nTel: 0331 70 60 379\nEmail: anja.kaeumle@ufa.de",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}