{
    "url": "https://www.db.com/news/detail/20170508-cio-view-vive-la-france?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 8, 2017",
    "tags": [
        "Research"
    ],
    "title": "CIO View: Vive la France",
    "body": "The outcome of the French presidential elections is good for Europe – both for the for the future of the European Union and for European equity markets, according to new research from Deutsche Asset Management.\nIn a report entitled “Vive la France, long live Europe and its equities”, Britta Weidenbach, Head of European Equity, notes: “What we believe to have been the single biggest political risk in Europe in the current year was happily averted with the outcome of the French elections. Populist tides also appear to have peaked for the time being. We have taken this occasion to upgrade European equities to overweight as we believe political uncertainty has been the main factor that has kept investors, especially foreign investors, from shifting their funds to Europe.”\nWeidenbach says that Europe’s advantages can no longer go unnoticed. Alongside the stable macroeconomic environment, it’s the earnings momentum of European companies that makes a strong case for investing in Europe: “This year we expect double-digit earnings growth versus last year. This year we will finally see the turning point for Europe, now that decent earnings growth is back, after five flattish years.”\nDeutsche AM says that with President-Elect Emmanuel Macron, there is a committed European leading Germany's most important political partner. His taking the helm could accelerate investor hopes for further European integration, perhaps in the form of a better coordinated and more stimulating fiscal policy. By the year’s end, Europe’s stability may even turn out to be higher than when the year began. That said, it’s important not to sugarcoat the election results because they also reveal a high degree of political dissatisfaction and loss of confidence in the established parties on the part of voters.\nOverall, Weidenbach sees a slight easing in political risk across Europe. However, because Britain’s separation from Europe involves friction and uncertainty, she expects Brexit to remain an economic burden in the short- to medium-term, not only for the UK but also for the rest of the EU.\nNo matter how good the negotiations turn out to be, at most, they will only be able to minimize the damage, not eliminate it completely.\nThis means that the largest single risk continues to be Italy where political dissatisfaction and a fragile banking sector are being met with fading economic growth. “Still, we do not expect Italy to hold new elections before the fourth quarter of 2017,” Weidenbach notes.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}