{
    "url": "https://www.db.com/news/detail/20170505-commitment-to-europe?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 5, 2017",
    "tags": [
        "Corporate Citizenship",
        "Research"
    ],
    "title": "Commitment to Europe",
    "body": "European industry and millions of its employees have benefitted for over half a century from peace, freedom and economic cooperation. It is the basis of our economic prosperity and quality of life. And that foundation must not be jeopardised. This is why we, as internationally operating companies, are declaring our common commitment – to an open, united and strong Europe!\nThe European Economic Community (EEC), a milestone in the economic and political cohesion of Europe, was founded 60 years ago, at a time when the rubble of two devastating world wars had not been completely removed and our continent bore all the scars of war and suffering. The Europe in which we now live is a different, better Europe.\nAs the largest internal market in the world, Europe is a heavyweight in international trade. The per capita GDP of the six founding nations of the EEC has since tripled in size.\nWe have a degree of personal prosperity and freedom that was unimaginable directly after the end of the 2nd World War. As internationally operating companies, we are all agreed that Europe gives us many benefits and now is the right moment for us to give something back.\nStressing the benefits\nFrom the outset, political and economic integration were mutually supportive growth drivers. The common market was just the starting point of an increasingly interwoven European world: goods and services are freely traded today, and every day the old borders and language barriers are disregarded as a matter of course. It is where people meet. It is the lifeblood of Europe.\nWhile it needs to be discussed which topics the EU should address itself and which it should leave to the member states, we should return to a focus on the benefits of the union instead of constantly complaining about red tape and regulation.\nYet these benefits of European integration are often seen as the norm. The fact that they only emerged as the result of enormous effort is sometimes overlooked or forgotten. But we in our companies experience the many benefits of Europe on a day-to-day basis. Our everyday life and working world is an international one. And we want to draw attention to that.\nWe are committed to supporting the future of Europe, which is why this issue is and will remain important for our communication agenda. We support all areas of society actively and constructively lobbying for European unity. And we want to encourage those responsible in government, industry and society to continue strengthening the cause of a united Europe and work together on making it better. As internationally operating companies, we want to play our part in this.\nFor peace, freedom and prosperity – for a united Europe!\nAirbus, Axel Springer, BMW, Deutsche Bank, Deutsche Telekom, innogy, LANXESS, Lufthansa, RWE, thyssenkrupp, Volkswagen",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}