{
    "url": "https://www.db.com/news/detail/20191009-momentum-building-in-deutsche-bank-equity-capital-markets?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 9, 2019",
    "tags": [
        "Capital markets",
        "Company",
        "Investment Banking"
    ],
    "title": "Momentum building in Deutsche Bank Equity Capital Markets",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE:) has acted as a Global Coordinator (Glo-Co) on three Equity Capital Market (ECM) transactions out of Europe in the past week, demonstrating the ability of the bank to effectively lead ECM deals following the repositioning of its equities business announced on July 7th 2019.\nThe bank was joint Glo-Co on the 978 million euro IPO (including greenshoe) of French bottle maker, Verallia, the largest IPO in France since 2017 and the third largest IPO in the packaging sector ever. Michel Giannuzzi, Chairman and CEO of Verallia, said: “I am very grateful for the impressive drive and commitment of the Deutsche Bank teams during all critical phases of Verallia’s IPO from start to finish, executing this IPO despite a challenging market environment and paving the way for the new chapters of the company.”\nAlso in the past week, Deutsche Bank was joint Glo-Co on the 385 million euro offering of D shares for Akelius Residential Property AB, the first ever issuance of euro denominated D shares, a format combining the benefits of hybrid and common stock. In addition Deutsche Bank was joint Glo-Co on the 345 million US dollar re-IPO for JSE Halyk Bank of Kazakhstan, the largest re-IPO in the CIS region this year. Deutsche Bank has been mandated on 26 new ECM transactions since July, contributing to a solid pipeline of business for the rest of the year.\nThe three transactions priced last week, with Deutsche Bank acting as a Global Coordinator, are an endorsement of our new model for equity capital markets and distribution. Through our outstanding company research, global syndicate desk and targeted distribution capability, we are well positioned to provide corporate and financial sponsor clients with IPO and ECM products and services including structured equity transactions.\nHenrik Johnsson, Co-Head of Capital Markets at Deutsche Bank\nDeutsche Bank has now priced 21 ECM transactions since repositioning its equities business. Deutsche Bank was joint bookrunner on the 5.75 billion US dollar Hong Kong IPO (including greenshoe) of AB Inbev’s Budweiser Brewing Co and financial advisor to Naspers on its 120 billion euro listing of Prosus.\nIn the US, last week Deutsche Bank acted as an Active Bookrunner on Grocery Outlet’s 440 million dollar first time follow on after the June IPO. The bank has also maintained its leading SPAC franchise, pricing IPOs for Oaktree (200 million dollars), Conyers (450 million dollars) and KSL (275 million dollars) since the repositioning of its equities business.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}