{
    "url": "https://www.db.com/news/detail/20191127-deutsche-bank-wealth-management-adds-senior-key-roles-to-its-middle-east-and-africa-team?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 27, 2019",
    "tags": [
        "Company",
        "Investment Banking"
    ],
    "title": "Deutsche Bank Wealth Management adds senior key roles to its Middle East and Africa team",
    "body": "Deutsche Bank Wealth Management has enhanced its Middle East and Africa (MEA) team with two senior hires in Dubai. They complement the appointment of five relationship and investment managers in Dubai, Manama, Geneva and London over the last six months.\nBased in the Dubai International Financial Centre (DIFC), Hamza Hamza has joined the MEA team from Standard Chartered Private Bank as an Investment Manager. He has more than 15 years of experience in commodity brokerage, investment management and advising Gulf and South Asian clients in the Middle East and the UK. In addition, Naushair Malli has joined as a Client Advisor, bringing a wealth of experience in advising Ultra High Net Wealth (UHNW) clients, in investment and asset management from Julius Baer and Barclays, among others.\nBoth Hamza and Malli cover the Gulf States, which play a pivotal role in Deutsche Bank Wealth Management’s proposition for MEA clients.\nAlso joining the MEA Wealth Management team as a Relationship Manager focusing on Saudi Arabia is Omar Abdullah Abouzeid. He joins the bank from Credit Suisse and is based in the DIFC. He has a 14 years’ track record of servicing clients in the Middle East as investment and relationship manager.\nIn Bahrain, Murtuz Zamanly has been appointed Representative Officer. Zamanly has over 15 years of wealth management experience having previously worked at BNP Paribas and Credit Suisse covering UHNW Gulf Clients in Bahrain.\nAs part of Deutsche Bank Wealth Management’s efforts to further strengthen its UK market, the bank recently announced that it appointed Marwa Alani as Head of Middle East desk based in London. She will be instrumental in building a model advice-led wealth management business in the UK for clients with ties to the MEA region and an appetite to increase their investment activity there. Alani joined Deutsche Bank from Emirates NBD where she was the Head of the UAE/Pan Gulf Cooperation Council (GCC) Private Banking Team.\nEarlier this year, the bank appointed Geneva based Ahmed Hammouda Head of the Saudi offshore business. With more than 25 years of experience, Hammouda joined the MEA offshore team from Credit Suisse where he was the Market Head for Egypt and Head of the Saudi offshore business. Dion Marsden also joined the Saudi offshore business team in Geneva. He has more than 23 years of experience, most recently at Citi Private Bank where he focused exclusively on the Saudi market for last seven years.\nDeutsche Bank Wealth Management’s enhanced client coverage team reflects its commitment to invest in people, technology, advisory and investment solutions and to hire an additional 300 relationship and investment managers globally by 2021.\nLoïc Voide, Head of Wealth Management for MEA, said: “The MEA team has been contributing strongly to the growth of the global Wealth Management business at Deutsche Bank with a low double-digit percentage revenue increase year-on-year. I am delighted about these appointments that will enable us to further promote our proven capabilities to serve wealthy clients in the region.”\nDeutsche Bank Wealth Management has identified its Emerging Markets region, which includes Asia Pacific, the Middle East and Africa, as an area with particular growth potential. The buildout of the MEA team underscores the business’s ambition to grow its client franchise in a region that includes some of the strongest wealth creation and entrepreneurial activity. The bank recently announced a series of hires for its Global South Asia team, many also based in the MEA region.\nUHNW individuals and entrepreneurs in the MEA region benefit from Deutsche Bank Wealth Management’s investment platform and offering that covers the entire range from cash management and traditional portfolio management to complex structuring and alternative asset classes. Moreover, its lending capabilities have proven to satisfy the most complex needs which, when required, benefit from direct access to Deutsche Bank’s Investment Bank.\nFor further information, please contact:\nDeutsche Bank AG Media Relations\nMohanad Nahas, Dubai\nPhone: +971(4)3611-754\nMobile: +971 50 5445 836\nEmail: mohanad.nahas@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}