{
    "url": "https://www.db.com/news/detail/20191126-istanbul-metro-financing-is-deutsche-bank-s-latest-turkish-infrastructure-project?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 26, 2019",
    "tags": [
        "Company",
        "Corporate products",
        "Research"
    ],
    "title": "Istanbul Metro financing is Deutsche Bank's latest Turkish infrastructure project",
    "body": "Back in 1888, Deutsche Bank helped finance the construction of the Baghdad Railway connecting Istanbul with Baghdad and the Persian Gulf. Earlier this year, Deutsche Bank celebrated its 110 year anniversary in Turkey having opened its branch in Istanbul on August 16, 1909.\nSince its establishment, Deutsche Bank has maintained an active role in supporting many infrastructure projects in modern Turkey.\nLast month, Deutsche Bank acted as sole arranger for Istanbul Metropolitan Municipality’s (IMM) 110 million euro loan for the extension of Istanbul’s metro network.\nAs the local population in Istanbul has grown by 50 percent over the last two decades reaching 15 million in 2019, infrastructure needs have become more prominent especially in transportation. The facility provided by Deutsche Bank will be used to finance IMM’s capital requirements in the Çekmeköy-Sancaktepe-Sultanbeyli metro line, an extension to one of Istanbul‘s backbone metro lines Üsküdar-Ümraniye-Çekmeköy, which was partially financed by Deutsche Bank in 2018.\nThe project, which consists of eight stations for a total length of 10.9 kilometers, is expected to be operational by 2022 and together with the Üsküdar-Ümraniye-Çekmeköy metro line, is estimated to transport a combined daily volume of approx. 750,000 people in 2023, rising to an estimated 1,300,000 people in 2045.\nCommenting on the transaction, Orhan Ozalp, Chief Country Officer for Turkey, said: “We have a proud history and well established track record of supporting infrastructure projects in the country. Responding to local needs is a fundamental element of Deutsche Bank’s Positive Impact on local societies.”\nBesides the metro projects in Istanbul, Deutsche Bank participated in landmark Turkish infrastructure financing transactions including the world’s longest suspension bridge in Canakkale and the refinancing of capital Ankara’s Airport in the last two years.\nAs part of Deutsche Bank’s global transformation announced in July this year, the Corporate Bank and Investment Bank will both continue to support the Turkish economy by offering lending and trade finance facilities to leading Turkish institutions and corporates and for key infrastructure projects. The bank will also continue to enable access to similar facilities for the numerous subsidiaries of German and other international companies based in Turkey.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}