{
    "url": "https://www.db.com/news/detail/20191125-deutsche-bank-wealth-management-makes-strategic-hires-to-build-out-its-global-south-asia-team?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 25, 2019",
    "tags": [
        "Company",
        "Corporate products",
        "Wealth"
    ],
    "title": "Deutsche Bank Wealth Management makes strategic hires to build out its Global South Asia team",
    "body": "Deutsche Bank Wealth Management (DB WM) has made a number of senior strategic hires this year to its Global South Asia (GSA) team, notably in Dubai and Mumbai, as well as completing a lateral move for a senior manager in Singapore. In addition to 21 new relationship and investment managers who have joined Wealth Management’s GSA teams in Dubai, India, Singapore and London this year, with a further four to join in 2020, these latest hires bring the total number of client-facing bankers in the GSA team to more than 80, of which a quarter are based in India.\nAchal Aroura joined last month as group head of the GSA team based in Dubai. Aroura has worked in the financial industry for over 20 years, primarily in the UAE and India. He was previously a senior client advisor and group head Middle East and Africa for the non-resident Indian (NRI) business at Julius Baer. In his new role, Aroura reports to Amrit Singh, Head of Wealth Management GSA.\nFor onshore India, Deutsche Bank Wealth Management has hired Mayank Khemka as Head of Discretionary Portfolio Management (DPM) and Chief Investment Officer (CIO) for Wealth Management in India, effective November 22. Based in Mumbai, Khemka will report to Atinkumar Saha, Head of WM India, and Christian Nolting, Global Head of DPM and WM CIO. He has over 25 years of experience in Indian capital markets, having joined from Credit Suisse, where he spent nine years as Head of Investment Management, India, managing discretionary portfolios across asset classes.\nAs part of Deutsche Bank Wealth Management’s efforts to create a seamless investment management proposition for all clients across all GSA locations, the bank has also appointed Akshay Prasad as Head of Investment Management for GSA, moving from his previous role as Deutsche Bank’s Head of Capital Markets for Emerging Markets. Still based in Singapore, Prasad will report to Amrit Singh and Bobby Abraham, Regional Head of Institutional Wealth Partners (IWP) in Emerging Markets, and will oversee all of the team’s investment managers and FX advisors. His new role will be effective January 1, 2020.\nAmrit Singh, Head of Wealth Management GSA, said, “We are delighted to welcome our new senior managers and all the new relationship and investment managers to their new roles. The hires reflect Deutsche Bank Wealth Management’s ongoing commitment to invest in people, technology, advisory and investment solutions. They underscore our ambition to grow our client franchise in one of the world’s fastest growing regions where wealth creation and entrepreneurial activity are enjoying strong tailwinds.”\nThe appointments are part of Deutsche Bank Wealth Management’s drive to hire 300 relationship managers and investment managers globally by 2021, with its Emerging Markets region, which includes Asia Pacific, the Middle East and Africa, identified as an attractive area of growth.\nThe Global South Asia business has established itself as one of the market leaders in serving non-resident Indian (NRI) clients, and other clients from the sub-continent, enjoying very strong business momentum across its centres in Singapore, Hong Kong, Dubai, Geneva and London.\n  For further information, please contact:\nDeutsche Bank AG Media Relations\nYves Kaufmann Lobato, Zurich\nPhone: +41 (0)44 224 58 64\nMobile: +41 (0)76 825 97 38\nE-Mail: yves.kaufmann-lobato@db.com\nMohanad Nahas, Dubai\nPhone: +971(4)3611-754\nMobile: +971 50 6529 445\nE-Mail: mohanad.nahas@db.com\n\n\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nWith client assets of more than EUR 215 billion (as of September 30, 2019), Deutsche Bank’s Wealth Management business is one of the largest wealth managers worldwide. It offers high-net-worth (HNW) and ultra-high net-worth (UHNW) clients a broad range of traditional and alternative investment solutions, as well as comprehensive advice on all aspects of Wealth Management.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}