{
    "url": "https://www.db.com/news/detail/20191122-fsb-reduces-g-sib-capital-buffer-requirement-for-deutsche-bank?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 22, 2019",
    "tags": [
        "Company",
        "Investment Banking",
        "Research",
        "Strategy"
    ],
    "title": "FSB reduces G-SIB capital buffer requirement for Deutsche Bank",
    "body": "Deutsche Bank has been allocated to a lower bucket in the 2019 list of Global Systemically Important Banks (G-SIBs) which was published today by the Financial Stability Board (FSB). Deutsche Bank is the only one of 30 G-SIBs allocated a lower risk bucket in the FSB’S 2019 classification.\nIn the 2019 exercise, the FSB has assessed Deutsche Bank to be less systemically risky in each of the five relevant categories: size; cross-jurisdictional activity; interconnectedness; substitutability, and complexity.\nThis was primarily driven by reductions in leverage, strategic adjustments in the bank’s business and geographic perimeter and lower derivative volumes, together with wider industry developments.\nConsequently, the FSB has reduced Deutsche Bank’s additional capital buffer requirement relating to its G-SIB status from 2.0% to 1.5%. The reduction will become effective after corresponding notification by BaFin.\nHowever, given Deutsche Bank’s position in its home market, Deutsche Bank’s capital buffer as a Domestic Systemically Important Bank (D-SIB) is currently set at 2.0%, and thus the bank’s overall capital buffer requirement is currently expected to remain unchanged.\nAdditionally, the FSB’s 2019 assessment implies a reduction in the bank’s prospective leverage ratio requirement from 4.0% to 3.75% from 1st January 2022, when a G-SIB add-on to leverage ratios will become a legal requirement.\nThe FSB’s 2019 G-SIB classification is based on data as at 31 December 2018. As a result, Deutsche Bank’s scores in this assessment do not yet reflect progress made during 2019 in reducing non-strategic assets by the bank’s Capital Release Unit as part of Deutsche Bank’s transformation strategy.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}