{
    "url": "https://www.db.com/news/detail/20191121-the-s-in-esg?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 21, 2019",
    "tags": [
        "Sustainability"
    ],
    "title": "The \"S\" in ESG",
    "body": "In this new report, Wealth Management aims to place social considerations into the spotlight of public awareness – to give them the visibility they deserve.\nEnvironmental, social and governance (ESG) issues concern us all. The importance of the social dimension for investors has only started to become apparent quite recently. However, public awareness is catching up. Investors are starting to realise that non-financial considerations, such as social metrics, have a measurable financial impact on investments. In addition, it is not uncommon to hear companies talk about their concern for employees and stakeholders. Companies that demonstrate a positive social contribution may be able to command premium pricing for their products and premium valuations for their shares. The guest contribution by Università Cattolica del Sacro Cuore Milan confirms that only the social pillar significantly reduces systematic, idiosyncratic and total firm risk by taking the relative impact of each ESG sub-index into consideration.\nSocial criteria goes mainstream and becomes an integral part of informed investment decisions. Thereby, more sophisticated measurement and reporting methodologies of social criteria are bound to highlight the manifold ways in which social matters are intertwined with financial return. Naturally, some of the milestones in “S” investing will have a positive impact on “E” and “G”.\nThe CIO argues that it is in the self-interest of the investor to embrace companies that deliver social benefits, if they provide superior returns. One important factor can be diversity. Diversity has benefits on society that have been severely under-appreciated so far, but as importantly, diversity has benefits on business and on the investment landscape that make it a key factor for investors to take into consideration. Applying the “S” in ESG to business and investment decisions will lead to a change in business models, with the consequence, that traditional business models may no longer work, which will impact those enterprises that fail to adapt. This is also important from a portfolio diversification perspective.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}