{
    "url": "https://www.db.com/news/detail/20191119-al-gore-tells-millennial-clients-that-sustainability-is-biggest-investment-opportunity-in-history?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 19, 2019",
    "tags": [
        "Sustainability"
    ],
    "title": "Al Gore tells millennial clients that sustainability is \"biggest investment opportunity in history\"",
    "body": "Combating climate change is not just a “your generation’s life or death struggle” but also “the single biggest investment opportunity in history,” Al Gore, the former US Vice President and Nobel Prize-winning environmentalist, told millennial clients in San Francisco last week.\nInvestors who take a long-term approach and invest in sustainable food, health, energy and mobility technology can enhance returns while helping to restore the natural balance of the planet, Gore said at the fourth annual Deutsche Bank Wealth Management Next Generation Innovation Summit.\nHowever, those that solely pursue short-term shareholder returns at the expense of wider environmental and social costs, depletion of natural resources and inequalities of incomes and wealth risk being left behind, he said. Unsustainable companies are in danger of losing their licence to operate or are part of a “subprime carbon bubble” with inflated valuations based on outmoded fossil-fuel assets.\n“The sustainability revolution has the magnitude of the agricultural and industrial revolutions but the speed of the digital revolution,” Gore said. “This is the battle of your lifetimes -- but we can turn the corner in the next 10 to 15 years and the assets you control can make a huge difference.\"\nSustainability was the core theme of the three-day event, organised in partnership with Stanford University, which introduces young clients to some of the world’s leading technology entrepreneurs, academics and venture capitalists. The speakers included Dan Goldin, the longest-serving Administrator of NASA, Mark Hawkins, President and Chief Financial Officer of Salesforce, Brian Sheth, Co-Founder and President of Vista Equity Partners, and Murat Sonmez, Managing Director of the World Economic Forum’s Centre for the Fourth Industrial Revolution.\n  Christiana Riley, Al Gore and Salman Mahdi\n“Sustainability has never been more central to our NextGen Innovation Summit, driven by a generation that is aware of its responsibility and understands that it can add purpose to performance,” Christiana Riley, CEO of Deutsche Bank in the Americas, said at the event. “Environmental, social and governance (ESG) analysis, guidance and investments are rapidly becoming not just an important component of what we offer our clients – they’re the essential foundation.”\nGore, who is also the co-founder and chairman of Generation Investment Management and the founder and chairman of The Climate Reality Project, presented a “climate crisis that is way worse than most people think,” peppered with statistics and images of recent forest fires, “rain bombs” and “flash droughts”.\nHowever, he also showed how dramatic advances in the productivity and cost-effectiveness of technologies such as solar power are already threatening to render obsolete fuel sources such as coal, particularly in developing countries that can leapfrog nations with existing infrastructures. The key is rapid adoption.\n“We have to avoid unrealistic technological optimism,” Gore said. “There’s a temptation to believe that the innovation fairy will come in and wave her wand. We have to take what we already know is going to work and move ahead aggressively with it.”\nDeutsche Bank Wealth Management's two-decade old Next Generation programme, led by Vice Chairman Salman Mahdi, is intended to build multigenerational relationships with clients and counts more than 500 alumni from its educational summits. Millennial clients are helping drive the focus on environmental, social and governance (ESG) investing, which the business's Chief Investment Office has singled out as one of the long-term strategic themes that will have the biggest impact on the world and on clients’ portfolios.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}