{
    "url": "https://www.db.com/news/detail/20191114-helping-indigenous-boys-achieve-their-goals-in-australia?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 14, 2019",
    "tags": [
        "Corporate Citizenship",
        "Education"
    ],
    "title": "Helping Indigenous boys achieve their goals in Australia",
    "body": "For over 45 years, Deutsche Bank Australia has been helping clients achieve their goals and now through its partnership with the Clontarf Foundation the bank is proud to be helping young Indigenous boys in Australia achieve theirs.\n\nDeutsche Bank began working with Clontarf two years ago as part of its Born to Be programme which seeks to help young people reach their full potential. The Foundation ”exists is to improve not only the education but the self-discipline and employment prospects of Aboriginal and Torres Strait Islander boys and by doing so equips them to participate meaningfully in society.”\nLike Deutsche Bank, Clontarf believes that lack of opportunity coupled with a position of disadvantage can have serious consequences. Unfortunately, this is true of young Indigenous men in Australia who are over-represented in Australia’s youth detention system and have the highest suicide rate in the world.\nDeutsche Bank Australia CEO Anthony Miller says: “An investment in Clontarf is an investment in Australia’s future because without their programmes many of the boys would never get an opportunity to succeed in life.”\nThe Clontarf programme is delivered through a series of academies established in partnership with local schools. The academies use the boys’ love of sport as the engagement mechanism to attract them to school and in turn improve their school attendance.\nIts approach has proven to be very successful. KPIs include retention, attendance rates, average cost per boy, Year 12 (final school year) completion and employment. Since it began 20 years ago, Clontarf has helped more than 3,000 boys complete Year 12 and find employment. 2018 was a record year. And what started in 2000 with one academy, two staff and 25 boys in a remote part of Western Australia has grown to 116 academies, 428 staff and 8,000 boys.\nDeutsche Bank was thrilled to fund the 100th academy (alongside government) in New South Wales which opened in January 2019. The academy is 14kms from the bank’s Sydney offices and caters for 50 boys from the local area. Beyond financial support, employees in Australia are actively involved and engaged in the cause. This year, 20 percent of Australian employees have volunteered and many more have taken part in fundraising activities. Some have also been fortunate enough to see the amazing work of Clontarf in remote communities around Darwin, Katherine, Arnhem Land and Broome.\n“My trip to Darwin was an eye-opening experience with regards to some of the boys’ circumstances. The work that the Foundation does is phenomenal. I’m very proud that Deutsche Bank has chosen to partner with Clontarf and hope it continues into the future.”\n“I am incredibly grateful to Deutsche Bank for affording me the time and opportunity to take part in something which is so different to our day jobs. It is encouraging to see Deutsche Bank’s support of not only an incredible charity but also the personal development of two junior employees.”\nWhere to from here? Clontarf is aiming to have 10,500 boys enrolled in its programmes by 2020 and we want to be part of that important journey. The partnership with Clontarf Foundation is part of Deutsche Bank’s Born to Be youth engagement programme, one of the strategic CSR pillars. It is made up of over 180 education-led projects, all of which demonstrate the bank’s commitment to addressing the social issues around young people’s potential and unemployment across the globe.\nLareena Hilton, Global Head of Brand Communications and Corporate Social Responsibility, at Deutsche Bank said: “We are incredibly proud that since 2014, Born to Be has provided close to 4.5 million young people with education opportunities. Now active in 29 countries, our Born to Be programme continues to have a positive impact in every region. We look forward to seeing this grow further and we are close to reaching our target of helping change the lives of 5 million young people by 2020.”\n\nFind out more about Born to Be’s global impact, read other personal life-changing stories and watch our film here: www.db.com/lifechanger\n\nFollow Born to Be on Facebook and Twitter:\n@dbborntobe\n#PositiveImpact\n#lifechanger",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}