{
    "url": "https://www.db.com/news/detail/20191112-the-responsible-use-of-ai-in-financial-services-from-principles-to-practice?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 12, 2019",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "The responsible use of AI in Financial services",
    "body": "Artificial Intelligence (AI) has the potential to unlock innovation, increase efficiency and improve the customer experience. But as well as the opportunities it opens up, how do we ensure AI is applied responsibly in financial services? This is the question at the heart of a new white paper released this week in Singapore, designed to guide the ethical use of AI in the sector and highlight what financial organisations, technology companies and regulators need to think about as adoption of this powerful technology grows.\n“AI developments are focused on making the technology as autonomously \"intelligent\" as possible, but with growing awareness of AI’s potential implications, we also need to ensure that it is understood and that trust in it is maintained,” said Chris Bezuidenhout, Deutsche Bank’s APAC CIO and project sponsor for the Deutsche Bank team in the study.\nCommenting on one of the paper’s key recommendations that a core set of principles for responsible AI should be applied globally, explained Boon-Hiong Chan, Global Head of Market Advocacy, Securities Services and project lead: “As AI develops further, we need to have a continuous dialogue with regulators, across the industry and with clients on how it can be applied ethically and responsibly across the board. This will help mitigate the potential complexity that would arise from multiple standards and interpretation globally and ultimately lead to better outcomes for clients.”\nAbout the study\nThe paper applies Singapore’s regulatory ethical and responsible AI guidance in three specific use cases across a variety of contexts:\nEnhancing customer experience – Predict consumer travel behaviour as a basis for travel related marketing\nEmpowering employees to make data-driven insights – Automate verification of wet ink signatures\nStreamlining regulatory compliance - Generate insights and support decision-making for KYC Compliance-related processes\nDeutsche Bank collaborated with Microsoft, Linklaters, Standard Chartered and Visa on the study. The working group engaged closely with the Monetary Authority of Singapore (MAS) and Singapore’s Personal Data Protection Commission (PDPC) throughout.\nRead the white paper: https://aka.ms/fromprinciplestopractice\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}