{
    "url": "https://www.db.com/news/detail/20191108-deutsche-bank-s-role-after-the-fall-of-the-berlin-wall-30-years-ago?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 8, 2019",
    "tags": [
        "Company",
        "History",
        "Investment Banking"
    ],
    "title": "Deutsche Bank's role after the fall of the Berlin Wall",
    "body": "The fall of the Berlin Wall on November 9, 1989 came as a surprise not only to the whole of the Western world but also to Deutsche Bank. At the time the bank had a mere ten employees with specialist knowledge about the East German economy. But then overnight came the opening-up not only of a border, but also of a market.\nOver 16 million East German citizens were expecting not only political changes; the yearning to experience Western standards of living was just as pronounced. “Who would ever have thought that...” – this phrase was uttered so often as people struggled to comprehend the breakneck speed of the changes occurring in those days and months.\nDeutsche Bank Management Board Spokesman Alfred Herrhausen already had a clear sense as soon as the Wall fell that German unification was in the offing: “The opening of the Wall has raised the question of German reunification.\nPreferably, we should speak about unification. In my opinion, a single, united German state is clearly desirable, not because of the attraction of sheer size or any power that size might confer, but because - historically, culturally and in human terms - it is a natural aspiration.” This was the message that he wanted to share in a speech scheduled for early December 1989. His assassination on November 30 prevented this; Herrhausen’s thoughts on the falling of the Berlin Wall were\nPDF\npublished posthumously.\nLess than eight months passed between the falling of the Wall and the currency union on July 1, 1990 – when thousands of people gathered in front of Deutsche Bank’s East Berlin branch on Alexanderplatz wanting to be the first to get their hands on deutschmarks. And on October 3, 1990, less than a year later, Germany was unified.\nQueueing for the so-called “welcome money” outside a Deutsche Bank branch in Berlin’s Kreuzberg district in late 1989\nBack in November 1989 it was East German citizens who first came to Deutsche Bank in the West and not the other way round. By the end of 1989 just the Berlin branches of Deutsche Bank had handed out 62 million deutschmarks of “welcome money” to East German citizens (see below for more information).\nIn the first days after the Wall fell, paying out this money proved to be haphazard. The word spread that Deutsche Bank had decided to pay out welcome money on Sunday, November 12. As a result, queues began to form at 2 o’clock in the morning as people waited, for example in West Berlin's Rudow district, for the Deutsche Bank branch to open. When the counters closed that evening half a million deutschmarks had been paid out at this branch alone.\nFrom mid-December 1989 Deutsche Bank started to make specific preparations for setting up business in East Germany. It set up an “East Germany Working Group” chaired by Management Board member Georg Krupp that focused on planning and developing business operations in East Germany. It also coordinated the measures to be taken. Members of the working group made their first exploratory visits to East Berlin, Leipzig and Dresden in the final few days before Christmas.\nSince conducting actual banking business was not yet permitted Deutsche Bank initially regarded its main purpose as providing information and advice, sending teams of employees to East Germany who started working at the end of January 1990. They established contact with large East German industrial firms and conglomerates and explained how the market economy operates – there was a huge need for advice.\nThe turbulent period of political and economic upheaval, during which conditions changed on a daily basis, is without precedent in the bank's history. With remarkable energy and drive, Deutsche Bank's employees set about establishing business operations together with their new colleagues from the East German banking sector. For many of those involved in this effort, this is one of the most significant phases of their careers – all the more so because of the many obstacles they overcame together.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 3
}