{
    "url": "https://www.db.com/news/detail/20191108-investors-need-to-prepare-for-bumps-ahead?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 8, 2019",
    "tags": [
        "Company",
        "Corporate products",
        "Wealth"
    ],
    "title": "Investors need to prepare for \"bumps ahead\"",
    "body": "Global debt levels are rising and investors need to be prepared to reassess their portfolios to prosper in a sustained low-yield environment, according to the latest Deutsche Bank Wealth Management Chief Investment Office (CIO) Insights Special – Peak Debt.\nInvestors should reconsider risk and investment time horizons amid fears about the direction and side-effects of current monetary policy, Chief Investment Officer Christian Nolting wrote in the report, which looks at historical debt trends, the policy implications of rising debt and possible investment responses.\nRather than waiting for higher or positive returns in high grade bonds, investors should instead see their merits as diversifiers – and look for yield elsewhere, he suggested. The case for real assets remains, with equity investments potentially offering a range of benefits, albeit with implications for risk and potential rewards.\n“High and increasing levels of debt are likely to remain the reality for many years to come,” Nolting said. “The message remains, whatever you do, to be prepared. Historical lessons on debt and debt management suggest there will be bumps ahead.”\nThere also appears to have been a shift of sentiment towards debt, according to the report. In recent years there has been a particularly rapid rise in overall debt levels and, in some economies, private debt becoming public debt.\n“Lower interest rates and thus debt servicing costs over the last decade could have been used to reduce debt,” he wrote. However, “human nature being what it is, they have encouraged many to increase borrowing.”\nDownload the report via the link in the right navigation.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}