{
    "url": "https://www.db.com/news/detail/20191106-wealth-management-wins-best-private-bank-in-germany-award-from-ft-s-pwm-the-banker?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 6, 2019",
    "tags": [
        "Awards",
        "Company",
        "Corporate products",
        "Wealth"
    ],
    "title": "Wealth Management wins Best Private Bank in Germany award from FT's PWM/The Banker",
    "body": "Deutsche Bank Wealth Management won \"Best Private Bank in Germany\" in this year's Global Private Banking Awards from PWM/The Banker, part of the Financial Times group.\nClaudio de Sanctis, incoming Global Head of WM, congratulated colleagues in Germany, saying the award is important external recognition that they are building a safer, more efficient and even more client-focused business.\nThe award was presented at a ceremony in London and accepted by Martin Renker (right in the picture below) on October 31. It was judged by an expert panel of 15 industry professionals based on a qualitative and quantitative pitch document.\nWM is the market leader in Germany where the business has the largest coverage team dedicated to U/HNW clients serving established wealthy families and entrepreneurs. In December 2018 the global coverage structure was revised, bringing Europe and Germany into one market region, underpinned by investment in more than 100 front-office hires in the region now underway.\n  \"Our home market Germany is one of the world’s key wealth hubs and we want to further expand our position here. We already service over 40% of the wealthiest 750 German clients worldwide and this client segment is seeing the fastest growth,” de Sanctis said.\nHe added: “We can offer them international capabilities and connect them with Deutsche Bank’s Corporate Bank and Investment Bank to serve their private and corporate needs on both sides of the balance sheet.”\nLast year's German award winner Berenberg was “Highly Commended”. Citi Private Bank won Best Global Private Bank while the Best Private Bank in Europe was Pictet.\nTo read PWM's article on national winners in Western and Northern Europe including Deutsche Bank, with quotes from outgoing Global Head of WM Fabrizio Campelli, visit PWMNet (free registration).",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 57
}