{
    "url": "https://www.db.com/news/detail/20210218-deutsche-bank-launches-state-of-the-art-payments-platform-through-2c2p-in-thailand?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "February 18, 2021",
    "tags": [
        "Corporate products"
    ],
    "title": "Deutsche Bank launches state-of-the-art payments platform through 2C2P in Thailand",
    "body": "Deutsche Bank today announced the launch of a state-of-the-art payments platform for its clients in Thailand to facilitate local collections through Southeast Asia’s leading payments platform provider, 2C2P.\nThrough 2C2P’s platform, the bank’s corporate clients in Thailand will be able to maximise their business potential by collecting funds more efficiently and conveniently through an extensive range of online banking and non-banking channels, including internet and mobile banking, ATM and branches, as well as mobile payment options such as True Money, LINE Pay, Alipay, WeChat Pay and PromptPay. Deutsche Bank’s corporate clients can also utilise 2C2P’s diverse payment features such as instalment payments, recurring payments and multi-currency converters to suit the needs of their business models.\nOnce the preferred payment channel is selected, payment orders will be securely processed through 2C2P’s system with real-time data available for corporate clients to monitor and perform post-sales activities. Upon completion of this process, the funds will be directly auto-credited to a Deutsche Bank account. Deutsche Bank’s corporate clients will also benefit from 2C2P’s other services such as card and wallet issuing as well as digital bills aggregation.\n2C2P is a secure and certified payments platform that offers comprehensive payment services in Southeast Asia, ranging from acquiring solutions to issuing solutions. With an impressive alternative payments network reach of more than 400,000 touchpoints across Asia, regional coverage in 10 markets as well as partnerships with over 30 financial institutions worldwide, the payment solution provider has successfully designed and developed solutions for e-commerce and m-commerce businesses with global ambitions and built customised solutions for financial institutions.\nChintan Shah, APAC Head of Corporate Cash Management at Deutsche Bank, said: “This platform addresses emerging client needs in the rapidly changing payment landscape in Thailand and we are confident that by making this new collection tool available to our clients, they will see the direct benefits, notably by being able to boost their business performance through a direct sales model. ASEAN is a key market for us and we are committed to continuing to bring more innovative solutions to our clients in this fast-growing part of the world.”\nPiyachart Ratanaprasartporn, CEO of 2C2P Thailand, added: “We are honoured to work with Deutsche Bank to empower their corporate clients to accept payments digitally, amidst the rising trend of digital payments adoption by consumers. We are confident that our payments expertise and tools will enable businesses to make smarter and quicker decisions as they transition to an online and mobile-first environment.”\nFor further information, please contact:\nKarène Dufour. Deutsche Bank AG Media Relations\nPhone: +852 2203 7846 | E-mail: karene.dufour@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 5
}