{
    "url": "https://www.db.com/news/detail/20210216-bank-appoints-sven-afhueppe-as-global-head-of-political-affairs?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "February 16, 2021",
    "tags": [
        "Company"
    ],
    "title": "Bank appoints Sven Afhüppe as Global Head of Political Affairs",
    "body": "In a move to strengthen dialogue with the political sphere, Deutsche Bank is appointing Sven Afhüppe as Global Head of Political Affairs, a newly created position he will assume on March 1. The long-time financial journalist and former editor-in-chief of Handelsblatt will be based in Berlin and report to the CEO Christian Sewing.\n“With Sven Afhüppe’s appointment, we are gaining a respected expert for the political and the financial landscape”, said Sewing. “With his experience and network, he is well-placed to further expand our links to Berlin, Brussels and Washington and strengthen our global network.”\nAfhüppe is to continue the successful work of the team responsible for managing Deutsche Bank’s relationships with political stakeholders. In this capacity, he will work closely with Christian Berendes, currently Global Head of Government & Regulatory Affairs, who will focus more on regulatory topics in the future. Furthermore, on March 1, Berendes will also become Chief Operating Officer for the area of responsibility of Stefan Simon, Member of the Management Board and Chief Administrative Officer.\nAfhüppe has a degree in Economics and worked for more than ten years as a political correspondent for the publications Wirtschaftswoche, Der Spiegel and Handelsblatt in Berlin, where he reported intensively on financial and economic policy. In 2011, he became deputy editor-in-chief of Handelsblatt in Düsseldorf. At the beginning of 2015, Afhüppe was appointed co-editor-in-chief of Handelsblatt, a year later becoming sole editor-in-chief. He was responsible for the successful digital transformation of the publication. He left Handelsblatt at the end of 2020.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 11
}