{
    "url": "https://www.db.com/news/detail/20210212-merkel-working-together-to-revitalise-germany?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 12, 2021",
    "tags": [
        "Company"
    ],
    "title": "Merkel: “Working together to revitalise Germany”",
    "body": "German Chancellor Angela Merkel underscored the important role of the financial sector in the fight against the Covid pandemic at Deutsche Bank's first ever virtual New Year's reception, which attracted more than 7,000 clients, friends and employees of Deutsche Bank. In a video greeting Merkel said, “Along with state aid, support from the financial sector has been extremely important. Our export-oriented economy needs appropriate regional and international financial services”, she continued, adding that a crisis-proof and competitive financial sector is fundamentally important for the national economy.\nMerkel said that she was, of course, aware of the challenges facing the banking industry, but she is confident that, together, policymakers and businesses will succeed in quickly restoring Germany's innovative strength and helping the nation return to strong growth rates after the pandemic.\nIn his speech, Christian Sewing emphasised that he took the Chancellor's entreaty very seriously. “We at Deutsche Bank promise you that we will continue playing our part in ensuring that people and companies make it through this challenging period as unscathed as possible – and that in some respects Germany can emerge from the crisis in even better shape, if we lay the right foundations now,” said the CEO. “Especially now, in this phase of upheaval, we want to continue to stand shoulder to shoulder with our clients”, he added. “During challenging times especially, there is a huge need for action and consultation. The same is true of politicians with whom we are in ongoing dialogue, which we also wish to maintain.”\nIn a conversation with Sewing moderated by our Global Head of Communications & CSR Jörg Eigendorf, German Minister for Economic Affairs Peter Altmaier said the Covid pandemic is making great demands of citizens, companies and politicians. “We must make sure that today's loosened restrictions are not followed in four weeks by the next lockdown,” he said, referring to recent decisions by the federal and state governments regarding lockdown restrictions. “The consensus is greater than it was in November”, he added. Altmaier, who joined the event via video from Berlin also praised the successful restructuring of Deutsche Bank, saying, “We need a strong international bank. I would like to thank Deutsche Bank for putting itself through an extensive course of restructuring – it has strengthened trust. I’m glad that you’re successful.”\nAt the start of the event, President Karl von Rohr underscored the progress the bank has made along its transformation path. “The past year has been an exhausting time for us, but also one in which – I believe – we were able to prove once again how relevant we are.” According to surveys, customer confidence in Deutsche Bank in Germany is higher than it has been in eight years. ”Above all,” von Rohr said “that's praise for our employees”.\nIn keeping with the fact that many clients especially value Deutsche Bank's global perspective, Management Board members Christiana Riley, CEO Americas, and Alexander von zur Mühlen, CEO Asia Pacific, offered insights into their regions in a conversation with Anke Hallmann, Deputy Head of Communications & CSR. “Even though we are happy about Joe Biden's election, we have to understand that the new US president will first and foremost be concerned with the tense domestic political situation,” said Riley. Alexander von zur Mühlen said he expected more diplomatic skill in international trade policy again. Still, he added, relations between the United States and China are likely to remain tense for years to come. “Europe must find its own inclusive approach somewhere in between,” he advised.\nBChancellor Merkel also took the New Year's reception as an opportunity to congratulate Deutsche Bank on its 151st anniversary, after last year's 150 years anniversary celebration had to be cancelled. “Deutsche Bank has endured and survived all the upheavals of recent German history. That is cause for optimism”, she said. “In this spirit, I wish Deutsche Bank a bright future.”\nClick here for a full-length recording of the virtual New Year's reception. The \nPDF\ntranscript of Christian Sewing's speech can be found here.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 15
}