{
    "url": "https://www.db.com/news/detail/20210211-as-renminbi-strengthens-so-does-deutsche-bank-s-rmb-franchise?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 11, 2021",
    "tags": [
        "Capital markets"
    ],
    "title": "As Renminbi strengthens, so does Deutsche Bank’s RMB franchise",
    "body": "This Lunar New Year should be different for China’s Renminbi (RMB), with Deutsche Bank’s FX strategists predicting the currency will remain strong (perhaps like the Ox) against the US dollar through February.\nRMB FX strategist Perry Kojodjojo says, “RMB this February is likely to go against a pre-Covid seasonality trend, which typically sees the RMB rally in January but pullback in February. This could reflect institutions drawing down dollar deposits to meet liquidity demand ahead of the Lunar new year while February reverses due to outbound tourism.”\n“So far this year the RMB has continued to strengthen, backed by China’s V-shaped recovery and policy wind back,” he said.\nDeutsche Bank strategists forecast the RMB, also known as the Chinese Yuan (CNY), to hit 6.2 by year end, appreciating against the US dollar.\nLate in 2020, when the RMB was performing like a safe haven currency, Deutsche Bank recorded significant trading volume increases in the RMB with EM currency crosses.   \nHead of Global Markets Greater China, Jerry Li said, “Our unique RMB hub and spoke setup is enabling more and more clients to trade onshore CNY from offshore.  In Q4 2020, the cross border RMB volumes we facilitated for corporate clients rose 70%, quarter-on-quarter.\nAs RMB trading has increased, so has Deutsche Bank’s market share. “During Covid volatility last April, we were one of the few foreign banks that continued to provide liquidity and pricing, when liquidity was only 20%-40% compared to normal markets,” Li added.\nRecognising the bank’s RMB franchise strength, last year the China Foreign Exchange Trading System (CFETS), the official FX platform affiliated to the People’s Bank of China (PBOC), named Deutsche Bank China Best Foreign Currency Bank 2020. \nRMB gone global\nChina and the RMB’s internationalization has been a long-term strategic focus for Deutsche Bank’s FIC business and in 2019 the bank was named RMB House of the Year by Asia Risk (Risk.Net).\nHead of Global Emerging Markets Sameen Farooqui said, “Standing apart from competitors, we created a dedicated RMB team under Global Emerging Markets. This global team of traders and sales people - in Shanghai, Singapore, Hong Kong, New York and London - enables 24/5 follow-the-sun RMB trading and coverage.”\n“In addition to quoting RMB in these hubs, we now quote RMB crosses in the country of client domicile using our network of onshore ‘pipes’.  For example, we quote RMB / Ringgit in Malaysia,” Farooqui added.\nInvested in RMB\nThe bank has expanded its global CNY sales and trading through the years, and this accelerated in 2019  when the PBOC approved use of Deutsche Bank’s Hong Kong branch as the central hub to offer cross border RMB spot and FX derivatives through any of the bank’s branches worldwide.\nThis was a first-of-its kind solution allowing clients of any Deutsche Bank branch in the world to trade onshore USD / CNY spot and hedging solutions.\n“Last May we executed the first onshore Chinese Yuan electronic deal via our e-trading Autobahn platform, representing the next step towards 24/5 CNY-electronic streaming capability,” Li added. \nDeutsche Bank’s hub and spoke model makes China FX and hedge solutions much more accessible for Deutsche Bank’s corporate clients, especially in Europe and the U.S, Latin America, Africa and the Middle East. \nRMB options growth\nHead of ICG APAC (ex Japan) and GEM coverage David Beale said, “Last year we saw client demand for CNY options nearly double in Asia, as well as significant growth in demand from clients across Europe and North America.  This momentum has continued unabated into 2021 with another strong month of CNY option activity during the month of January which looks set to continue as the investor interest in China markets more broadly accelerates.\nThe huge leap in interest for CNY options in 2019 is attributed to China’s bond inclusion in the Bloomberg Global Aggregate bond indices, which represented the single largest re-balancing in this index’s history.\nDeutsche Bank strategists estimate offshore investors held about 2.9% of China’s domestic bond market at the end of 2020, up from 2.3% in 2019.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 6
}