{
    "url": "https://www.db.com/news/detail/20210204-a-message-from-christian-sewing-on-our-full-year-results-2020?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 4, 2021",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "A message from Christian Sewing on our full-year results 2020",
    "body": "Dear Colleagues,\nPresenting our results for 2020 today, we look back on a year that confronted the world with health, social and economic challenges that we could have hardly imagined 12 months ago. And there were some people who warned that this was bad timing for Deutsche Bank as we faced these challenges in the middle of a fundamental transformation which already called for a huge effort.\nBut we have mastered these twin challenges – thanks to our new strategy and, above all, to your great dedication to our bank. We are ahead of plan with our transformation. We have achieved all of our strategic objectives over the past year. And we are profitable – with a pre-tax profit of more than 1 billion euros and net profit of 624 million euros. In other words: we have been able to more than offset the significant strains of the pandemic and our transformation, thanks to strong results in our business.\nIn 2020 we increased our revenues by 4 percent at Group level and by 6 percent in our Core Bank. Two factors drove this: we are focusing on what we are good at and we are relevant to our clients. That’s what we have demonstrated in this crisis – whether for companies that needed liquidity in the short term, or for private clients who wanted to secure their assets or needed flexibility on their loans.\nI am particularly pleased that we are leveraging our strengths in all businesses. At the moment, the focus may be on the successes and growth of our Investment Bank. But we should not overlook what our Private Bank and Corporate Bank have achieved. In a challenging environment, with historically low interest rates, our teams managed to keep revenues stable and to deliver in line with our plans in both areas. This is a remarkable accomplishment.\nWe have shown how flexible and reliable we are in all of our businesses:\nIn our Private Bank, we were able to offset low interest rates by, among other things, increasing fee income – thanks to net inflows of 16 billion euros into investment products, including 5 billion euros transferred from existing deposits. This included benefits from selectively recruiting client advisers in our International Private Bank. We also achieved net new client loan growth of 13 billion euros. New mortgages for energy-efficient homes totaled 4 billion euros, an increase of almost 30 percent year-on-year. We also expanded our digital offerings: in 2020, for example, the number of users and logins for the German private banking business mobile app both jumped about 35 percent.\nIn our Corporate Bank we largely offset interest rate headwinds through deposit repricing, which covered almost 80 billion euros of deposits at year-end. And we are making progress in our growth areas: in Asia-Pacific, we increased revenues by 4 percent; and global payment volumes with our fintech, ecommerce and platform clients grew by 20 percent. At the same time, we have done a great deal to help companies through the COVID-19 crisis – for example, we managed applications for more than 12 billion euros of government-sponsored loans in Germany and answered more than 250,000 inquiries to our Coronavirus Helpdesk.\nOur Investment Bank increased its revenues last year by a third. The key drivers were the enormous financing needs of many companies and sovereigns and the corresponding market activity – and the fact that we are ideally positioned to support our clients in such an environment. In Debt Capital Markets, Deutsche Bank helped clients raise a record 1.7 trillion euros, up 43 percent year-on-year. We outperformed the market in all four quarters in our Origination & Advisory business. In Fixed Income & Currencies (FIC), we achieved double-digit revenue growth in every quarter; full year revenues were up 28 percent. In FIC we also gained market share against our US peers in the second half of the year. Many of our key clients are re-engaging and doing much more business with us. All of this makes us confident that a substantial portion of our revenue performance will prove sustainable – even if markets are set to normalise somewhat this year. A very good start to the new year has also fully reinforced our confidence in our business.\nWe also had a successful year in Asset Management. Assets under management rose to 793 billion euros, the highest in almost six years. This was mainly due to net inflows of 30 billion euros. And almost a third of this went into sustainable investment products – making us particularly well positioned in this growing area. Overall, DWS managed to keep management fees broadly stable despite the margin pressure in the industry - and to improve its adjusted cost-income ratio significantly to just 64 percent.\nThanks to your discipline, we have made further progress on costs throughout our bank, achieving our target of reducing adjusted costs to 19.5 billion euros last year (excluding transformation costs and reimbursable Prime Finance expenses). Therefore, our cost base was almost 4.5 billion euros lower than in 2017. We have reduced adjusted costs ex-transformation charges and bank levies year-on-year for twelve consecutive quarters.\nTo achieve our 2022 target, we must now cut another 2.8 billion euros in adjusted costs. Of course, this requires further effort. However, given our track record on costs we are very confident that we will continue to meet our cost targets in future. At the same time, we continue to strengthen our controls – we have spent around 2 billion euros in this area over the last two years.\nCredit loss provisions increased, as expected, accounting for 1.8 billion euros for the full year, in line with the guidance we gave as early as April. Our Common Equity Tier 1 (CET1) ratio of 13.6 percent at year-end was higher than expected. This was partly due to regulatory changes in the coronavirus crisis, and partly because our Capital Release Unit was able to reduce its risk-weighted assets faster than planned – and at a lower cost than expected. We therefore continue to have the financial strength to be a reliable partner for our clients.\nThese results reflect our successful efforts over the last six quarters and in 2020 in particular. We in the Management Board and in the Group Management Committee cannot thank you enough for this.\nIt is particularly important that we also fundamentally changed the way we work. Our results would not have been possible if we had not put our clients further at the centre of our strategy and activities. There is still a lot to be done, but we have made good progress. In our home market, clients’ trust in our brand has reached the highest level in eight years.\nWe are also making great strides in technology that strengthens our controls and client offering. The partnership with Google is a paradigm shift in this regard. And we made progress in our leadership culture, which in turn is reflected in significant positive feedback from you. Four out of five colleagues around the world support our strategy and nine out of ten believe that we will manage the crisis well.\nAnother priority is making progress on sustainability. We can be proud of what we have achieved in the past 12 months. In May we set our target for 2025 of 200 billion euros in financing and assets under management which meet strict environmental, social and governance (ESG) standards. And we exceeded our 2020 target – 20 billion euros – by more than 100 percent. What a start!\nSo we're really on track: 18 months after the announcement of our new strategy, we have completed the most intense transformation phase and we can now focus even more on our business. After these six quarters, we have already accounted for 85 percent of the transformation-related effects that we expected for the period up to 2022. The third phase of our transformation has begun – a phase in which we will focus on sustainable profitability. This will require growth – while remaining fully disciplined on cost and capital, and working consistently to further strengthen our controls and processes. We know that we still have work to do, but we also know we are on the right track.\nLet’s build on our achievements together and on the new spirit in our bank. Challenges will continue to emerge during 2021, not least because the fight against the pandemic continues. But there are opportunities for us – and they are significant. We are well positioned for an economic environment in which financing demand remains high; wealth preservation and global trade become more complex; and sustainability rapidly gains in importance. The economy is facing major upheavals – and we are being called on to support and help shape its transformation.\nOnce again, thank you for your outstanding efforts in a year in which the pandemic also brought great personal challenges for many of us. Now it is up to us to pursue our path with commitment and passion – the path to a bank that is sustainably profitable and that is even better suited to live up to our responsibility for our clients, the economy and society.\nBest wishes,\nChristian Sewing",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 19
}