{
    "url": "https://www.db.com/news/detail/20210204-deutsche-bank-announces-1-billion-euros-profit-before-tax-in-2020?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "February 4, 2021",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank announces 1 billion euros profit before tax in 2020",
    "body": "Profitable in all four quarters despite impact of transformation and COVID-19\nFull-year net profit of 624 million euros; profit before tax of 1.0 billion euros\nFourth-quarter 2020 net profit of 189 million euros\nSignificant growth in Core Bank profitability in 2020\nProfit before tax of 3.2 billion euros, up six-fold over 2019\nAdjusted profit before tax¹ up 52% to 4.2 billion euros\nFourth quarter profit before tax of 591 million euros versus prior year loss\nRevenue growth continued into the fourth quarter\nFull year 2020 Group net revenues rose 4% to 24.0 billion euros\nFourth quarter Group net revenues grew 2% to 5.5 billion euros\nCore Bank full year net revenues up 6% to 24.3 billion euros\nCost reduction remains on target\nNoninterest expenses down 15% to 21.2 billion euros for the year and down 21% to 5.0 billion euros in the fourth quarter\n2020 adjusted costs, ex-transformation charges¹ and Prime Finance-related reimbursable expenses down 9% to 19.5 billion euros, on target, and down 8% to 4.6 billion euros in the fourth quarter\nTwelve successive quarters of year-on-year reductions in quarterly adjusted costs ex-transformation charges¹ and bank levies\n85% of transformation effects¹ anticipated through 2022 fully recognised\nCapital Release Unit maintains progress on de-risking\nRisk weighted assets of 34 billion euros at year-end, down 25% in 2020\nLeverage exposure of 72 billion euros, down 43% during the year\n2020 loss before tax of 2.2 billion euros, versus 3.2 billion euros in 2019\nContinued disciplined management of capital, risk and balance sheet\nCommon Equity Tier 1 ratio strengthened to 13.6% in fourth quarter\nLiquidity reserves of 243 billion euros, up 21 billion euros year-on-year\nProvision for credit losses of 251 million euros in the fourth quarter and 1.8 billion euros, 41 basis points of average loans, for the full year\n¹ For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ on pp 17-18\nChristian Sewing, Chief Executive Officer, said: “In the most important year of our transformation, we were able to more than offset transformation-related effects and elevated credit provisions – despite the global pandemic. With profit before tax of a billion euros, we’re ahead of our own expectations. We have built firm foundations for sustainable profitability, and are confident that this overall positive trend will continue in 2021, despite these challenging times.”\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) reported a net profit for the full year 2020 and remained on track for all strategic and financial objectives, six quarters into its transformation. Significant profit growth in the re-focused Core Bank more than offset the costs of transformation together with elevated provisions for credit losses. Strong capital and liquidity reserves enabled Deutsche Bank to support clients resolutely during 2020.\nRevenue growth and disciplined execution drives profit growth in 2020\nFull year 2020 profit was 624 million euros, with profit before tax of 1.0 billion euros, versus a loss of 5.3 billion euros, and a loss before tax of 2.6 billion euros, in 2019.\nFourth quarter 2020 Group profit was 189 million euros, versus a loss of 1.5 billion euros in the fourth quarter of 2019. Pre-tax profit was 175 million euros, compared to a 1.3 billion euro loss before tax in the prior year quarter. The tax benefit of 14 million euros in the quarter was mainly driven by the release of provisions from prior periods, and tax effects related to share-based payments.\nThe Core Bank, which excludes the Capital Release Unit, delivered significant fourth-quarter and full-year profit growth. For 2020, profit before tax was up six-fold to 3.2 billion euros, versus 536 million euros in 2019, while adjusted profit before tax1, which excludes specific revenue items, transformation charges, impairments of goodwill and other intangibles and restructuring and severance, rose 52% to 4.2 billion euros.\nCore Bank fourth-quarter profit before tax was 591 million euros, compared to a loss before tax of 435 million euros in the fourth quarter of 2019. Adjusted profit before tax1 more than doubled to 1.0 billion euros in the quarter.\nThe Capital Release Unit significantly reduced losses in 2020, primarily due to a 43% reduction in noninterest expenses and a 39% reduction in adjusted costs1. The Unit’s full year 2020 loss before tax was 2.2 billion euros, down from a loss of 3.2 billion euros in 2019. In the fourth quarter, the Unit reported a loss before tax of 417 million euros, a reduction of more than half versus a loss before tax of 858 million euros in the prior year quarter.\nThe Capital Release Unit maintained its progress on de-risking. In the fourth quarter, the Unit reduced risk weighted assets (RWAs) by 5 billion euros to 34 billion euros, versus a target of 38 billion euros. Leverage exposure was reduced by a further 18 billion euros in the quarter to 72 billion euros, compared to guidance of 80 billion euros. As at year-end 2020, RWAs have been reduced by more than half, and leverage exposure by approximately three-quarters, since year-end 2018. \nSix quarters of disciplined execution contributed to a significant reduction in transformation-related effects¹ in 2020, which increased the positive impact of Core Bank profitability on Group results. Valuation adjustments on deferred tax assets were 37 million euros in 2020, down from 2.8 billion euros in 2019. Transformation-related goodwill impairments, which were 1.0 billion euros in 2019, did not recur in 2020. Transformation charges¹ declined by more than half, from 1.1 billion euros in 2019 to 490 million euros in 2020, while restructuring and severance charges fell 15% to 688 million euros. As at 31 December 2020, 85% of total anticipated transformation-related effects¹ through 2022 were fully recognised.\nRevenue growth driven by client financing and risk management needs\nNet revenues were 24.0 billion euros, up 4%, in 2020. In the fourth quarter, net revenues were 5.5 billion euros, up 2% year-on-year, despite a negative revenue impact of 104 million euros relating to the sale of Postbank Systems AG at the end of the quarter which impacted the Corporate Bank and Private Bank. Core Bank net revenues were 24.3 billion euros for the year, up 6%, and 5.5 billion euros in the fourth quarter, essentially flat year-on-year and up 2% excluding specific items¹.\nIn Deutsche Bank’s core businesses:\nCorporate Bank net revenues were 5.1 billion euros in 2020, and 5.2 billion euros ex-specific items¹, down 2% and essentially flat if adjusted for currency translation effects.  The Corporate Bank largely offset interest rate headwinds through deposit repricing, which covered 78 billion euros of deposits at year-end, ahead of plan and up from 68 billion euros at the end of the third quarter.\nFourth quarter net revenues were 1.2 billion euros, down 4%, or essentially flat if adjusted for currency translation effects and specific items¹ which included the aforementioned negative impact from the sale of Postbank Systems. Global Transaction Banking revenues were down 6%, or down 3% adjusted for currency translation. Commercial Banking was up 1%, or up 6% excluding specific items, driven in part by deposit re-pricing.\nInvestment Bank net revenues were up 32% to 9.3 billion euros in 2020. Revenues in Fixed Income & Currencies (FIC) Sales & Trading rose 28%, reflecting four consecutive quarters of double-digit growth, while Origination & Advisory revenues were up 34%. Revenue growth reflected both supportive market conditions and market share gains in Investment Grade Debt Origination (source: Dealogic). In the debt capital markets, Deutsche Bank helped clients raise a record 1.7 trillion euros, up 43% year on year.\nFourth quarter net revenues rose 24% to 1.9 billion euros, driven by a 52% rise in Origination & Advisory to 532 million euros and a 17% rise in FIC Sales & Trading revenues to 1.4 billion euros, reflecting strong growth in Credit, Emerging Markets and FX revenues. Deutsche Bank led the European Union’s inaugural Social Bond, raising 17 billion euros, and ranked no. 1 in Origination & Advisory in Germany in the fourth quarter (source: Dealogic). The Investment Bank achieved these results while simultaneously reducing costs and maintaining risk and capital discipline.\nPrivate Bank net revenues were 8.1 billion euros, down 1%, and essentially flat if adjusted for specific items¹ which included a negative impact of 88 million euros arising from the sale of Postbank Systems. The Private Bank largely offset significant interest rate headwinds and the impact of COVID-19 through business growth. This included net inflows of investment products, across four consecutive quarters, of 16 billion euros, net new client loans of 13 billion euros, and deposit repricing agreements on accounts with a total value of 9 billion euros. Revenues in the Private Bank Germany, which included the negative impact on the Postbank Systems sale, declined 2% to 5.0 billion euros, while revenues in the International Private Bank were essentially flat at 3.1 billion euros.\nFourth quarter net revenues were 2.0 billion euros, down 1% on a reported basis, and up 1% ex-specific items¹ which included the negative impact on the sale of Postbank Systems. Sustained business growth, and higher fee income from insurance partnerships, largely offset headwinds from interest rates and COVID-19. Fourth-quarter net inflows of investment products were 3 billion euros, and net new client loans were 4 billion euros.\nAsset Management net revenues were 2.2 billion euros, down 4% in 2020. In the fourth quarter, net revenues were 599 million euros, down 11%, or 9% on a currency-adjusted basis, reflecting the non-recurrence of certain significant performance fees in the prior year quarter. Management fees remained essentially stable year-on-year, as the positive impact of client flows and market development offset industry-wide margin compression.  \nNet asset inflows were 14 billion euros in the quarter, bringing full-year net inflows to a record 30 billion euros. This included 9 billion euros in environmental, social and governance (ESG) assets. Assets under Management ended 2020 at 793 billion euros, up by 25 billion euros over the year. The year-end total included 91 billion euros in ESG assets, up 23%.\nFurther progress on costs, with full-year 2020 target delivered\nNoninterest expenses were down 15% to 21.2 billion euros in 2020. Deutsche Bank achieved its full-year target of 19.5 billion euros, down 9%, in adjusted costs ex-transformation charges¹ and Prime Finance-related reimbursable expenses. The bank reaffirmed its 2022 targets for adjusted cost reduction.\nIn the fourth quarter, noninterest expenses were 5.0 billion euros, down 21% year-on-year. Adjusted costs ex-transformation charges¹ were reduced by 8% to 4.6 billion euros if adjusted for 81 million euros of expenses eligible for reimbursement related to Prime Finance. Deutsche Bank has now delivered twelve consecutive quarters of year-on-year reductions in quarterly adjusted costs ex-transformation charges and bank levies¹.\nProvision for credit losses in line with guidance\nFor the full year 2020, provision for credit losses was 1.8 billion euros, versus 723 million euros in 2019. At 41 basis points of average loans, provisions were in line with Deutsche Bank’s guidance of between 35 and 45 basis points of average loans for the year. Including fourth-quarter provisions, allowances for credit losses were 4.8 billion euros, or 111 basis points of loans, as at 31 December 2020, versus 4.0 billion euros at the end of 2019.\nFourth-quarter provision for credit losses was 251 million euros, 23 basis points of average loans on an annualised basis, in line with guidance, as Deutsche Bank continued to benefit from a high-quality loan book and disciplined risk management framework.\nMaintained capital, balance sheet and liquidity strength\nThe Common Equity Tier 1 (CET1) ratio rose from 13.3% to 13.6% during the fourth quarter, and thus ended 2020 essentially unchanged versus year-end 2019 and 316 basis points above regulatory requirements. The fourth-quarter development reflected the positive impact of changes to Capital Requirements Regulation (CRR 2), and a positive contribution from the aforementioned progress on de-risking in the Capital Release Unit. These were partly offset by the impact of RWA increases to support growth in core businesses.\nAn expected increase in RWA of approximately 4 billion euros related to the European Central Bank’s Targeted Review of Internal Models (TRIM), originally anticipated in the fourth quarter of 2020, is now expected in 2021.\nThe Leverage Ratio increased to 4.7% (fully loaded) in the quarter, up 24 basis points over the previous quarter, excluding certain central bank deposit balances. Including these balances, the Leverage Ratio would have been 4.3% at year-end, up from 4.1% in the previous quarter. The quarter-on-quarter increase predominantly reflects the aforementioned positive capital effects. On a phase-in basis, the Leverage Ratio rose from 4.5% to 4.8% in the quarter.   \nLiquidity Reserves were 243 billion euros at the end of 2020, 21 billion euros higher than at year-end 2019. The Liquidity Coverage Ratio was 145% and the surplus over regulatory requirements was 66 billion euros.\nMore than 40 billion euros in sustainable financing and investment\nSustainable financing and investment volumes were over 40 billion euros in 2020, well ahead of the bank’s target threshold of 20 billion euros for the year. Sustainable financing volumes in the Investment Bank exceeded 20 billion euros, while the Corporate Bank provided its clients more than 5 billion euros of ESG financing. The Private Bank’s contribution to Deutsche Bank’s 2020 sustainable finance and investing targets included 4 billion euros of loans in Private Bank Germany and 11 billion euros of investment products as at year-end.\nIn addition, Asset Management attracted 9 billion euros of net inflows into ESG assets during 2020. The ESG share of total net inflows, at 30%, increased fourfold over 2019. At year-end, Asset Management’s ESG assets of 91 billion euros represented over 11% of total Assets under Management.\nSustainability governance further strengthened\nThe bank launched the Sustainability Committee of the Management Board, the bank’s highest level decision-making body with respect to sustainability, chaired by the CEO Christian Sewing. Deutsche Bank recently published its Green Financing Framework, paving the way for a wider range of green financing options for both the bank and clients. In the fourth quarter, the bank announced plans to tie the compensation of top-level executives to additional sustainability criteria from 2021.   \nRead the \nPDF\nfull media release in the downloadable PDF.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 24
}