{
    "url": "https://www.db.com/news/detail/20210201-to-the-bitter-end?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "Frankfurt am Main, February 1, 2021",
    "tags": [
        "Research"
    ],
    "title": "To the bitter end",
    "body": "The quick development of highly effective vaccines and, of course, expectations of huge fiscal stimulus in the US had made investors optimistic about global growth. However, their hopes were recently dampened as vaccination campaigns were slow to start and, in Europe, experienced supply problems. Furthermore, concerns about more infectious COVID mutations have led to prolonged and more restrictive lockdowns which have weighed on business and consumer sentiment. That has stopped the equity market uptrend for now.\nStill, the darkest hour of night is just before dawn. By the beginning of summer at the latest, rising vaccination numbers and warmer temperatures should drive down infection rates and prop up sentiment. Consumers can hardly wait to return to restaurants and bars, go shopping and travel. When this occurs, pent-up demand will combine with unprecedented monetary and fiscal stimulus as the two move in lockstep.\nFiscal programmes drove up global debt by USD 19.5 trillion in 2020 and more programmes are being drafted to lift overall growth and pull the most affected sectors of the economy out of their pandemic-related slump. They also seek to ensure the necessary transition to a digital and sustainable economy.\nCentral banks are doing their bit, too, by extending their mandates further and monetising higher government debt by providing liquidity. This policy mix works like a drug. As the global pandemic is overcome, we will probably see similar market euphoria as back in the “roaring twenties”.  There are already some indications that this has begun; just look at the significant, broad market index gains which appear to have left firm ground.\nAs in the 1920s, the markets are already attracting increasingly speculative retail investors. World trade has already exceeded its pre-COVID level and ship charter rates are going through the roof. This, and ballooning demand, will increasingly cause liquidity to spill over from the financial markets to the real economy. In turn, multiplier effects should massively boost growth. The upswing is likely to continue until 2022. However, as inflation expectations rise, doubts about the sustainability of the uptrend will surface. This might ultimately cause a dip in both equity and bond prices.\nA century ago, fiscal and monetary policy created the illusion of prosperity, and speculation boosted the bubble further. The outcome was a major disaster. We like to believe that we have learned from the past. So do we really think that the trillions of dollars spent on supporting the economy will create sustainable prosperity? Once inflation spirals out of control and interest rates rise, the party will be over. And the question of who is going to pay will be just as difficult to answer as it was a hundred years ago.\n\nDavid Folkerts-Landau\ndavid.folkerts-landau@db.com\n+44 20 754 55502",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 8
}