{
    "url": "https://www.db.com/news/detail/20161123-capital-markets-outlook-2017-all-eyes-on-the-usa?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "November 23, 2016",
    "tags": [
        "Asset Management",
        "Capital markets",
        "Company",
        "Corporate products",
        "Investment Banking",
        "Wealth"
    ],
    "title": "Capital Markets outlook 2017: all eyes on the USA",
    "body": "US & European political challenges will characterize the investment year 2017\nGlobal economy will grow by 3.5 percent\nGerman GDP will halve to 1.0 percent\nUS dollar will climb above parity with euro\nDAX target for end of 2017: 11,300 points\nAccording to Deutsche Bank strategists, the global economy and capital markets will be mainly determined by political decisions in 2017. In its Capital Markets Outlook 2017 published in Frankfurt today, Deutsche Bank experts primarily focus on the situation in the USA.\n\"Donald Trump clearly expressed his position in the election campaign. He will now have to show which measures he can in fact implement as a President. It is clear that the US economy will benefit from his policy – at least temporarily,“ said Oliver Rakau, Senior Economist at Deutsche Bank Research.\nIn addition to a business-friendly tax reform, Trump's focus is also on plans for a comprehensive investment programme. Only the extent and the time frame are still uncertain.\nExperts consider the trend towards a more restrictive immigration policy and a more protectionist economic policy as particularly critical – developments that can also be observed in other countries. \"In Europe, such positions have not only emerged since the Brexit vote\", said Dr. Ulrich Stephan, Global Chief Investment Officer at Deutsche Bank Private and Commercial Clients. \"They particularly meet with approval from people who consider themselves as losers of globalisation or fear to be one of those soon.\"\nThe basic problem is the unequal distribution of wealth generated in the past few decades. \"In fact, parts of the middle class in many developed countries have not benefited enough from globalisation – in some cases their real wages have even decreased,\" explained Rakau.\nPolitics: Necessary reforms are further delayed\nInstead of countering this and eliminating the causes, the respective governments still try to cover the biggest problems with monetary policy and fiscal measures. \"These are voter-friendly measures. Politicians delay necessary economic cuts that would initially be painful,\" Stephan said. \"It is a vicious circle: If quite unproductive companies are kept alive artificially and structural reforms are being postponed, in the long term this results in the fact that the economy stagnates and the situation gets worse.”\nMacroeconomy: Self-made stagnation for fear of recession\nThe globally slow growth that has persisted since the financial crisis will continue. \"Unless politicians consistently implement structural reforms, I see no chance of sustainable and noticeably increasing growth,\" Rakau said. In 2017, supportive economic measures in the USA, China and Japan could at least regionally stimulate the economy.\nThis would be countered by slow development in Europe. The fact that global trade has been sluggish since the financial crisis is also expected to have a negative impact on global growth. This means the growth model in many emerging markets – and export-oriented developed markets such as Germany – is faced with challenges.\nAccording to Deutsche Bank forecasts, global economic growth – measured by gross domestic product – may overall still be slightly higher than in 2016 and reach 3.5 percent.\nEurope: Many question marks, hardly any positive impulses\nThe economy in Europe will be facing turbulent months ahead. Italy will hold a constitutional referendum at the beginning of December. Other stress factors in 2017 will be elections in France, the Netherlands and Germany.\nThe uncertain progress in the Brexit negotiations is also expected to keep slowing companies' willingness to invest. Tense labour markets – particularly in European peripheral countries – might curb moderately increasing inflation rates and the real income development. Positive growth impulses seem only possible to come from outside Europe.\nIf US growth accelerates without new trade restrictions being established at the same time, this would support European exports. For the eurozone, Deutsche Bank expects economic growth of 1.1 percent in the year ahead – about 0.5 percentage points lower than in 2016. The forecast for the German economy is 1.0 percent and is thus halved compared to the expectations for 2016.\nUSA: Economic development mainly depends on the new government\nIf important aspects such as the tax reform and the investment programme are initiated in the USA, Deutsche Bank strategists expect noticeably rising growth in 2017. Furthermore, the planned easing of regulatory requirements, for example in the financial and energy sector, could result in US companies being more willing to invest. Deutsche Bank's forecast for US economic growth in 2017 is 2.3 percent.\nEmerging markets: Hardly any noticeable improvement\nAccording to Deutsche Bank, there will be hardly any noticeable improvement in emerging markets. China will continue to restructure its economy. This will slow growth. \"Due to fiscal and monetary policy measures, we still expect strong economic growth of 6.5 percent in 2017,\" said Stephan. For this year he expects 6.6 percent.\nIf the emerging markets Russia and Brazil find their way out of recession, positive impulses can be expected. Risks exist particularly in increasing US interest rates and the thereby possibly induced capital outflows as well as in a more protectionist trade policy.\nDollar on the fast track\nEven though the US central bank is independent in its decisions: It is still open which indirect influence the new policy from the White House will have on the central bankers. \"So far, Trump has clearly positioned himself against the current Fed chair Janet Yellen's policy. Nevertheless, we expect the Fed to carry out moderate interest rate hikes in 2017,\" Stephan said.\nAt the same time, other important central banks' monetary policy is expected to remain expansionary. \"It is very likely that the European Central Bank will expand its bond purchase programme beyond March 2017. The increasing interest rate differential between Europe and the USA will lead to capital flows towards the USA in the course of the year. This means the US dollar will further appreciate against the euro,\" said Stephan.\nFor the end of 2017, Deutsche Bank expects the euro to fall to 0.95 US dollars and thus below parity.\nAsset classes, regions and sectors\nBonds: End of the longest bull market in the world\nIn the past 35 years, yields for US government bonds have almost constantly fallen. This seems to be over now. In the first few days after the US election, the yield for 10-year US bonds already rose to more than 2 percent: \"This trend will initially continue in 2017 – but we do not expect significantly increasing capital market interest rates in the USA,\" said Stephan. Trump's fiscal policy may drive inflation up, but the weak global economic environment is also expected to reduce the interest rate increase.\nBy the end of 2017, Deutsche Bank expects a yield level in the USA of 2.3 percent. This would be significantly above the expected bond yields that investors could achieve in Germany or Japan. \"Deutsche Bank's focus is clearly on US bonds in 2017,\" Stephan said. \"Euro investors might additionally benefit from currency gains if the US dollar continues to appreciate against the euro.\" However, emerging market bonds could also become more attractive again if the initial shock about higher US yields recedes.\nEquities: Some light but plenty of shadow for cyclicals\nFollowing the China shock at the beginning of the year and the subsequent consolidation phase, stock markets in developed countries have gained again, in some cases significantly, after the US election. Deutsche Bank strategists expect recurrent difficulties in the implementation of the announced US reforms in the course of 2017. This is when the focus is likely to move more towards the uncertain situation in Europe again. High volatility on stock markets would be the consequence.\n\"In this environment, I see some light but also plenty of shadow for cyclical sectors,\" emphasized Stephan. There will occasionally be interesting investment opportunities with these companies. However, a high level of expertise in selecting the sectors and individual stocks as well as active portfolio management will be required. Defensive sectors and dividend stocks as a long-term basic investment may benefit from market volatility: Investors looking for an interesting risk return ratio might increase their investment in these sectors due to the lack of alternatives.\nGermany: Political uncertainties have a negative impact on share prices\nThe DAX is one of the particularly cyclical stock indices worldwide. \"German companies would therefore benefit from comprehensive fiscal programmes as we expect them in the USA, China and potentially in Japan,\" Stephan said. At the same time, however political uncertainties in Europe are likely to be a burden on German equities.\nAs many German companies significantly depend on exports, possible trade restrictions implemented in the USA and a weaker Chinese economy might lead to further negative impulses. All in all, Deutsche Bank strategists expect increased volatility on the German stock market in 2017. If political uncertainties recede in the second half of the year, interesting investment opportunities might come up.\nStephan expects the DAX to reach 11,300 points by the end of 2017.\nUSA: Stock markets benefit from new economic policy\nDonald Trump's announcement of business-friendly initiatives has already paid off for the US stock market: Since the beginning of November, the S&P 500 has clearly improved. Deutsche Bank expects the S&P 500 to show further potential and predicts an index level of 2,350 points by the end of 2017.\nFinancials, which should further improve their margins due to moderately rising interest rates, appear promising. The US healthcare sector should also benefit if deregulation on the pharmaceuticals market is implemented.\nReal Estate: Plausible boom rather than bubble formation\nThe globally attractive interest rate environment for real estate investment is expected to persist in 2017. Especially the USA seems interesting as an investment objective: According to Stephan, \"Robust US consumption and a functioning US labour market provide positive momentum for the commercial real estate market.\" The expected strength shown by the US dollar could open the opportunity of additional currency gains for euro investors.\nIn Europe, investors are expected to keep focusing on German real estate. Immigration and rising income are likely to stabilise the market. On an international level, there is light and shadow because markets such as China seem overheated in some regions. \"All in all, a globally broadly diversified and well managed real estate portfolio has the best return prospects for 2017,\" said Stephan.\nCommodities: Fighting for equilibrium rather than a fast comeback\nCommodity prices are expected to remain under pressure. This also applies to oil. It is still questionable as to whether OPEC will be able to reduce the production volumes as announced. Furthermore, it will influence the development of oil prices to a smaller extent than in the past: As soon as the price rises above the 50 US dollar mark, US producers are ready to close the gap. \"This is added to by the fact that the production conditions for oil companies in the USA will improve with Trump as a President,\" said Stephan.\nA noticeable reduction in the existing excess supply is therefore not expected. There is also the risk of headwinds from an increasingly strong US dollar, which may also make gold less attractive. \"When it comes to gold, investors should take into account that this is a relatively small market that already shows bigger fluctuation in the event of smaller dollar or interest rate movements,\" Stephan said. Deutsche Bank sees price potential for gold in 2017 but also significant investment risks in general.\n\"Increasing interest rates in the USA and a stronger dollar speak against gold. Furthermore, it neither produces yields nor dividends and has lost its status as a crisis currency,\" Stephan pointed out.\nMegatrends: Long-term opportunities apart from daily market moves\nEspecially in times of fluctuating markets, it may be worthwhile for investors to take a look at long-term developments. These include future-oriented technologies in the automotive industry. \"Traditional car manufacturers will continue to play an important role for the car of the future, but the influence of tech companies in the value chain will grow massively\", Stephan said.\nAnother trend is the Internet of Things, which is the intelligent internetworking of everyday items. With regard to demographic developments, the areas of healthcare and biotechnology will also become increasingly important for people's lives.\nFour sectors might benefit particularly from the megatrends: \"Biotechnology and pharmaceuticals companies, healthcare equipment companies, software services providers as well as companies from the semiconductor industry have significantly increased their contribution to market capitalisation on the US stock market,\" Stephan explained. \"This growth trend will continue.\"\nAsset allocation\nHomework for investors: Monitor political developments\nDeutsche Bank considers growing protectionism and only slowly growing global trade as the main stress factors for global economic development. In combination with increasing inflation, this might result in a stagflation trend in some economies. Expected economic stimulus measures in the USA should have a positive impact on capital markets. Similar measures are expected in Japan and China. The European countries, however, are not likely to agree on a coordinated approach.\n\"Due to the political uncertainties, dynamic portfolio management is recommendable. The focus should increasingly be on investments in the USA,\" said Stephan. Towards the start of the year he thinks a significant equity ratio is advisable. \"Depending on where Trump will steer the US economy, the weighting of other regions may be gradually increased in the course of the year.\"\nWhen it comes to bonds, investors should opt for safe havens and riskier bonds in equal proportions – with a considerable share of US bonds as well in this case. Real estate investments and liquidity would complete the portfolio.\nAs was the case in previous years, commodity investments will also not play a significant role in 2017. \"Nevertheless: 2017 may also turn out well for investors,\" Stephan said.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}