{
    "url": "https://www.db.com/news/detail/20161117-deutsche-bank-kunsthalle-presents-first-retrospective-of-the-indian-artist-bhupen-khakhar?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "November 17, 2016",
    "tags": [
        "Art",
        "Company",
        "Corporate Citizenship"
    ],
    "title": "First retrospective of the Indian Artist Bhupen Khakhar",
    "body": "Bhupen Khakhar (1934–2003) played a central role in the development of modern Indian art. The self-taught artist painted things that no one before him had shown: the everyday life of the Indian middle-class, but also intimate scenes from his own life. He and Anish Kapoor were the first Indian artists to take part in documenta, in 1992.\nNevertheless, Khakhar is scarcely known in Germany. The Deutsche Bank KunstHalle is now showing the first posthumous survey show, curated by Chris Dercon and Nada Raza, which was previously on view at Tate Modern. It is part of the exhibition cooperation between the KunstHalle and Tate Modern that is presenting important artists from Africa, Asia, and the Middle East in Berlin for the first time.\nKhakhar was viewed internationally as an important figure of 20th-century painting. He began working artistically in the 1960s and soon became part of the Baroda School, an art movement that brought forms of narrative and figuration to modern Indian art. Though trained and employed as an accountant Khakhar developed an artistic career rooted in his intense study of South Asian and European art.\nAfter experimenting with Pop Art early on, Khakhar moved on to develop his own idiosyncratic style of painting that combined seeming opposites such as high and mass culture, everyday life and historical painting, thus subversively undermining existing iconography. With great courage, he dealt with complex and provocative issues: class difference, desire and homosexuality, and his personal battle with cancer.\nThe show brings together works from international public and private collections spanning five centuries, among them works from the Deutsche Bank Collection. During his lifetime, Khakhar’s art was shown regularly in India and elsewhere, including at documenta IX in Kassel. In addition to well-known paintings and works on paper, the retrospective also presents works that have been shown rarely, including ceramic and textile.\nAn eponymous catalogue was published to accompany the exhibition at the Tate, with contributions by Ranjit Hoskote, Shanay Jhaveri, Geeta Kapoor, Nada Raza, Adrian Rifkin, Vivian Sundaram, and Katrin Zitzewitz, among others. It is on sale at the ArtShop in the KunstHalle.\nPhoto material on Bhupen Khakhar: \"You Can’t Please All\" can be downloaded for free at www.photo-files.de/deutschebankkunsthalle.\nDeutsche Bank’s commitment to art\nDeutsche Bank’s commitment to art is reflected by the bank’s new Art, Culture & Sport department. The new unit bundles the bank’s support programs and develops them further in conceptual terms. Together with its divisions, Deutsche wants to provide its customers with new access to the art, culture, and sports worlds.\nWith its involvement in contemporary art Deutsche Bank is setting standards worldwide, be it with the Deutsche Bank Collection, one of the world’s most important collections of contemporary artworks on paper and photography, with international exhibitions, or with the Deutsche Bank KunstHalle in Berlin. And for many years the bank has had a presence at selected art fairs such as Frieze London, Frieze New York, Sydney Contemporary, and the Tokyo Art Fair.\n\nInformation on Deutsche Bank’s global art program can be found at www.db.com/art and www.db-artmag.com.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}