{
    "url": "https://www.db.com/news/detail/20161110-deutsche-bank-wealth-management-launches-wealth-innovation-summit-for-young-entrepreneurs-and-investors-in-silicon-valley?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "November 10, 2016",
    "tags": [
        "Corporate Citizenship",
        "Corporate products",
        "Wealth"
    ],
    "title": "Silicon Valley: Deutsche Bank launches Wealth Innovation Summit",
    "body": "Deutsche Bank Wealth Management launched its Wealth Innovation Summit this week, introducing young entrepreneurs and investors to leading technology companies and innovators in Silicon Valley.\nThe three-day private event gives more than 80 “Next Generation” clients from around the world the inside track on the latest developments in technology and innovation, arranged in partnership with Plug and Play Tech Center, a Sunnyvale, California-based global innovation platform for start-ups, corporations and investors. The event started yesterday with a series of workshops, demonstrations and networking sessions and also includes tours of some of Silicon Valley’s most innovative companies.\n“We are constantly looking for new ways to give our clients access to experiences, networks and investment opportunities that they can’t get anywhere else,” said Fabrizio Campelli, Head of Deutsche Bank Wealth Management. “The Wealth Innovation Summit is a unique opportunity for our global Next Generation clients and Silicon Valley entrepreneurs to meet, exchange ideas and discuss ways to work together at the cutting edge of technology.”\nThe Wealth Innovation Summit is part of the further buildout of Deutsche Bank Wealth Management in the US.\nLeveraging its global network and expertise from across Deutsche Bank, Deutsche Bank Wealth Management provides capital markets expertise and international solutions tailored to the individual needs of clients such as entrepreneurs and next-generation affluent family members. It offers wealth planning over generations and international borders; asset management with individual risk management, loans and deposits; and bespoke solutions for individuals or institutions in close collaboration with experts in investment banking and asset management.\n\"This Silicon Valley summit is an exciting extension of our Next Generation programs which have been running for over 15 years,\" said Salman Mahdi, Deutsche Bank Wealth Management Vice Chairman. \"It's a fantastic opportunity to showcase our technology and entrepreneurship credentials and deepen our relationships with tomorrow's business leaders.\"\nThe Summit combines Deutsche Bank Wealth Management’s investing expertise in the US with the bank’s commitment to innovation and digitalization.\n“We are excited to be able to give Deutsche Bank Wealth Management clients an insight into the work we do in reviewing and investing in start-ups, running accelerator programs and teaming up with corporate partners, and for us to be able to give our local partners access to the global expertise and client base of Deutsche Bank,” said Plug and Play Chief Executive Officer and founder Saeed Amidi. “Deutsche Bank is taking an innovative approach to wealth management that we are keen to support.”\nThis year has seen a number of important initiatives in this area: Deutsche Bank opened labs in Silicon Valley, Berlin and London that help to discover and evaluate new financial technology ideas. The bank’s newly opened Digital Factory in Frankfurt translates these ideas into real products and services for clients.\nIn September, Deutsche Bank signed a cooperation agreement with the start-up accelerator Axel Springer Plug and Play to select, develop and finance up-and-coming technology companies from sectors such as banking and insurance.\nAnd at the end of October, more than 70 software developers and designers took part in Deutsche Bank’s Hackathon, a programming competition where creative minds develop ideas for new digital products, including contract management, group expense management and financial literacy for children.\nFollow updates and conversation about the summit on Twitter via #DBInnovation.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}