{
    "url": "https://www.db.com/news/detail/20161110-interview-with-kim-hammonds-technology-is-driving-everything?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 10, 2016",
    "tags": [
        "Careers",
        "Company",
        "Digitalisation",
        "Entrepreneurship",
        "Research",
        "Strategy"
    ],
    "title": "Interview with Kim Hammonds: \"Technology is driving everything\"",
    "body": "In an interview with German magazine ‘International Bankers Forum’ Kim Hammonds, member of the Management Board and Group Chief Operating Officer of Deutsche Bank, talks about first successes in transforming the bank’s IT systems, and how Deutsche Bank will operate in 2020.\n\nHammonds calls banks “technology firms in the banking business”, highlighting that bankers are needed who understand banking and regulation, and to have an understanding of their clients as well as their changing needs. “This is what Deutsche Bank stands for. But technology is what is driving everything”, she added. Deutsche Bank will be less complex in the future. “Our focus is on configuring the Bank for the long run. We have to drive efficiency by automating and digitalising. The staff are really important in this context”.\n\nPDF\nRead the full interview here.\n\nSelected interview quotes:\nOur focus is on configuring the Bank for the long run. We have to drive efficiency by automating and digitalising. The staff are really important in this context, too.\nWe are streamlining and standardising. There will be a more simplified structure including cloud technology. We not only want to cut costs, but our goal is also to reduce complexity and risk.\nThere are some areas we are really excellent in. These include, for example, the Autobahn platform that we use in investment banking and the new mobile banking app …\nWe will be ploughing a billion euros in digitalisation over the course of the next five years.\nToday, 27 percent of our applications have been standardised. By the end of this year we want to reach the 35 percent level, and by the year 2020 this should be over 85 percent. Doing this simplifies and accelerates updates.\nI have … learned that although the financial industry has its own particular features, the fundamental requirements do not differ all that much from those in industrial companies such as my previous employers, Ford and Boeing.\nI don’t see fintechs as opponents but as partners. There is so much that we can learn from them. But they can learn from us, too. If fintechs want to be successful they have to attain economies of scale. … As banks, we have the relevant volumes and customer base. We can help fintechs along the entire value chain.\nWe need bankers who understand banking. We need bankers who understand regulation. And we need bankers who understand their clients as well as their changing needs. This is what Deutsche Bank stands for. But technology is what is driving everything.\nWhen I first started here, we had outsourced over 70 percent of our IT activities, and we only handled 30 percent ourselves. We are turning this ratio around. We will do 70 percent internally by the end of 2020.\nIf you thrive on change, transformation and technology, you will like working in the financial sector.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}