{
    "url": "https://www.db.com/news/detail/20161104-deutsche-bank-is-changing-gender-dynamics-in-tech?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 4, 2016",
    "tags": [
        "Company",
        "Digitalisation",
        "Diversity",
        "Research"
    ],
    "title": "Deutsche Bank is changing gender dynamics in tech",
    "body": "The global tech industry has always found it challenging to attract women but there is growing evidence that times are finally changing. The latest comes from Romania: 40% of applicants for the DB Global Technology centre in Bucharest are women, and women make up 35% of technology staff there.\n“It is encouraging to see that women graduates and professionals are now more attracted by the idea of a career in technology. We are seeing a constant increase in the number of women who apply for these jobs across all disciplines and seniority levels,” said Iulia Cirmaciu, Head of HR at DB Global Technology, Bucharest.\nSince the software engineering centre opened in 2014, it has championed initiatives to encourage gender diversity and its 35% proportion of female technologists exceeds the Deutsche Bank-wide technology figure of 25%. But with one quarter of global technology roles held by women, Deutsche Bank overall compares well in the tech world.\nThe positive trend is one result of a sustained global drive to attract more women to work in Deutsche Bank’s technology team. Initiatives include its Graduate Outreach to Women (GROW) for female University students, supporting the Grace Hopper Celebration of Women in Computing Conference in the US, and sponsoring the We Are Tech Women conference in London later this month.\nAmanda Sams, HR Business Partner for Corporate Technology and the Chief Technology Office, commented: “Deutsche Bank has made a commitment to encourage more women to follow their passion for technology and build a career in this field, by offering them support, development and promotion opportunities together with exciting and challenging work at the highest level.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}