{
    "url": "https://www.db.com/news/detail/20211027-a-message-from-christian-sewing-on-q3-results-2021?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 27, 2021",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "A message from Christian Sewing on Q3 results 2021",
    "body": "Dear Colleagues,\nWhen we rang the closing bell on the New York Stock Exchange last Wednesday, it was not just a great honour for our bank - it was also a very emotional moment for me personally. The 20th anniversary of our listing on Wall Street and the opening of our new offices at Columbus Circle are clear commitments which go far beyond the US. The reason is that both events underline our ambition. We are the global Hausbank, the primary relationship banker, that can accompany businesses and private clients around the world.\nThe prerequisite for meeting this challenge is the successful completion of our transformation, which began in the summer of 2019. Here we took another important step forward in the third quarter. Although trading markets have normalised somewhat, we were able to increase revenues by 2 percent to just over 6 billion euros over the three-month period. And, as in the first two quarters of 2021, our earnings increased significantly compared to the same quarter a year earlier. The pre-tax profit of 554 million euros represents an increase of 15 percent compared to the third quarter of 2020.\nWe achieved this despite accepting additional one-off costs to further accelerate our transformation. Our adjusted pre-tax profit would have risen by 39 percent to 1.2 billion euros. For the first nine months of the year, pre-tax profit was 3.3 billion euros or 4.3 billion euros on an adjusted basis. This is a more than respectable outcome and we owe it to your great dedication.\nEvery area and region is contributing to this success. Whether with private clients or companies, institutional investors or governments, we feel a growing willingness to do business with us all over the world. It is particularly pleasing that there is demand for loans from companies that are confident of new investments in the face of the uneven path towards the easing of the pandemic, as well as growing activity in our Origination & Advisory business. \nThe sustainability business also continues to be very successful. We were again able to book ESG financing and investments worth some 27 billion euros, including issuances for the UK and Spain. As a result, we have already enabled 125 billion euros in sustainable financing and investments since the beginning of 2020 and have now reached almost two thirds of our target of at least 200 billion euros by the end of 2023. We firmly believe that this trend will continue. Next week's UN Climate Change Conference in Glasgow will significantly raise awareness of the issue once again.\nI am particularly pleased that all our businesses were able to further improve their profitability in the first nine months of the year:\nThe Corporate Bank more than doubled its return on tangible equity (RoTE) year on year to 7.0 percent - despite sustained headwinds from the low interest-rate environment. In the third quarter, these negative effects were offset by additional new price agreements with our clients and increased lending. And the outlook for the division is positive, as interest-rate effects will weaken in the next few quarters, and as the Corporate Bank has laid the foundation for future growth with its forward-looking initiatives.\nIn the Investment Bank, trading market activity and volatility continued to normalise as expected. As a result, revenues fell by 6 percent compared with the exceptional third quarter of last year. After nine months, however, we were still above the comparable level last year and our RoTE was 13.5 percent, up from 10.6 percent. Our Financing business delivered a strong performance, and in Origination & Advisory revenues were up 22 percent year on year, thanks to a sharp increase in advice on mergers and acquisitions as well as growth across Debt and Equity Origination. And in Germany, we maintained our market leadership year to date.\nThe Private Bank generated a RoTE of 2.7 percent, compared to a loss in the same period last year. In the third quarter, revenues decreased slightly, but they would have risen had it not been for the impact of 94 million euros from the German High Court's ruling on account terms. At the same time, net new business volumes were 9 billion euros, predominantly due to inflows into investment products and new loans. After three quarters, we have already recorded net new business in the Private Bank of 38 billion euros – far more than we had planned for the whole year.\nStrong inflows were once again recorded in our Asset Management business, too. DWS recorded 12 billion euros of net inflows in the third quarter, 5 billion euros of which went into funds focused on ESG. Assets under management grew by 21 billion euros to a record 880 billion euros. And the RoTE in Asset Management is at 28.3 percent after nine months, compared to 20.3 percent a year earlier.\nOur Capital Release Unit (CRU) is also developing very positively. The unit’s costs fell significantly in the quarter to 312 million euros, and risk-weighted assets were reduced to 30 billion euros. This is already lower than what we had planned for the end of next year. \nWe are therefore continuing on a very good path to achieving the post-tax RoTE of 8 percent that we are targeting for 2022. This is also because of further cost initiatives, as announced. While these led to transformation charges of 583 million euros in the quarter, they will enable us to reduce the run-rate of costs in future quarters and take an important step towards a cost-income ratio of 70 percent. Overall, we have already recognised 90 percent of the expected burden of our transformation and are on track to recognise almost all of the remaining transformation-related effects by the end of the year.\nAt the same time, however, it is also clear that we must not lose any ground on our disciplined path. Our shareholders expect us to achieve the 8 percent RoTE target. We have gained a lot of trust in the last two years, first with our clients and then in the capital markets. The ratings upgrades by Moody's and then by Fitch were important milestones in this regard. Let us not repeat the mistake of the past by slowing down now that we are back in the fast lane.\nThe good news is that we can control a lot of things ourselves. We have costs under control, we are feeling the tailwinds from our clients and, as one of the world's leading advisors and risk managers, we can navigate difficult times for individuals and businesses. We have a robust balance sheet, ample liquidity and a strong capital base. Our Common Equity Tier 1 (CET1) capital ratio remains strong at 13.0 percent, even after absorbing the impact of regulatory headwinds. So we retain our ability to fund future business growth.\nAll of this should fill us with confidence for the remaining two months of the year – enough to carry over into the last year of our transformation and execute it with full force. So far, this has been a success story. Let's continue it together.\nBest wishes,\nChristian Sewing",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 12
}