{
    "url": "https://www.db.com/news/detail/20211022-mypocket-skill-wins-2021-edition-of-female-fintech-competition?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 22, 2021",
    "tags": [
        "Awards",
        "Digitalisation",
        "Diversity",
        "Entrepreneurship"
    ],
    "title": "2021 edition of Female FinTech competition",
    "body": "Following a live pitch final held in person and virtually around the globe, MyPocketSkill has emerged as the winner of the 2021 Female FinTech Competition supported by Deutsche Bank to champion female entrepreneurs.\nMyPocketSkill is an award-winning digital technology and advisory company. Founded in 2017, its goal is to help young people aged 13-21 to become more financially capable by enabling them to earn, save and learn about money. Its platform connects young people to paid opportunities with households and businesses.\nCo-founder and Co-CEO Zara Ransley said: “Winning this global Female FinTech competition is a real vote of confidence in the innovative Learning by Doing approach that MyPocketSkill has in creating financially capable future generation. MyPocketSkill is going through a period of rapid growth and this award will give us access to incredible resources to further scale our platform.”\nThe competition, run by Deutsche Bank, Atos, Google Cloud and TechQuartier, invites financial technology companies that were founded by or include women in their top management ranks to pitch their business case.\nThe winner earns a prize that will be tailored to their needs and will enable access to programmes and resources from the host companies.\nDeutsche Bank judge Gil Perez, Chief Innovation Officer and Head of Cloud & Innovation Network, said: “I was incredibly impressed by the pitches from all of the finalists, and I am looking forward to watching them all grow and succeed. Ultimately, we had to make a tough decision and we chose MyPocketSkill. They delivered a fantastic and compelling business case.”\nThe competition aims to promote gender diversity in financial technology, to share the collective experience and resources of the host companies, and to create a network for female-founded fintechs. A recent study in Harvard Business Review found that female-led startups received just 2.3% of venture capital funding in 2020.\nThe lack of gender equality in funding startups leads to further problems. It affects the overall jobs picture for women exponentially. It’s also likely to slow the recovery and efforts to tackle inequality. However, a Boston Consulting Group analysis found that when female-led startups do get funded, they are more likely to be successful. They “ultimately deliver higher revenue — more than twice as much per dollar invested,” it said.\nPerez said: “Gender diversity is essential to the success of organisations across industries. All evidence shows that more diverse teams perform better and adapt faster to a changing environment. In financial services in particular women are still under-represented, and this is something we must address. I hope that initiatives such as the Female FinTech competition are a step in the right direction and that it helps to inspire and support women in this industry.”\nThe full list of finalists and judges can be found below and on the Atos website.\nFinalists\nLaura Pomfret – Financielle (UK)\nSophia Stone – IndieTech (Canada)\nHeather-Anne Hubbell – Phundex (UK)\nHanifa Azri – Regal 38i83 (UK)\nZara Ransley – MyPocketSkill (UK)\nPaola Blanco– Prestapolis (Colombia)\nJudges\nCarol Houle, Global Head of Consulting & Marketing, Financial Services & Insurance, Atos\nLucas Schmitt, Head of Innovation Products, TechQuartier\nLaurence Lafont, Vice President, Industry Sales, EMEA, Google Cloud\nGil Perez, Global Chief Innovation Officer and Head of Cloud & Innovation Network, Deutsche Bank",
    "number_of_ratings": 2,
    "rating": 1.0,
    "likes": 7
}