{
    "url": "https://www.db.com/news/detail/20211022-deutsche-bank-s-e-fx-trading-hub-in-singapore-goes-live?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 22, 2021",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank’s e-FX trading hub in Singapore goes live",
    "body": "Deutsche Bank today announced that it has completed its first set of live trades on its electronic foreign exchange (e-FX) hub, based in SG1.\nThe e-FX hub, which was developed in partnership with the Monetary Authority of Singapore (MAS), enables Deutsche Bank’s clients to execute FX transactions more closely aligned to geographic location, helping make trade execution times faster.\nAsia Pacific is a prime example of the ongoing decentralisation that is happening in the FX marketplace globally. We’ve set out to create a low latency trading environment so that our clients can benefit from localized price distribution and consumption, leading to improved execution results and performance of roughly 90 milliseconds, for clients in Singapore. The investment in our platform in Singapore significantly enhances Deutsche Bank’s market-leading electronic FX offering, and nicely complements our other global FX trading hubs in New York, London, and Tokyo.\nHead of APAC G10 FX Lee Merchant\nIn Euromoney’s closely watched annual FX Survey, this year Deutsche Bank jumped to No. 2 in the APAC Overall Market Share category and ranked as a top-3 FX house in 11 markets across the region, significantly more than any other liquidity provider.\nWe continue to invest in sharpening our technology to ensure that our electronic offering for our clients is best on the street. This was a complex delivery, which included the set-up of significant local hardware, network, and server infrastructure, as well as the deployment of a host of customised applications. We are proud that our unique technology delivery capability, which simplifies and speeds up trading, has positioned us at the heart of our clients’ FX requirements across this fast-growing region.\nChris Bezuidenhout, CIO for Corporate & Investment Bank in APAC and Global Emerging Markets\nWe are very excited to launch an additional e-FX pricing engine in Singapore. The latest expansion of electronic pricing capacity continues to strengthen our Emerging Market currencies and NDF trading platform by offering clients enhanced execution experience both in terms of transaction latency and quality of liquidity. With Singapore growing as a major liquidity hub during the Time Zone, the investment reaffirms Deutsche Bank’s strong commitment to the region and our endless pursuit to deliver the best-in-class solution to our clients.\nJohn Zeng, Head of E-Trading FIC APAC\nDeutsche Bank continues to be recognised for its marketing leading FX franchise across Asia Pacific, including being awarded Best Emerging Markets FX Trading Platform at FX Markets Asia Awards 2021. The bank’s strength and resilience during the pandemic has also recognised by Asia Risk and GlobalCapital as part of their 2020 awards.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 10
}