{
    "url": "https://www.db.com/news/detail/20211019-deutsche-bank-appoints-essence-to-lead-from-2022-on-multi-brand-portfolio-media-campaigns?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, October 19, 2021",
    "tags": [
        "Digital banking & services",
        "Digitalisation"
    ],
    "title": "Deutsche Bank appoints Essence to lead from 2022 on multi-brand portfolio media campaigns",
    "body": "Global data and measurement-driven media agency Essence will become Deutsche Bank’s new lead media agency from 1 January 2022. For the first time ever, one agency will manage the media buying for most of the portfolio of brands and products across the group, including all media and platforms online and offline, nationally, and internationally.\nDeutsche Bank put out the tender together with DWS in the second quarter of 2021, and invited agencies to pitch. An interbank committee and the bank's group purchasing department managed the pitch with the support of IMEDIAG, an independent media, audit and consulting company, in a multi-stage selection process. They were looking for an agency that uses innovative, data-driven marketing strategies, with a forward-looking approach to operate proactively in a dynamic and competitive environment. The customised strategies, quality of planning and creativity demonstrated by Essence were particularly impressive to the committee.\n“Essence is the ideal partner to have at our side. Essence thinks through campaigns based on data from the customer's point of view – and scales and distributes them together with their global network GroupM,\" said Tim Alexander, the Chief Marketing Officer (CMO) and Chief Experience Officer (CXO) Private Bank. \"This will also be particularly helpful to us in further anchoring our two-brand strategy with Deutsche Bank and Postbank in the market in Germany.\" The focus is on an optimal dovetailing of offline and online channels that takes new technologies into account and integrates new formats as well as new media.\n\"We were convinced by the holistic approach, the excellent understanding of the market and the many innovative ideas about the Deutsche Bank brand,\" said Christian Rummel, Deputy Head of Brand Communications & Corporate Social Responsibility, Deutsche Bank AG.\n\"Our new lead agency has a strong affinity with innovation, data and technology, and will deliver a global setup that is a perfect fit with our strategy and beliefs. We are looking forward to working with them,\" said Adib Sisani, Global Head of Communications and Marketing DWS.\nChristian Leipacher, the Managing Director of Essence Germany, said: \"We’re looking forward to partnering with Deutsche Bank, the leading bank in Germany, and its network, and to finding future-proof answers to an ever more rapidly changing media landscape together.\"\nEssence is a global media agency that combines media consulting with data science. Clients include Google, Peloton, Friday, Subway, Bandai Namco and the Bill and Melinda Gates Foundation. Essence has been Google's global digital agency for more than 14 years. The agency employs more than 2,000 people, invests over US$4.5 billion in media volume and has a presence in 121 markets – with locations in North America, Europe, Africa and the Middle East, as well as the Asia-Pacific region. It is part of the world's largest advertising holding company, WPP.",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 2
}