{
    "url": "https://www.db.com/news/detail/20211013-deutsche-bank-extends-its-partnership-with-frieze?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 13, 2021",
    "tags": [
        "Art",
        "Corporate Citizenship",
        "Diversity"
    ],
    "title": "Deutsche Bank extends its partnership with Frieze",
    "body": "Deutsche Bank has announced the long term extension of its partnership with Frieze, in support of artistic excellence and the shared vision of a diverse and thriving global community of emerging artists. \nFor over 40 years Deutsche Bank has supported contemporary art and artists, and believes that art has a positive impact, not only on clients, visitors and staff but also on the communities in which the bank operates. \nAs the Global Lead Partner for Frieze for 18 consecutive years, Deutsche Bank is proud to continue this commitment to the partnership.\nOur longstanding partnership with Frieze underlines Deutsche Bank’s commitment to encouraging new and noteworthy artistic talents from across the globe\nAnna Herrhausen, Global Head of Deutsche Bank Art & Culture\nDeutsche Bank’s partnership with Frieze began in 2004, based on a shared understanding of the unique role contemporary art plays in today’s globalised culture, transcending boundaries and connecting people by creating shared experiences and perspectives.\nOur collaboration with Frieze not only enables us to connect with our clients and support contemporary art worldwide, but to partner with Frieze in their mission to make the global fairs more inclusive and sustainable\nClaudio de Sanctis, Global Head of Deutsche Bank International Private Bank and CEO of Europe, Middle East, and Africa    \nTogether with Frieze, in 2019 the bank launched the Deutsche Bank Frieze Los Angeles Film Award to support emerging filmmakers in Los Angeles.  The launch of the Frieze x Deutsche Bank Emerging Curators Fellowship followed in 2020, to promote diversity in the arts in the UK.   \n“I am extremely proud of the Frieze x Deutsche Bank Emerging Curators Fellowship and the Los Angeles Film Award; two inclusive initiatives that ensure doors are wide open to creative talent,” de Sanctis added. “This year also sees the continuation of Art:LIVE online at Frieze London and Frieze Masters, making the fair more accessible to all by bringing it into the homes of thousands of people worldwide who cannot attend in person.”\nProduced as a collaboration between Deutsche Bank and Frieze, Art:LIVE is a new online broadcast and video programme which makes expert insights about contemporary art and culture accessible to all.    ",
    "number_of_ratings": 2,
    "rating": 1.0,
    "likes": 67
}