{
    "url": "https://www.db.com/news/detail/20211013-deutsche-bank-issues-its-second-green-formosa-bond-in-2-months?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 13, 2021",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank issues its second green Formosa bond in 2 months",
    "body": "Following its ground-breaking first green bond in Formosa format in August, Deutsche Bank has successfully raised another USD 200 million in Taiwan via a second green Formosa bond.\nThe green format and long tenor of the bond, as well as the bank’s recent ratings upgrade by Fitch (following another ratings upgrade by Moody’s in August) all contributed to very healthy investor demand, including from major local insurance groups.\n“We are proud of the pioneering role we continue to play in the development of Taiwan’s capital markets, having been a leader in opening the Formosa bond market back in 2006, and now making great strides in helping push this important market segment greener,” said Cynthia Chan, CEO and Head of Corporate & Investment Bank for Taiwan.\n“Institutional investors in Taiwan are increasingly looking for assets that further their sustainability objectives and as a leading ESG bank in Asia Pacific, we are keen to support them in this direction.”\nThe proceeds of this transaction will help to fund eligible green assets including the development of renewable energy and energy technology and the improvement of energy efficiency and conservation. \nClaire Coustar, Head of ESG for FIC said: “Deutsche Bank has been supporting the Taiwanese renewable energy sector with financing and FX/rates risk management solutions for a number of years, in line with the government’s focus on offshore wind. This, combined with the bank’s leading position in the Formosa market, provided us with a strong foundation to re-enter the market as an issuer with a second successful issuance in the space of two months.”\nIn addition to the bank’s active contributions to the development of the Formosa bond market, Deutsche Bank has also been a leader in supporting European investments into Taiwan’s renewable energy sector through award-winning project finance transactions.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 7
}