{
    "url": "https://www.db.com/news/detail/20211007-deutsche-bank-welcomes-first-entrepreneurs-in-residence?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 7, 2021",
    "tags": [
        "Digitalisation"
    ],
    "title": "Deutsche Bank welcomes first “Entrepreneurs in Residence”",
    "body": "Gilad Parann Nissany and Jason Wolf are the first participants in Deutsche Bank’s Entrepreneur-In-Residence (EiR) Programme, a new initiative aimed at attracting talented serial entrepreneurs from the fintech industry to temporarily join the bank to validate, develop and scale ideas sourced from inside and outside the bank.\nOver the coming months Nissany and Wolf will work with experts from the Private Bank, the Corporate Bank and the Chief Security Office to incubate an innovative concept to help transform fraud detection in retail and corporate banking. The solution will leverage artificial intelligence to better protect the bank’s clients from scams.\nThe pair have strong start-up credentials. Nissany enjoys all aspects of building start-ups from writing code, through to strategy to sales. He has deep knowledge in the areas of cloud computing, big data, and cyber-security, and has worked for four different successful start-ups targeting different size market segments. Wolf, who has spent half his life in Israel and half in Silicon Valley, has been involved in several technology start-ups as co-founder, entrepreneur, and senior executive. He is passionate about translating visions into effective strategies and execution.\nBy joining the EiR programme, entrepreneurs will benefit from the incredible network of knowledge and expertise within Deutsche Bank to rapidly validate, design and develop concepts into successful businesses. These start-ups will be supported by a dedicated business development manager and given access to funding and networks of potential clients.\nLed by the bank’s Corporate Venture Capital (CVC) team, EiR will focus on start up opportunities which will compliment Deutsche Bank’s business and technology strategy and address unmet industry needs. CVC is a cross-divisional, global initiative which invests in start-ups and entrepreneurs; researches and incubates transformational ideas, and drives growth of portfolio companies.\nOn the partnership, Wolf said: “The programme is a unique opportunity to see the bank from the inside and engage in highly strategic conversations with the bank's most senior people. This is something most start-ups can only dream about. This provides unique insight for our strategy as we build our start-up towards great success.”\nEiR programme lead Shannon Sali said: “For the entrepreneurs it provides the opportunity to scale their ideas and collaborate with experts from across the organisation. For Deutsche Bank, it offers an opportunity to rapidly provoke constructive disruption and develop new products and markets that complement our business.”\nFor more information about the Entrepreneur-in-Residence programme, or if you have an exciting fintech idea, contact the CVC team at corporate.venture-capital@db.com",
    "number_of_ratings": 3,
    "rating": 3.7,
    "likes": 29
}