{
    "url": "https://www.db.com/news/detail/20211007-deutsche-bank-joins-the-german-australian-hydrogen-alliance-as-the-inaugural-presenting-partner?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 7, 2021",
    "tags": [
        "Asia-Pacific",
        "Corporate products"
    ],
    "title": "Deutsche Bank joins the German-Australian Hydrogen Alliance as the inaugural Presenting Partner",
    "body": "The German-Australian Chamber of Industry and Commerce (AHK Australien) today announced that Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) will join the German-Australian Hydrogen Alliance as the inaugural Presenting Partner.\n \nThe Alliance, which launched in November 2020 and is headed by AHK Australien, functions as an important platform for exchange between Australian and German stakeholders, informing and driving forward activities, approaches, and importantly coordinating activities with a bilateral background.\nDaniel Schmand, Global Head of Trade Finance & Lending and Institutional Cash Management at Deutsche Bank, said: “Establishing partnerships is key in order for Germany to execute its ambitious National Hydrogen Strategy and as a global bank, we have an important role to play in helping to bring together key international industry players. With the significant opportunity present in Australia’s hydrogen sector, we are delighted to join as a presenting partner of this Alliance, once again cementing Deutsche Bank’s leadership in sustainable finance globally.”\nWith Germany’s aim to reach net-zero emissions by 2045 and Australia’s potential to create a significant green hydrogen export industry, both countries have executed a formal energy co-operation agreement. Building on long-standing trade relationships, the bilateral hydrogen business is actively supported by both governments.\nPeter Connor, Head of Corporate Bank for Australia at Deutsche Bank, said: “As a leading international bank for ESG solutions in Australia, we leverage our global network and expertise to help clients execute their own sustainability strategies. For us to achieve this, we must play a role in helping to develop and drive investments into emerging sectors and we are delighted to be doing just that with the German-Australian Hydrogen Alliance, in partnership with AHK Australien.”\n Australia offers an immense potential for hydrogen production from renewable sources, whereas Germany can function as a technology provider, especially in the provision of competences, in order to promote electrolysis technologies and sector coupling in Australia. In return, Australia can serve not only the local, but also the international hydrogen market and, as an export nation, is well placed to meet the large demand for hydrogen in Germany to decarbonise its industry.\nChristoph von Spesshardt, Chief Executive Officer of AHK Australien, said: “In this pivotal time of restructuring how the world sources its energy for a sustainable and prosperous future, we thankfully welcome Deutsche Bank as the inaugural presenting partner of the German-Australian Hydrogen Alliance. We founded the Alliance to maximise the unparalleled potential of German hydrogen technology know-how and Australia's wealth of renewables and resources, to firmly position both countries as catalysts for a net-zero future.”\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nMia Popplewell\nEmail: mia.popplewell@db.com\nPh: +61 439528842",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 10
}