{
    "url": "https://www.db.com/news/detail/20211007-european-food-industry-not-resilient-to-crises?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 7, 2021",
    "tags": [
        "Research"
    ],
    "title": "European food industry not resilient to crises",
    "body": "What role do chemicals companies play in food chain resilience and biodiversity? Deutsche Bank’s Private Bank Chief Investment Office (CIO) examined this question with other bank partners in the latest research collaboration led by the University of Cambridge Institute for Sustainable Leadership (CISL).\nWithout quantifiable data and modelling to show how a company’s valuation can be exposed and impacted by such things as extreme weather, environmental degradation (nature-related risks) or policy responses to those events, financial markets may mis-value a stock by under-estimating how much a company relies on the natural world.\n\nThis latest CISL study ‘Assessing Nature-related Financial Risks’ aims to move to a financial system that accounts for nature, helps prevent catastrophic nature loss and provides tangible valuation data for financiers. It follows the March publication of Handbook for Nature-related Financial Risks, which was designed for financial institutions (including Deutsche Bank) to assess risks related to nature, and material risks to portfolios. Deutsche Bank is one of seven banks to collaborate and contribute to the CISL publication.\nDr Alex Kusen, Private Bank Investment Officer Europe, contributed a use case to the latest publication, examining the impact of EU Farm to Fork and Biodiversity policies on the valuation of leading European fertiliser companies.\nExplaining the purpose of the study, Kusen said: “The aim was to derive and estimate the risks and financial impacts on chemicals companies in the EU with an exposure to the EU Farm to Fork Strategy post 2030 due to a reduction in fertiliser use.”\n\nTo conduct detailed analysis, working with other bank partners, he built discounted cashflow models to calculate the impact of a 20% EU mandated reduction in fertiliser use.\n“COVID-19 has shown that both global and European food systems are not resilient to crises if not operated sustainably. Accounting for nearly a third of the global greenhouse gas (GHG) emissions, the food system needs to be redesigned to consume less natural resources while providing economic returns to support the livelihoods of producers,” Kusen said.\n\nPrivate Bank Global Head of the Chief Investment Office Markus Müller said, “We were pleased to contribute to this latest research project about the EU Farm to Fork Strategy with CISL and Banking Environment Initiative (BEI) partners. Industry collaboration is key to developing workable ESG solutions and accelerating change.”\n\nCISL authors Grant Rudgley and Dr Nina Seega acknowledged contributions from Markus Müller and Dr Alex Kusen, saying: “The forthcoming use cases, upon which this paper is based, are being co-created by CISL and seven financial institutions. Without the dedication of these institutions and the individuals doing the risk assessments, the preliminary highlights presented here would not have been possible.”\nThe study aims to raise awareness of nature-based risk ahead of the upcoming UN conferences, COP15 and COP26. The full research study will be published prior to the second phase of Biodiversity COP, scheduled to take place in April next year.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 3
}