{
    "url": "https://www.db.com/news/detail/20160229-deutsche-bank-announces-results-of-public-tender-offer-for-us-dollar-bonds-as-of-early-tender-date?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "February 29, 2016",
    "tags": [
        "Capital markets",
        "Company",
        "Investment Banking"
    ],
    "title": "Deutsche Bank announces results of public tender offer for US Dollar bonds as of early tender date",
    "body": "Deutsche Bank (XETRA: DBKGn.DE/ NYSE: DB) announced the initial results of its tender offer to repurchase up to USD 2 billion of eight US Dollar-denominated senior unsecured debt securities. During the first ten business days of the tender period, securities with an aggregate notional value of USD 740 million were tendered by investors as of the early tender date and accepted by the bank for purchase.\nToday’s announcement marks a further important step of Deutsche Bank’s tender offer launched on 12 February 2016. The Bank announced the successful completion of its public tender offer for Euro-denominated securities on 23 February 2016.\nThrough the transaction Deutsche Bank continues to manage its overall wholesale funding levels and simultaneously provides liquidity to holders of the debt securities in the offer.\nThe relatively low investor participation in the public tender offers for both the Euro-denominated and US Dollar-denominated securities tendered reflects improved market sentiment and an investor preference to retain exposure to Deutsche Bank.\nDeutsche Bank expects to record a gain in the first quarter of 2016 of approximately EUR 15 million from the repurchase of US Dollar-denominated securities. This is additional to the expected positive earnings impact of approximately EUR 40 million from the tender offer for Euro-denominated securities.\nThe aggregate outcome of both tender offers has resulted in bonds with an aggregate notional value of EUR 1.94 billion being repurchased to date with an aggregate positive impact on first-quarter 2016 earnings of approximately EUR 55 million.\nThe tender offer for the US Dollar-denominated securities remains open until 11 March 2016. All further incoming investor tenders are subject to a discount of three percentage points to the prices received by investors who tendered during the early period. Deutsche Bank plans to announce final tender results on 14 March 2016.\nFurther details can be found on Deutsche Bank’s Investor Relations website under https://www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}