{
    "url": "https://www.db.com/news/detail/20160226-konzept-07-is-inflation-really-dead?language_id=1",
    "language": "DE",
    "article_type": "Research",
    "publish_date": "February 26, 2016",
    "tags": [
        "Research"
    ],
    "title": "Is inflation really dead?",
    "body": "One of the few certainties in economics is that if everyone thinks the same thing will happen, it probably won’t. Therefore as the spectre of deflation is foremost in everybody’s mind these days, we have chosen to devote issue #7 of Konzept to that long-forgotten relic, inflation.\nWe don’t have bone to pick with deflationistas. Everything from commodity prices and anaemic wage growth to record-low bond yields and a devaluing renminbi suggest they may be right. But confidently predicting falling prices is dangerous given that inflation in the post-crisis years has consistently flummoxed traditional economic models. Even Janet Yellen recently expressed “some humility” about the Federal Reserve’s inflation forecasting abilities.\nSo why might inflation make a surprise return? What is the role of demographics in setting price levels? How does the future look for commodities? Where does inflation mess with standard equity valuation metrics? All these questions and more are explored at length in this issue.\nAnd as ever, the magazine is jam-packed with a sweet spread of shorter articles. We use free-range eggs to explain how renewables are shaking up traditional energy. Another piece describes why the billionaires jostling to enter the space exploration business, from Elon Musk to Richard Branson, could end up with egg on their faces. We also explore the topic of China’s 100 m diabetes patients and the ongoing tussle between multinational and local pharma companies. And while on emerging markets, our consumer staples analysts have spotted one or two green shoots within the recent results from their companies.\nFinally, the usual array of columns in the back pages offers some serious light relief, including advice on why you don’t get along with your team and some extreme lessons on leadership from two ex-navy SEALs. \nFor further information, please contact:\nresearch.haus@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}