{
    "url": "https://www.db.com/news/detail/20160212-a-message-from-marcus-schenck-deutsche-bank-announces-a-public-tender-offer-to-buy-back-debt?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 12, 2016",
    "tags": [
        "Company",
        "Management & Leadership",
        "Strategy"
    ],
    "title": "A message from Marcus Schenck: Deutsche Bank announces a public tender offer to buy back debt",
    "body": "Dear colleagues,\nDeutsche Bank today announced that it plans to repurchase some of its senior unsecured debt in the market. The Bank has a target acceptance volume of EUR 3 billion of euro-denominated debt and of USD 2 billon of dollar-denominated debt through a public tender offer.\n\nFrom today, the tender is expected to be open for seven business days for the euro-denominated bonds and 20 business days for the USD-denominated bonds, subject to lower pricing for bonds tendered after the tenth day of this period.\n\nThe Bank is taking advantage of market conditions to repurchase this debt, lowering its debt burden at attractive prices. By repurchasing this debt below its issue price, the Bank realises a profit. Deutsche Bank is also using its strong financial profile to provide liquidity to bond investors in challenging market conditions. At the end of 2015, the Bank had around EUR 215 billion in liquidity reserves and our liquidity coverage ratio, which measures a bank’s ability to meet short-term liquidity needs, was around 120%.\n\nDeutsche Bank is also making the most of a strong capital and risk position. Based on our published preliminary results, our Common Equity Tier 1 (CET1) ratio as at 1 January 2016 is 12.52% on a ‘phased-in’ basis – around 180 basis points, equivalent to around EUR 7 billion of Common Equity Tier 1 capital, higher than regulatory requirements for 2016. Levels of market risk are low by any historical measure and credit risk costs, at around 30 basis points of average loans in 2015, are below peers.\n\nDeutsche Bank is able to repurchase these bonds without altering our 2016 funding plan – we have already completed EUR 4 billion of our 2016 full-year funding plan of up to EUR 35 billion.\n\nThis repurchase has no impact on the Bank’s capacity to service coupons on its Additional Tier 1 (AT1) capital during 2016 or 2017.\n\nYours sincerely,\nMarcus Schenck\nChief Financial Officer",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}