{
    "url": "https://www.db.com/news/detail/20160211-deutsche-bank-continues-its-support-to-offshore-wind-project-bonds?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "February 11, 2016",
    "tags": [
        "Corporate products",
        "Investment Banking",
        "Sustainability"
    ],
    "title": "Deutsche Bank continues its support to offshore wind project bonds",
    "body": "Deutsche Bank’s Global Transaction Banking division has taken on several mandates for the refinancing of the “Meerwind” offshore wind park in Germany. The 288MW Meerwind Sud/Ost offshore wind farm, one of the largest in the German North Sea, consists of 80 wind turbines which was fully commissioned in February 2015. The construction of the wind farm was initially financed by loans from a syndicate of commercial banks, together with a development bank and export credit agency.\nSimilar to the recently closed Gode Wind 1 wind park acquisition financing that Deutsche Bank supported, Global Transaction Banking will act in numerous capacities to support the complex array of bonds and credit facilities in the Meerwind refinancing, most critically as intercreditor agent, ensuring the widely held debt is managed from end to end for all creditors during the long-term operational phase of the project. In addition, Deutsche Bank has been mandated as security agent, principal paying agent, registrar, U.S. paying agent, Schuldschein agent, facility agent, settlement agent and indenture trustee.\nSriram Iyer, Global Head of Corporate Trust, Global Transaction Banking, Deutsche Bank, said: “We are delighted to have followed up our success in the renewable/wind energy space with another key mandate. It confirms the continued appetite of institutional investors in offshore wind assets, and the ability of Deutsche Bank to support complex multi-sourced debt financing across regions as a single sourced solution. Infrastructure refinancing in the capital markets will be key this year with rising rates in a continued low-yield environment leading to similar bond take-outs.”\nWindMW, owner of the Meerwind offshore wind park, refinanced its construction loans with the issuance of approximately EUR1bn of senior secured project bonds in the form of listed EUR and USD bonds, privately placed German registered notes (Namensschuldverschreibungen) and promissory note loans (Schuldscheindarlehen), along with a working capital facility and decommissioning\nletters of credit. The successfully categorised green bonds are the first senior secured bonds for a German wind farm in operation with a project finance approach and received an investment grade rating from all three major rating agencies.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}