{
    "url": "https://www.db.com/news/detail/20160209-a-message-from-john-cryan-to-deutsche-bank-employees?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 9, 2016",
    "tags": [
        "Company",
        "Management & Leadership",
        "Strategy"
    ],
    "title": "A message from John Cryan to Deutsche Bank employees",
    "body": "Dear Colleagues,\nWhen I first became your colleague and Co-CEO seven months ago, I promised to increase communication from the Management Board to you. I made clear that when we had something to communicate, I wanted you to hear about it first from us. That is why I am writing to you today.\nLast week, at one of our scheduled off-sites, the Management Board talked about progress on our strategy, and how recent market volatility and forecasts for slowing economic growth might impact our clients and us. Volatility in the fourth quarter impacted the earnings of most major banks, especially those in Europe, and clients may ask you about how the market-wide volatility is impacting Deutsche Bank.\nYou can tell them that Deutsche Bank remains absolutely rock-solid, given our strong capital and risk position. On Monday, we took advantage of this strength to reassure the market of our capacity and commitment to pay coupons to investors who hold our Additional Tier 1 capital. This type of instrument has been the subject of recent market concern.\nThe market also expressed some concern about the adequacy of our legal provisions but I don’t share that concern. We will almost certainly have to add to our legal provisions this year but this is already accounted for in our financial plan.\nThe Management Board also discussed its vision for the bank. For us, a vision defines our aspiration for the bank, and what we want it to be. It’s important because it creates clarity of purpose and unites all of us in achieving common and worthy goals.\nOur vision is to be a trusted and successful bank. We aim to deliver financial solutions, technology, products and services that exceed our clients’ expectations. We want to be the most respected financial services provider across all customer segments in Germany, our vital and strong home market; the number one bank for our corporate, institutional and fiduciary clients in Europe; and the best foreign bank in the United States and Asia.\nWe are achieving our vision in a number of ways, including:\nFirst, we are investing in hiring more people in Equity Sales and Research to serve our clients’ needs and to regain our leadership in the equities markets.\nSecond, we are investing in bringing on board some talented senior bankers into Corporate & Investment Banking.\nThird, we are investing in client-facing technology, particularly in our retail banking and asset management businesses.\nFinally, I am personally investing time to resolve successfully and speedily open regulatory and legal cases. I want to remove the uncertainty among staff and in the market that these cases cause. A small group of senior people, led by me, will focus on this. For everyone else, we ask you to continue to focus on our clients and on the implementation of our strategy.\nIn the weeks ahead, my colleagues on the Management Board will update you on a number of topics, including customer focus, the work we’re doing on costs, and our priorities for developing employees. We want to make transparent where we are in our strategic efforts. This will add to accountability and help track progress.\nWe want to hear from you too. What are clients telling you? How do you think we should build a better Deutsche Bank? As ever, please contact me directly via the feedback tool on our intranet.\nOn behalf of the entire Management Board, thank you for your ongoing hard work. Let’s all work together to support this vision.\nYours sincerely,\nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}