{
    "url": "https://www.db.com/news/detail/20160324-deutschbankers-offer-their-expertise-to-social-enterprises-and-non-profit-organisations?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "March 24, 2016",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Corporate Volunteering",
    "body": "One in five employees — more than 17,000 people globally — volunteered over 185,000 hours in 2015. They support local community projects, mentor young people or even take on assignments abroad. Many of them offer their experience and business skills to support, underresourced charities, non-profit or community organisations, and entrepreneurs for social good and help them to find solutions to their toughest challenges.\nThrough the global Corporate Community Partnership (CCP) and the Yunus Social Business (YSB) programmes, Deutsche Bank employees are matched with non-profits in developing and emerging countries. The first coaching phase of the Yunus Social Business programme has started in Albania, Bosnia and Serbia in mid-March. Five employees part in this project. Another colleague will support the Balcan team, by accompanying a Due Diligence of an Albanian social enterprise in Germany.\nThe selection process for the Uganda Accelerator programme also started recently. Four employees of Deutsche Bank will be seconded as coaches from June/July onwards. Moreover, two employees will offer their expertise to the YSB Social Success Note — a new and unique financial tool, jointly launched by YSB and the Rockefeller Foundation, that channels capital flows into underfunded sectors traditionally deemed too risky or unprofitable for mainstream capital. It also enables social enterprises to deepen their impact, e.g. by targeting an underserved segment which would not meet traditional Internal Rate of Return (IRR) investment hurdles.\nAnother coaching project is starting in Cambodia: two volunteers there support the Temple Garden Foundation in developing a communication strategy as well as a comprehensive portofolio. The Temple Garden Foundation works in partnership with local rural communities, acts as a catalyst for sustainable development and aims to accomplish this with carefully selected projects that maximise community involvement and reduce reliance on external funding by governments and NGOs.\nSince 2011, Deutsche Bank has supported the Foundation´s Income Generation Programme that provides a mechanism for savings as well as access to loans for the rural community. Training includes teaching best practice in various agricultural ventures to help community members develop and improve business activities, supplement existing income streams and ensure savings and low interest credit is available, when required.\nA substantial success of the CCP Programme has been achieved in Myanmar. Since 2014, ten employees have assisted local banks in improving their services and in training their staff on best bank practices in cooperation with Deutsche Gesellschaft für Internationale Zusammenarbeit (GIZ). Currently, the programme is turned into a long term strategic alliance - a Public Private Partnership (PPP) - between Deutsche Bank, GIZ and the Yangon University of Economics.\nIn South East Asia, Deutsche Bank is also engaged in the Better Rice Initiative Asia (BRIA) in Thailand as part of the CCP Programme. Together with GIZ, the Deutsche Bank employees support the development of a sustainable rice farming sector. During the last two secondments, employees have evaluated cost-efficiency and feasibility of various new sustainable agricultural technologies, developed financing models and consulted small farmers in order to facilitate an access to financing sources. In the medium run, it is also planned to scale these activities into PPP's.\nSince 2008, a total of 119 employees have helped to empower 75 CCP and YSB projects in Africa, Latin America, Asia, and the Balkans.\nThe enforcement of non-profit organisations is also at the core of the Alternate Income Generation project (AIG) in South Africa, which was developed in 2015 in close cooperation with TSiBA, a non-profit business school. The idea behind the AIG programme is to move more charities towards a hybrid financing model that reduces donor reliance.\nTwo organisational sustainability tools were launched in early March in Johannesburg, designed to improve resilience among South African Civil Society Organisations (CSOs) through self-assessment and capacity building. Both tools were developed by Capacitate, an initiative of social entrepreneurship in partnership with the Deutsche Bank South Africa Foundation. Capacitate was established as a mechanism to challenge conventional models of interaction between NGOs, charity organisations, government departments and donors or corporate investors.\nKirsten Koetsier, Head of Deutsche Bank South Africa Foundation said, “We are pleased to partner with Capacitate to develop this self-learning toolkit, particularly given their expertise, exposure and the excellent work in sustainability carried out by them in the South African non-profit sector. Now any Civil Society Organisation can take themselves through a guided process with access to a solid resource. ”\nPlay\nVideo",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}