{
    "url": "https://www.db.com/news/detail/20160323-a-decade-of-unlocking-young-people-s-potential-through-theatre?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "March 23, 2016",
    "tags": [
        "Corporate Citizenship",
        "Education"
    ],
    "title": "A decade of unlocking young people's potential through theatre",
    "body": "A partnership between Globe Education and Deutsche Bank’s youth engagement programme, Born to Be, the project gives students the opportunity to experience Shakespeare’s plays in the way he intended; not simply as text on a page, but playfully and on the stage for which he wrote.\nWorkshops for students and Continuing Professional Development (CPD) sessions for teachers support the learning and teaching of Shakespeare, alongside comprehensive online resources.\nSince 2014, Deutsche Bank employees have purchased more than 4,000 tickets to a performance, enabling more young people to see one for free. In the past decade, we’ve made it possible for:\nOver 137,000 state secondary school children across London and Birmingham to attend a Shakespeare performance for free;\nOver 20,000 students to attend a workshop;\nOver 1,000 teachers to undertake CPD sessions;\n82% of students to have an improved understanding of Shakespeare's language;\n1.5 million people around the world to make use of the online resources.\nShakespeare is a compulsory part of the syllabus in the UK for 11-14 year olds. At GCSE and A-level, Shakespeare is compulsory for all students studying English Literature. Playing Shakespeare with Deutsche Bank helps students to succeed academically. It also enables young people to develop a richer sense of themselves and their communities, and encourages skills such as critical thinking, empathy and self-expression that are also important to employers.\nGurdon Wattles, Head of Financial and Executive Communications at Deutsche Bank said:\n„We are immensely proud of our 10 year partnership with Globe Education to create a legacy for over 137,000 students who are more passionate and knowledgeable about Shakespeare and better equipped for GCSE and A-level texts. We are delighted to be able to continue our commitment for a further three years to reach another 60,000 young people.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}