{
    "url": "https://www.db.com/news/detail/20190528-united-for-wildlife?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 28, 2019",
    "tags": [
        "Company",
        "Sustainability"
    ],
    "title": "United for Wildlife",
    "body": "Deutsche Bank has pledged its support to United for Wildlife, an initiative that works to tackle illegal wildlife trade.\nSpearheaded by HRH Prince William, United for Wildlife helps conservation organisations, governments, law enforcement and global corporations join forces to protect endangered species like elephants, rhinos, tigers and pangolins.\n“Our collective ambition was to build something that would significantly disrupt illegal wildlife trade,” Prince William said at a United for Wildlife meeting in London earlier this month.\nDeutsche Bank’s commitment\nAs part of Deutsche Bank’s commitment to preserving wildlife and combating illegal trade, in January 2019 it joined United for Wildlife’s finance taskforce, which enables sharing of resources and intelligence in a bid to disrupt the illegal income generated by wildlife trade.\n“Illegal wildlife trade is an organised crime threat that often overlaps with other crimes such as drug and people trafficking,” said Stephen Strickland of Deutsche Bank’s Anti-Financial Crime (AFC) function, who is leading the bank’s efforts as part of the taskforce. “The financial sector has a key role to play in identifying and reporting possible wildlife trade.”\nAFC is committed to increasing awareness and providing training to help identify and investigate potentially illegal wildlife trade activity. AFC also provides intelligence to relevant regulatory bodies or law enforcement agencies, and reviews intelligence alerts received through the taskforce.\n“Through close collaboration with the public sector and other banks as part of the taskforce, we can significantly improve controls and investigations related to wildlife trade,” Strickland said.\nWildlife trade is one of the five most lucrative global crimes\nIllegal wildlife trade is the unlawful harvest of, and trade in, live animals and plants or parts and products derived from them for sale on the international market. There has been an unprecedented spike in the global illegal wildlife trade in the last decade, driven by demand for wildlife and wildlife products as jewellery, souvenirs and pets.\nWildlife trade is estimated to be valued between 50-150 billion US dollars per year. The impact has been devastating: Over the last 10 years, Tanzania has lost 60 percent of its elephant population, while the world’s rhino population has decreased by 90 percent since the 1970s.\n“It is only through continued, committed partnership between transport companies, the financial sector and law enforcement that we will bring these criminals to justice,” HRH Prince William said.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}