{
    "url": "https://www.db.com/news/detail/20190527-european-elections-what-our-experts-say?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 27, 2019",
    "tags": [
        "Research"
    ],
    "title": "European elections – what our experts say",
    "body": "1. How do you assess the outcome of the European elections?\nKevin Körner:\nThe \"grand coalition\" of conservatives (EPP) and social democrats (S&D) has lost its traditional absolute majority in the next European Parliament. Together with the liberals and greens, pro-European groups will still hold a clear majority of two-thirds of the seats in the next EP. But policymaking will likely become more complex and require broader cross-party agreements and discipline.\nEurosceptic and anti-establishment groups and (nonaligned) parties took more than 30 percent of seats and are estimated to have increased their weight in EU policymaking over the next five years. But we remain doubtful that these groups will manage to permanently overcome their (many) differences and use their leverage to promote their own coherent policy agenda.\nBalance in the next EP will also depend on group formation over the next few weeks. Big questions remain, for instance regarding the planned joint group between the liberal ALDE and French President Macron's Renaissance as well as the composition of Italian Deputy PM Matteo Salvini's new far-right Eurosceptic alliance and the efforts of Five Star Movement to create a new (also Eurosceptic) anti-establishment group, potentially to be joined by Nigel Farage's Brexit Party from the UK.\nUlrich Stephan:\nThe election outcome means that it will become increasingly difficult to form majorities and there is a risk of standstill in Europe, which would be bad for the continent. I would like politics to be prepared to compromise and for us to see real developments and progress in Europe, in particular in connection with the challenges posed by the US and China, digitalisation and climate change.\nJohannes Pockrandt:\nThe erosion of the traditional party systems continues. In Germany, the Christian Democrats produced their worst result in party history, and the Social Democrats are at an all-time low. We find ourselves in a Europe that is increasingly dominated by heavy voter swings, which caters more to political movements than traditional peoples’ parties. That is good news in terms of reflecting the will of the people in political institutions, but bad news for market participants looking for medium-term political stability and predictability.\nNina Schindler:\nThe 2019 elected European Parliament is notably more fragmented due to a significant voters swing. The European People’s Party (EPP) and the Socialists & Democrats (S&D) both lost a crucial amount of seats. The “grand coalition” is history. The election winners, the Liberals and the Greens, increased their shares and will possibly become the kingmakers for a new coalition. Besides, eurosceptics gained more than one-fifth of seats with particular strong results in some countries, for instance France, Italy, Poland, and the UK.\nIn terms of policymaking, there is the risk that the more diverse EP composition will lead to diluted legislative compromises and less predictable processes.\n2. What was the biggest election surprise for you personally?\nKevin Körner:\nAlthough the number of Eurosceptic parties represented in the European Parliament has increased, electoral turnout was substantially higher, which shows that voters are happily more interested in the European Union.\nUlrich Stephan:\nI find it amazing that Macron did not get the majority in France, that the Social Democrats won in the Netherlands and the Greens lost voters in Sweden – despite Greta Thunberg. I also find it astonishing that the established parties have been punished so severely, despite the relatively high level of support for the EU. Their elections campaigns probably focused on issues that were too national in nature. The voters are looking for the European Union to develop further and the established parties have given too few answers, although I question whether the marginal parties have these answers.\nJohannes Pockrandt:\nI think the pollsters across Europe did a phenomenal job this time around. Be it the German Greens’ record result, right-wing populist Le Pen beating President Macron in France or the performance of Nigel Farage’s Brexit Party – we were fairly well prepared for all of these events last week.\nNina Schindler:\nGround-breaking surprises failed to appear as the predictions were pretty precise. Although I did not expect such a high turnout. This peak may not only result from an increased European enthusiasm but also arise from a high voters’ mobilisation stemming from the populist waves. However, the anticipated triumph of right-wing parties failed to materialise. The biggest winners for me turned out to be the Liberals and Greens.\n3. What do you expect next?\nKevin Körner:\nThe increased fragmentation on the next EP will make the appointment of the next Commission President a potentially lengthy procedure. None of the EP's \"lead candidates\" will find it easy to secure support of a majority of the MEPs and the Council might see this as a reason to deviate from the \"lead candidate\" procedure altogether.\nA lengthy standoff between Council and Parliament as well as intense negotiations on the top jobs between leaders could push the appointment of the next Commission beyond October. This would reflect badly on the EU's prospective ability for constructive policy making and joint decisions and could thus impact market's confidence and trust in the single currency.\nUlrich Stephan:\nThe election results should have a manageable impact on the EU economy. Parliament has a limited say. Economic policy is still very much in the hands of the nation states. By contrast, European trade policy is largely being designed in Brussels. There is a risk of tariffs on cars and I hope Europe will act here. Europe also needs to find answers to the dispute on technological leadership between the US and China.\nI also hope that there will be a swift decision as to who becomes the new President of the EU Commission so that he or she would then be able to negotiate and make sure European interests are defended against the US, China, Russia and other parts of the world.\nJohannes Pockrandt:\nI expect the European Parliament to put up a hard fight for its place in the EU institutional system. In Germany, the lead candidates of all parties but the far-right AfD have pledged to support the “Spitzenkandidat” process, i.e. the promotion of one of the European lead candidates to Commission President. If the EP backs down from this position, it will almost certainly lose influence in the Brussels power play over the coming years.\nNina Schindler:\nWe will see a merry-go-around for the EU top jobs in the coming weeks. I expect the EP will insist on its “Spitzenkandidaten” model to have a stance on the next EU Commission President. The high turnout clearly strengthens the EP in the selection process vis-à-vis the Member States, especially with some of the EU leaders’ parties having suffered a loss in this election (e.g. Germany, France). Clarity on names is expected before the summer break in July.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}