{
    "url": "https://www.db.com/news/detail/20190524-profit-and-purpose-are-not-mutually-exclusive-rockefeller-urges-millennials-to-invest-with-values?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 24, 2019",
    "tags": [
        "Sustainability"
    ],
    "title": "Rockefeller urges millennials to invest with values",
    "body": "Justin Rockefeller, the great-great-grandson of the oil magnate John D. Rockefeller, urged millennial Deutsche Bank Wealth Management clients to invest in line with their values at an event in New York earlier this month.\nWhat people do with their resources – including capital – has moral consequences,” Rockefeller said at a roundtable on impact investing at Wealth Management’s offices in 345 Park Avenue. “Profit and purpose are not mutually exclusive; business can be an expression of values.\nThe values-aligned investor and financial technology professional said that all investments, and thus all companies, have positive and negative consequences. Everyone has a “tool belt for effecting social change,” including time, passion, expertise, influence and capital; how and whether one uses those tools also has moral consequences, he said.\nWhile Rockefeller was serving on the board and investment committee of Rockefeller Brothers Fund, the private foundation announced in 2014 that it would divest its coal, tar sands and other fossil fuel holdings and instead invest that money in managers whose work aligns with the foundation's mission. Five years later, the fund has handily outperformed its 70% MSCI ACWI and 30% Barclays Global Aggregate Bond Index benchmark, he said.\nHe gave examples of early-stage impact investments he has made personally including in Zero Mass Water, which produces solar panels that extract drinking water from the air, and Modern Meadow, which uses biofabrication to make real leather in a laboratory in New Jersey, without harming cows.\nRockefeller is also the Global Director of Family Offices and Foundations at Addepar, a financial technology company, and co-founder and chairman of The ImPact, a network of family enterprises committed to making investments with measurable social impact.\nImpact investing forms a helpful bridge among generations and political divides,” combining conservative emphasis on market efficiency with liberal social and environmental values, he said. “It gets younger people more interested in finance and helps families reflect on their own values.\nThe roundtable was part of Wealth Management's two-decade old Next Generation programme, which counts around 500 alumni from events including its annual flagship Innovation Summit in California. Building multi-generational relationships with clients is a key part of the business's long-term growth strategy, as ultra-high net worth baby boomers are expected to pass down approximately 4 trillion dollars over the coming decade.\nRolfien Kuijpers, head of responsible investments and strategic relationships at DWS, also spoke at the event. She delivered a sobering outlook on the environmental – and consequent social -- threats facing the world within the lifetimes of the young audience and an uplifting perspective on the potential investment gains to be achieved by focusing on companies with strong governance.\n“You should all be thinking about your entire portfolio across public and private markets with an environmental, social and governance (ESG) perspective,” Kuijpers said. “If we want to change the world, and continue as a species, we should think about the total 135 trillion dollars in assets under management globally being invested in a more responsible way.”",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 0
}