{
    "url": "https://www.db.com/news/detail/20190522-global-wealth-managers-out-of-the-pit-stop-into-the-fast-lane?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 22, 2019",
    "tags": [
        "Corporate products",
        "Digitalisation",
        "Investment Banking",
        "Research",
        "Wealth"
    ],
    "title": "Global wealth managers: out of the pit stop – into the fast lane",
    "body": "Oliver Wyman and Deutsche Bank have today released their fourth annual wealth management report, titled “Out of the pit stop – into the fast lane”, providing an overview of recent industry trends and an outlook for future developments. Listen to the podcast about that report.\nWealth managers faced growing headwinds in 2018, with global high-net-worth (HNW) wealth growth slowing to 4 percent. Lower asset under management growth, more challenging markets and continued fee compression created revenue pressure and led to declining wealth management business valuations.\nThe report highlights the following priorities:\nRethink footprint in emerging markets – more than half of HNW wealth growth will originate in emerging markets, so wealth managers need to rethink their positioning.\nAsia-Pacific – based on structural changes, now is the time to assess entry into Mainland China.\nLatin America – wealth managers must guide clients on their path towards more sophisticated investment strategies and better understanding of risk, given the low interest environment.\nSimplify the operating model – the Q1 2019 market rebound has given wealth managers a chance to improve their operating model efficiency and adjust their cost base\nTo increase efficiency in the front office, wealth managers must free up advisor capacity for revenue generating activities by automating and digitizing processes, particularly in client onboarding, KYC/AML, and lending.\nCosts remain stubbornly high. Wealth managers need to focus on understanding and steering cost allocations as well as establishing a culture of cost ownership.\nThis report does not include Deutsche Bank Wealth Management.\nMore information\nThe full report is available to clients of Deutsche Bank Research.\nClick here for an overview of the 2018 report: Global Wealth Management – Dare to be Different",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 1
}