{
    "url": "https://www.db.com/news/detail/20171122-capital-markets-outlook-2018-deceptive-calm-coming-to-an-end?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 22, 2017",
    "tags": [
        "Investment Banking",
        "Research"
    ],
    "title": "Capital Markets Outlook 2018: deceptive calm coming to an end?",
    "body": "Capital markets driven by economic upturn and the normalisation of monetary policy\nGlobal economy to grow 3.8 percent in 2018, German GDP flat at least 1.8 percent\nCorporate earnings could drive stock prices in 2018, bonds to come under pressure\nDAX target for end of 2018: 14,100 points\nThe global economy should post consistently solid growth in 2018 and US monetary policy should gradually return to normal. In its Capital Markets Outlook 2018 published in Frankfurt today, Deutsche Bank’s capital markets experts point out that there are nevertheless potential economic perils, especially of inflation rising too rapidly. “If the price pressure should climb faster than expected, the central banks could see themselves compelled to make a more aggressive exit from their continuing expansionary monetary policy – with correspondingly negative repercussions for the global economy,” said Stefan Schneider, Chief German Economist at Deutsche Bank Research.\n2018 will therefore be characterised by two market-defining factors: on the one hand, the strong global economy, and on the other, the central banks which will have to achieve a cautious transition to a less expansionary monetary policy. “This is challenging because there is no precedent for exiting a zero interest rate policy – the currency guardians are having to probe into uncharted territory and act with corresponding caution,” said Ulrich Stephan, Global Chief Investment Officer at Deutsche Bank Private & Commercial Clients. “We are however optimistic that the monetary policy actions of the central banks will not have a lasting negative impact on the global economy in 2018.”\nMacroeconomics: full steam ahead\nThe global economy is on a robust upswing that should continue in the coming year with growth in the major economic regions likely to exceed potential once again in 2018. “This trend will primarily be driven by a marked increase in global trade that has long been sluggish,” said Schneider. At the same time the economic drivers are shifting: “Whereas private consumption has driven growth to date, mainly thanks to positive labour market developments and oil-price induced increases in purchasing power, investment in machinery and equipment are now gaining importance – both in developed markets and emerging markets,” emphasised Stephan. “Overall, global economic growth at nearly 4 percent of GDP in 2018 should end up at roughly the same level as in 2017,” Schneider forecast. Geopolitical risks and stronger than expected inflation growth could, however, dampen the upturn.\nEurope and Germany: cyclical upturn to continue\nDeutsche Bank currently detects no signs of a tangible cyclical slowdown in the eurozone. Despite the uncertainty about progress in the ongoing Brexit negotiations and the results of the Italian parliamentary election scheduled for next Spring, Deutsche Bank’s experts forecast economic growth of a solid two percent in 2018. This should prompt the European Central Bank (ECB) to terminate its bond purchase programme by the end of 2018. “We think ECB key rate hikes are possible in mid-2019,” said Stephan.\nIn Germany, the ongoing upturn in the labour market will probably result in higher wage settlements being reached in the upcoming negotiations between employer and employee representatives. ”We assume that this will feed through to a higher inflation rate, that could approach the two percent mark at the end of 2018,” said Schneider. The uncertainties caused by the surprising termination of exploratory talks about a so-called Jamaica coalition of CDU/CSU, FDP and Greens are likely to feed through to the sentiment indicators, but only be a minor burden on the German economy. “We still forecast that there is a realistic chance that a new government can be formed without a new election being held,” said Schneider. Deutsche Bank forecasts economic growth in Germany of about two percent in 2018.\nUSA: strong growth with upside potential\nThe US economy is increasingly based on broad foundations: the traditionally robust consumption is being supplemented by rising corporate investments. “This upward trend will continue and become even stronger, if the planned tax reforms are implemented,” asserted Stephan. At the same time, the impact of the change in the Fed chairman scheduled for February 2018 is likely to be minor. “Jerome Powell will stick to the course set by his predecessor Janet Yellen, so we still expect four rate moves by the end of 2018 – including one this December.” Deutsche Bank forecasts that in the coming year the US economy will grow by 2.6 percent – compared with 2.2 percent for 2017.\nCurrencies: all change on exchange rates\nThe better than expected eurozone economic data at the start of the year have buttressed the single currency in 2017. “We assume that this trend could reverse in the first half of 2018 and that the US dollar could strengthen against the euro again,” said Stephan. He added that the main reason for this is the monetary policy of the Fed. Nevertheless, the euro might already make good the lost ground in the second half of 2018: as soon as the ECB will probably terminate its bond purchase programme towards the end of the year and possibly trigger initial debate about rate hikes, market participants could assume that the ECB will pursue a more restrictive monetary policy. Following an interim high for the US dollar of possibly below USD 1.15/EUR Deutsche Bank therefore expects the euro to firm again at the end of 2018 at USD 1.20/EUR.\nAsset classes, regions and sectors\nBonds – difficult farewell\nFollowing a challenging 2017 fixed income investors are unlikely to fare much better in 2018. According to Stephan, although it is too early to talk about a bear market (constantly falling prices); the decades-long bull market (constantly rising prices) is drawing to a close. “We expect interest rates to continue rising at both the short and long ends of the yield curve in the US and the eurozone.” In the US prices are likely to be dampened not only by the expected key rate hikes but also by the smaller Fed balance sheet and China’s smaller current account surpluses – both combined with fewer purchases of US government bonds. “Although marked increases in capital market rates are not to be expected in the eurozone,” said Stephan, “we do expect rising yields on German government bonds – the benchmark for eurozone bonds: the 10-year Bund should yield around one percent at the end of 2018.” From a yield perspective, it could be worth looking beyond the developed markets. “The higher yield level in emerging markets comes at the cost of higher risks, however. Above all, locally denominated paper is likely to come under increasing pressure as US interest rates rise,” Stephan pointed out.\nStocks – the final mile is the best\nThe uptrend in global stocks is set to enter its tenth year in March 2018. “Market participants could demand a higher risk premium on account of the already longstanding cycle,” said Stephan. Nevertheless, the outlook is interesting due to the strong global economy: “We believe that prices could continue to rise, possibly even beyond 2018”. One particular source of hope is the fact that corporate earnings have now become the main driver of price movements. “Whereas company valuations may even drop slightly, global earnings for the coming year are forecast to average a solid 10 percent,” explained Stephan. “Stocks could play a role for correspondingly risk-seeking investors in 2018 as well.” Deutsche Bank prefers cyclical sectors such as technology, finance, industrials and consumer cyclicals. Given the tension between the business cycle and central bank policy investors will, however, have to expect major price swings. “Following the moderate fluctuations this year temporary price fluctuations would represent a normalisation of the markets,” said Stephan.\nThe German stock market is likely to continue benefiting from its cyclical orientation – even though prices may fluctuate more sharply as a result. Companies that generate most of their sales outside Europe could be the main beneficiaries of the improved global economic outlook. Stephan forecasts that the DAX will have reached 14,100 points at the end of 2018.\nUS: positive development thanks to strong corporate earnings\nThe drivers of the US stock markets in the current year include corporate earnings which are rising broadly. According to Stephan, S&P 500 earnings per share could rise by more than 12 percent in 2017. Overall, US stock valuations are already comparatively ambitious. “On account of the low interest rate level and the high return on equity of companies I do not consider them to be unjustified, however,” said Stephan. Another interesting aspect is that recently investors have evidently favoured companies that have invested more in their own growth and thus the future. After all, the stocks of companies with high capital expenditure have posted better performance recently. Deutsche Bank forecasts continued growth in earnings and capital expenditure in 2018. Its S&P 500 forecast for the end of 2018 is 2,850 points.\nAsia: Japan and China in transition\nIn Asia, Deutsche Bank’s focus is on Japanese and Chinese stocks. In Japan, the leading Nikkei index recently climbed to a 25-year high and the outlook remains rosy. “Japanese multinationals are benefiting from the uptick in world trade,” said Stephan. The fact that in the year to date the yen has traded lower on average than in 2016 is helping Japanese exports. In addition, there are the large cash reserves of Japanese firms that should accrue to investors over the long term either via dividends and share buybacks or could be used for capital expenditure. The development of liberalisation in the Chinese stock market is exciting. Due to the long-term high savings ratio of the Chinese they have accumulated about 10 trillion US dollars which might also be invested outside mainland China over the medium term. The Hong Kong and mainland China stock exchanges are linked via so-called Stock Connects. “The continuing liberalisation of the economy and the stock exchanges is making it easier for the Chinese to invest money on a more global and diversified scale,” according to Stephan. Moreover, international investors could gradually become more interested in mainland Chinese stocks due to the opening-up of markets.\nReal estate: no end in sight\nGiven the continuing global trend towards urbanisation, the markets for residential real estate in conurbations look to remain interesting. “This also applies to Germany, where the supply in many large cities cannot keep pace with the rise in demand – there is simply too little construction going on,” said Stephan. In the commercial real estate segment, office space in the global metropolitan regions could benefit from the growing importance of the service sector. Deutsche Bank regards advanced logistics facilities as particularly interesting. “Online retailing increasingly requires efficient and agile supply chains to be able to fulfil increasing customer expectations with respect to delivery times and flexibility,” said Stephan. The demand for such spaces is likely to rise worldwide in 2018, whereas traditional retail properties and shopping centres will continue to feel the squeeze.\nCommodities – renaissance of the (super) cycle\nThere are indications that trading prices on the commodities markets will continue to stabilise over the coming year. This applies to oil, too. Prices should not rise substantially due mainly to US oil producers who might compensate for potential cuts in production by OPEC over the short term. Price developments in industrial metals will largely be determined by China. “Reductions in overcapacities in China’s heavy industries, for example steel and aluminium production, will support the corresponding trading prices, while prices of raw materials such as iron ore and bauxite will remain under pressure,” stated Stephan. However, China will also remain a major customer. The world’s second largest economy accounts for 47 percent of the global demand for copper, for example. Over the coming years, the demand for oil, aluminium and copper, for example, is expected to rise significantly. Deutsche Bank strategists see little potential for the price of gold because with interest rates increasing in the US, investors have to fear higher interest income losses compared to US Treasuries. As a rule, this has a negative impact on the demand for and price of gold. Deutsche Bank expects the price of gold to be USD 1,230 per troy ounce by the end of 2018.\nTrends – tomorrow’s markets\nFuture-oriented investment opportunities, such as bitcoins, are currently enjoying a lot of attention in the media. “As far as Deutsche Bank is concerned, crypto-currencies are not an investment topic at present,” said Stephan. This is a view also shared by the Federal Financial Supervisory Authority (BaFin). “Of course, we will continue to keep a close watch on these currencies. However, as long as the market remains unregulated – contrary to the demands of the ECB – we would advise most urgently against getting involved, especially as bitcoin has fluctuated much more strongly than exotic currencies such as the Malagasy ariary or the Botswana pula.”\nQuite the opposite holds for other future-oriented industries. Broad-based investments in digital trends, for instance, the Internet of Things, big data, cloud computing and e-payments offer potential for investors – this could already be clearly seen over the past five years. According to Stephan, a further interesting fact is that digitalisation is bringing about an increase in data volumes and global networks. Because the risks for users are growing, providers of cyber security solutions could continue to be the main beneficiaries of this trend. Although Stephan considers the hype surrounding e-mobility to be just as exciting, at the same time, however, it is more uncertain than the other megatrends already mentioned. “While it is certain that digitalisation is gaining ground in our daily lives and the world of work, it still remains to be seen which propulsion technology will ultimately be triumphant,” said Stephan.\nAsset allocation\nRisks – the next crisis will come around for sure\nEven without a potential overshooting of inflation, stronger fluctuations on the capital markets are to be expected in the coming year. In Deutsche Bank’s view, geopolitical factors, such as the intensification of the conflict with North Korea and political risks in Europe hold potential for turbulence. Although Deutsche Bank does not expect next year to be as resistant to fluctuation as 2017 has been, nevertheless, the bank is fundamentally positive about 2018. In addition to investments in real estate and multi-asset funds, according to Stephan, investments in stocks and bonds could come in to play for investors who are willing to take risks: “Our answer to the increasing bond market risks is an active term structure and flexible management.” In spite of the partially improved outlook, direct investments in commodities do not play a notable role for Deutsche Bank at present.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}