{
    "url": "https://www.db.com/news/detail/20171117-deutsche-bank-partners-with-ibm-for-block-chain-based-shared-kyc-platform?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 17, 2017",
    "tags": [
        "Entrepreneurship",
        "Research"
    ],
    "title": "Deutsche Bank partners with IBM for block-chain-based shared KYC platform",
    "body": "Deutsche Bank is part of a group of organisations that partnered with IBM on a block-chain-based shared Know Your Customer (KYC) proof-of-concept (POC). IBM announced the successful completion of the POC at the Singapore Fintech Festival this week. Other companies involved include HSBC, Mitsubishi UFJ Financial Group (MUFG) and the Treasuries of Cargill and IBM.\nThe current KYC process requires customers to submit information to different banks each time they start a new relationship, which includes opening an account, taking out a loan or buying an insurance policy. The essential process can take weeks with resources spent validating the identity of the customer. The shared KYC platform provides a secure, decentralised and efficient method for banks to collect, validate, store, share, and refresh trusted KYC information. It also provides a scalable infrastructure to implement the open shared KYC network, providing benefits to all network participants – banks, corporates and regulators. Another important benefit of the new platform is the role it will play in helping to combat financial crime.\nIn a media briefing, IBM explained that banks can use the platform to enhance customer experience and automate mandatory processes, which will result in operational savings and reduce operational risk over time. Banks also benefit from reduced paperwork: they will only have to go through the KYC process once and can then share the data – eliminating redundancy – with relevant financial institutions by means of a consent model.\nThe Singapore Fintech Festival is a week-long event organised by the Monetary Authority of Singapore in partnership with the Association of Banks in Singapore (ABS) and brings together financial service organisations and fintech companies to collaborate on financial technology initiatives.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}