{
    "url": "https://www.db.com/news/detail/20171110-deutsche-am-integrates-corporate-scores-on-exposure-to-catastrophic-climate-events?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 10, 2017",
    "tags": [
        "Sustainability"
    ],
    "title": "Integrating corporate scores on exposure to catastrophic climate events",
    "body": "A ground-breaking approach to climate risk management has been developed by Deutsche Asset Management in partnership with California-based climate intelligence advisory firm Four Twenty Seven.\nFour Twenty Seven has mapped the physical locations of more than one million corporate facilities globally and uses climate science models to assess the likelihood of them being affected by climate hazards such as heatwaves, floods and cyclones. This means that exposure to catastrophic events for individual companies can now be calculated.\nThis is the first time the physical location of corporate facilities and their exposure to climate-related events have been mapped for investment purposes. Deutsche AM will now be able to integrate a company’s physical climate risk equity score within new investment products, and assess the implications of climate events for individual companies in its portfolios.\nThe scoring methodology identifies and categorises the location, activity and business sensitivity of facilities or companies to climate hazards. Climate science models are then applied to assess the geographical exposure to climate hazards. The business impact of these is measured from an operations, supply chain and market risk perspective.\nThe data can be analysed, for example, to look at how rising sea levels could affect coastal and offshore oil and gas infrastructure, how floods could disrupt supply chains, or whether extreme heat affects labour productivity in the agricultural and construction sectors.\n“The availability of this new data on physical climate risk is a major step forward to addressing a serious and growing risk for investors. Climate risk is now centre stage, however we believe the investment industry needs to champion the disclosure of annual and once-in-a-lifetime climate risks by companies. We have a duty to understand what more hurricanes or heatwaves mean for valuations and investment returns,” said Nicolas Moreau, Head of Deutsche Asset Management (pictured).\nThis new approach, and the physical climate threat to investment portfolios, is outlined in a research paper by Four Twenty Seven and Deutsche AM that was launched as the COP23 climate conference in Bonn gets underway.\nIt tackles physical risk head on, giving credible insight into the vulnerability of corporate production and retail sites to climate change. Factors such as sea level rise, droughts, flooding and cyclones pose an immediate and measurable threat to investment portfolios.\nWhilst no location is immune from the risks of physical climate change, the research paper highlights Asia as particularly vulnerable. Five out of six people occupying the highest climate risk zones globally live in Asia, with 145 million people in China living on land threatened by rising seas.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}