{
    "url": "https://www.db.com/news/detail/20180328-a-message-from-john-cryan-on-the-current-situation?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 28, 2018",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "A message from John Cryan on the current situation",
    "body": "Dear Colleagues,\nIt is holiday season for many of you and no doubt you have been looking forward to a few peaceful and quiet days with family and friends. Unfortunately, we have not had much of that peace and quiet at our bank, as once again we are the subject of widespread rumours. Having been in touch with quite a few of you in the past week I know that many of you are worried about the destabilising effect this has on us all.\nI just wanted to reaffirm that I am absolutely committed to serving our bank and to continuing down the path on which we started some three years ago. There is a lot of talk about our performance in and outside the bank. We all know that we have a lot of work to do: our programmes are ambitious, but the financial results have so far not been what all of us would want them to be.\nAlthough easier to say and harder to do in these circumstances, we need to focus on executing on the strategy that was agreed and signed off by both the management and supervisory boards. There is no difference of opinion here. We need to demonstrate more visibly the excellent progress we are making in so many areas, so that doubts about our bank fade away over time. We have strong momentum right now, so let’s not allow ourselves to be thrown off course. The IPO of DWS is the obvious and most illustrative recent example of a key milestone of success that we have passed. We have also demonstrated our ability to sustain market share in our most important business lines, especially in our fixed income sales and trading, even in difficult times. In the coming months, you can expect further positive developments with the Private & Commercial Bank merger in Germany.\nChange remains the only constant in our world, and as we continue to notch up successes in our change programmes I personally have to give the company direction as we have to rebalance the often conflicting demands of our various stakeholders. We do need to stay absolutely attentive to our mandatory remediation projects and to improving our control environment. But as we gradually put these tasks behind us, we can invest more and more of our time and resources into building new businesses and making those we are in much more efficient. It will lead to more emphasis on generating attractive shareholder returns and to returning to growth. This is the best way to stay out of unwanted headlines and I will commit all my efforts to make this happen.\nWith warmest wishes to you all, and, as always, heartfelt thanks to you for your tremendous commitment to placing this great institution back where it deserves to be.\nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}