{
    "url": "https://www.db.com/news/detail/20180327-deutsche-bank-puts-art-in-the-frame-in-asia-pacific?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 27, 2018",
    "tags": [
        "Art",
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank puts art in the frame in Asia Pacific",
    "body": "Tokyo, Sydney, Singapore and Manila are all cities popular for their vibrant art scene. As part of its commitment to promote art in the region, Deutsche Bank, through its Art, Culture and Sports division, has kicked off high-profile art engagements in these cities\nThe 13th edition of Japan’s largest art fair, ART FAIR TOKYO 2018 (AFT) drew a record 60,026 visitors between March 8 and 11 with 164 exhibitors. The annual event is a unique platform that features a wide range of Japanese, Asian and international artworks from antiques and crafts, modern art and contemporary art. The fair continues to evolve and expand as a platform for the art market, connecting past and present, Asia and the West, and presenting historically inspired artistic contexts.\nDeutsche Bank’s sponsorship of the PROJECTS section supports young Japanese gallerists and introduces highlights from their collections to fair visitors in special tours.\nThe fair’s opening programme “Art & Diversity”, sponsored by Deutsche Bank, attracted more than 180 guests, including clients and a range of art professionals, collectors, diplomats, diversity leaders from around Tokyo and staff.\nHeld on International Women’s Day, the opening featured a talk by the actress and civil-rights advocate Sahel Rosa; the fair’s Senior Advisor Hozu Yamamoto; Makoto Kuwahara, Deutsche Bank’s Chief Country Officer for Japan and dbPride Japan Chairperson, Nanako Imazu from Japanese Equity Sales.\nDown under in Australia, the 21st Biennale of Sydney officially opened to the art loving public just recently. Deutsche Bank is a major partner of this three month contemporary art festival, which showcases works from 70 artists across six Sydney venues.\nAround 650,000 visitors are expected from March to June, adding to the four million visitors of past editions and making it Asia-Pacific’s largest international festival of contemporary art. Deutsche Bank has enjoyed a relationship with the Biennale of Sydney for a decade and continues the bank’s strong commitment to the arts in Australia alongside its sponsorship of the Sydney Contemporary (September 13-16, 2018).\nIn Singapore Deutsche Bank has partnered with OH! Open House to bring art out of museums and into everyday spaces to change the way society experiences art.\nBrainchild of local curator Alan Oei and Deutsche Bank's Oliver Bettin, Head of Asset Financing Asia, OH! Open House is a unique art walkabout where close to 120 dedicated volunteers show the secret life of Singapore to participants from all walks of life.\nOH! Gives artists in the region opportunities to experiment and give new meanings to everyday spaces. The participants experience and appreciate art while learning more about the history of the neighbourhood. Its eighth edition held this month explores the colonial past of Emerald Hill in Orchard Road, when the area - now an iconic shopping district - was known for nutmeg plantations.\nThrough the Appreciating Art programme, the once blank walls in the main lobby of Deutsche Bank Group Manila are now regularly adorned with the work of local artists. Initiated and solely driven by employees, the programme is part of Plus You, the bank’s volunteering and giving initiative. Since its launch in 2012, Appreciating Art is increasingly popular with employees and has featured more than two dozen of the country’s top artists and helped launch multiple new talents onto Manila’s colourful arts scene.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}