{
    "url": "https://www.db.com/news/detail/20180316-deutsche-bank-publishes-2017-non-financial-report?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 16, 2018",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank publishes 2017 Non-Financial Report",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) today published its Non-Financial Report 2017. This is the first report under the new German law on non-financial reporting and replaces the Corporate Responsibility Report in which Deutsche Bank has covered sustainability and other non-financial topics since 2002.\nThe new Non-Financial Report covers topics that the financial industry commonly refers to as environmental, social and governance (ESG).\nJohn Cryan, Chief Executive Officer, said: “Deutsche Bank aims to foster business that enables sustainable economic growth and societal progress by creating a positive impact for its clients, its people, its investors and its communities.”\nIn 2017 the bank reinforced governance by establishing a Sustainability Council. This body comprises senior managers representing the business divisions and infrastructure functions across the bank. The Council will advise the Management Board on ESG matters, further develop and enforce our sustainability approach and improve co-ordination across the bank’s businesses. “This is a commitment to responsible banking. In 2017, Deutsche Bank continued to integrate sustainability into the fabric of all our businesses,” Cryan added. “We reinforced our structures to give ESG commitment a higher priority.”\nSustainability in Deutsche Bank’s businesses\nThe Corporate & Investment Bank is one of Europe’s leading private-sector financiers of clean energy projects. In 2017, Deutsche Bank arranged 2.2 billion euros in project financing for renewable energy projects expected to generate around 3,800 megawatts. We also partnered with clients in a number of landmark issues in the fast-expanding Green Bond market.\nThe Private & Commercial Bank offers a broad range of financial products including loans for energy efficient building and renewable energies that are subsidised by the KfW bank group. In 2017, we arranged 13.9 million euros in KfW loans for renewable energies and 30.9 million euros in KfW loans for energy-efficient construction for our commercial clients in Germany. In November, Wealth Management launched the first in a series of ‘CIO Insights Special’ publications on ESG topics to raise awareness among clients of its ESG investment approach.\nThe asset management division, in future branded DWS, had 20.0 billion euros of ESG assets under management, including 9.4 billion euros of real estate investments in certified green labelled buildings, at the end of 2017. Governance was strengthened in 2017 by establishing a Global Leadership Team for Responsible Investments led by a member of the Deutsche AM Global Executive Committee, who will further ensure effective integration of ESG factors into investment and business processes.\nCommunity engagement\nAcross the world, Deutsche Bank also engages in the communities it serves. Its corporate social responsibility programs reached more than five million people in 2017. Approximately 3.1 million people enjoyed access to Deutsche Bank art, culture and sport sponsorships and programmes, while the bank’s social and education programmes reached 2.1 million people.\nDeutsche Bank’s community development efforts supported 147 community projects in 25 countries, impacting the lives of almost 700,000 people and tackling issues like poverty, forced migration, joblessness, and homelessness and providing relief in emergencies. “Made for Good”, Deutsche Bank’s enterprise program for social good, has focused on leveraging the expertise of employees to help grow 4,466 innovative enterprises in 12 countries that tackle urgent social and environmental challenges. They in turn reached more than 200,000 people through their work. The bank’s “Born to Be” youth engagement programme helped 1.2 million young people in 25 countries to develop their potential.\nMore than 17,000 Deutsche Bank employees donated over 235,000 hours of their time and expertise in a wide variety of volunteering activities during 2017.\nThe report can be downloaded from: www.db.com/ir/en/reports-and-events.htm",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}