{
    "url": "https://www.db.com/news/detail/20180316-deutsche-bank-publishes-annual-report-2017-and-audited-financial-results?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 16, 2018",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank publishes Annual Report 2017 and audited financial results",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) today published its 2017 Annual Report. This includes an overview of Deutsche Bank, the Management Report and the bank’s audited consolidated financial statements for the financial year 2017.\nIn addition, the bank today published its Non-Financial Report and Human Resources Report. In its audited results, Deutsche Bank reports a net loss for 2017 of 735 million euros, versus a net loss of 497 million euros in its preliminary and unaudited results published on 2 February 2018.\nFurther analysis of deferred tax assets (DTAs) resulted in a valuation adjustment to the bank’s DTAs in the UK. This accounted for most of the difference between the bank’s preliminary and final audited results. Having reflected this adjustment in the 2017 financial statements, the bank also adjusted for less material accounting-related adjustments to its deferred compensation and pension liabilities. These adjustments are not material to the operating performance of the bank’s business divisions.\nThe Management Board and Supervisory Board will propose a dividend of 11 cents per share to the Annual General Meeting and confirm payment of AT1 coupons.\nThe bank’s Common Equity Tier 1 capital ratio (fully-loaded) was 14.0 percent at year-end 2017 versus 11.8 percent at the end of 2016. Risk weighted assets were reduced by 4 percent to 344 billion euros, versus 358 billion euros at the end of 2016.\nJohn Cryan, Chief Executive Officer, said: “We remain committed to our objective of delivering a net profit and a competitive dividend payout for 2018. In the meantime we have established the basis for realising Deutsche Bank’s full potential.”\nFinal and audited results at a glance (in EUR million):\n  FY2015  FY2016  FY2017  2017 vs 2016 \n Net revenues  33,525  30,014  26,447  (12)%\n Provision for credit losses  956  1,383  525  (62)%\n Total noninterest expenses  38,667  29,442  24,695  (16)%\n Income before income taxes  (6,097)  (810)  1,228  N/A\n Income tax  675  546  1,963  N/A\n Net income  (6,772)  (1,356)  (735)  (46)%\nCompensation\nThe Management Board has decided to waive its variable compensation for the 2017 financial year. The Supervisory Board respected the decision and has therefore refrained from setting variable compensation for the financial year 2017 for the members of the Management Board.The twelve members of the Management Board collectively received for the year 2017 compensation (without fringe benefits and pension service costs) totalling 29.2 million euros. John Cryan, Management Board Chairman and Group Chief Executive Officer, received a salary of 3.4 million euros.\nTotal compensation awarded to Deutsche Bank employees in respect of the year 2017 increased to 10.3 billion euros (2016: 8.9 billion euros). This includes variable compensation (group and individual components) for employees of 2.2 billion euros, versus 0.5 billion euros in the prior year and 2.4 billion euros in 2015. The year-on-year increase predominantly reflected the return to a more normal system of variable compensation in 2017, whereas the bank awarded only limited individual variable compensation for the year 2016. 43 per cent of the performance-based variable compensation for 2017 will be paid out in future years.\nHuman Resources Report\nThe bank’s Human Resources Report, published today for the fifth time, complements the Annual Report. It provides employee statistics and information on Deutsche Bank’s strategic Human Resources (HR) priorities and initiatives during 2017 and details on key metrics and people-related activities.\nThe number of employees (full-time equivalent) decreased in 2017 by 2,209 or 2.2 percent to 97,535. Germany saw the largest decline in employee numbers, largely driven by the restructuring of PCB. In Asia-Pacific, the number of employees increased due to the insourcing of business-critical external roles especially in Technology. The bank remained committed to filling vacant positions with internal candidates whenever possible. During 2017, 32 percent of open positions globally and 66 percent in Germany were filled with internal candidates.\nInvesting in young talent\nDeutsche Bank also continued to hire graduates, with 619 joining in 2017 versus 813 in the prior year. Underlining the value of science, technology, engineering and mathematics (STEM) profiles across all businesses, 40% of the 2017 class has a STEM degree, while 30% of the bank’s graduate intake was into technology roles. The proportion of female graduates in the new class is 37%. In Germany the bank sustained its apprenticeship programme, hiring 616 new apprentices during 2017. 47% of apprentices are women.\nHarnessing the benefits of digitalisation\nDeutsche Bank Human Resources implemented a new online learning and training curriculum bank-wide in 2017. Additionally, a digital job search engine enables employees to upload their CV in order to find matches to open in-house jobs. An innovative “Stay Connected” app allows the bank to engage with its graduate recruits twelve months prior to their start date at the bank.\nA commitment to gender equality and diversity\nThe bank underlined its commitment to gender equality and made further progress in this area during 2017. The percentage of women Managing Directors and Directors rose again, from 21.3 percent in 2016 to 21.9 percent. The number of women at these levels has grown by around 15 percent since Deutsche Bank’s 2011 voluntary commitment, with other DAX 30 companies, to increase the proportion of women in executive positions and includes two Management Board members, Chief Operating Officer Kim Hammonds and Chief Regulatory Officer Sylvie Matherat.\nThe proportion of women on the Supervisory Board remained at 35 percent. In 2017, Deutsche Bank was one of only two DAX companies to be included in the Bloomberg Financial Services Gender-Equality Index (BFGEI).\nDeutsche Bank operates in 60 countries and had employees from 149 different nationalities as at the end of 2017. The bank continued to support inclusion for lesbian, gay, bisexual, transgender and intersex (LGBTI) people and in 2017 became a founding signatory for the United Nations Standards of Business Conduct to prevent LGBTI discrimination in the workplace. For the fifteenth year in a row Deutsche Bank was awarded the maximum score of 100 in the Human Rights Campaign’s annual Corporate Equality Index.\nAll reports can be downloaded from: www.db.com/reports\nThe Annual Report on Form 20-F, which will be submitted to the U.S. Securities and Exchange Commission (SEC) over the course of today, will also be made available following submission (in English only) on the website:\ninvestor-relations.db.com/reports-and-events/sec-filings-for-financial-results/\nAn updated full-year 2017 Financial Data Supplement is available at: www.db.com/ir/en/reports-and-events.htm.\nToday, the bank also published its 2017 Annual Financial Statements and Management Report for Deutsche Bank AG under HGB and its Pillar 3 Report.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 1
}