{
    "url": "https://www.db.com/news/detail/20180311-deutsche-bank-determines-price-range-and-offer-structure-for-ipo-of-dws?language_id=1",
    "language": "EN",
    "article_type": "Ad-hoc Release",
    "publish_date": "March 11, 2018",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Deutsche Bank determines price range and offer structure for IPO of DWS",
    "body": "Frankfurt am Main, 11 March 2018, 20:40 CET - Deutsche Bank AG (“Deutsche Bank”) (XETRA: DBKGn.DE / NYSE: DB) has set the price range for shares offered in the planned Initial Public Offering (“IPO”) of DWS Group GmbH & Co. KGaA (“DWS”) between EUR 30.00 to EUR 36.00 per share.\nThe base offering consists of 40 million existing ordinary bearer shares held by DWS’s sole shareholder, DB Beteiligungs-Holding GmbH, a 100% subsidiary of Deutsche Bank and corresponds to 20 percent of DWS’s existing share capital. In addition, Deutsche Bank reserves the right to offer up to 4,782,600 shares (2.4 percent of the share capital) from its indirect holdings in the event of particularly strong demand (upsize option). Moreover, up to 5,217,400 shares (2.6 percent of the share capital) from Deutsche Bank’s indirect holdings can be placed to cover potential over-allotments (in connection with a greenshoe option).\nNippon Life Insurance Company has agreed to acquire a 5.0 percent stake in DWS in the IPO at the IPO issue price.\nThe implementation of the offering is subject to the approval of the prospectus by the German Federal Financial Supervisory Authority (Bundesanstalt für Finanzdienstleistungsaufsicht, BaFin).\nMore details at https://group.dws.com/ir/ipo/\nImportant note\nThis announcement is not and does not constitute an offer of, or the solicitation of an offer to buy or subscribe for, securities in the United States of America, Germany or any other jurisdiction. The securities will not be or have not been registered under the U.S. Securities Act of 1933, as amended (the “Securities Act”) and may not be offered or sold in the United States absent registration or an applicable exemption from the registration requirements of the Securities Act. There will be no public offer of the securities in the United States of America.\nThis announcement is not a prospectus. Investors should not purchase or subscribe for any shares referred to in this document except on the basis of information in the prospectus to be issued by the company in connection with the offering of such shares. Copies of the prospectus will, following approval of the German Financial Supervisory Authority (BaFin) and publication, be available free of charge from the issuer or on www.dws.com.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}