{
    "url": "https://www.db.com/news/detail/20210922-seven-rules-how-we-manage-and-measure-sustainable-finance?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 22, 2021",
    "tags": [
        "Strategy",
        "Sustainability"
    ],
    "title": "Seven rules: how we manage and measure sustainable finance",
    "body": "James von Moltke \nGood afternoon, everyone. Gerald and I are delighted to be here. Very pleased to be discussing such an important topic with you.\nWe think Deutsche Bank has a historic opportunity to help Germany, and Europe, on the path to meeting our commitments under the Paris Agreement on Climate Change.\nWe also believe that market mechanisms, accountability and strong performance management is key to a successful transition to a more sustainable Deutsche Bank.\nThis afternoon:\nI’m going to make some remarks about the ESG imperative – and opportunity – as we see it: the role we aspire to, our approach, and our achievements so far\nGerald will then talk about the core elements of effective ESG performance management, based on Deutsche Bank’s experience.\nTurning first to the role we aspire to:\nWe aim to:\nServe as a reliable partner for our clients, as they define their transitional pathways towards low carbon business models\nLead by example – by transforming our own operations as we help clients transform theirs; and\nEngage in dialogue with our stakeholders: clients, investors, society and public institutions, and our own people.\nWe think Deutsche Bank is ideally placed to meet these aims – for several reasons:\nFirst, we have a high-quality loan book and capital markets presence. We originate, structure, design and distribute assets, serving clients on both sides of our balance sheet;\nSecond, we have strong advisory capabilities, advisory relationships with some clients that go back generations and comprehensive risk management expertise\nThird, being a European, and German bank is an advantage. We’re at the heart of a community with a strong affinity for sustainability – and as a bank with a global network, we can export that expertise. In the US, and particularly in Asia, we see a lot of ESG activity, and that plays to the competitive strengths of European-based banks\nFourth, we’re in the midst of the most radical transformation of Deutsche Bank for 20 years, and rapidly adapting our mindset to a changing environment.\nSo: how in practice do we seek to meet the aspirations I just described? Our approach consists of four pillars:\nFirst, to finance and advise clients as they set out their plans to meet the terms of the Paris Agreement;\nSecond, to manage the environmental and social impact of our business – for example, the carbon intensity of our loan book;\nThird, to embed sustainability into our own operations;\nAnd fourth, to contribute thought leadership – specifically advocacy and our expertise – as society makes the transition to a more sustainable future. Gerald will show that a lack of harmonised, consistent standards is one of the major challenges we face in managing ESG performance.\nAcross all four, we’re aligned to the United Nations Sustainable Development Goals and the Paris Agreement.\nOn each of these dimensions, we’re walking the talk.  A few examples of how we’re putting this four-pillar approach into practice:\nWe announced concrete, transparent and verifiable targets for sustainable finance\nGerald will talk more about these shortly\nWe’ll have 50% of our client-facing staff trained in our sustainability taxonomy by the end of this year, and 100% by end-2022.\nAmong our policies and commitments, we:\nPublished a green bond framework, and for the first half of 2021 we ranked #3 globally in sustainable debt issuance;\nSignalled a complete exit from the financing of thermal coal mining;\nBecame founder members of the Net Zero Banking Alliance.\nIn our own operations, we:\nCut our own carbon emissions by over 40% since 2012, and;\nBy 2020, we already sourced 80% of our total energy from renewables which has saved around a quarter of a million tonnes of carbon per year since 2012;\nPledged to complete our transition to 100% renewable energy by 2025.\nAs thought leaders, we:\nBecame founding members of the Net Zero Banking Alliance;\nJoined the partnership for Carbon Accounting Financials or ‘PCAF’;\nSupported the UNEP FI principles for Responsible Banking;\nServe on the Sustainable Finance Advisory Council of the German Government.\nFinally, a word about the dialogue with our stakeholders – the third of our three aims.\n  Across all stakeholder groups, the dialogue is intensifying – as it should, given the importance of the environmental challenge we face\nRegulation will get more demanding;\nClients, facing their own challenges, need a credible partner more than ever;\nOur own people want to be clear on Deutsche Bank’s purpose;\nInvestors and other capital market participants demand transparency as ESG criteria become ever more important in investment decisions, and\nSociety is watching us closely.\nWe’re convinced we need to embrace this intensity as a unique opportunity:\nWe can help clients and deepen our dialogue with them in new areas;\nAttract and retain new and existing talents who share our sense of purpose in creating a truly sustainable Deutsche Bank;\nAttract investors as they, increasingly, factor sustainability considerations into their investment decisions.\nThis applies to other capital market participants too. We saw a striking example last month, when Moody’s, the rating agency, upgraded Deutsche Bank’s credit ratings, our first fundamentals-driven upgrade since 2007. Moody’s made clear that our sustainability commitments played a substantial role in their decision; \nFinally, our reputation within society and the media is increasingly influenced by sustainability considerations.\nBefore I hand over to Gerald, a few words about media reports on DWS, our fund management arm, based on allegations made by a former employee.\nLet me reference a few clear statements which DWS has made:\nDWS stands by its disclosures;\nDWS firmly rejects unfounded allegations made by a former employee;\nDWS looks back on a 20-year history of sustainable and responsible investing;\nBecoming a leading ESG asset manager is a cornerstone of DWS’s strategy;\nDWS reports within the comprehensive reporting framework of the EU Sustainable Finance Disclosure Regulation which took effect in March this year.\nThe fact is that the question of what constitutes an ESG transaction or investment, and what does not, is a challenge for the finance industry as a whole. Gerald will explain how we approach that challenge.\nTo sum up:\nWe’re absolutely committed to creating a sustainable Deutsche Bank;\nThat goal is at the core of our transformation strategy;\nIt’s a historic opportunity for us to create value for all our stakeholders…\n… but to make it happen, rigorous ESG performance management is vital.\nAnd with that, let me hand over to Gerald, who will discuss our approach in detail.\n  Gerald Podobnik – ESG Performance Management in Practice\nThank you, James, and good afternoon from my side as well.\nManaging ESG performance presents significant challenges, but also opportunities.\nLet me start by setting out three practical challenges we face in managing ESG performance:\nFirst: as James said – across the financial industry we lack consistent, standardised definitions of what Environmental, Social or Governance activity actually is\nUnlike other core elements of financial accounting or risk management\nThere’s no single ‘ESG taxonomy,’ although the EU Taxonomy project is a step in the right direction\nThere is a lot of work underway by banks, regulators, asset managers and investors – we’re deepening our expertise, day by day.\nSecond: we see multiple overlapping frameworks to define disclosure rules.\nThird, and the greatest challenge of all: the gap between ambition and impact:\nSustainability reporting has taken off in recent years… the number of companies publishing sustainability reports has risen from a few dozen to more than 4,000\n… but in the same timeframe, CO2 emissions rose by 40%:\nIn other words: the illusion of action is as dangerous as inaction.\nActivity without tangible impact undermines our ability to meet the Paris Agreement and undermines our ability to accompany clients on that path as James outlined.\nIn addition, real impact is at the core of a credible dialogue will all our stakeholders:\nClients and our wider franchise\nCapital market participants, including socially responsible investors and rating agencies, as James pointed out\nRegulators, policymakers and standard-setters\nPresent and future employees, including campus recruits.\nRigorous performance management is essential to guard against two particular dangers:\nFirst, greenwashing – passing off activities as sustainable without good reason;\nSecond, greenwishing – setting grandiose targets with no clear roadmap to deliver them.\nSo: how do we confront these challenges?\nThe over-arching goal of ESG performance management must be: to help the organisation turn ambition into impact.\nHow do we do that? From our experience, we’ve learned seven rules.\nLet’s look at those.\nRule 1: give your targets teeth! A strong governance framework is key\nYour targets need to be backed up by a governance structure which is understood and respected by the businesses and which has the power to draw consequences for underperformance including linkage to compensation.\nWhat does ‘strong governance’ mean in practice?\nYour governance framework must be Senior. ESG performance must be driven from the top of the company, and linked to the individual performance of leaders;\nIt must be well-embedded – close to the businesses and to the individual strategies you have developed to deliver ESG performance – so make it mainstream;\nIt must be networked – in a new and fast-expanding area, it’s important to share best practice across divisional activities – unlock synergies and break silos;\nIt must be independent – delivery on targets must be monitored and verified by experts outside the business, just like any other business activities under scrutiny of independent control functions such as Risk, Finance or Compliance.\n Deutsche Bank’s approach illustrates this:\nThe Management Board Sustainability Committee is chaired by CEO Christian Sewing – so we start at the top.\nThis is supported by a Sustainability Council which helps share best practice and cross-divisional activities.\nA specialist Group Sustainability function monitors implementation and adherence to policy – this is an independent control function or ‘second line of defence’.\nWe assess intensively, transaction by transaction, whether any given transaction meets our ESG standards, and if there’s any doubt: we do not include it.\nSometimes, that leads to heated debates – but rigorous controls are essential for our credibility.\nHow does this governance work in practice? A few examples…\nLoans, bond issuances and investments which our businesses claim to be ESG-eligible are validated by Finance and Group Sustainability;\nIn the first quarter of 2021, we assessed around 80 transactions per month;\nOur bi-weekly Sustainable Finance Governance Forum reviews new ideas for ESG eligibility, and this is tough: in the first half year, we reviewed 14 proposals and rejected six;\nAs James explained, we’ll have offered ESG training to all relevant front-office staff by the end of next year – Deutsche Bank has around 22,000 client-facing people in total.\nRule 2: link your targets to incentives and compensation-setting\nWe use a balanced scorecard to measure and manage performance.\nInitially for the Management Board, it’s now rolled out to around 300 top executives:\n  We don’t start from scratch:\nAlmost all these 300 have targets for gender diversity and a feedback culture;\nAround 50% have targets for improving governance or regulatory remediation.\nWe’ve added a ‘franchise’ component for around 50 senior leaders which assesses:\nESG financing and investment volumes;\nESG ratings – we use an index of the top-5 sustainability rating agencies;\nOur own operations – to be specific, energy consumption of own buildings.\nWe lead from the top: meeting ESG targets has the greatest impact on compensation of the most senior people.\nFor Management Board members, the ESG performance factor within the long-term award accounts for 20% of reference variable compensation.\nRule 3: make your performance targets near term – the planet cannot wait\nClear long-term goals are important – but in addition, it’s vital to set some concrete near-term targets.\nLarge organisations including banks can make the biggest impact, but they’re not so nimble – so start early: re-configure your organisation around your ambitions and set short-term targets.\nThis gives you several opportunities:\nYou can use performance management as a catalyst for a sense of urgency – there’s no place for ‘kicking the can down the road’\nYou’re agile enough to react quickly! Take corrective action if you’re falling behind schedule, or raise the bar if you’re delivering ahead of schedule;\nYou gain ‘first mover’ advantage – sustainability capabilities are likely to be an ever more important differentiator in the coming years;\nYou stay ahead of regulatory change – or help to shape it!\nMoody’s, recognised this when they recently upgraded Deutsche Bank’s credit ratings – in a fast-changing regulatory environment, our ability to get ahead of the curve was a factor in their decision to upgrade us.\nDo near-term targets work? Let me answer that from Deutsche Bank’s experience:\nWe originally set 5-year targets in May 2020: cumulative ESG financing and investments of €200 billion by year-end 2025;\nWe accelerated these to year-end 2023 in May this year – in other words, we raised the bar after several quarters of ahead-of-target performance;\nAs at 30 June, cumulative ESG financing and investment volumes were € 99 billion – nearly halfway toward our year-end 2023 targets, thanks to record second quarter volumes of €27 billion…\n… so raising the bar had its effect! Our businesses stepped up, and outperformed.\n  As you can see, this approach is different from some of our leading peers who have announced bigger targets, but which go further into the future.\nOur focus is not on quantum, but quality – we think long-term, but we act near-term!\nRule 4: make your targets granular! That focuses accountability\nIt’s important to push targets down as far as possible into the organisation – bottom up rather than top-down – because in our experience:\nGranularity focuses accountability on specific businesses, teams, and individuals, which spurs delivery;\nTargets should be linked to senior leaders, but also cascaded down to those who deliver them day to day;\nThe more granular your targets are, the easier it is to embed these targets into the normal course of business and mainstream performance management.\nDeutsche Bank’s approach:\nWe slice and dice our figures by business, sub-business, client segment and category (E, S, or G)\nWe bake sustainability reporting into our regular quarterly earnings communications;\nWe send a signal: if sustainability is part of your mainstream performance management, it’s part of your mainstream business;\n We get praise from leading analysts for this granularity as it also gives them a feeling for the revenue potential in ESG.\nRule 5: be selective! Focus your targets on activities with most impact\nIt’s essential to demarcate clearly what products and services are included and which are NOT included.\nIt focuses our business leaders on activities with tangible impact;\nIt reduces the risk of actual or perceived greenwashing.\nDeutsche Bank is transparent on what we do and don’t include:\nWe include:\nFinancing – loans and other instruments;\nCapital Market Issuance – e.g. our bookrunner share of green or social bonds;\nInvestments – the stock value, at period-end, of the ESG funds and other assets in the Private Bank.\nWe DO NOT include:\nM&A – because the financial adviser on an M&A transaction has no control over whether the deal actually delivers the environmental benefit claimed or intended;\nDWS – an independent company, which therefore has separate targets.\nIn the spirit of transparency, our framework is publicly available on our website.\nWhat does this mean in practice? Let me give you some concrete examples of activities we include:\nWe were bookrunner on three social bonds for the European Union as part of its Support to mitigate Unemployment Risk in an Emergency (SURE) programme, the most recent being a 14 billion euro dual tranche offering in May;\nIn Germany, we recently closed a bilateral sustainability-linked loan for Dr. Babor, a progressive cosmetics company, which is planning to expand its facility near Aachen to reduce carbon emissions. Dr. Babor aims for a 50% reduction in five years. If they meet this target, verified by a 3rd party, there’s a price advantage to the loan. If not, they make a donation to a climate NGO which finances CO2 compensation projects. In other words, we help, but also incentivise, a client on the path to carbon neutrality;\nIn the US, we financed projects with capacity of 1.7 Gigawatts for SB Energy to retire older, coal-fired power plants in Texas and deliver solar power capacity to replace brown energy with green,\n‘Investments’ include ESG investments in the Private Bank, like ESG mutual funds.\nRule 6: practice what you preach!\nPerformance management which is credible in the eyes of external and internal stakeholders, depends on evidence of delivery.\nThat’s been the case for Deutsche Bank.\nLoan exposure to carbon intensive corporates came down by a fifth in five years;\nRecent analyst reports show that our exposure to carbon-intensive sectors, as a proportion of our loan book, is significantly below the average of leading international banks.\nThis sends a message: when we say that agreeing a clear path to meeting the Paris agreement will increasingly become the prerequisite for client relationships, clients know we’re serious.\n  Rule 7 – the most important: manage performance for verifiable impact!\nIt’s all-important to manage ESG performance in a way that leads to real impact on the world around us.\nAligning the way you manage performance to a solid external benchmark.\nDeutsche Bank’s approach:\nWe classify our business according to the UN’s 17 Sustainable Development Goals.\nThis is an art as well as a science.\nThere is, of course, some overlap across categories.\nBut it’s a vital, external reference point when defining impact.\nWe’re not done – we have more to do to align our performance management with environmental impact.\nGoing forward, this will include:\nReducing greenhouse gas emissions linked to our loan portfolio – we’ll disclose the carbon intensity of our loan book by the end of 2022;\nManaging the composition of our balance sheet by using the green asset ratio, which we’ll announce by mid-2022;\nWorking with our clients to identify the carbon footprint of our clients today;\nTogether with others, developing models to measure the impact of our business on other areas: water consumption, land usage, biodiversity and social factors.\nConclusion\nLet me sum up.\nFirst: rigorous management of ESG performance is absolutely crucial in successfully delivering a credible sustainability strategy.\nSecond: ESG performance management will become more powerful if we’re able to harmonise around consistent, comparable approaches across the industry – banks, regulators, policymakers and experts all need to work together to make that happen.\nThird: a few key factors determine the effectiveness of ESG performance management, which needs to be:\nSupported by strong governance, starting right at the top of the house;\nLinked to incentives and compensation;\nNear-term – a catalyst for rapid action;\nGranular enough to make individuals accountable;\nRigorous and transparent in what’s included and what’s not;\nBacked up by demonstrable behaviour;\nAnd above all: geared to turning ambition into impact.\nWith that, on behalf of James and myself: thank you for your attention!",
    "number_of_ratings": 6,
    "rating": 2.5,
    "likes": 19
}