{
    "url": "https://www.db.com/news/detail/20210920-deutsche-bank-acquires-berlin-based-payment-service-provider-better-payment?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "September 20, 2021",
    "tags": [
        "Corporate products"
    ],
    "title": "Deutsche Bank acquires Berlin-based payment service provider Better Payment",
    "body": "Deutsche Bank is acquiring payment service provider Better Payment Germany GmbH, based in Berlin. Through the acquisition, Deutsche Bank will expand its market share in payment processing and acceptance. Over the next 12 months, Deutsche Bank will integrate Better Payment's technical solutions into its existing product range.\n“Better Payment gives us broader market access in payment processing. Thanks to the know-how of their employees, their existing dealer relationships and technical solutions, we can accelerate our growth in the German market, which is key to us,” said Kilian Thalhammer, Head of Merchant Solutions at Deutsche Bank. \"We will develop additional synergies by integrating the respective products from Deutsche Bank and Better Payments,\" said Thalhammer. The bank plans to offer further banking and payment services via the existing Better Payment channels.\nBetter Payment operates a service for the technical processing of online payments. For this purpose, the company uses a payment platform (\"online payment gateway\") to carry out and receive online payments. The payment platform enables retailers - or their clients - to accept all common means of payment and to be able to receive all types of payment consignments. Better Payment offers its own \"online payment gateway\" as a \"white label\" solution to other companies and does not operate under its own brand. For these \"white label\" customers, payment processing is a useful addition to their own product portfolio.\n\nThis includes banks, financial service providers or SaaS (“software as a service”) providers who offer their customers the technology enhanced with their own services. In the business with “white label” solutions in particular, Deutsche Bank expects very high growth rates in the double-digit percentage range for the number of affiliated dealers over the coming years. Around 1,500 retailers are already using the company's payment platform. Contracts with existing customers remain unchanged.\nBetter Payment will keep its headquarters in Berlin. All Better Payment employees, including its long-standing management team, will stay on board and work for Deutsche Bank in future.",
    "number_of_ratings": 4,
    "rating": 4.0,
    "likes": 18
}