{
    "url": "https://www.db.com/news/detail/20210915-the-reality-of-asia-s-reopening?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 15, 2021",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "The reality of Asia’s reopening",
    "body": "Asia has been at the heart of the delta wave. In many Asian countries, the height of the latest waves were four times as severe - in terms of cases per population - as seen earlier in the pandemic. Singapore was the first to announce a shift towards an endemic “living with Covid” strategy, Philippines is keen on shifting to “granular” lockdowns instead of nationwide ones, India is opening back schools, Indonesia has eased restrictions, and Thailand is planning on opening more tourist destinations. How realistic are these reopening plans?\nTo solve this puzzle, Sachdeva and Bryant Xu jointly examined Asia’s re-opening potential by looking at 13 measures across medical and economic criteria.\nThe medical and economic drivers\n“We believe reopening will be driven by two broad drivers: the medical reality and the economic reality,” says Deutsche Bank Research’s Mallika Sachdeva. “We assume that a better medical reality implies a higher likelihood of reopening, while a poorer economic reality implies a higher likelihood of reopening,” explained Sachdeva.\nVaccine coverage levels and the ability of the health care system to accommodate potential case spikes are key considerations on the medical side. While the level of economic stress felt under lockdown, and the amount of policy space - both fiscal and monetary - left to offset it, are the main economic drivers.\nThe team argues that the better vaccinated the population is, and the more prepared the medical system is for a rise in cases, the higher the likelihood of reopening. While a weaker economy with less fiscal and monetary space would also increase the urgency to reopen.\nHow is Asia likely to reopen?\nThe team found strong evidence of offsetting drivers. Countries that are medically more equipped to reopen are also the countries where the economic compulsion to take risks is the lowest. North Asian countries are mostly in this camp. Meanwhile, countries where the economic urgency to reopen is the highest, are also the countries where vaccinations and healthcare systems are the least advanced. India, Indonesia and the Philippines fall into this category. According to Sachdeva, Malaysia emerged as the top “reopening candidate” into year-end as it comes the closest to checking both boxes.\nWhile the opposing medical and economic forces paint a sceptical picture of reopening in the region, Sachdeva adds that this environment could still favour positive asset returns in markets like India and Indonesia. “Slow recoveries should help keep credit cycles, abrupt policy turns, and current account deficits in check, while equity and FDI inflows should remain motivated by more structural positive trends around demographics and technology adoption.”\nFigure 1 - Asia average reopening rank ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 5
}