{
    "url": "https://www.db.com/news/detail/20210910-notalone-92-million-steps-in-the-us?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 10, 2021",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "#NotAlone: 92 million steps in the US!",
    "body": "The #NotAlone US Steps Challenge was a huge success, with over 1,200 employees in the US crushing the 50 million steps target. The final amount was over 92 million steps!\nThe step challenge is part of Deutsche Bank’s global #NotAlone campaign that has been highlighting the impact of the Covid pandemic on youth mental health by partnering with local charities that support young people’s mental health. The more steps, the more funding.\nThe Covid pandemic has had a catastrophic impact not only on the physical, but also on the mental health of people across the world. In the US, a quarter of young people said they had suicidal thoughts during lockdown and calls to domestic abuse helplines for young people have increased by 20 percent.\nThanks to the #Not Alone steps challenge, Deutsche Bank donated 100,000 US dollars each to the National Alliance on Mental Illness (NAMI) and The Door – both organisations that provide services to underserved communities that the pandemic has hit particularly hard.\nMatt Kudish, Executive Director at NAMI-NYC, says, “Thanks to partners like Deutsche Bank, NAMI-NYC helps families and individuals affected by mental illness build better lives through education, support, and advocacy. Recent support from Deutsche Bank enabled us to reach 4,456 students, staff, and family members through our school-based ‘Ending the Silence’ education programme, ensuring more young people – and those who care about them – understand and recognise the early warning signs of mental health conditions. Contributions from Deutsche Bank also helped us increase the number of graduates of our Basics class by 79 percent, empowering parents and caregivers to navigate support and care for their dependents experiencing mental health challenges.”\n\nKelsey Louie, CEO of The Door, receiving the donation\n“When youth receive targeted mental health supports, it expands their capacity to focus on other areas of their life and increases the likelihood they will reach desired milestones, thus setting them up for independence, explains Renee McConey, Director of the The Door’s Adolescent Health Services. “In the past year alone, and with generous funding from Deutsche Bank, The Door has been able to provide over 1,200 young people with immediate and uninterrupted mental health support and effectively dismantle existing barriers to access.”\nEvery step helps!\nDeutsche Bank employees have been getting involved in the campaign through the global #NotAlone steps challenge. By taking as many steps as possible in teams or individually, they have united to share an important message with young people: you are not alone. And since lockdown has been hard on everyone the steps challenge also has also helped employees look after their own health and wellbeing too. One participant reports: “Many of us who took part weren’t used to regularly going outside and getting exercise. The challenge helped us to find the time for walking and we’re really grateful for the opportunity. In fact, even now the challenge is over, many of us still do about 10,000 steps every day!”",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 76
}