{
    "url": "https://www.db.com/news/detail/20210910-deutsche-bank-executes-first-green-repo-financing?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "September 10, 2021",
    "tags": [
        "Investment Banking",
        "Sustainability"
    ],
    "title": "Deutsche Bank Executes First Green Repo Financing",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) has executed its first ever green repo transaction as part of a new initiative to broaden the range of ESG fixed income products available to clients.\nClaire Coustar, Global Head of ESG for the bank’s Fixed Income and Currencies (FIC) business, commented: “We are proud to be one of the first banks to bring a green repo to market. We believe this is the first transaction to be executed by any firm in Europe, and hope it will encourage more activity so that a new source of green finance can be developed for the industry, as well as a new asset class for investors.”\nThe transaction involved Deutsche Bank transferring securities to long-standing client M&G Investments, and receiving cash to fund Deutsche Bank’s green asset pool, including renewable energy projects such as wind or solar power plants and the improvement of energy efficiency for example, commercial buildings as per our Green Financing Framework.*\nIn May 2020, Deutsche Bank set itself a target of providing at least EUR200 billion in cumulative sustainable finance by 2025. Thanks to the quick progress made, the target date was brought forward to 2023. By Q2 2021, over EUR99 billion had been provided.\nThe bank plans to introduce further innovative ESG financial products for clients in the coming months. “Our ambition is to be a market leader in ESG fixed income,” says Claire Coustar. “We are one of the few firms to be a top tier player across the product spectrum and we want to leverage that expertise to help develop the sustainable finance market.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 4
}