{
    "url": "https://www.db.com/news/detail/20210908-weichenstellungen-fuer-europas-banken-drei-thesen-von-christian-sewing-beim-bankengipfel-2021?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 8, 2021",
    "tags": [
        "Capital markets",
        "Private products"
    ],
    "title": "Three theses for answering Europe’s banking and capital markets challenges",
    "body": "Ladies and gentlemen,\nit is a pleasure for me to speak at this banking summit again. This year, for the first time, I am speaking to you from London, where many of our largest institutional clients have gathered together again at last. This means we’re returning to a little bit of normality. And it’s an indication that we are gradually emerging from the pandemic.\nYou can interpret the fact that I no longer want to talk about how we can get out of this crisis as quickly as possible as another indication of that. Instead, I want to look far into the distance. What are the big trends and factors that will shape the banking industry in the next decade? And what do we need to do to emerge from this upheaval as winners?\nThere is a consensus, ladies and gentlemen, that our economy must become more digital and more sustainable. This transformation, driven by technology, will be just as fundamental in nature as the first industrial revolution more than two centuries ago. Back then, humanity began burning carbon on a large scale. In this century, it will have to largely stop doing that if we want to avoid a catastrophe. Leading scientists agree on that.\nAt the same time, the stakes for Europe are high.\nThis decade will decide who will dominate the global economy in the 21st century. And Europe will have to pull out all the stops to avoid being one of the losers.\nYet we have already fallen behind in the past 20 years. In 2000, 41 of the 100 most valuable listed companies in the world still came from Europe. Now only 15 of them do. What applies to the economy as a whole is also reflected in the financial sector. At the turn of the millennium, the 25 largest European banks had a similar stock market value to that of the 25 largest US banks. Today, JP Morgan and the Bank of America alone are worth as much as the 18 largest European banks together.\nAnd I will put forward the proposition that there is probably more than just one correlation between this relative decline in the value of our financial sector and our companies as a whole. Because I am convinced that an efficient banking and capital market was and is one of the great location advantages of the United States. That means that, in order to catch up again, Europe also needs a stronger banking and capital market. Otherwise, we will not be able to hold our own in a global economy polarised between the US and China.\nWhy not? Because without a strong financial sector we (a) cannot mobilise enough capital and (b) even more seriously, we cannot channel it efficiently.\nWhat do we have to do?\nFirst and foremost, it is up to the banks themselves - and the industry is on the right track. Overall, financial institutions in Germany have not only become much more stable and robust since the financial crisis, but the industry is also making progress on profitability at last.\nOur progress in transforming Deutsche Bank is a case in point. In the first six months of the year, we achieved a pre-tax profit of 2.8 billion euros and a return on tangible equity of 6.5 per cent, our best half-year since 2015. And in our core bank, i.e. the business areas we want to continue, we doubled our pre-tax result to 3.4 billion euros and achieved a return of 9.3 per cent. That was already in line with our target for the coming year. I remain optimistic that we will sustainably achieve our goals for 2022.\nBut that alone will not be enough if we want to be up there with the top players. The big banks in Europe also need to set a fundamental course, which I would like to link to three propositions.\nFirstly: there will only be a few major global banks left.\nAnd that means: we must finally make use of Europe's economies of scale. It was and remains right to regulate big banks particularly carefully. In Europe, however, we have also done a great deal to ensure that banks no longer get big. But this is a questionable course. After all, the importance of size in the financial world is increasing exponentially.\nBecause in future only large banks will be able to …\n… combine a global network with deep local roots.\nraise the necessary investments to become more digital and offer holistic advice at the same time.\nOnly they will still be able to leverage efficiency gains in the face of continuing cost pressure …\n… and only they will eliminate the capital market deficit in Europe.\nIt cannot be in our interests if all those global banks have their headquarters outside Europe. In an increasingly fragmented world dominated by national interests, we would make ourselves even more dependent on US banks. After the experience of recent years, we would be making a strategic mistake, that would not be in Germany’s and Europe’s interest.\nWhat is to be done given the discrepancies in stock market value? By doing what the European economy as a whole urgently needs. We need to further strengthen the single market in Europe as quickly as possible, especially in services. This also includes a banking and capital markets union. We can no longer afford to follow an evolutionary path; we need a big leap forward. This will also accelerate the overdue consolidation across national borders.\nSecondly: regulation must be fair\nThe banking and capital markets union is a necessary but not sufficient condition for a strong financial sector in Europe. To achieve this, we must also finally create a level playing field.\nThis applies to capital regulations that do not sufficiently take European economic structures into account - keyword Basel IV.\nThis applies to the securitisation market, which in Europe is only one tenth the size of the US market, also because of regulatory barriers. This would be an important lever for creating room for manoeuvre in bank balance sheets and thus helping the financing of the economy.\nBut this also applies to unequal conditions for banks and non-banks, even when looking at similar services. The regulatory imbalance in the competition with fintechs or big techs is just one example. Another is the unequal struggle between banks and other financial groups. In the face of persistently negative interest rates, institutional investors are chasing higher returns and are pushing into credit markets that were traditionally the preserve of banks.\nEven insurers have suddenly become very active in leveraged loans, although they are not subject to the same regulation as banks. This shows that if European banks are subjected to increasingly restrictive regulation, the business will not disappear; it will simply migrate to other financial sectors.\nWe may also see completely new constellations in the consolidation of the financial sector in the future. However, these would be primarily driven by regulation. This would further undermine the highly controlled banking system while business is done elsewhere. No one can seriously want that. This promotes neither financial stability nor fair competition. Same business, same regulation: that must be the principle.\nThirdly: sustainability will pick the winners and losers\nThe fight against climate change is probably the greatest challenge facing humanity, and we banks will have to fundamentally align ourselves with it. Right now. But this is not only a duty, it is also an opportunity. Or let me put it this way. I believe that ESG, i.e. banking according to strict environmental, social and governance criteria, is the biggest growth topic for decades.\nWhy? Because huge investments will be needed to transform our economy. According to current estimates, over two trillion euros will be needed worldwide every year until 2050. According to calculations by Autonomous, this would mean that the banking sector’s total annual financing volume would be 15 per cent higher than today.\nThe prospects that we Europeans will be able to account for a large share of this are good. Europe's economy is a leader in many areas of green technology. And the European market share in green bonds is twice as high as in the bond market as a whole.\nBut there is more to it than that. Sustainability is already changing banks fundamentally - and this change will accelerate even more. It starts with risk management and continues with the validation of loans, investments and transactions according to environmental, social and governance standards. And it's about our business. Sustainability has vastly increased the demand for advice from both companies and private investors. We are adapting our dialogue with our customers accordingly. We are currently spending a lot of time working out how we can best support our customers in their transformation.\nThe importance of this topic can be seen in the fact that I am directly responsible for it. But the increase in importance will go even further. Not only does sustainability affect each of our divisions, but it will also develop into a business field itself. This will have to be reflected in our structure if we are to realise our potential.\nLadies and gentlemen, the twenties will decide who will dominate the global economy and which path we take in the fight against climate change.\nWe need better conditions for this, and the course must now be set for a consolidation of our industry, for competition-neutral regulation and for more sustainability in the financial sector.\nBut this also means that we have to work on ourselves. Because we will only be able to take advantage of the best conditions if we also continue to change ourselves – and here I am of course talking first and foremost about our own bank.\nIt’s about culture, it’s about leadership culture.\nIt's about the purpose of what we do and about being able to explain it to society.\nThat is also important for us to remain competitive. Because banking is shaped by people. Because dialogue with and advice for our customers must always be at the focus of our work.\nThat means we don't just need the best people and diverse teams. We also need to look after our colleagues and our customers much more, invest in them and see them for what they are: the most valuable asset we have. This must be the benchmark for the management of a bank.\nLadies and gentlemen, in view of the current challenges, we need a strong, globally active banking sector. Our industry is one of the key industries of a globally exporting economy like those of Germany and Europe.\nSo we should act accordingly now, with a clear strategy and attitude.\nThank you very much.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 13
}