{
    "url": "https://www.db.com/news/detail/20170131-a-message-from-karl-von-rohr-on-settlements-over-russian-securities-trades?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 31, 2017",
    "tags": [
        "Company"
    ],
    "title": "A message from Karl von Rohr on settlements over Russian securities trades",
    "body": "Dear Colleagues,\n\nOver the past day we reached settlements with the UK Financial Conduct Authority (FCA) and the New York State Department of Financial Services (DFS). The settlements conclude the FCA and the DFS’s investigations into the bank’s anti-money laundering (AML) control function in our investment banking division, including in relation to certain securities trades that occurred between 2011 and 2015 involving our Moscow, London and New York offices.\n\nWhile we are pleased to have resolved these matters, the FCA and the DFS were critical of our client onboarding and know-your-client (KYC) procedures, AML monitoring and organisational clarity among the businesses and control functions involved in these securities trades. We deeply regret the bank’s role in the issues cited.\n\nWe have taken a number of important actions including a comprehensive review of our client onboarding and KYC procedures, launched in 2015. We continue to upgrade the bank’s AML monitoring and training and have increased headcount in Anti-Financial Crime by almost 30% in 2016 with plans to increase by a further 50% in 2017.\n\nIn addition, as part of our efforts to simplify the bank, we closed our onshore investment banking business in Russia in 2016. We also increased those countries defined as having higher AML risk weightings from approximately 30 to approximately 100. This requires the bank to perform enhanced due diligence when onboarding entities from those countries.\n\nThe settlements also bring a financial cost for us. Under the terms of the settlement agreement with the FCA, we agreed to pay civil monetary penalties of approximately 163 million pounds. The bank qualified for a 30 percent discount for agreeing to settle at an early stage of the FCA’s investigation. The FCA noted in its findings that the bank has committed significant resources to improving its AML controls and recognises the work already undertaken in this area. The FCA also noted that the bank has been exceptionally cooperative in bringing the matter to its attention and throughout its investigation.\n\nUnder the terms of the settlement agreement with the DFS, we entered into a Consent Order, and agreed to pay civil monetary penalties of 425 million dollars and engage an independent monitor for a term of up to two years. The Consent Order acknowledged Deutsche Bank’s cooperation and remediation efforts and noted that the DFS considered those efforts in arriving at the settlement amount.\n\nThe settlement amounts are already materially reflected in existing litigation reserves.\n\nAs previously disclosed, we are cooperating with other regulators and law enforcement authorities, which have their own ongoing investigations into these securities trades. We therefore cannot say yet that this matter is closed, but we are making progress.\n\nMy Management Board colleagues and I are grateful for your resilience, hard work and commitment over the past year in strengthening our controls. We have some way to go until we can put our major legacy legal matters behind us, but we continue to pursue their resolution step-by-step.\n\nWith best wishes,\nKarl von Rohr",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}