{
    "url": "https://www.db.com/news/detail/20170131-deutsche-bank-reaches-settlements-over-russian-securities-trades?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "January 31, 2017",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank reaches settlements over Russian securities trades",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE:DB) has reached settlements with the UK Financial Conduct Authority (FCA) and the New York State Department of Financial Services (DFS). The settlements conclude the FCA and the DFS’s investigations into the bank’s anti-money laundering (AML) control function in its investment banking division, including in relation to certain securities trades that occurred between 2011 and 2015 involving its Moscow, London and New York offices.\nUnder the terms of the settlement agreement with the FCA, Deutsche Bank agreed to pay civil monetary penalties of approximately 163 million pounds. The bank qualified for a 30 percent discount for agreeing to settle at an early stage of the FCA’s investigation. The FCA noted in its findings that the bank has committed significant resources to improving its AML controls and recognises the work already undertaken in this area. The FCA also noted that the bank has been exceptionally cooperative in bringing the matter to its attention and throughout its investigation.\nUnder the terms of the settlement agreement with the DFS, Deutsche Bank entered into a Consent Order, and agreed to pay civil monetary penalties of 425 million dollars and to engage an independent monitor for a term of up to two years. The Consent Order acknowledged Deutsche Bank’s cooperation and remediation efforts and noted that the DFS considered those efforts in arriving at the settlement amount.\nThe settlement amounts are already materially reflected in existing litigation reserves.\nAs previously disclosed, Deutsche Bank is cooperating with other regulators and law enforcement authorities, which have their own ongoing investigations into these securities trades.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}