{
    "url": "https://www.db.com/news/detail/20170119-deutsche-bank-in-jacksonville-partners-with-duval-county-public-schools-on-ciso-internship-program?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "January 19, 2017",
    "tags": [
        "Corporate Citizenship",
        "Education"
    ],
    "title": "Deutsche Bank in Jacksonville partners with Duval County Public Schools on CISO internship program",
    "body": "Deutsche Bank in Jacksonville is proud to announce a new partnership with Duval County Public Schools designed to mentor students from Sandalwood High School enrolled in an Early College program. In association with co-partner, Jacksonville Electric Authority (JEA), the students will have the opportunity to complete their Associate of Science Degree through Florida State College of Jacksonville and gain hands-on career experience while still attending high school.\nUnder the program, the Early College students complete their high school requirements during their ninth and tenth grade school years while taking quarterly trips to Deutsche Bank to spend the day learning about the Chief Information Security Office (CISO) and the opportunities available to them upon graduation.\nOnce they’ve entered 11th grade, the students begin earning their Associate of Science degree from Florida State College of Jacksonville along with monthly visits to Deutsche Bank where they will receive specific training and instruction in CISO. Candidates will also have the opportunity to participate in a summer internship program designed to provide valuable insight into computer networking and cybersecurity.\nDeutsche Bank is honored to be a part of this internship program and hope to make a difference in the lives of deserving students in the community,\n\nWe are proud of our state of the art Cyber Intelligence Response Center in Jacksonville, which serves our global network, and we aim to provide students with valuable hands-on experience that will prepare them for rewarding careers.\nWade Bicknell, Global Head, Threat Operations and Regional Head of Security Operations.\n“Through our invaluable partnership with industry leaders like Deutsche Bank and JEA, our students have the opportunity for rich, engaging, and hands-on, real-world S.T.E.M.-learning experiences, beyond what is taught in the classroom. Additionally, with the opportunity for students to earn their associate’s degree while in high school, we are ensuring that our schools serve as a true springboard to successful entries into college and the workforce,” said DCPS Superintendent Dr. Nikolai Vitti.\nAbout the program\nThe program is a collaboration between Duval County Public Schools, Deutsche Bank, Jacksonville Electric Authority, and Florida State College of Jacksonville. It is designed to allow students to interact with industry experts in their specific field of interest. This partnership ensures students are well-equipped to pursue STEM related careers by providing them with both their high school diploma and Associate of Science degree, as well as industry certification in the IT field.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}