{
    "url": "https://www.db.com/news/detail/20170118-message-from-all-members-of-the-management-board-on-variable-compensation-for-2016?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 18, 2017",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Message from all members of the Management Board on variable compensation for 2016",
    "body": "Dear Colleagues,\nOver the past several months we made significant progress in resolving legacy matters and restructuring our bank. However, there is still some way to go to strengthen our bank and make it more profitable again. This is why we have to take some tough decisions that will demand a great deal of us. This also applies to variable compensation.\nWe have discussed this matter thoroughly at the Management Board in recent weeks, and it is not a decision we have taken lightly. Now that we have a clearer idea of the financial impact of the settlement with the US Department of Justice and our performance for the year, we feel that tough measures are unavoidable. This is especially true at a time when thousands of jobs are being cut and our shareholders are not receiving an annual dividend.\nThe Management Board has therefore decided to substantially limit bonus payments for 2016. In concrete terms, this means that employees with the corporate titles of Vice President, Director and Managing Director will receive the group variable compensation component but not any individual variable compensation component for the 2016 financial year.\nFor other components of variable compensation, the consequences are as follows:\nThe group variable compensation component, which we introduced last year, will be awarded to eligible employees. The amount of this component is based on the bank's overall performance, which will be determined using four key performance indicators (KPIs).\nThe next round of Recognition Awards, as announced last autumn, for eligible employees up to the Assistant Vice President level who are to be recognised for outstanding performance, will proceed as planned.\nEmployees up to the Assistant Vice President level who are not eligible for a Recognition Award may receive an individual, but limited, variable compensation award for 2016.\nBinding contractual agreements, including bonuses covered by collective tariff agreements, will be unaffected.\nThis means that approximately 75 percent of employees are not or are hardly affected by our decision on individual variable compensation.\nIn addition, a limited number of employees in crucial positions for the further success of the bank will be granted a special long-term incentive, partly in the form of shares, which will be deferred up to six years. Separately, the Management Board has decided unanimously to waive its variable compensation for 2016.\nWe are aware that many of you will be disappointed by this decision about 2016 bonuses. We know how hard you work for the bank. We recognise how committed you remained throughout the challenging days in the autumn – and indeed not only then. Today we are able to say that our bank is resilient thanks to your hard work and dedication. Unfortunately, this recognition will not be reflected in the amount of individual variable compensation this year. We sincerely regret this.\nWe have taken this tough decision because it is the right thing to do. Other companies have taken similar steps in the past and have come back stronger than before. We are convinced that we will too. We plan to return to our normal compensation programs for the year 2017.\nWe, on the Management Board, intend to do everything we can to make your work as interesting and attractive as possible and to encourage you to do your best – and this is also something that we expect of our managers. In doing this we want to contribute to maintaining our position as an employer of choice even in this challenging phase.\nLet's work together to return Deutsche Bank to the respected and successful position that it rightly deserves.\nWith best wishes,\nJohn Cryan, Kim Hammonds, Stuart Lewis, Sylvie Matherat, Nicolas Moreau, Garth Ritchie, Karl von Rohr, Marcus Schenck, Christian Sewing, Werner Steinmüller, Jeff Urwin",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}