{
    "url": "https://www.db.com/news/detail/20170112-rhetoric-into-reality-wealth-management-cio-insights-10-themes-for-2017?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 12, 2017",
    "tags": [
        "Corporate products",
        "Investment Banking",
        "Research",
        "Wealth"
    ],
    "title": "Rhetoric into Reality: 10 themes for 2017",
    "body": "Christian Nolting, Chief Investment Officer for Deutsche Bank Wealth Management, discusses his 10 key investment themes for 2017, as the rhetoric of last year is translated into policy and investment reality.\nTheme No. 1 is multi-dimensional divergence – across monetary, fiscal and other policy areas. One manifestation of this will be Theme No. 2 – pop-up protectionism – as governments try to engineer or anticipate changes in the global trade regime.\nIn this changeable environment, investors need to make a clear-headed assessment of what is likely and what is not. In the fixed income market, Nolting believes that you need to get “real” on interest rates, his Theme No. 3. Inflation could be become a topic. But it will not be the perfect storm and that’s why Theme No. 4 is give credit to the bond market.\nLooking at equities, Theme No. 5 must be all eyes on earnings. With valuations high, markets will need reassurance that earnings can increase. Investors will also need to assess individual sectors. For Nolting, Theme No. 6 – NextGen Tech – still has considerable appeal. He also argues that, given still high levels of global supply, oil prices are unlikely to increase much further, hence Theme No. 7 - topped-off oil markets.\nU.S. growth and tighter Fed policies will be key drivers of U.S. currency strength this year. So, to rephrase US President-elect Donald Trump, Theme No. 8 is making the dollar great again. Volatility will also be a feature of 2017, potentially triggered by a wide range of political events and global risks.\nSo Theme No. 9 – navigating headline hysteria – will be an important skill to have. But investors shouldn’t forget to look beyond this for opportunities in Theme No. 10 – tomorrow’s themes today. Cyber-security, global ageing and the millennials as well as NextGen Tech are in focus here.\nFor highlights of the report, click on your region below:\nPDF\nAmericas\nPDF\nAsia Pacific\nPDF\nEMEA ex Germany (in English) /\nPDF\nEMEA ex Germany (in German)\nPDF\nGermany (in German)",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}