{
    "url": "https://www.db.com/news/detail/20220221-deutsche-bank-named-ssar-bond-house-and-asia-high-yield-bond-house?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 21, 2022",
    "tags": [
        "Asia-Pacific",
        "Awards",
        "Capital markets",
        "Investment Banking"
    ],
    "title": "Deutsche Bank named SSAR Bond House and Asia High Yield Bond House",
    "body": "IFR has named Deutsche Bank Sovereign, Supranational, Agency and Regional (SSAR) Bond House and Asia High Yield Bond House of the year. It is the second consecutive year the bank has been awarded Asia High Yield Bond House, with IFR recognising the bank for its market savviness, multi-market strength and leadership in sustainability.\nNaming the bank SSAR Bond House, IFR said: “Key roles on many of the year’s most important transactions, an increase in market share, and a resurgent sterling business were all hallmarks of Deutsche Bank’s activities in 2021. ESG was another area where the bank led the market”.\nHenrik Johnsson, Global Co-Head of Capital Markets at Deutsche Bank, said: “Congratulations to everyone involved in securing these awards. In another turbulent year for markets we have demonstrated our strength and ability to deliver for our clients.”\nPanos Stergiou, Deutsche Bank’s Head of Institutional Clients Group (ICG) FIC EMEA, Global Head of ICG Macro Sales and Head of the SSA Coverage Group, said: “This is a significant achievement for our SSA franchise following a realignment of the origination, syndicate, trading and sales teams to sharpen our focus on this client segment two years ago.”\nDeutsche Bank was also named on six deal awards:\nEurope High-Yield Bond: Asda’s £2.75bn dual-tranche bond\nEMEA Leveraged Loan: Flender's €1.3bn-equivalent buyout financing\nSterling Bond: UK Debt Management Office’s £10bn July 2033 green Gilt\nReverse Yankee and Europe IG Corporate Bond: Eli Lilly’s €2.1bn-equivalent four-tranche bond\nNorth America High-Yield Bond: Dish Network’s US$5.25bn dual-tranche bond\nNiche-Market Bond: Mexico’s US$3bn 50-year Formosa bond\nIn the IFR Asia awards, IFR stated: “In a year that decimated high-yield supply and saw bonds default just months after issuance, one bank managed to shift its business to not only survive but thrive.”\nHaitham Ghattas, APAC Head of Capital Markets at Deutsche Bank, said: “We are delighted to win this award once again, which is testament to our sustained performance across Asia Pacific’s debt capital markets. Our ability to collaborate across teams and borders has yet again enabled us to deliver outstanding outcomes for our clients.”\nThe IFR Asia awards also recognised Deutsche Bank’s leadership in sustainability, with the bank winning ESG Bond, for its role as joint lead manager and bookrunner on JSW Steel’s 500 million US dollar sustainability-linked bond. \nPlease see links to the full write-ups below:\nhttps://www.ifre.com/story/3197154/ssar-bond-house-deutsche-bank-rr30whmrjm\nhttps://www.ifre.com/story/3212955/high-yield-bond-house-deutsche-bank-0ghsvc6dv8",
    "number_of_ratings": 3,
    "rating": 1.0,
    "likes": 5
}