{
    "url": "https://www.db.com/news/detail/20230630-deutsche-bank-in-the-uk-features-in-the-times-top-50-employers-for-gender-equality-2023?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 30, 2023",
    "tags": [
        "Diversity"
    ],
    "title": "Deutsche Bank in the UK features in The Times Top 50 Employers for Gender Equality 2023",
    "body": "For the fourth year running, Deutsche Bank in the UK features in The Times Top 50 Employers for Gender Equality.\nLed by Business in the Community (BITC), this is the UK’s most highly profiled and well-established annual listing of employers who are taking action towards workplace gender equality and making it part of their business strategy. Inclusion in the list recognises progress and examples of best practices, impact, innovation, and individual achievement and employers have been selected by gender equality experts at BITC, through a competitive and robust application process and double-blind evaluation.\nRebecca Short, Chief Operating Officer and Member of the Management Board, said: “Deutsche Bank is committed to creating a more gender balanced workforce. We are proud to once again be named in The Times Top 50 Employers for Gender Equality, which recognises the progress we are making to attract, retain and develop talented women. We will continue to monitor the progress of our initiatives and measure their impact to support a diverse, equitable and inclusive work environment.”\n\nTiina Lee, Chief Executive Officer, UK & Ireland, said: “Our continuous efforts in diversity and inclusion, supported by our passionate team, have positioned us alongside some of the world's top companies. We're working tirelessly not only to enhance gender equality, but inclusivity in all forms. Thanks to initiatives like our Inclusive Talent Programmes and a global network of senior female leaders, we're actively paving the way for a more equitable workplace for everyone. Our journey continues, but today we’re delighted to celebrate this milestone.”\nSince Deutsche Bank announced its refreshed gender diversity goal of at least 35% of women in the Managing Director (MD), Director (D) and Vice President (VP) population combined by 2025 (’35 by 25’), the bank continues to make progress. The below are some of the many examples of this:\nThe UK remains on track to achieve its target this year and we are also making an impact through hiring and promotion, with a record year for promotions of women in the region.\nAs well as making progress at the senior levels, the bank has also strengthened the proportion of women at entry levels to ensure sustainability and drive gender parity.\nOur Everyday Inclusion Toolkit outlines behaviours/actions for inclusive decision-making across our people processes including mitigating barriers to women’s progression, inclusive language terminology guide and considerations for team events and meetings.\nThe bank significantly increased the amount of online learning resources on inclusion targeted to managers.\nIntroduction of the voluntary use of personal pronouns in email signatures and on internal Group Directory profiles.\nThe list was profiled in a printed edition of The Times, in a digital supplement on The Times website, as well as the BITC site.\nAs in previous years, the list is unranked and published in alphabetical order.",
    "number_of_ratings": 3,
    "rating": 3.0,
    "likes": 3
}