{
    "url": "https://www.db.com/news/detail/20230616-against-the-odds-a-story-of-living-with-thalassaemia?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 16, 2023",
    "tags": [
        "Asia-Pacific",
        "Careers",
        "Diversity"
    ],
    "title": "Against the odds: a story of living with thalassaemia",
    "body": "Imagine having a genetic disorder that means your body produces little or no haemoglobin, which red blood cells use to transport oxygen around the body. Gagandeep Singh Chandok was born with this severe health condition – thalassaemia – and, as a result his body does not have good quality bone marrow to produce red blood cells, which means he needs a blood transfusion every three weeks.\nGrowing up, Gagandeep was told that having thalassaemia would prevent him from studying or working. In this personal video, Gagandeep shares how he overcame this adversity and has built a successful career in Operations at Deutsche Bank – also thanks to the supportive environment which allows him to openly talk about his disability and attend necessary and regular medical treatments.\nThe supportive environment that Gagandeep has experienced at Deutsche Bank has also encouraged him to be an ambassador for inclusion. He also raises awareness about the condition in the community as president of the Thalassemia and Sickle Cell Society in Bengaluru. Gagandeep recently received an achievement award from Thalassaemics India for his work. He also talks to colleagues about the disorder as a member of dbEnable, the employee group that builds awareness of disabilities.\nAbout dbEnable\ndbEnable is Deutsche Bank’s employee resource group that nurtures an inclusive and supportive workplace for people with disabilities. This group helps the bank become more disability confident through better policy, practice, procedure and more open discussion. They build awareness of visible and invisible illness or disabilities and provide education and practical support for employees and managers.",
    "number_of_ratings": 5,
    "rating": 5.0,
    "likes": 3
}