{
    "url": "https://www.db.com/news/detail/20230607-deutsche-bank-named-best-liquidity-provider-for-forwards-swaps-and-best-new-algo-2023?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 7, 2023",
    "tags": [
        "Awards"
    ],
    "title": "Deutsche Bank named Best Liquidity Provider for Forwards / Swaps & Best New Algo 2023",
    "body": "For the third year running, Deutsche Bank’s Foreign Exchange (FX) business has scooped Best Liquidity Provider for Forwards/Swaps and placed top in a new category - Best New Algo - in FX Markets’ eFX Awards 2023.\nStrong market share across both forwards and swaps and our reputation for leading innovation were central to the bank’s success in this year’s Awards process. \nHead of European FX, David Leigh, said: “We’ve been focused on building our forwards and swaps business from the ground up, incorporating innovative hybrid pricing models. Today, Deutsche Bank has the technology and strategy to successfully maintain market share – and we are confident of consolidating our market leading position in the years to come”.\nIn addition to this, building on our reputation for leading innovation, Deutsche Bank combined the capabilities of three market-leading algos – Stealth, SmartPeg, and IS – into one new strategy: Stark. The all-new, next generation algo has been built using DB’s insight and investment into research, as well as quantitative analysis of impact, information leakage and order-placement.\nMaria Prata, Global Head of FX eCommerce ICG Sales said, “Our continual investment in technology means our clients should have the tools available to manage their execution style in a variety of ways. We are confident, in instances where there is a high level of volatility, these solutions will stand out by enabling clients to seamlessly switch their style and navigate the uncertain landscape”.",
    "number_of_ratings": 4,
    "rating": 2.8,
    "likes": 10
}