{
    "url": "https://www.db.com/news/detail/20210430-people-s-bank-of-china-approves-deutsche-bank-china-as-qualified-primary-dealer-in-open-market-business?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 30, 2021",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "People's Bank of China approves Deutsche Bank China as qualified primary dealer in open market business",
    "body": "Deutsche Bank (China) Co., Ltd. (Deutsche Bank China) today announced that it has received approval by the People's Bank of China (PBOC) to act as a qualified primary dealer for domestic open market businesses.\nAs the first Eurozone bank to obtain this qualification, Deutsche Bank China and PBOC will carry out open market business such as the repurchase of treasury bonds, policy financial bonds, spot bond transactions, central bank bill issuance and other trading instruments.\nChief Country Officer of Deutsche Bank in China, Rose Zhu said: “We are honored to be the first Eurozone bank appointed primary dealer in China’s open market business. This PBOC appointment recognises the strength of Deutsche Bank’s capital markets franchise, and reflects China’s determination to continue opening up its capital markets. The rapid development of the China market provides broad opportunities for global participants and Deutsche Bank will continue to deepen the China market, leverage its global network, and exercise best practice risk management to support the country’s continuous capital markets opening and development.\"\nDeutsche Bank is one of the most active foreign banks in China's inter-bank market. It already acts as market maker in the inter-bank bond market, bond settlement agent, and Bond Connect market maker. It is also one of two foreign banks that have qualifications as a Type-A lead underwriter for non-financial corporate debt financing instruments.  The bank’s full set of businesses are at the forefront of onshore foreign capital management.\nHead of Global Markets for Deutsche Bank China, Jason Shi added: “As a leading European bank active in the domestic market and as one of the world’s major RMB banks, obtaining this qualification means that Deutsche Bank has the expertise and interbank license to fully serve RMB customers. By further strengthening the level of RMB-related liquidity risk management, Deutsche Bank can effectively interpret monetary policy guidance for domestic and overseas customers and partners, support the development of the domestic capital market and accelerate the internationalization of the RMB.\"\nIn global markets, Deutsche Bank's fixed income, foreign exchange and derivatives businesses are world leading.  It provides a full set of RMB bond investment services for a wide range of central banks and sovereign institutions, commercial banks, fund companies and insurance companies. At the same time, the Hong Kong branch is the RMB centre, linking all branches around the world to provide RMB spot and foreign exchange derivatives business.   Asia Risk awarded Deutsche Bank the title \"Renminbi Bank of the Year” twice - in 2016 and 2019.\nFor further information please contact:\nDeutsche Bank AG                                      \nCommunications                                                       \nAmy Chang                                                  Sarah Stabler\nPhone: +852 2203 8434                              Phone: +65 6423 8413\nEmail: amy.chang@db.com                         Email: sarah.stabler@db.com\n                                                                        ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 4
}