{
    "url": "https://www.db.com/news/detail/20210428-a-message-from-christian-sewing-on-our-q1-results-2021?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 28, 2021",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "A message from Christian Sewing on Q1 results 2021",
    "body": "Dear Colleagues,\nIt has been a long time since we have seen such a successful quarter as we had at the start of 2021. Reporting a quarterly profit for the Group of 1.6 billion euros before tax and 1 billion euros after tax is something we last achieved seven years ago. Furthermore, with a return on tangible equity of 7.4 percent in this quarter, our 2022 targets are within reach. Indeed, in the Core Bank we were ahead of our target for 2022, achieving a return on tangible equity of almost 11 percent. Even though we undoubtedly benefited from a favourable market environment, this result shows once again that we are on the right track with our strategy. It confirms your excellent work, your dedication and your discipline. Thank you all!\nThe foundation for this success is that we managed to grow our revenues to 7.2 billion euros, a 14 percent increase compared to what was already a strong first quarter in 2020. This is the highest revenue level since the first quarter of 2017, although we have exited several businesses since then. Equally important for the quarterly result was our continued discipline; we remain on track with cost reductions and we benefited once again from prudent risk management. Although the pandemic continues to weigh on the global economy, our risk provisions in the first quarter were just 69 million euros, 86 percent below the prior-year level and much lower than expected. We now expect our risk provisions for the full year to be substantially lower than previously anticipated. Our Risk function led by Stuart Lewis deserves special thanks for this.\nI am delighted that all of our business divisions contributed to this first quarter success\nOur Corporate Bank increased its profit before tax by 90 percent compared to the prior year quarter. Its revenues adjusted for exchange rate effects rose by 2 percent. This means we once again succeeded in offsetting the impact of interest rate headwinds, mainly through additional repricing measures that now apply to 83 billion euros of client deposits. We also made further progress on our growth initiatives in the payments business, for example via online marketplaces and our partnership with Mastercard.\nOur Investment Bank profits more than doubled, with revenues up by 32 percent year on year. This is the sixth consecutive quarter of double-digit year on year revenue growth. Following exceptional market activity last year, our Rates, Emerging Markets and FX businesses largely returned to more normal levels. However, this was more than offset by higher revenues from the Credit trading and Financing businesses. At the same time we grew Origination & Advisory revenues by 40 percent and we regained market share in Debt and Equity Capital Markets, driven in particular by winning significant IPO mandates in a favourable market.\nOur Private Bank also delivered strong results, with profit before tax up by 92 percent. Revenues were stable despite the interest rate environment, as we were able to further increase business volumes. Our clients took out net new loans worth 4 billion euros and made net investments of 9 billion euros in investment products, driven in particular by the International Private Bank. So in the last five quarters, our Private Bank’s net inflows in investment products totalled 25 billion euros. At the same time, we continue to adapt to changes in customer behaviour, with many of our clients coming to our branches less and less often and opting instead for digital products and offers such as our remote advisory video sessions. In our home market we recently reached agreement with our workers councils regarding a balance of interests for our Deutsche Bank branches and for our Postbank branches. Unfortunately, this also means we will have to make cutbacks and will therefore be closing 150 Deutsche Bank and Postbank branches in 2021, before closing a further 50 Postbank branches in 2022. And we will have to reduce more than 1,200 positions as a result.\nIn Asset Management, pre-tax profits were up 66 percent, while net revenues increased by 23 percent. We benefited from the favourable market conditions and net inflows for the fourth consecutive quarter, which helped to offset the margin pressure in the industry. Asset Management now has 820 billion euros of assets under management – a record level.\nWe are also making good progress in our Capital Release Unit. Compared to the same period last year, risk-weighted assets in the CRU decreased by 24 percent and noninterest expenses were down by 28 percent.\nWhile we can look back on an excellent quarter, the outlook is also encouraging. We are confident that in a year on year comparison, the impact from low interest rates will gradually pressure our revenues less, both in the Corporate Bank and our Private Bank. At the same time, we are seeing increasing evidence that a significant portion of the revenue growth in our Investment Bank relative to 2019 will prove to be sustainable. Even if the markets normalise as expected in the coming months, we anticipate that revenues in 2021 will be close to 2020 levels, which was a very strong year.\nMoreover, the past few months have shown that we are benefiting from a number of global economic trends, including ongoing high corporate and sovereign financing demands and the growing importance of sustainability. This is one area where we are already seeing continued growth; our sustainable financing and investments volume in the first quarter totalled 25 billion euros. After just one quarter, we already have sustainable financing and investments equivalent to more than half of the 46 billion euros we reported for the full financial year 2020.\nAs planned, we continue to cut our costs. Our adjusted costs excluding transformation charges were 5.3 billion euros in the first quarter, which is 2 percent lower than in the same period in 2020 – despite having to pay 571 million euros in bank levies in the first quarter, which is 13 percent more than in the prior year period and substantially higher than we originally planned for. Stripping out these bank levies, we have reduced our adjusted costs excluding transformation charges year on year for 13 consecutive quarters. \nWe also continue to strengthen our controls. Even though we have invested substantially over the past three years, there is still much to do. And each and every one of us has a part to play. So please stay alert and if you witness any kind of suspicious activity or misconduct, report it. Also, make use of all the training opportunities and keep abreast of resources that our control functions provide to staff\nWe can also continue to build on an extremely robust balance sheet. Our Common Equity Tier 1 (CET1) ratio slightly increased to 13.7 percent in the first quarter despite regulatory headwinds. During the course of this year, further regulatory and supervisory changes are expected to negatively impact the CET1 ratio. All told though, we have an excellent foundation not only to be able to return capital to our shareholders, as we plan to do from next year, but also to support our clients wherever they need it. They value our support, especially in this uncertain economic environment. In fact, in our home market, our corporate clients’ trust in us in the first quarter was even greater than the strong average for 2020.\nWe have made a very strong start to the third phase of our transformation and today, we can be proud of what we have all achieved so far. We have laid the foundation for our bank's return to sustainable profitability.\nBest wishes,\nChristian Sewing",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 13
}