{
    "url": "https://www.db.com/news/detail/20210427-providing-sustainable-trade-financing-to-vestas-for-wind-turbines-in-australia?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 27, 2021",
    "tags": [
        "Asia-Pacific",
        "Corporate products"
    ],
    "title": "Providing sustainable trade financing to Vestas for wind turbines in Australia",
    "body": "Deutsche Bank today announced that it will provide an ECA-backed AUD313.97 million account receivables purchase facility, with a two-year tenor, to Vestas for two wind farms owned by Australian subsidiaries of Global Power Generation SA.\nThe facility will be used for purchasing receivables on a limited recourse basis, arising out of the supply and installation of Vestas’ wind turbines for the Ryan Corner and Hawkesdale wind farms in the state of Victoria. In addition, the wind turbine exports will be insured by China Export & Credit Insurance Corporation.\nWith more than 132 GW of wind turbines in 82 countries, and 113 GW currently under service, Vestas has installed more wind power than anyone else. Vestas currently operates the most amount of wind generation in Australia and is a leading turnkey provider in the country’s promising renewable energy sector.\nGPG SA is a joint venture company between Naturgy (NYSE: NTGY.MC), a Spanish multi-national natural gas and electrical energy utilities company, and the Kuwait Investment Authority. Including the Ryan Corner and Hawkesdale wind farms, GPG SA has increased its capacity in Australia to over 700 MW.\nAustralia’s electricity sector has been historically dominated by coal-fired power stations with 83% of power production in 2000 coming from coal. However, due to the retirement of aging coal plants, availability of new gas capacity and the uptake of low cost renewable generations, IHS forecasts that renewables will generate 79% of Australia’s power by 2050, with coal only accounting for 4% of the total power.\nMatthew Moodey, APAC Head of Natural Resource Finance and Trade & Loans Structuring at Deutsche Bank, said: “We are pleased to partner with Vestas and support General Power Generation’s short-term financing needs. This landmark multi-market transaction further demonstrates the strength of our global platform and our strong focus on sustainable financing in the region.”\nKamran Khan, Deutsche Bank’s Head of ESG for APAC, said: “This new financial solution led by Vestas demonstrates our ability to work with sustainable energy providers, buyers/operators and ECAs to structure cross-border ESG transactions which make the sustainable options commercially viable. Our high standards for ESG compliance and our world-class financial structuring/pricing capabilities provided the necessary comfort to all parties that this transaction will be received by the market as a high-end ESG transaction, establishing important benchmarks for the renewable energy sector in Australia.”   \nPurvin Patel, President of Vestas Asia Pacific said: “We are proud that our customers not only utilize our leading technology, but also turn to us for our market experience and broad energy solutions, which aim to bring the best return on investment for their wind farms. Our collaboration and experience with global institutions like Deutsche Bank, has allowed us to structure innovative financial solutions. By drawing on this strong relationship, we are able to support Global Power Generation in optimizing their projects’ returns”.\nGlenn Sundaram, Director, Head of Financial Solutions Asia Pacific at Vestas, said: “This is a landmark transaction for Vestas. It demonstrates our ability to structure innovative financial solutions by collaborating with experienced global institutions like Deutsche Bank. Their long-standing relationship with China Export & Credit Insurance Corporation was extremely valuable throughout the structuring process of this transaction.”\nFor further information, please contact:\nDeutsche Bank AG\nMedia Relations\nKarène Dufour\nPhone: +852 2203 7846\nE-mail: karene.dufour@db.com ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 3
}