{
    "url": "https://www.db.com/news/detail/20210421-deutsche-bank-joins-new-net-zero-banking-alliance?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 21, 2021",
    "tags": [
        "Strategy",
        "Sustainability"
    ],
    "title": "Deutsche Bank Joins New Net Zero Banking Alliance",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) has announced that it has joined the Net Zero Banking Alliance [NZBA] which was launched today. \nAn initial group of 43 banks from 23 countries have joined the NZBA, each committing to align the operational and attributable emissions from their portfolios with pathways to net-zero by 2050 or sooner.\nThe NZBA has been convened by the United Nations Environment Programme Finance Initiative as part of the Glasgow Financial Alliance for Net Zero (GFANZ). The GFNAZ brings together existing net zero finance initiatives into a sector-wide strategic forum. It will work to mobilise the trillions of euros necessary to build a global zero emissions economy and deliver the goals of the Paris Agreement.\nChristian Sewing, Deutsche Bank CEO, commented:  “Banks will play a crucial role in the fight against climate change, and the creation of the NZBA is an important step forward to developing coordinated, accelerated action. We are proud to be a founding member of the NZBA and to commit to making our portfolio net zero carbon by 2050 at the latest. We look forward to playing an active role in the work of the alliance.”\nDeutsche Bank made sustainability a strategic priority in 2019, and this commitment is one of many actions taken by the bank since then to further develop sustainability within its own operations and those of its clients.\nIn May 2020, Deutsche Bank set itself the target of expanding its ESG financing and investment by at least 200 billion euros by the end of 2025 (excluding DWS). By the end of 2020, it had achieved 46 billion euros towards this goal, significantly above the 20 billion euro target for the year.\nDeutsche Bank issued its first green bond in June 2020 and followed this up with an inaugural US dollar green bond in March 2021. It was a top 5 arranger of green bonds globally in Q1 2021, and has been active in developing new green derivative products such as the first green hedging transaction with a second party opinion based on a specially designed green hedge framework.\nIn March 2021, DB Research held its first virtual DB Access conference focused purely on ESG bringing together issuer and investor clients.\nDeutsche Bank is already a signatory to the German financial sector’s Commitment on Climate Action in which – in June 2020 - it pledged to align its lending portfolios with the targets of the Paris Agreement on Climate Change.\nIn May 2021, Deutsche Bank will hold its first ever Sustainability Deep Dive. The event will be dedicated to providing details of the bank’s strategic and operating progress in the environmental, social and governance space.\nFor further information please contact:\nDeutsche Bank AG                                       \nMedia Relations                                            \n  Charlie Olivier\n+44 7917151627\nEmail: charlie.olivier@db.com\n                                                                       Tim-Oliver Ambrosius\nEmail: tim-oliver.ambrosius@db.com\n  Dylan Riddle\nEmail: Dylan.riddle@db.com\n  About Deutsche Bank\nDeutsche Bank provides retail and private banking, corporate and transaction banking, lending, asset and wealth management products and services as well as focused investment banking to private individuals, small and medium-sized companies, corporations, governments and institutional investors. Deutsche Bank is the leading bank in Germany with strong European roots and a global network.\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement. Such factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission. Such factors are described in detail in our SEC Form 20-F of 21 March 2021 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 16
}