{
    "url": "https://www.db.com/news/detail/20210401-minority-women-and-service-disabled-veteran-owned-broker-dealers-help-to-underwrite-deutsche-bank-s-750-million-us-dollar-bond?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 1, 2021",
    "tags": [
        "Capital markets",
        "Diversity",
        "Sustainability"
    ],
    "title": "Minority, Women and Service-Disabled Veteran Owned Broker Dealers help to underwrite Deutsche Bank’s 750 million US dollar bond",
    "body": "Deutsche Bank today successfully closed its offering of 750 million US dollars of its senior non-preferred callable four-year (4nc3) Fixed-to-Floating rate bonds. For the first time, 11 additional underwriters owned and led by management teams from minority, woman and service-disabled veteran backgrounds joined Deutsche Bank Securities Inc. to underwrite this bond offering.\nEach Joint Lead Manager will retain 7% of the fees.  The full group of minority, woman and service-disabled veteran owned firms will collectively receive around 60% of the fees associated with this transaction. This marks a significant increase over the traditional fee arrangement for other sole-led bank transactions, where such firms typically retain 0.5-1% individually and 3-5% collectively.\n“This is an impactful statement to the financial community,” said David R. Jones, President & CEO, CastleOak Securities, L.P. “Diversity and inclusion have increasingly become a topic of discussion, but it’s great to be recognized for our capabilities and execution prowess rather than as a participant merely to check a box.” \n“Having Loop Capital Markets participate as an active joint bookrunner with books, allowed us to fully leverage our distribution capabilities and amplifies our discussions with investors,” said Sidney Dillard, Partner, Head of Corporate & Investment Banking at Loop Capital.\n“Two of the most exciting developments in the diversity and inclusion (D&I) space over the past year have been the broadening of corporate engagement with D&I broker dealers and the elevation of roles being offered,” said Annie Seelaus, CEO, R Seelaus & Co. “Deutsche Bank’s initiative to elevate their D&I partners to active book-running roles goes far beyond bestowing a credential. Allowing us to participate in every aspect of the new issue process creates the kind of institutional knowledge that can only be earned one way – with experience and repetition.”    \n“This deal will lead directly to more veteran hires here as we continue to execute on our commitment to mentor, hire, and train veterans,” said Chance Mims, Founder & CEO Academy Securities.\n “Today’s brand of a much higher level of engagement leads to greater profitability, introduces a more diverse network of high quality investors to an issuer’s portfolio while promoting better business outcomes for all stakeholders, including clients. Issuers take note – you will achieve all that and more by deepening your partnerships with firms owned by minorities, women and disabled veterans,” said Ronald M. Quigley, Head of Fixed Income Syndicate at Mischler Financial Group, Inc.\n“While Diversity and Inclusion initiatives have been in place for decades, our invitation to join Deutsche Bank as an active joint bookrunner on this offering is a reflection of their confidence in our ability to add value as a partner and creates a foundation for us to continue to build our presence as an underwriter. Our role on this mandate demonstrates a deliberate step forward in diversity and inclusion initiatives and we are pleased with the successful execution of the transaction,\" said Christopher J. Williams, Chairman, Siebert Williams Shank & Co., LLC.\nThe offering reflects Deutsche Bank’s commitment to diversity and inclusion, both among its employees and in the wider community. As part of this commitment, the bank seeks to expand community partnerships and work with diverse suppliers, vendors and other partners. Today’s announcement reflects Deutsche Bank’s strong partnerships, developed over many years, with these and similar firms on Wall Street.\nThe group of underwriters were selected to represent diverse missions including Service-Disabled Veteran Owned, African American Owned and Women Owned firms.\nThe full list is as follows: \nJoint Lead Managers\nAcademy Securities Inc. Service-Disabled Veteran Owned\nCastleOak Securities, L.P. African American Owned\nLoop Capital Markets LLC African American Owned\nMischler Financial Group, Inc Service-Disabled Veteran Owned\nR Seelaus & Co., Inc. Women Owned\nSiebert Williams Shank & Co., LLC Woman / African American Owned\nCo-Managers\nAmeriVet Securities, Inc. Service-Disabled Veteran Owned\nBancroft Capital LLC Service-Disabled Veteran Owned\nCapital Institutional Services, Inc. Women Owned\nMulti-Bank Securities, Inc. Service-Disabled Veteran Owned\nRoberts & Ryan Investments, Inc. Service-Disabled Veteran Owned\nThe Broker Dealers demonstrated their ability to execute a benchmark deal to Deutsche Bank’s investor client base, who seek to support diversity and inclusion with respect to underwriters. The transaction is an important element of Deutsche Bank’s wider commitment to diversity and inclusion, and the bank hopes to deliver at least one transaction with a similar underwriting group annually in the years ahead, working with a wide range of minority-owned Broker Dealers.\nThis offering enabled Deutsche Bank to share its capital markets experience, legal knowledge, and partnership and mentoring expertise with a highly diverse Syndicate group. This helps each firm gain further transaction experience and expand its opportunities to work with new investors.\n“We have offered these Joint Lead Managers the opportunity to play a full role in the deal execution by being involved in a real-time book build and interacting closely with the issuer,” said Jeanmarie Genirs, Head of US IG Syndicate at Deutsche Bank. “The process was seamless, and what’s most gratifying is that the syndicate proved their capabilities to a wider client and investor base,” she added.\nThe offering attracted total demand from investors of $1.8 billion US dollars, with final final demand approaching $1.1 billion dollars, pricing at 112.5 basis points over the .25% US Treasury maturing 3/15/25.\n“We were pleased to leverage Deutsche Bank’s strong relationships with US investors to work with partners from diverse communities,” said Dixit Joshi, Group Treasurer. “Promoting greater diversity and inclusion in the finance industry reflects our wider commitment to sustainable finance.”\nToday’s announcement builds on existing efforts by Deutsche Bank in the United States to address racial inequities. Last year, Paul Trussell, senior Research Analyst and co-chair of Deutsche Bank’s Black Leadership Forum, joined the Americas Executive Committee as the bank’s Diversity Champion. In the summer of 2020, Deutsche Bank Americas committed to seven actions in seven months to advance the principles of diversity, equality and inclusiveness, which were completed ahead of schedule in December 2020.\nThis bond is Deutsche Bank’s fifth issuance of 2021, across three currencies. The bank has already completed a significant portion of its 2021 issuance plan and was recently named “2020 Financial Issuer of the Year” by International Financing Review.\nAbout Deutsche Bank\nDeutsche Bank provides retail and private banking, corporate and transaction banking, lending, asset and wealth management products and services as well as focused investment banking to private individuals, small and medium-sized companies, corporations, governments and institutional investors. Deutsche Bank is the leading bank in Germany with strong European roots and a global network.\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections, as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement. Such factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission. Such factors are described in detail in our SEC Form 20-F of 12 March 2021 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 6
}