{
    "url": "https://www.db.com/news/detail/20180308-diversity-solidarity-and-equal-rights?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 8, 2018",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "Diversity, solidarity and equal rights",
    "body": "In 1911 women in Germany, Austria, Denmark and Switzerland took to the streets to claim their rights for the very first time. They demanded women be given the right to vote and included in the political process, something they were denied in most European countries. These protest marches gave rise to “International Women’s Day” on March 8, which serves as an annual reminder of the achievements of the women’s movement.\nBut that’s not all: it also stresses that further progress is needed, because the longstanding trend towards greater equality has stalled worldwide, according to a recent report from the World Economic Forum (WEF). In 2017, the gender gap widened in the areas of health, education, politics and the world of work for the first time since records began in 2006. If the current pace is maintained, it will take another 100 years for equality to be achieved – and over 200 years for the economic gender gap to be closed, according to the report.\nSo it is particularly appropriate that the international initiative for International Women's Day www.internationalwomensday.com has adopted the #PressforProgress hashtag this year. The campaign aims to be a catalyst for more change and further progress.\nDeutsche Bank is committed to supporting the advancement of women, and this commitment will be underlined by numerous initiatives taking place around March 8:\nIn the US, for example, the Deutsche Bank Americas Foundation is proud to support the New York Historical Society’s new Center for Women's History that is dedicated to weaving women’s contributions back into the narrative of American history. In addition, the Women on Wall Street® employee resource group is partnering with the Ellevate Network to host a screening of the documentary “Miss Representation”. This film aims at challenging any limiting stereotypes.\nIn Europe, too, numerous activities are being planned:\nin London Deutsche Bank’s gender equality employee resource group dbGO is joining forces with Born to Be partner “Student to STEMette” to organise a debate. The Student to STEMette programme aims to enthuse girls about the STEM subjects of science, technology, engineering and mathematics as well as explaining career opportunities.\nAnother dbGO event will be held in Birmingham – a coffee and connect session with senior female managers will enable women from all levels to network and share experiences.\nIn Frankfurt, the WoMen@db network is organising an event entitled “The Journey to Social Entrepreneur”. The guest speaker Asiya S. Mohammed will talk about how she started her company Conflict Women Ltd, which provides job opportunities for victims of domestic and sexual violence. Her presentation will also examine what it means to question the status quo and boldly branch out in new directions.\nAt the bank in Düsseldorf, the women’s group Frauennetzwerk Nordwest is organising a Lunch & Connect session where demographic change and its influence on women will be discussed.\nIn addition, the second round of Deutsche Bank’s language mentoring programme “From woman to woman” – in which female employees help female refugees to learn German – is now being launched in Germany.\nDeutsche Bank also uses its banking terminals to publicise International Women’s Day throughout Germany.\nIn Italy the dbMORE networkers have invited inspirational journalist and blogger Monica Nanetti to Milan to talk about her journey along the “Via Francigena” pilgrimage route.\nFor the second time Deutsche Bank in Switzerland has now gained recognition for its ambition for gender equality. The bank was one of eight companies to receive the EDGE certification. EDGE (Economic Dividends for Gender Equality) is a leading global assessment methodology and business certification standard for gender equality that is currently used in more than 150 organisations in over 40 countries and 22 industries across the globe.\nIn Russia, International Women’s Day is a very special day to be celebrated nationwide: Not only is it a national holiday but also a day of acknowledgement.\nIn Asia-Pacific, too, women’s networks will be flying the flag: In many locations employees are encouraged to wear purple on March 8 to show the bank’s commitment to diversity and equal opportunities.\nDeutsche Bank and the INSEAD Emerging Markets Institute (EMI) in Singapore published a study into levels of gender equality in Asian corporates, revealing that equality, particularly at senior levels, is still a way off.\nA series of events are also being organised at Deutsche Bank across India, including speaker sessions to take place in Bangalore, Mumbai, Jaipur and Pune and a selfie contest: employees are asked to take a selfie of women who made a positive impact on their lives – friends, colleagues, wives, mothers, sisters, daughters.\nIn Manila, dbGO is organising a #PressforProgress video contest.\nIn Hong Kong cash and clothing donations will be collected and passed on to local social facilities for women.\nIn Japan, too, a special “Go Purple donation drive” has been organised: The money collected will go to the non-profit organisation “Lights on Children” that is partnering with Deutsche Bank and supporting young girls in the Tokyo area. The employee resource group dbWoman Japan will also host a session with Yumiko Tategami, the founder of this organisation. In addition, a special “Art and Diversity” event will be held at the Art Fair Tokyo, which is sponsored by Deutsche Bank.\nThe local dbGO network in Australia will host a panel discussion in Sydney with women representing the performing arts scene. The focus of the panel will be on the key factors that influence performers and the physical and mental stamina required to sustain a successful career in the arts.\nAll of these activities for International Women’s Day contribute to one key objective: creating a culture of inclusion in which Deutsche Bank employees whatever their gender feel motivated to give their best.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}