{
    "url": "https://www.db.com/news/detail/20180305-follow-us-on-instagram?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 5, 2018",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "Follow us on Instagram!",
    "body": "Instagram users are young: 90% are under 35 – much younger than the Facebook demographic.\nInstagram already has an impressive 700 million users, around half of whom are active on the image sharing channel on a daily basis.\nFacebook acquired Instagram in 2012, and now videos can also be uploaded, as can “Insta-Stories” – aesthetically appealing photos and videos that … tell a story.\nThe particularly interesting aspect for companies is that the Instagram community is much more prepared to interact with brands and branded content than the communities on Facebook and Twitter. This is why by the end of 2018 over 70% of all brands worldwide and nine of the top 100 brands are expected to have an Instagram presence.\nSporting goods manufacturers such as Nike and image-focused media like National Geographic were among the first companies to have an Instagram presence. It has been a different story for banks, whose products and services are notoriously difficult to convey – particularly in picture form.\nVisually strong topics and a focus on our employees\nSo what can you expect to find on the Deutsche Bank Instagram channel? We want to visually convey a different side to our company and our activities. We will portray staff from around the world doing a wide variety of jobs, showing the differences and similarities between the everyday routines of employees at a major global corporate. We want to provide a platform for projects and ideas with particularly strong visuals.\nWe want to get closer to situations and people, provide a look behind the scenes and communicate authentically – with no filter.\nSo take a look and follow us on www.instagram.com/deutschebank.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}