{
    "url": "https://www.db.com/news/detail/20180301-the-persistence-of-zombie-firms-in-a-low-yield-world?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 1, 2018",
    "tags": [
        "Corporate products",
        "Research"
    ],
    "title": "The persistence of zombie firms in a low yield world",
    "body": "Zombie companies, which had been growing in the 20 years from 1996 to 2016, may be on the decline, according to a\nPDF\nnote out today from Deutsche Bank Research. Early data from 2017 shows that their growth may be coming to an end. If this proves to be a trend, it may give central banks confidence that continuing to raise interest rates and move away from unconventional monetary policy could bring advantages.\nSo what is a zombie firm? DB Research defines them as companies where operating profits are less than annual interest expenses for two consecutive years, and are valued by the market at less than three times annual sales. The note examines data of around 3,000 companies in the FTSE All World Index which shows that the percentage of zombie firms more than trebled to 2.0% of firms in 2016 from 0.6% in 1996.\nThe data for 2017 remains inconclusive given the difference in global companies’ financial reporting schedules, but with two-thirds of firms now having published their numbers, figures indicate that the rate of zombie firms has declined sharply in 2017. Provisionally, this may suggest that the increase in growth since 2016, accompanied by tighter monetary policy, may be having an impact on the incidence of zombie companies.\nThree-quarters of zombie firms today are in the energy and financial sectors, whilst a further 15% are in utilities, materials and telecoms. In the early 2000s, the most prominent zombie companies were in the large-cap TMT space. In terms of regions, Europe has the highest percentage of zombie firms, followed by North America, then other parts of the world, then Asia Pacific.\nThe report posits that, if so many zombie companies are clinging to survival today, it is down to a combination of factors: ultra-loose monetary policies, implicit state support, and the reluctance of banks to write down bad loans since the financial crisis. These companies spend so much of their cash on repaying their debt that they are unable to make investments necessary for growth, which in turn could be part of the reason for the economy’s weak recovery to date.\nThe note is the fourth in a series of five about the general trend of rising yields published this week by Jim Reid, Global Head of Fundamental Credit Strategy Group, and his team.\nTo learn about subscribing to Deutsche Bank Research, please click this link.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}