{
    "url": "https://www.db.com/news/detail/20180426-deutsche-bank-announces-actions-to-reshape-its-corporate-undamp-investment-bank-and-additional-cost-cutting-measures?language_id=1",
    "language": "EN",
    "article_type": "Ad-hoc Release",
    "publish_date": "April 26, 2018",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Deutsche Bank announces actions to reshape its Corporate & Investment Bank and additional cost-cutting measures",
    "body": "Frankfurt am Main, 26 April 2018 - 7:15 CEST - Deutsche Bank‘s (XETRA: DBKGn.DE / NYSE: DB) Management Board has agreed on strategic adjustments in its Corporate & Investment Bank (CIB). Deutsche Bank aims to shift more decisively to more stable revenue sources and to strengthen those core business lines which are most important for its European and multi-national clients. In reallocating resources and to improve capital and balance sheet efficiency, the bank will scale back other areas where the Management Board believes that Deutsche Bank no longer has a sustainable competitive advantage in the changed market environment.\nThe Management Board has agreed on three measures:\nDeutsche Bank will focus its Corporate Finance business on industries and segments which either align with its core European client base or link to financing and underwriting products in which it enjoys a leadership position. Commitment to sectors in the US and Asia, in which cross-border activity is limited, will be reduced. The bank will remain committed to offering global industry expertise to corporates, financial institutions and financial sponsors whose activities are closely aligned with the strengths of the German and European economies.\nThe bank will scale back activities in US Rates sales and trading, shrinking the balance sheet, leverage exposure and repo financing while remaining committed to its European business, which given its scale and relevance to our client base generates more attractive returns.\nThe bank will be undertaking a review of its Global Equities business with the expectation of reducing its platform. This includes reducing leverage exposure to global prime finance where the focus will be on maintaining the deepest client relationships by reprioritising the deployment of resources.\nThe bank intends to reduce front, middle and back office costs in the Corporate & Investment Bank and related infrastructure functions significantly.\nThe Management Board reiterates its commitment to keep the adjusted cost base for 2018 below 23 billion euros. To meet and potentially improve on the 2018 adjusted cost base commitment, additional cost reduction measures are planned. These actions include:\nA significant reduction in workforce through the rest of the year, in particular stemming from the right-sizing of the Corporate & Investment Bank and the supporting infrastructure functions,\nDelayering management structures across the organization,\nRationalisation of external spend and real estate footprint worldwide, and\nIncreasing efficiency of control systems.\n  Deutsche Bank AG\nTaunusanlage 12\n60325 Frankfurt am Main\nGermany\nISIN: DE0005140008\nWKN: 514000\n\nListed: Regulated market in Berlin-Bremen, Duesseldorf, Frankfurt (Prime Standard), Hamburg, Hanover, Munich und Stuttgart; EUREX; NYSE\nThe International Securities Identification Numbers (ISINs) of further financial instruments issued by Deutsche Bank AG, and admitted to trading on a domestic organized market or for which such admission has been applied for, are listed in the attached PDFs.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}