{
    "url": "https://www.db.com/news/detail/20180426-deutsche-bank-reports-net-income-of-120-million-euros-for-the-first-quarter-of-2018?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 26, 2018",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank reports net income of 120 million euros for the first quarter of 2018",
    "body": "Christian Sewing, Chief Executive Officer, said: “We are on a good track both in the DWS asset management business and in our Private & Commercial Bank, although we need to substantially improve profitability in both. Our Corporate & Investment Bank is also doing well in some areas and held or gained market share in certain areas. However, we are not strong enough in other areas of this business. Therefore we have to act decisively and to adjust our strategy. There is no time to lose as the current returns for our shareholders are not acceptable.”\nDeutsche Bank (XETRA: DBKGn.DE/NYSE: DB) reported income before income taxes of 432 million euros, versus 878 million euros in the first quarter of 2017. Net income was 120 million euros, versus 575 million euros in the prior year period.\nRevenues were down slightly, and were impacted by exchange rate movements. In the first-quarter of 2018, net revenues were 7.0 billion euros, down 5% versus the prior year period. The year-on-year development was primarily driven by exchange rate movements, notably the appreciation of the euro against the US dollar, and lower revenues in the Corporate & Investment Bank. The prior year quarter was negatively impacted by Debt Valuation Adjustments.\nAdjusted costs were essentially stable, and up slightly on an FX-adjusted basis. Noninterest expenses were 6.5 billion euros in the quarter, up 2% versus the prior year period. Adjusted for exchange rate movements, noninterest expenses were up 6%. Adjusted Costs were 6.3 billion euros, essentially unchanged on a reported basis, and up 4% taking account of exchange rate movements. Current -quarter adjusted costs included bank levies of 0.7 billion euros.\nBank levies increased by 124 million euros or 23% year-on-year, mainly driven by industry-wide higher annual contributions to the Single Resolution Fund, for which the full-year estimate is recorded in the first quarter. IT costs were higher by 86 million euros, or 118 million euros on an exchange rate adjusted basis, driven by depreciation charges on self-developed software, IT investments in the Private & Commercial Bank and investments to modernise IT infrastructure.\nCompensation and benefits expenses were slightly lower, as lower headcount and lower retention accruals more than offset wage inflation.\nCredit quality remained strong. Provision for credit losses of 88 million euros declined by 34% versus the prior year quarter, partly reflecting releases in the Corporate & Investment Bank, driven primarily by favourable developments in the shipping segment.\nThe capital ratio remains solid. The Common Equity Tier 1 (CET1) ratio was 13.4% at the end of the first quarter, versus 14.0% at the end of 2017. CET1 capital declined by 1 billion euros, or 0.7 billion euros net of FX, largely due to adjustments including the treatment of irrevocable payment commitments to the Single Resolution Fund, adoption of the IFRS 9 accounting standard, and a number of other smaller movements. These were partly offset by a capital benefit from the partial initial public offering of DWS.\nRisk weighted assets (RWA) rose by 10 billion euros to 354 billion euros in the quarter, principally driven by business-related RWA growth in the Corporate & Investment Bank, together with a rise in market risk RWA against a backdrop of higher market volatility.\nThe leverage ratio (CRR/CRD 4 fully loaded) was 3.7%, compared to 3.8% at the end of the fourth quarter of 2017.\nProgress on the execution of strategy during the first quarter of 2018\nThe bank made progress with the implementation of its strategy in a number of areas during the quarter. The initial public offering of the asset management business, DWS, was successfully completed in March, only a year after its announcement. The bank continued to focus its geographic perimeter, reaching agreement on the sale of retail operations in Portugal, following the announcement in the previous quarter of the partial disposal of the bank’s Polish retail operations.\nThe integration of Postbank and Deutsche Bank’s Private & Commercial Clients business in Germany is proceeding on schedule. The bank has now received confirmation from the European Central Bank that the merged entity may apply the capital waiver permitting more efficient liquidity management for Deutsche Bank. Progress was also made on securing other approvals for the merger from the German authorities which are expected during the second quarter.\nFirst-quarter revenue development in Deutsche Bank’s businesses\nCorporate & Investment Bank (CIB):\nRevenues were 3.8 billion euros, down 13% year-on-year. Revenues in all business units were lower year-on-year. This development was partly impacted by specific effects, including exchange rate movements, changes in funding allocation methodology introduced in the second quarter of 2017, and one-time items in both the current quarter and prior year period. These were partly offset by the positive year-on-year impact of debt valuation adjustments. Excluding these items, revenues declined 11% year-on-year.\nIn our Sales & Trading businesses, Fixed Income and Currencies (FIC) revenues were down 16%, or 12% when adjusted for the specific effects mentioned above, versus a relatively strong prior year period. Equity Sales & Trading revenues declined 21% on a reported basis but were broadly flat year-on-year when adjusted for specific effects mentioned above, which included a one-time gain on the sale of a stake in BATS, the stock exchange operator, of approximately 80 million euros in the prior year quarter.\nGlobal Transaction Banking revenues declined by 12%, partly reflecting the exchange rate impacts and changes in funding allocation methodology mentioned above, with Cash Management revenues impacted by earlier perimeter reductions. Revenues in Origination & Advisory were down 27% year-on-year against the backdrop of a decline of approximately 25% in euro terms in the industry fee pool versus the prior year period (source: Dealogic).\nPrivate & Commercial Bank (PCB):\nRevenues were 2.6 billion euros, down 2% year-on-year on a reported basis. This development was largely attributable to specific one-time gains in the prior year quarter, which exceeded the net positive impact of specific items in the first quarter of 2018 by approximately 80 million euros. The prior year quarter saw positive impacts related to the workout of legacy positions in Sal. Oppenheim and the sale of Private Client Services.\nThe current quarter saw a gain from a property sale within Postbank, offset by negative impacts from the agreements related to the sale of the Portuguese operations and partial sale of the Polish operations. When adjusted for these items, revenues were essentially stable year-on-year as higher loan revenues offset the ongoing impact of lower interest rates as well as the impact of the implementation of MiFID II.\nAsset Management (AM):\nThe Asset Management segment now consists almost entirely of the business of the majority owned subsidiary DWS. The results of the Asset Management segment, however, include certain items which are not part of the public company, DWS, whose results are published separately today.\nAsset Management revenues were 545 million euros, 10% lower year-on-year. This development was partly driven by exchange rate movements, a loss related to the sale of the German private equity business in the current quarter, and the non-recurrence of revenues in the prior year period from disposals of non-core businesses. Adjusting for these items, revenues declined 3% year-on-year.\nThe segment reported net asset outflows of 8 billion euros, attributable mainly to outflows of predominantly low-margin assets, specifically redemptions from two clients: a US client repatriating balance sheet investments to the US following the implementation of US tax reform and a redemption from a European insurance client. Assets under management declined 3% during the quarter, reflecting net outflows together with foreign exchange and market impacts. In Europe, DWS ranked second in inflows of exchange traded products in the quarter with inflows of 3.6 billion euros (Source: ETFGI).\nNote: for exchange rate-adjusted year-on-year comparisons, prior year figures are recalculated using the corresponding current year's monthly FX rates.\nThe complete media release is\nPDF\navailable as PDF.\nAn analyst call to discuss first-quarter 2018 financial results will take place today, Thursday, 26 April 2018, at 08.00 CEST. This conference call will be transmitted via internet: www.db.com/quarterly-results\nA Fixed Income investor call will take place on Wednesday, 2 May 2018, at 14.00 CEST. This conference call will be transmitted via internet.\nAn Interim Report, a Financial Data Supplement (FDS), presentation and audio-webcast for the analyst conference call are available at: www.db.com/quarterly-results\nThe Deutsche Bank Pillar 3 Report, March 2018 (produced on a quarterly basis from now) as well as the “Disclosures for Global Systemically Important Institutions (G-SIIs) 2017” are both published today and are available at: www.db.com/regulatory-reporting\nThis document contains non-IFRS financial measures. For a reconciliation to directly comparable figures under IFRS, to the extent not provided herein, please refer to the Financial Data Supplement.\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 16 March 2018 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}