{
    "url": "https://www.db.com/news/detail/20180425-using-big-data-to-provide-portfolio-management-solutions?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 25, 2018",
    "tags": [
        "Capital markets",
        "Investment Banking"
    ],
    "title": "Using big data to provide portfolio management solutions",
    "body": "To what extent does a social media storm influence stock prices? Has the stock market fully priced bad news? Could you predict whether a data protection breach would have a material impact on the affected company’s stock price?\nNow there is a way: Deutsche Bank Research has launched “α-DIG”, (pronounced alpha-dig), an interactive web tool that uses Natural Language Processing (NLP) to quantify the importance of ESG (Environmental, Social and Governance) issues and other company intangibles such as human capital, innovation, brand value, management quality and environmental sustainability.\nIt is the first product to stem from a broader data initiative within Deutsche Bank Research, hosted on a new platform called Data Innovation Group (dbDIG), that leverages the power of alternative data and Artificial Intelligence (AI) to provide data-driven investment solutions.\nThe initiative reflects the increasing availability and importance of data: by 2020, about 1.7 megabytes of new information will be created every second for every human being on the planet, with the number of smart devices set to pass 50 billion.\nIntroducing dbDIG and its first product α-DIG.\ndbDIG is Deutsche Bank’s answer to this trend. The team behind the platform combines expertise in finance, quantitative & fundamental investing, and data science, as acknowledged by awards including Risk Magazine’s “Quant Research House of the Year”, 2018.\n“If you leave the data scientists to their own devices they may identify patterns, but without filtering those through the eyes of an investment specialist those patterns might not actually mean anything,” says Spyros Mesomeris, Global Head of Quantitative Research and Co-Head of dbDIG.\nThe platform’s first product – α-DIG – is a collaboration with Dow Jones, which is providing access to its complete historical news archive, dating back more than 20 years, and live news feeds.\nExactly how does the tool work?\nAs well as scanning a company’s quarterly or annual report for information hidden in footnotes to the accounts, the tool uses data science techniques to sift through the web and analyse how stakeholders – employees, customers and suppliers – perceive the company’s behaviour. It then uses this information to quantify the company’s intangible assets, such as its corporate culture, reputation and ability to innovate, in order to help clients incorporate this information into their investment approach.\n“I am obsessed with finding ways to measure whether ESG news is material,” Andy Moniz, Chief Data Scientist, dbDIG says. “Academic studies suggest that investors underestimate sustainability issues until they materialise as positive or negative earnings surprises.”\nMoniz’s interest stems from his time working for a Dutch pension fund. While seeking to integrate sustainability into equity strategies, he grew frustrated at the lack of relevant ESG data. He decided a new approach was needed and completed a doctorate on the topic. His idea of sifting everything from tweets to regulatory filings, list of patents, conference call transcripts, and financial media news led to the rationale for α-DIG.\n“In today’s service-based economy,” Moniz says, “most of the value of a firm comes from its intangible assets. Unfortunately, under current conservative accounting methods, companies cannot record the value of most of these assets in their financial statements as they are hard to measure. Investors know such non-financial information is valuable, but they have to look beyond a firm’s accounts if they want to incorporate this information into their investment decisions.”\nMoniz finds that companies often bury qualitative assessments about their future business risks deep within regulatory filings. He highlights the example of a-DIG scanning Facebook's latest filing, identifying new sentences added to the disclosure stating that data breaches, General Data Protection Regulation (GDPR) and government investigations may impact future sales. This was ahead of the Cambridge Analytica news of data breaches.\nPam Finelli, Global Head of Equity Derivatives Research and Co-Head of dbDIG, notes that, “α-DIG is only the first of many tools that will be created by the dbDIG platform to provide differentiated insights to our clients. It is Deutsche Bank at the cutting edge of innovation”.\nThe new tool, which will initially monitor around 5,000 companies, was showcased to clients at a launch event at Dow Jones’ London headquarters on Monday.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}