{
    "url": "https://www.db.com/news/detail/20180424-frank-kuhnke-appointed-as-new-chief-operating-officer-of-deutsche-bank?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 24, 2018",
    "tags": [
        "Company"
    ],
    "title": "Frank Kuhnke appointed as Chief Operating Officer",
    "body": "Deutsche Bank’s (XETRA: DBKGn.DE / NYSE: DB) Management Board has appointed Frank Kuhnke as new Chief Operating Officer (COO). He will be responsible for technology and central operations, including information security, data management, digital transformation and corporate services. Kuhnke succeeds Kim Hammonds who, as previously announced, will leave the bank after this year’s Annual General Meeting.\nAdditionally, the Management Board appointed Kuhnke as a Senior Group Director (“Generalbevollmächtigter”). The Supervisory Board agreed on the appointment. Kuhnke will report into Christian Sewing, Deutsche Bank’s Chief Executive Officer, and will regularly attend the meetings of the Management Board.\nKuhnke joined Deutsche Bank in 1986 and, since January 2016, has been Divisional Control Officer, Chief Administrative Officer and Head of Operations of the Private & Commercial Bank. During his career he has worked across several business divisions and infrastructure functions in Tokyo, London, New York and Germany.\nDeutsche Bank’s CEO Christian Sewing said: “In his tenure at Deutsche Bank of more than three decades Frank Kuhnke has proven that he is strong at taking decisions and executing them. He is able to systematically make complex processes and structures more efficient. Together with his team he will continue simplifying our bank’s technology and operations, cut costs and strengthen our innovation potential. We have been working together closely for many years, and I am looking forward to continuing our journey together.”\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them.\nThese statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 16 March 2018 under the heading “Risk Factors”.\nCopies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}