{
    "url": "https://www.db.com/news/detail/20180420-earth-week-2018-what-is-deutsche-bank-doing-about-climate-change?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 20, 2018",
    "tags": [
        "Sustainability"
    ],
    "title": "Earth Week 2018: what is Deutsche Bank doing about climate change?",
    "body": "Tackling climate change requires everyone’s effort and engagement. This Earth Week, we explain what the bank means by climate change and what it is doing to combat it.\nDeutsche Bank’s approach to Climate Change is key to its wider mission to balance economic success with environmental and social responsibility. This is realised through the bank’s commitment to the Ten Principles of the United Nations Global Compact, the UN’s global initiative to encourage businesses to adopt sustainable and socially responsible policies, and to report on their implementation. The Global Compact is a principle-based framework with ten principles covering human rights, labour, the environment and anti-corruption. It is the world's largest social responsibility initiative with 13,000 participants in over 170 countries.\nIn 2017, the bank created a Sustainability Council comprised of leaders across businesses and infrastructure. As the main advisory body to the Management Board, the Council’s purpose is to strengthen sustainability integration throughout the organisation and to constantly develop the bank’s sustainability strategy.\nChange begins at home\nClimate change awareness and mitigation at Deutsche Bank is practiced worldwide. The bank actively minimises the environmental impact from its direct business operations by continuously improving its environmental performance, through efficient use of resources, new technology, optimisation of building operations, reduced business travel, and increased use of renewable energy. The bank’s dedicated Eco-Performance Management Office monitors and reports its\nPDF\nemissions data.\nLighting management and the wider roll out of pull-print helped reduce electricity consumption by 1.7 percent in 2017 – equivalent to 5 gigawatt hours – beating the bank’s 1 percent target. Paper usage fell 7 percent. The bank is committed to achieving a low carbon economy by making its operations as energy efficient as possible. Where carbon emissions are unavoidable, such as essential business travel, the bank offsets emissions through reduction certificates that support climate change mitigation and economic development to.\nSupporting clients create sustainable economic growth\nPublic and private sector collaboration will be critical to promoting and financing a shift towards a low-emissions global economy and climate friendly development. Energy efficient technologies and renewable energies will drive this and need significant investment. By signing the Paris Pledge for Action alongside over 400 private and public organisations in 2015, Deutsche Bank made a commitment to contribute to limit global warming to 2°C above pre-industrial levels.\nCorporate & Investment Bank\nThe Corporate & Investment Bank (CIB) is one of the top European private-sector project financiers of clean energy. During 2017, it arranged ~2.2 billion euros in project finance for renewable energy projects generating over 3,800 megawatts.\nCIB is also a leader in green bonds, whose proceeds exclusively finance assets or projects that meet a set of environmental criteria such as renewable energy projects or clean transportation. Deutsche Bank’s role on 10 billion euros of deals in 2017 helped global green bond issuance rise 78 percent to 155.4 billion US dollars.\nDWS\nDWS’s commitment to combatting climate change includes being a signatory of the Climate Action 100+ initiative of investors engaging with the world’s largest greenhouse gas emitters to improve governance, curb emissions, and strengthen disclosures.\nThrough its recently created position of Chief Investment Officer (CIO) for Responsible Investments, DWS ensures that ESG issues are integrated into its investment processes and that it supports the growth of dedicated ESG products and solutions.\nThese already include 20 billion euros of ESG assets under management (end 2017) including seven sustainable and impact funds investing in sectors such as clean energy, energy storage and water as well as certified Green-labelled buildings.\nPrivate & Commercial Bank\nThe Commercial Clients division offers a range of products that include loans for environmental and climate protection such as energy efficiency, renewable energies, and clean technologies. In Germany, it grants loans for energy efficient building, sustainable energies and modernisation, arranging 922 loans totalling 313 million euros in 2017. Since 2005, Postbank has partnered with co2online, a non-profit consulting firm promotes climate protection in the construction and housing sector.\nThought leadership\nDiverse teams within Deutsche Bank monitor trends in climate change, undertake research and propose new approaches and solutions, helping position the bank as a thought leader. Examples include dedicated ESG research teams in CIB and DWS, which published a series of research papers on controversial topics and major trends in ESG investments.\nThis included a DWS paper that identified and categorised the location, activity, and business sensitivity of facilities or companies to climate hazards, such as heat waves, floods, and cyclones. Wealth Management’s Chief Investment Officer recently published a special report on sustainable investing: “Act today to ensure our future – understanding ESG.”\nDeutsche Bank’s commitment to tackling climate change goes right to the top. In 2017, Nicolas Moreau, Head of DWS and Member of the Management Board, called for the investment industry to move beyond carbon footprinting and towards improved disclosure of physical climate change risks.\nAddressing the “PRI in Person” conference, the leading event for responsible investors, Moreau also argued the case for sustainable investing, saying it will eventually enjoy superior returns, or at least the same returns with lower volatility.\nFor more information on Deutsche Bank’s efforts to combat climate change see the\nPDF\nNon-Financial Report 2017.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}