{
    "url": "https://www.db.com/news/detail/20180420-helping-tackle-environmental-issues-with-green-bonds?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 20, 2018",
    "tags": [
        "Capital markets",
        "Investment Banking",
        "Sustainability"
    ],
    "title": "Helping tackle environmental issues with green bonds",
    "body": "The global green bond market is expanding rapidly and Deutsche Bank is playing a leading role helping clients including Apple and the European Investment Bank capitalise on growing investor interest. Deutsche Bank’s role on 10 billion euros of deals in 2017 – including Apple’s inaugural 1 billion US dollar issue in June 2017 – helped global green bond issuance rise 78 percent to 155.4 billion US dollars last year. As a leading underwriter the bank’s high-profile deals also include the European Investment Bank’s first Climate Awareness Bond; the first green bond in Brazil and the first green covered bond from Norway.\nMore recently Deutsche Bank acted as Joint Global Coordinator and Green Structuring Advisor on the 580 million US dollar green bond issue for Indonesia’s Star Energy, the first ever corporate green bond issuance out of Indonesia. Last month, Deutsche Bank acted as the sole book runner on a USD 400mn dual-listed Green Formosa Bond for the Export and Import Bank of Korea (KEXIM), the largest ever Green Formosa Bond. Formosa bonds are bonds issued in Taiwan by international issuers, in any currency other than the New Taiwan Dollar.\nGlobal green bond issuance is expected to reach more than 160 billion US dollars this year. China is the largest issuer with 59.4 billion euros of outstanding issuance, 22 percent of the global total at the end of 2017, according to Dealogic. Going green has emerged as a key component of China’s future growth plan and Chinese financial institutions have climbed the ranks in terms of green bond issuance volume, coming close to “traditional” issuers such as the European Investment Bank (EIB) or Germany’s KfW.\nBeng Hong Lee, North Asia head of financing and solutions group said: “With a strong presence in China and uniquely positioned as a bridge between our global franchise and the local market, Deutsche Bank is at the heart of our Chinese clients’ efforts to achieve their green development objectives. We also serve the growing demand from socially responsible international investors tapping into the fast growing Chinese green bond market.”\nIn 2017, the bank acted as a joint global book runner for China Development Bank’s dual tranche issuance of 1 billion euro and 500 million US dollar green bonds and China Three Gorges Corporation’s 650 million euro green bond. Both transactions gained certification by the Climate Bond Initiative, attracted strong interest from European investors, which made up around two thirds of the investor base. These transactions were awarded Best FIG Bond, China and Best Green Bond, China at The Asset Triple A Awards 2017.\nAccording to Lee, the Chinese green bond market is set to keep growing and he expects 2018 to be a new high water mark.\nGerald Podobnik, Head of FIG FSG EMEA and Global Head of Capital Solutions & Sustainable Financing, said: “Deutsche Bank is committed to developing the green bond market and is focused on providing regulatory and structuring advice to banks, corporates and SSA’s and helping them to successfully issue green or sustainable bonds. Instead of green and sustainable finance being a niche product we expect a greening of the overall bond market.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}