{
    "url": "https://www.db.com/news/detail/20180420-earth-week-deutsche-bank-sponsors-paperless-friday-on-april-20?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 20, 2018",
    "tags": [
        "Digitalisation",
        "Research",
        "Sustainability"
    ],
    "title": "Earth Week: Deutsche Bank sponsors \"Paperless Friday\" on April 20",
    "body": "Corporations and individuals across the globe consume large volumes of paper every day. Some studies, like the “Paperless Project”, estimate that an average of 10,000 sheets of paper are used annually by an office worker. Yet often printing and copying aren’t necessary. Earth Week offers an opportunity to reflect on the ways we can be more sustainable. One way is to think about the number of times you print and copy in a given day, and where you can cut back.\nAs part of the Deutsche Bank’s Earth Week awareness activities, employees are invited to give printers and copiers a much-needed “rest” on Friday, April 20, and participate in “Paperless Friday. This simple gesture does not require great effort, and yet it’s a productive way to contribute to protecting the environment. While it is part of our Earth Week activities, we ask you to consider making a #PositiveImpact by using less paper moving forward.\nAs organizations like Deutsche Bank move towards digitization with increased use of mobile devices and virtual meeting room technology, reliance on printing is likely to decrease. This reduction in paper consumption save costs and minimizes the environmental impact on business operations. By participating in “Paperless Friday,” employees can further embrace a sustainable practice in their daily work lives.\nEmployees were also asked to let colleagues know they participated in “Paperless Friday” by sharing their pledge on #PositiveImpact, the bank’s internal social media hub.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}