{
    "url": "https://www.db.com/news/detail/20150129-deutsche-bank-reports-fourth-quarter-2014-net-income-of-eur-441-million?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "January 29, 2015",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank reports fourth quarter 2014 net income of EUR 441 million",
    "body": "Group results\nFourth quarter 2014 results\nIncome before income taxes (IBIT) of EUR 253 million\nCore Bank IBIT, which excludes the Non-Core Operations Unit (NCOU), of EUR 943 million, up EUR 1.4 billion from the prior year period\nNet revenues of EUR 7.8 billion, up 19% year over year largely reflecting higher revenues in Corporate Banking & Securities (CB&S)\nNoninterest expenses of EUR 7.2 billion, down 5% from 4Q2013\nAdjusted cost base of EUR 6.0 billion, up 7% from 4Q2013\nNet income of EUR 441 million; post-tax return on average active equity (RoE) in 4Q2014 of 2.6% for the Group\nFull year 2014 results\nIncome before income taxes (IBIT) of EUR 3.1 billion more than doubled year over year\nCore Bank IBIT of EUR 6.0 billion, up EUR 1.1 billion from FY2013\nNet revenues of EUR 32.0 billion were stable compared to prior year\nNoninterest expenses of EUR 27.7 billion, down 2% from 2013\nAdjusted cost base of EUR 23.8 billion, up 3% from last year\nNet income of EUR 1.7 billion; post-tax return on average active equity (RoE) in 2014 of 2.7% for the Group\nCapital and de-leveraging\nCommon Equity Tier 1 (CET1) ratio of 11.7% on a fully loaded Capital Requirements Regulation (CRR)/Capital Requirements Directive 4 (CRD4) basis at quarter end\nPhase-in CET1 ratio of 15.2%\nRisk-weighted assets (RWA) on a fully loaded CRR/CRD4 basis of EUR 394 billion, down 2% from 3Q2014\nCRD4 fully loaded leverage ratio of 3.5% (based on revised CRD4 rules), driven by EUR 81bn of exposure reduction in the quarter\nTangible Book Value per share of EUR 38.53 increased 3.1% compared to 3Q2014\nFourth quarter 2014 segment results\nCorporate Banking & Securities (CB&S) 4Q2014 IBIT was EUR 516 million, up EUR 384 million from prior year fourth quarter reflecting solid revenues, lower litigation expense and cost-to-achieve (CtA)\nPrivate & Business Clients (PBC) 4Q2014 IBIT of EUR 55 million decreased by EUR 163 million from prior year as stable revenues, and lower provision for credit losses were more than offset by EUR 330 million extraordinary charges for the reimbursement of loan processing fees\nGlobal Transaction Banking (GTB) IBIT of EUR 265 million increased by EUR 179 million compared to 4Q2013 due to revenue growth, lower provision for credit losses and specific items in the prior year quarter\nDeutsche Asset & Wealth Management (Deutsche AWM) 4Q2014 IBIT stood at EUR 365 million, up EUR 165 million compared to last year fourth quarter benefitting from a EUR 83 million partial write up of intangibles for Scudder. Net new money inflows, which continued for the fourth consecutive quarter, were EUR 10 billion\nNon-Core Operations Unit (NCOU) loss before income taxes was EUR 690 million compared to a loss of EUR 1,272 million in 4Q2013 reflecting higher revenues, lower credit losses and decreased noninterest expenses\nDeutsche Bank (XETRA: DBKGn.DE / NYSE: DB) today reported results for the full year 2014 as well as 4Q2014. Group net revenues of EUR 7.8 billion, up 19% from the prior year, with noninterest expenses 5% lower at EUR 7.2 billion. Income before income taxes was EUR 253 million in 4Q2014, compared to a loss of EUR 1,768 million in 4Q2013. This reflects the solid revenue development in the Core Bank as well as lower litigation costs.\nJürgen Fitschen and Anshu Jain, Co-Chief Executive Officers of Deutsche Bank, said: “In 2014 our pre-tax profit rose from EUR 1.5 billion to EUR 3.1 billion, and net income rose from EUR 681 million to EUR 1.7 billion. For the first time ever, each of our four core business divisions delivered more than EUR 1 billion in pre-tax profits.”\nThey continued: “In the fourth quarter of 2014, we reported a pre-tax profit of EUR 253 million versus a loss of EUR 1.8 billion a year ago and net income of EUR 441 million versus a loss of EUR 1.4 billion a year ago.\nFurther, we increased net revenues in the fourth quarter by 19% year-on-year from EUR 6.6 billion to EUR 7.8 billion largely reflecting higher revenues in Corporate Banking & Securities, where we gained further market share across Fixed Income and Corporate Finance during the year. Also in the fourth quarter, we surpassed EUR 1 trillion in assets under management in Deutsche Asset & Wealth Management.”\nThey concluded: “While we are encouraged by many of our full-year and fourth-quarter business results, we are working hard to further manage our cost base, maintain our capital strength and increase our returns to shareholders. We look forward to updating the market, and all of our stakeholders, on the next phase of our strategy in the second quarter.”\nFourth quarter 2014 Group Results (Table 1)\nAdjusted cost base (Table 2)\nGroup net revenues in 4Q2014 increased by 19%, or EUR 1.3 billion to EUR 7.8 billion compared to EUR 6.6 billion in 4Q2013.\nCB&S revenues were EUR 3.0 billion, up EUR 488 million, or 20%, versus 4Q2013. This was primarily driven by a EUR 318 million, or 20%, increase in Sales & Trading, reflecting improved results in both Debt and Equity Sales and Trading driven in part by higher volatility in the beginning of the quarter.\nPBC revenues were EUR 2.4 billion in 4Q2014, stable compared to 4Q2013 as strong revenues in Investment & Insurance Products were offset by lower Deposit revenues from ongoing margin pressure.\nGTB revenues of EUR 1.0 billion increased by EUR 68 million, or 7%, compared to the prior year period as strong volumes and a positive trend in Asia and Americas offset the challenging rate environment.\nDeutsche AWM revenues were EUR 1.2 billion, an increase of EUR 57 million, or 5%, compared to 4Q2013 mainly attributable to strong alternative business and a solid performance in Wealth Management offerings in all regions.\nNCOU revenues of EUR 161 million were up EUR 318 million versus 4Q2013 benefitting from de-risking gains.\nProvision for credit losses were EUR 369 million in 4Q2014, a decrease of EUR 356 million, or 49%, compared to last year fourth quarter. Lower provisions in NCOU reflected a well reserved and significantly de-risked book, while our Core bank benefitted from increased releases & recoveries and the absence of a single credit event seen in last year.\nNoninterest expenses amounted to EUR 7.2 billion in 4Q2014, down EUR 394 million, or 5%, compared to the same period in 2013. Compensation and benefits of EUR 3.0 billion were up EUR 310 million, or 12%, compared to 4Q2013. This primarily reflects strategic hires in Deutsche Asset & Wealth Management and in control functions. General and administrative expenses were EUR 4.0 billion, a decrease of EUR 608 million, or 13%, versus the prior year quarter.\nLower costs in 4Q2014 result from roughly EUR 1.0 billion lower litigation related expenses compared to 4Q2013. This largely reflects timing differences as a number of major litigation cases have yet to be settled. The adjusted cost base of EUR 6.0 billion increased 7% due to higher expenses for regulatory requirements and ongoing investments in our business. Offsetting effects during the quarter include savings from the OpEx program and from the sale of BHF-BANK.\nGroup income before income taxes was EUR 253 million in 4Q2014 versus a loss of EUR 1.8 billion in 4Q2013 driven by higher revenues, lower provision for credit losses as well as lower noninterest expenses.\nNet income for 4Q2014 was EUR 441 million, compared to a net loss of EUR 1.4 billion in the prior year. In the fourth quarter 2014 Deutsche Bank recorded an income tax benefit of EUR 189 million which was primarily attributable to changes in the recognition and measurement of deferred taxes.\nFull year 2014 results:\nGroup net revenues of EUR 32.0 billion in 2014 were stable compared to the prior year.\nCB&S revenues were EUR 13.7 billion, up EUR 216 million, or 2%, compared to FY2013. This was primarily attributable to higher revenues in Equity Sales & Trading as well as in Origination & Advisory, while Debt Sales & Trading revenues were stable.\nPBC revenues of EUR 9.6 billion in 2014 were up EUR 89 million, or 1%, versus the previous year. Higher revenues in Investment & Insurance Products in Private & Commercial Banking Germany were partially offset by lower Deposit revenues reflecting margin pressure from the low interest rate environment.\nGTB revenues were EUR 4.1 billion, an increase of EUR 77 million, or 2%, versus the prior year despite the challenging low interest rate environment.\nDeutsche AWM revenues excluding Abbey Life gross-up of EUR 4.4 billion were 178 million higher compared to the prior year reflecting strong alternative business and a solid performance in the Wealth Management business in all regions.\nNCOU revenues of EUR 211 million declined EUR 753 million versus FY2013 as a result of asset sales in the course of the year.\nProvision for credit losses of EUR 1.1 billion in 2014 decreased by EUR 931 million, or 45%, compared to last year. This decline was driven by to the ongoing de-risking activities of NCOU as well as a strong portfolio quality and increased releases & recoveries in the Core Bank.\nNoninterest expenses were EUR 27.7 billion, EUR 693 million, or 2%, lower than in the previous year. Compensation and benefits, which amounted to EUR 12.5 billion, were up EUR 183 million, or 1%, compared to FY2013. This primarily reflects higher fixed compensation costs to comply with regulatory requirements, mainly in CB&S, as well as strategic hires in our business and control functions.\nGeneral and administrative expenses of EUR 14.7 billion, were down EUR 472 million, or 3%, year over year benefitting from EUR 1.5 billion lower litigation costs compared to FY2013.\nThe adjusted cost base of EUR 23.8 billion was up 3% due to higher expenses from regulatory requirements and investments in the business, only partially offset by savings from the OpEx program and from assets sales in NCOU.\nGroup income before income taxes of EUR 3.1 billion in 2014 more than doubled versus last year due to significantly lower credit loss provisions as well as lower litigation costs.\nNet income in 2014 amounted to EUR 1.7 billion versus a net income of EUR 681 million in the prior year.\nIn 2014 the income tax expense was EUR 1.4 billion versus EUR 775 million in 2013. The effective tax rate of 46% was mainly impacted by non tax deductible litigation charges and income taxes of prior periods, partially offset by changes in recognition and measurement of deferred taxes. In 2013 the effective tax rate was 53%.\nCapital, Funding, and Liquidity (Table 3)\nThe bank’s fully loaded CRR/CRD4 Common Equity Tier 1 (CET1) capital ratio was 11.7% as of 31 December 2014, 20 bps up compared to 30 September 2014. Fully loaded CRR/CRD4 CET1 capital as of 31 December 2014 increased by EUR 70 million to EUR 46.1 billion compared to the end of 3Q2014. Fully loaded CRR/CRD4 risk-weighted assets (RWA) decreased by EUR 8 billion to EUR 394 billion at the end of 4Q2014.\nCapital markets issuance: Over the course of 4Q2014 the Bank issued further EUR 8 billion in the capital markets bringing the total for the year to EUR 44 billion. The average spread of our issuance over the relevant floating index (e.g. Libor) was 45bps for the full year 2014 with an average tenor of 4.8 years.\nLiquidity reserves were EUR 184 billion as of 31 December 2014, 35% of which being in cash and cash equivalents primarily held at central banks.\nTotal assets were EUR 1,718 billion as of 31 December 2014, reflecting an increase of EUR 9 billion, or 1%, versus 30 September 2014.\nAccording to revised CRR/CRD4 rules, leverage exposure was EUR 1,445 billion as of 31 December 2014, a decrease of EUR 81 billion from 30 September 2014, despite a EUR 23 billion increase from adverse FX effects.\nThe leverage ratio, on a fully loaded basis according to revised CRR/CRD4, increased to 3.5% as of 31 December 2014.\nSegment results\nCorporate Banking & Securities fourth quarter 2014 results (Table 4)\nCorporate Banking & Securities (CB&S) net revenues increased by EUR 488 million, or 20%, to EUR 3.0 billion from EUR 2.5 billion in 4Q2013. Net revenues included valuation adjustments including Credit Valuation Adjustment (CVA) relating to RWA mitigation efforts, Debt Valuation Adjustment (DVA) and Funding Valuation Adjustment (FVA) totalling a loss of EUR 19 million (4Q2013: a loss of EUR 175 million).\nDebt Sales & Trading net revenues of EUR 1.1 billion were up EUR 130 million, or 13%, versus 4Q2013. Revenues in RMBS were significantly higher, reflecting a challenging market environment in 4Q 2013. Foreign Exchange revenues increased compared to 4Q2013 due to higher client activity and increased volatility. Revenues in Credit Solutions were up compared to the prior year quarter driven by a strong performance in North America and Asia. Revenues in Rates were lower versus the same period in 2013 driven by FVA and weaker performance in Europe.\nFlow Credit and Distressed Products revenues were below 4Q2013 due to a weaker performance in North America. Revenues were in line with the prior year quarter in Global Liquidity Management and Emerging Markets. Net revenues included two valuation adjustment items totalling a loss of EUR 30 million (a CVA loss of EUR 17 million relating to RWA mitigation efforts and a FVA loss of EUR 13 million) compared to a loss of EUR 69 million in 4Q2013.\nEquity Sales & Trading recorded net revenues of EUR 728 million in 4Q2014, an increase of EUR 187 million, or 35%, compared to last year fourth quarter. Prime Finance revenues were higher compared to 4Q2013 due to increased client balances. Equity Derivatives revenues increased significantly versus the same period in 2013 reflecting strong performance across all regions, notably in Asia. Equity Trading revenues were in line with the prior year quarter.\nOrigination and Advisory net revenues of EUR 741 million in 4Q2014 were in line with 4Q2013. Revenues in Advisory were above the prior year quarter due to increased market activity and market share. Revenues in Debt Origination increased driven by strong performance in Europe. Revenues in Equity Origination were down partly due to lower fee pool.\nCB&S provision for credit losses was EUR 9 million, versus EUR 70 million in 4Q2013, attributable to decreased provisions in the Shipping portfolio.\nCB&S noninterest expenses of EUR 2.5 billion increased by EUR 158 million, or 7%, compared to 4Q2013. The increase was driven by regulatory required spend, compensation adjustments and adverse foreign exchange movements. This development offset the savings from OpEx and lower litigation costs.\nCB&S income before income taxes of EUR 516 million was up EUR 384 million compared to last year fourth quarter reflecting solid revenues, lower litigation and cost-to-achieve (CtA) spending.\nPrivate & Business Clients fourth quarter 2014 results (Table 5)\nPrivate & Business Clients (PBC) net revenues were EUR 2.4 billion in 4Q2014, stable compared to 4Q2013 in an ongoing low interest rate environment. Loan volume growth continued, especially in German mortgages, however credit revenues declined by EUR 11 million, or 1%, compared to last year fourth quarter partly reflecting foregone loan processing fees.\nNet revenues from Deposit products decreased by EUR 22 million, or 3%, compared to 4Q2013 driven by the ongoing low interest rate environment. Revenues from Investment & Insurance Products were up by EUR 15 million, or 5%, reflecting strong asset inflows as well as higher levels of client transactions compared to 4Q2013.\nRevenues from Payments, Cards & Accounts decreased by EUR 14 million, or 6%, compared to the prior year period as increased regulation put further pressure on payment and cards fees.\nNet revenues from Postal and supplementary Postbank Services were down by EUR 6 million, or 5%, compared to 4Q2013. Other Revenues increased by EUR 49 million in 4Q2014 compared to the prior year period, partially driven by an improved performance of the Hua Xia Bank equity investment.\nPBC provision for credit losses declined by EUR 56 million, or 23%, compared to last year fourth quarter benefitting from the benign economic environment in Germany and the good quality of the loan book.\nPBC noninterest expenses increased by EUR 230 million, or 12%, to EUR 2.2 billion, compared to 4Q2013. The increase includes EUR 330 million charges related to loan processing fees following a German Federal Court ruling in late October 2014. Appropriate provisions for loan processing fees were created in 2014. On this basis, no further impact is expected in 2015 and beyond. Apart from those non-recurring charges, PBC continues to realize incremental savings from efficiency measures as part of our OpEx program.\nPBC income before income taxes was EUR 55 million, 75% lower compared to 4Q2013. The decrease is primarily attributable to EUR 330 million charges related to loan processing fees following the above mentioned change in German legal practice.\nInvested assets increased by EUR 2 billion compared to 30 September 2014 mainly due to net inflows and market appreciation.\nGlobal Transaction Banking fourth quarter 2014 results (Table 6)\nGlobal Transaction Banking (GTB) net revenues of EUR 1.0 billion increased by EUR 69 million, or 7%, compared to 4Q2013, despite the impact of the ongoing challenging market environment. Revenues in Trade Finance benefitted from strong volumes and stabilizing margins, especially in Asia. In Securities Services, revenue increase was driven by the growth in volumes. Cash Management revenues were negatively impacted by the ongoing low interest rate environment.\nGTB provision for credit losses of EUR 42 million in 4Q2014 declined by EUR 44 million compared to 4Q2013 which included a single client credit event in Trade Finance.\nGTB noninterest expenses of EUR 738 million decreased by EUR 67 million, or 8%, compared to 4Q2013. The decrease was primarily driven by lower costs related to the execution of the Strategy 2015+ in this year fourth quarter, i.e. lower OpEx related investments and impairments. This was partly offset by increased revenue-related expenses.\nGTB income before income taxes of EUR 265 million increased by EUR 179 million compared to 4Q2013\nDeutsche Asset & Wealth Management 4Q2014 results (Table 7)\nDeutsche Asset & Wealth Management (Deutsche AWM) net revenues in 4Q2014 increased by EUR 57 million, or 5%, to EUR 1.2 billion compared to 4Q2013. Management fees and other recurring revenues rose by EUR 71 million, or 12%, due to higher average assets under management reflecting positive asset flows and foreign currency effects.\nPerformance and transaction fees and other non-recurring revenues decreased by EUR 31 million, or 12%, driven by lower performance fees within Asset Management and lower transactional volumes from capital markets and foreign exchange products for private clients.\nNet interest income increased by EUR 22 million, or 15%, reflecting increased lending volumes and the recovery of loan interest relating to prior periods. Other product revenues were up EUR 24 million, or 53%, compared to 4Q2013, mainly due to increased alternative revenues.\nMark-to-market movements on policyholder positions in Abbey Life declined by EUR 30 million, or 27%, versus 4Q2013.\nDuring 2014, changes in fee structures for certain funds resulted in a shift of revenues to management fees from performance fees, resulting in higher recurring revenues.\nDeutsche AWM noninterest expenses of EUR 874 million were down EUR 102 million, or 10%, compared to the prior year. Adjusted for cost-to-achieve, litigation, policyholder benefits and claims as well as write-up for Scudder, costs increased as savings from the OpEx program were offset by strategic hiring and one-off effects in compensation relating to CRD4 and pension costs.\nDeutsche AWM income before income taxes increased by EUR 165 million, or 82%, in 4Q2014 to EUR 365 million compared to last year fourth quarter.\nInvested assets were EUR 1,039 billion as of 31 December 2014, an increase of EUR 33 billion versus 30 September 2014. Net inflows of EUR 10 billion were evenly spread across our Passive, Wealth Management, Active and Alternative businesses, as well as across our clients and regions.\nNon-Core Operations Unit fourth quarter 2014 results (Table 8)\nNon-Core Operations Unit (NCOU) net revenues of EUR 161 million in 4Q2014 increased by EUR 318 million compared to 4Q2013 as revenues in the prior year period included EUR 183 million losses related to the sale of BHF-BANK and a EUR 171 million negative effect from the first-time application of Funding Valuation Adjustment (FVA), partially offset by lower portfolio revenues.\nNCOU provision for credit losses of EUR 131 million in 4Q2014 were down EUR 188 million compared to 4Q2013 driven by lower provisions associated with European Commercial Real Estate exposures.\nNCOU noninterest expenses decreased by EUR 77 million, or 10%, compared to the previous year. The decrease versus 4Q2013 is predominately driven by lower litigation costs and the sale of BHF-BANK. This was offset by an EUR 194 million impairment for Maher Terminals in the quarter.\nNCOU loss before income taxes of EUR 690 million was EUR 582 million lower compared to the same quarter in 2013, primarily driven by the movements and impacts described above.\nConsolidation & Adjustments – Fourth quarter 2014 results (Table 9)\nConsolidation & Adjustments (C&A) loss before income taxes was EUR 258 million in 4Q2014, compared to a loss of EUR 1.1 billion in the prior year quarter. The decrease in losses compared to 4Q2013 was predominantly attributable to the lower litigation charges and Funding Valuation Adjustment (FVA) losses. This positive effect was partially offset by higher bank levies.\nThese figures are preliminary and unaudited. The Annual Report 2014 and Form 20-F are scheduled to be published on 24 March 2015.\n  Today at 10:00 a.m. CET a conference call for journalists will take place, on which we will discuss the results.\nWe also offer a webcast (listen only): www.db.com/media\nShortly before the conference call you will find the relevant presentation on: www.db.com/media.\nDisclaimer:\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank.\nForward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 20 March 2014 under the heading “Risk Factors.”\nCopies of this document are readily available upon request or can be downloaded from www.db.com/ir.\nThis release contains non-IFRS financial measures.\nFor a reconciliation to directly comparable figures reported under IFRS, to the extent such reconciliation is not provided in this release, refer to the 4Q2014 Financial Data Supplement, which is available at www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 3
}