{
    "url": "https://www.db.com/news/detail/20150127-deutsche-bank-named-bank-risk-manager-of-the-year-2015-by-risk-magazine?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 27, 2015",
    "tags": [
        "Awards",
        "Company"
    ],
    "title": "Deutsche Bank named Bank Risk Manager of the Year 2015 by Risk magazine",
    "body": "Risk magazine has recognised Deutsche Bank as Bank Risk Manager of the Year 2015 – the second consecutive year the Bank has won the prominent accolade and the third time in five years.\nRisk, a trade publication whose awards are a benchmark for the risk management industry, selects the award following widespread feedback from the banking sector.\nDeutsche Bank was recognised for its rapid de-risking during a period of significant market volatility in October 2014.\n“It is not only the sheer volume of positions that were taken off that appears remarkable, but also the speed with which the de-risking was achieved,” Risk said.\nThrough close collaboration, the Bank was able “to quickly establish a consensus, and then to materially change its risk profile,” Risk said. “That should be reassuring to senior management, investors and supervisors, and is ultimately what risk management is all about.”\nThe Bank received two additional accolades at the Risk Awards 2015: Interest Rate Derivatives House of the Year and Single-Dealer Platform of the Year.\nExplaining its choice for Interest Rate Derivatives House of the Year, Risk praised Deutsche Bank’s efforts to become “as efficient as possible” and for embracing electronic trading “creating the flexibility to engage in more lucrative trades.”\nThe Single-Dealer Platform of the Year award recognised the continued success of Autobahn, the Bank’s electronic service offering. Since its 1996 launch, Autobahn “has grown to encompass a huge suite of FX, fixed income and interest rate products”, Risk said, with 25,000 users in 2014.\nThe Risk accolades follow a number of successes for Deutsche Bank in last month’s IFR awards, where it won five categories including Structured Finance House of the Year.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}