{
    "url": "https://www.db.com/news/detail/20150113-deutsche-bank-s-2015-solar-outlook-accelerating-investment-and-cost-competitiveness?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 13, 2015",
    "tags": [
        "Sustainability"
    ],
    "title": "Deutsche Bank's 2015 solar outlook",
    "body": "We believe the recent volatility in solar stocks, driven largely by oil price weakness, presents an attractive entry point for investors as we expect 2015 to be a year of stable industry pricing and accelerating volume growth.\nWe expect a balanced supply demand outlook as strong demand from the US and improving demand from China/other emerging solar markets offsets any potential demand weakness in the UK/Japan. While weak oil prices could remain an overhang, our work suggests very little impact on solar demand fundamentals and expects several company specific positive catalysts in terms of execution of new/existing yieldcos.\nQ4 earnings season/Q1 seasonality & Fundamentals\n\nWhile solar stocks gave up nearly all of the outperformance during Q4'14, mostly due to declining oil prices, we believe Q4 earnings of most companies would generally be inline/ahead of expectations. China demand in 2014 could turn out to be 9-10GW vs expectations of 13GW, but we believe strong demand from markets such as UK/Japan would likely cover up any shortfall in China demand.\nWe also expect companies to talk about incremental progress in the permitting and payment process in China and believe a number of companies could get closer to launching yieldcos of international assets during 1H15 timeframe. While normal seasonality could likely impact China demand in 1H15, we expect UK/Japan to act as primary drivers for strong 1H volumes/margins. Consensus estimates have generally come down and we believe Q1 guidance from most companies would be more or less in line with expectations.\nWe expect other company specific catalysts such as announcements of yieldcos/project sales along with acquisition of new project pipelines to act as important catalysts for solar stocks over the next 3 months. Q1 seasonality typically affects module pricing, but we expect strong demand from higher priced markets such as the UK and Japan to drive pricing and margin improvement in Q1. We also see limited supply growth in the near term and as such expect relatively stable pricing environment.",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 6
}