{
    "url": "https://www.db.com/news/detail/20230130-johanes-oeni-appointed-head-of-the-international-private-bank-in-south-east-asia?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Singapore, January 30, 2023",
    "tags": [
        "Asia-Pacific",
        "Personnel announcements",
        "Wealth"
    ],
    "title": "Johanes Oeni appointed Head of the International Private Bank in South-East Asia",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today announced the appointment of Johanes Oeni as a Managing Director and Head of the International Private Bank (IPB) in South-East Asia (SEA). Based in Singapore, Oeni will join Deutsche Bank in April 2023 and report to Jin-Yee Young, Head of IPB Asia Pacific. He will also join the IPB Asia Pacific Executive Committee.\nJin-Yee Young said, “We are delighted to welcome Johanes to Deutsche Bank to lead our Wealth Management business in South-East Asia. Throughout his career, Johanes has demonstrated a successful track record in managing, leading, growing and nurturing teams of Relationship Managers and wealth management specialists. He has a detailed understanding of the needs of sophisticated clients in the region, and his deep market insights will accelerate the growth of our footprint in Asia Pacific.”\nHead of the IPB and CEO EMEA Claudio de Sanctis said, “We have strong ambitions to grow in Asia Pacific this year as we strive to become the leading financial institution for entrepreneurs and their families.  I warmly welcome Johanes to Deutsche Bank to help us further this ambition and wish him every success.”\nOeni will focus on further expanding the IPB’s SEA business by growing coverage of Ultra-High-Net-Worth (UHNW) individuals, entrepreneurs and their families. He will leverage the bank’s fully integrated advisory platform to provide clients with innovative WM solutions, focusing on wealth preservation and succession planning for UHNWs, while utilising the full Deutsche Bank’s product suite across WM, the investment bank and the corporate bank for entrepreneurs and their companies.\nOeni joins Deutsche Bank with over 31 years of WM experience, most recently at Credit Suisse where he led the WM business in Indonesia and Malaysia. Prior to that, he spent seven years at JP Morgan and three years at Banque Indosuez. He graduated from Arizona State University, USA and holds a Master of International Management degree from Thunderbird School of Global Management, USA, with specialization in International Studies and Finance.",
    "number_of_ratings": 4,
    "rating": 4.0,
    "likes": 4
}