{
    "url": "https://www.db.com/news/detail/20230127-sixteen-objects-seventy-years-of-yad-vashem?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 27, 2023",
    "tags": [
        "Europe",
        "Corporate Citizenship",
        "History"
    ],
    "title": "Sixteen Objects – Seventy Years of Yad Vashem",
    "body": "They are objects of the heart from the abyss of the Shoah: 16 objects that were once torn away from Germany together with their owners. \"Sixteen Objects – Seventy Years of Yad Vashem\" is the name of an exhibition which opened on Tuesday in the Paul-Löbe-Haus in the German Bundestag in Berlin.\nIt includes items like \"Inge\", a doll that belonged to Lore Mayerfeld (née Stern). As a little girl, Lore was forced to flee her native town of Kassel to escape the Nazis and took Inge, a gift from her grandmother, with her. In 1941, Lore and her mother managed to escape to the US via Portugal on the last ship. Lore later dressed her doll in the pyjamas she was wearing herself on the night of the pogrom in November 1938.\nLore has lived in Israel since 1991 and is one of the few surviving eyewitnesses to the Holocaust. This makes it all the more important that we constantly remember this crime, including on January 27, 2023 the Day of Remembrance for the Victims of National Socialism.\nChristian Sewing met Lore Mayerfeld on Monday at the Paul-Löbe-Haus. Together with her, he visited the exhibition one day before the official opening.\nReflecting on his visit, Sewing said: “We must and will never forget the injustice committed in Germany. That is why Deutsche Bank supports Yad Vashem’s hugely important work to keep the memory of the Holocaust alive. The fate of millions of victims reminds us to actively stand up for diversity and tolerance in our own lives and surroundings every day.\"\nDeutsche Bank has been supporting the expansion of the Yad Vashem International Holocaust Memorial in Jerusalem since 2019. The 16 objects now on display in Germany will find a permanent home in Yad Vashem’s new \"House of Memories.\" Together with Deutsche Bahn, Borussia Dortmund, Mercedes-Benz and Volkswagen, Deutsche Bank is promoting a culture of remembrance as a member of the Friends of Yad Vashem.\nBundestag President Bärbel Bas opened the \"Sixteen Objects” exhibition with 300 guests including Dani Dayan, Chairman of the International Holocaust Memorial; Ron Prosor, the Israeli Ambassador to Germany; German Finance Minister Christian Lindner and Kai Diekmann, Chairman of the Friends of Yad Vashem. Harald Eisenach, Head of Corporate Bank Eastern region, attended the opening on behalf of Deutsche Bank.\nThe first visitors experienced the touching collection of simple everyday objects that accompanied the victims of the Shoah on their journeys of escape and suffering. The objects not only tell a very tangible life story, described in the exhibition, they also stand for the countless lives that were destroyed by National Socialism.\nThe curators have deliberately chosen one memento from each of Germany’s 16 Federal states. So alongside \"Inge\", the doll from Kassel, there is a mini kitchen from Stuttgart, a poetry album from Saarbrücken and the Hanukkah menorah saved by a family from Kiel. And even seemingly mundane objects, such as a Berlin doctor’s stethoscope or a lady from Bremen’s suitcase, tell of the inhuman fate of their original owners. Further information about the exhibition is\nPDF\navailable as a PDF.\nThose who wish to visit the exhibition in the restricted area of the Paul-Löbe-Haus in Berlin must register in advance. More information is available in German on the website of the German Bundestag. However, those interested do not necessarily have to travel to Berlin: after its first stop in the capital, \"Sixteen Objects – Seventy Years of Yad Vashem\" will also be on display at the Zollverein Foundation in Essen from March 5 to April 10.\nThis exhibition is also special because it marks the first time the International Holocaust Memorial has loaned artifacts from its collection to Germany – the country which tore open the abyss to the Shoah. ",
    "number_of_ratings": 8,
    "rating": 3.5,
    "likes": 6
}