{
    "url": "https://www.db.com/news/detail/20230119-investing-in-the-year-of-the-rabbit?language_id=1",
    "language": "EN",
    "article_type": "News Research",
    "publish_date": "Singapore, January 19, 2023",
    "tags": [
        "Asia-Pacific",
        "Research"
    ],
    "title": "Investing in the Year of the Rabbit",
    "body": "After a volatile 2022, Deutsche Bank’s Asia Pacific Head of Research Sameer Goel suggests that investors need the traits of the rabbit - calmness and patience along with agility to navigate this year of transition. Goel discusses investing in the year of the rabbit in our latest “150 seconds on APAC” video.\nYou can also read the full transcript of the video here: \nQ. How should investors approach the Year of the Rabbit?\nThere is a Chinese proverb, “he who rides a tiger is afraid to dismount”. Indeed, for most of last year, which was the year of the tiger, the world economy found itself riding 3 tigers – inflation driving the fastest pace of policy tightening in decades, geopolitics driving record high energy and commodity prices, and the rising costs from China’s Zero Covid strategy. There are significant shifts underway in all of these narratives as we head into Year of the Rabbit. We think 2023 will be a year of transition towards more normalcy after the bust and boom pattern of the last few years. For Asia and emerging markets, we put our faith in three things – greater visibility on the peak of the inflation and rates cycle, positive tailwinds from the reopening in China, and better appetite for emerging markets assets after the struggles of the last few years.\nA rabbit’s personality symbolises hope, peace and calm, but also underlying confidence and strength. After the volatility of the year gone by, we will need those traits of calmness and patience, along with agility in navigating this year of transition. \nSameer Goel\nQ. How important is China reopening for Asia?\nThis is the year the region re-opens more unequivocally for business, and the policy pivots in China are a key part of the same – not just around unwinding the Zero Covid strategy, but also on easing restrictions on property developers, and possibly a more robust fiscal support for the economy. With China’s growth rate potentially doubling in 2023 from last year, we should see strong spill overs into rest of Asia via higher demand for consumer goods, for tourism services and for investment goods. This could add to some demand side pressures, but we think China’s re-opening and resulting positive impact to supply will overall be net beneficial for Asia, more so than to other emerging market economies, and the developed world.\nQ. What should investors watch out for in terms of risks?\nThe two key risks to watch for are, one, that inflation, and maybe more importantly, inflation expectations, end up being a lot more stubborn, and two, that geopolitics in an increasingly bipolar world causes structural risk premium to go up. Demand and growth driven inflation is still manageable for Asia, but geopolitics and supply driven price pressures could still create significant volatility in the year ahead.",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 4
}