{
    "url": "https://www.db.com/news/detail/20230118-deutsche-bank-raises-1-billion-yuan-via-first-panda-bond?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "January 18, 2023",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank raises 1 billion yuan via first Panda Bond",
    "body": "Deutsche Bank announced today that it has issued its inaugural Panda bond, raising CNY 1 billion via 3-year senior preferred notes. This transaction enables the bank to directly tap into China’s deep onshore bond market, accessing a new investor base at attractive funding levels. \nThe proceeds of this transaction will be used for general group funding purposes. The deal marks the first Panda bond following recent regulatory changes by the People’s Bank of China and State Administration of Foreign Exchange to facilitate foreign remittance of Panda bond proceeds.\nDeutsche Bank Asia Pacific Chief Executive Officer and Member of the Management Board Alexander von zur Muehlen said, “China’s onshore bond market is the second largest in the world. Increased international investor and issuer activity is an important step in China’s capital market opening, and global financial system integration. Deutsche Bank is proud to play a driving role in broadening international participation in this important market.”\nDeutsche Bank is a leading institution in China’s debt capital markets, as one of only two foreign banks to hold a full lead underwriting (“Type A”) license. The bank is also consistently recognised as one of the most active foreign banks in the Bond Connect program and has previously issued Dim Sum bonds via the South Bound Bond Connect (SBBC). The bank is fully committed to contributing to RMB internationalisation through its active participation in both onshore and offshore markets.\nDeutsche Bank China Chief Country Officer and Chairwoman Rose Zhu said, “Deutsche Bank’s Panda bond issuance has demonstrated the value of accessing the onshore market for international issuers. China has continued to improve its regulatory framework for Panda bonds, and the market is a key focus for our franchise. Deutsche Bank China is one of the few fully licensed foreign DCM banks in the market, and we have always been one of the most active players in onshore and offshore RMB bond and derivative markets.”\nTypically denominated in Chinese Yuan (CNY), panda bonds can be a useful way for foreign entities to gain access to the Chinese market and to diversify their funding sources.",
    "number_of_ratings": 7,
    "rating": 3.1,
    "likes": 6
}