{
    "url": "https://www.db.com/news/detail/20230117-argentinian-la-chola-poblete-is-deutsche-bank-s-artist-of-the-year-2023?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, January 17, 2023",
    "tags": [
        "Art"
    ],
    "title": "Argentinian La Chola Poblete is Deutsche Bank's “Artist of the Year” 2023",
    "body": "La Chola Poblete has been named Deutsche Bank's “Artist of the Year” for 2023. Born in 1989 in Mendoza (Argentina), she is the fourteenth artist honored by the bank. The Argentinian critically examines the consequences of colonialism and white supremacy in her home country. In paintings, watercolors, sculptures, and performances, she reflects on her indigenous and queer roots and opposes the stereotyping and exoticization of indigenous peoples. As part of the award, La Chola Poblete will present her first solo exhibition in Europe at Berlin’s PalaisPopulaire in the fall of 2023.\n\"Argentina has an enormously rich and diverse art scene that is not well known in Europe yet. Executing bold works on paper that are critical of the times, La Chola Poblete is one of the country’s most important living artists. In doing so, she forges completely new paths in terms of both form and content. The focus is on coming to terms with the repressive structures and suffering brought about by the colonial era,” says Anna Herrhausen, Head of Deutsche Bank’s Art and Culture unit. \nThe “Artist of the Year” award is given to contemporary artists who have created an artistically and socially relevant body of work that encompasses the media of paper and photography, the two focal points of the Deutsche Bank Collection. Many of them, including Wangechi Mutu, Yto Barrada, Maxwell Alexandre, Conny Maier, and LuYang, are among the most important contemporary artists working today.\nLa Chola Poblete creates independent hybrid forms and an artistic beauty that defies cultural and racial stereotypes. Her works often move between drawing and painting. Her delicate, masterfully composed watercolors combine the symbolism and mythology of South American peoples with her own reflections on sexuality, religion, politics, ecology, and history. Poblete is part of the queer artist collective Comparsa Drag. With the help of her alter ego La Chola, she constructs a hybrid cultural and sexual identity in performative actions.\nIn Argentina in 2022, the Museo de Arte Moderno de Buenos Aires dedicated an important exhibition to her titled Ejercicios del llanto (Exercises in Weeping). The show was curated by Victoria Noorthoorn, the museum’s director, who, along with Hou Hanru and Udo Kittelmann, is a member of Deutsche Bank’s Global Art Advisory Council, which proposed Pobletes as “Artist of the Year” 2023. \nLa Chola Poblete has been shown in numerous solo and group exhibitions in Latin America and Europe, including Throat, Centro Internacional Das Artes Jose de Guimaraes, Portugal (2022); Verdes Bovedas Limosas, La Calor, Madrid (2022); Heretic fork, Pasto, Buenos Aires (2021); 34 Argentine Artists, Museo Moderno de Buenos Aires (2021); El órgano masculino de la Chola, MAC, Córdoba (2019); SLAVE, Carlos Alonso Museum. Mendoza (2019), Exercises to carry absences, A la Cal, Santa Fe, (2018).\nMedia photos can be found at: www.photo-files.de/db-palaispopulaire.\n ",
    "number_of_ratings": 6,
    "rating": 3.3,
    "likes": 8
}