{
    "url": "https://www.db.com/news/detail/20180726-deutsche-bank-accelerates-account-openings-introduction-of-a-digital-signature?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "July 26, 2018",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "Deutsche Bank accelerates account openings: introduction of a digital signature",
    "body": "Deutsche Bank accelerates account openings for its corporate and institutional clients by introducing a digital signature. Digitising account openings and document signings will significantly reduce costs and processing times and will increase the efficiency in the contractual process handling for both clients and Deutsche Bank alike.\nDocument and contract signing remains one of the most important and frequent processes between banks and its clients and until today involves a high degree of manual processing. Leveraging DocuSign, an industry-recognised solution for its digital signature, the bank further accelerates its client onboarding processes. The bank has piloted the solution with US-based Honeywell, one of its large corporate clients.\n“In an increasingly digital working environment, we are always looking to our banking partners to help us enhance efficiencies and further digitise processes”, says Marie-Astrid Dubois from Honeywell. “Deutsche Bank’s new digital signature solution is a good example of how banks can introduce new technology to enhance existing banking partnerships. This solution is a nice and obvious fix to the otherwise cumbersome collection of wet signatures.”\n“Digital signatures enable us to accelerate the entire client onboarding and contract management process. This is just one example of how we further streamline our processes to create an improved and highly intuitive customer experience”. says Martin Runow, Global Head of Client Connectivity Products, Global Transaction Banking, Deutsche Bank AG.\nClients can use the digital signature to open accounts, sign documents and buy products from the bank. The digital signature solution is available to many corporate and institutional clients in the US, the UK, Germany, Belgium and the Netherlands. Deutsche Bank clients in Asia-Pacific and Middle East will be able to profit from the digital solution in 2019. US based Honeywell was the first Deutsche Bank client to pilot the solution.\n  About Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}