{
    "url": "https://www.db.com/news/detail/20180723-she-hacks-wins-deutsche-bank-s-largest-ever-hackathon?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "July 23, 2018",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "'She Hacks!' wins Deutsche Bank's largest ever Hackathon",
    "body": "Being diagnosed with cancer is a shock that hits you hard. It’s also a time when you are desperately seeking information, support and inspiration from those fighting the same battles.\nThis was the inspiration behind the bank’s third 24-hour Hackathon. In support of Cure Leukaemia, one of the bank’s UK Charities of the Year, over 800 volunteers from across the bank’s technical staff competed around the clock to design and develop prototypes of a mobile app to support Leukaemia patients.\n‘She Hacks!’ an all-female winning team based in London, developed a prototype called Sanguine, derived from the Latin for blood - and also a term for being positive. Using a friendly interface and clever programming, the app suggests “buddies” with similar diagnoses, age and gender. It also curates articles from trusted sources and keeps track of a patient’s well-being and key statistics. Patients can choose to share this information with friends, family, buddies or doctors, as well as fetch blood test results and report their daily progress.\n\nThe She Hacks! team with Paul Shepheard, Group CIO, and James Mclaughlin Cure Leukaemia CEO\nCommenting on their victory, She Hacks! said: “It was a lot of fun to pull together across a diverse range of technical perspectives and seniorities to produce a prototype solution that focussed on the needs of leukaemia patients, their families and carers. We all worked on something new in terms of technologies or platforms, splitting our responsibilities across design, user interface, backend, release and even automated testing.\n“As an all-female team with a range of technical backgrounds, everyone in the team had an important part to play.”\nOpening the event on 19 July at 13:00 CET, Frank Kuhnke, Group Chief Operating Officer, said. \"Events like this reflect the bank’s ambition to be a tech-led company and to be innovative. Cure Leukaemia is a brilliant cause and I hope the teams have fun and build contacts that last above and beyond the Hackathon.”\nCurrent and former leukaemia patients joined the Hackathon in London, sharing their experiences and offering the teams a unique sounding board for ideas about how to develop the app. Brooke Evans, who was diagnosed with Leukaemia at 18 and is now in remission, said: “I know only too well how much it means to have someone to talk to and all the mountains of lengthy but useful information you are given. I’m so glad I had the chance to share my story and hopefully make a difference to more patients by being that success story and giving people hope.”\nThe global event saw multidisciplinary teams take part in the UK, India, Romania, Germany, Hong Kong, US, Russia and Singapore. In London, each of the teams was joined by young women from the bank’s Student to STEMette (Science, Technology, Engineering or Maths) programme and engineering students from the Arkwright Scholarship Trust.\nA panel of judges from across the bank evaluated the prototypes based on four categories. A winning team from each country was shortlisted and a winner chosen in each category.\nCategories  Winning Teams\nBest User Experience: She Hacks! (London)\nMost Innovative Concept: Deep Blue (Jacksonville)\nBest Application Name: Overengineers (Eschborn) ‘CURENECT’, derived from CURE+CONNECT\nBest Overall Application:\nShe Hacks! (London)\nShivering Singletons (Bucharest)\nOverengineers (Frankfurt)\nAside from winning the admiration of their colleagues, the winning teams will get to see their ideas, designs and code used to help produce the final design and resulting app.\nThe event was promoted and shared widely on social media with hundreds of tweets and LinkedIn, Facebook and Instagram posts, including celebrity endorsements, from Gary Lineker (former UK soccer player) to Mark Hamill (Luke Skywalker in Star Wars).\nThe Hackathon follows the recent Design Swarms Workshop in Berlin for Rays of Sunshine, Deutsche Bank UK’s other Charity of the Year. Both events showcase the bank’s technical talent, collaborative spirit, innovation and societal impact across its global teams.\nWinning team members - She Hacks: Neha Thakur, Jovita Pereira, Dilara Okci, Natalie Spooner, Pippa Newbold, Emma Wansbrough, Milena Georgieva, Tia Nasir (STEMette), Kiara Takeuchi (Arkwright Scholar), Shijun Zeng (Graduate)\nMore information about the winning application, how the Hackathon was put together and the technology behind it will follow over the coming weeks.\nUK Charities of the Year\nCure Leukaemia is one of Deutsche Bank’s UK Charities of the Year. This is a two year partnership with two small charities that have been nominated and voted for by UK employees. The programme has raised more than 20 million pounds since being established in 1999 and also links charities with other parts of the bank, for example HR, Finance, Public Affairs and Marketing, to lend wider expertise",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}