{
    "url": "https://www.db.com/news/detail/20180718-deutsche-bank-named-best-investment-bank-in-india-by-euromoney?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 18, 2018",
    "tags": [
        "Awards",
        "Capital markets",
        "Company",
        "Investment Banking"
    ],
    "title": "Deutsche Bank named Best Investment Bank in India by Euromoney",
    "body": "Deutsche Bank’s prowess in delivering the most complex financing transactions for clients in India was recognised by Euromoney which named the bank India’s Best Investment Bank in its 2018 Awards for Excellence.\nIn a year of unprecedented volatility in Indian capital markets, Deutsche Bank continued to demonstrate leadership across all debt products – US dollar high-yield notes, US dollar loans, Indian rupee bonds and structured financings.\nThe Debt Capital Markets team led more than 70 percent of the country’s high-yield bond issuance during the financial year ending March 2018, including all public issuances for major Indian corporates JSW Group, Motherson Group and Greenko Group.\nThe bank also pioneered India’s first distressed debt financing for a large corporate – a deal which helped the client resume operations within two months and one that has become a benchmark for the industry.\nThis award is testament to the expertise of our Corporate & Investment Bank in delivering on complex and ground-breaking solutions for our clients; our deep understanding of the India landscape and the very strong client relationships we have built over the years.\nRavneet Gill, CEO, Deutsche Bank India\nDeutsche Bank also led sponsor-backed and corporate real-estate lending deals in spite of the prevailing low credit ratings of the sector, providing an alternate funding avenue for real estate companies in India. One such transaction was the 6 billion Indian rupee restructuring for the IREO Group.\nA string of landmark ECM deals included book-running India’s largest ever Qualified Institutional Placement which helped State Bank of India raise 2.3 billion US dollars; India’s largest IPO since 2010 for General Insurance Corporation in India which raised 1.7 billion US dollars and SBI Life Insurance Company’s 1.3 billion US dollar IPO.\nThe bank also executed a number of high profile M&A transactions including the sale of Reliance Infrastructure’s Mumbai power generation transmission and distribution business in December 2017 and DP World’s acquisition of a controlling stake in Continental Warehousing Group.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}