{
    "url": "https://www.db.com/news/detail/20180716-deutsche-bank-announces-above-consensus-preliminary-results-for-the-second-quarter-of-2018?language_id=1",
    "language": "EN",
    "article_type": "Ad-hoc Release",
    "publish_date": "July 16, 2018",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank announces above consensus preliminary results for the second quarter of 2018",
    "body": "Frankfurt am Main, July 16, 2018.10.25 CET — Deutsche Bank (XETRA: DBKGn.DE/NYSE: DB) expects to report income before income taxes (IBIT) of approximately 700 million euros and net income of approximately 400 million euros for the second quarter of 2018. For the first half of 2018, Deutsche Bank expects to report IBIT of approximately 1.15 billion euros. Management believes that these results demonstrate the resilience of the franchise.\nThe results are considerably above the average consensus estimate, as compiled by Deutsche Bank and published on July 11, 2018, triggering an ad hoc announcement in line with BaFin guidelines. The published average of analysts’ estimates is IBIT of 321 million euros and net income of 159 million euros.\nIn the second quarter, group revenues are expected to be approximately 6.6 billion euros, compared to an average consensus estimate of 6.4 billion euros. Group revenues include approximately 3.5 billion euros of revenues in the Corporate & Investment Bank (CIB). Within CIB, revenues include approximately 100 million euros from a gain on an asset sale and debt valuation adjustments reflecting a widening of Deutsche Bank’s credit spreads during the quarter. Compared to the prior year quarter, reported Sales & Trading revenues are expected to decline by approximately 15%, while Origination & Advisory revenues are expected to increase by 2%.\nGroup noninterest expenses are expected to be approximately 5.8 billion euros, compared to a consensus estimate of 6.0 billion euros. Noninterest expenses are expected to include restructuring and severance charges of approximately 0.2 billion euros and a small release of litigation provisions. Restructuring actions have progressed rapidly in the second quarter with headcount down by approximately 1,700 full-time equivalents to slightly above 95,400.\nPreliminary estimates of the group’s capital ratios as of June 30, 2018 are also higher than consensus expectations. The Common Equity Tier 1 capital ratio is expected to be approximately 13.6%, compared to the average consensus estimate of 13.3%. The fully loaded leverage ratio is forecast to be approximately 3.9%, compared to a 3.7% average consensus expectation.\nAll these amounts are preliminary. Full details of the second quarter results will be disclosed as planned on July 25, 2018.\n\nContact:\nMonika Schaller\nGlobal Head External Communications\nPhone: +49 69 910 48098\ne-mail: monika.schaller@db.com\n_________________________________________________________________\nDeutsche Bank AG\nTaunusanlage 12\n60325 Frankfurt am Main\nGermany\nISIN: DE0005140008\nWKN: 514000\n\nListed: Regulated market in Berlin-Bremen, Duesseldorf, Frankfurt (Prime Standard), Hamburg, Hanover, Munich und Stuttgart; EUREX; NYSE\nThe International Securities Identification Numbers (ISINs) of further financial instruments issued by Deutsche Bank AG, and admitted to trading on a domestic organized market or for which such admission has been applied for, are listed in the attached PDFs.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}