{
    "url": "https://www.db.com/news/detail/20180712-deutsche-bank-china-obtains-bond-underwriting-license-in-china-s-inter-bank-bond-market?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "July 12, 2018",
    "tags": [
        "Capital markets",
        "Company",
        "Corporate products",
        "Investment Banking",
        "Strategy"
    ],
    "title": "Deutsche Bank China obtains bond underwriting license in China's Inter-Bank Bond Market",
    "body": "The approval enables the bank to underwrite debt financing instruments for both onshore and offshore issuers. The bank is already licensed in China as a market maker on CIBM and China Bond Connect, and as a bond settlement agent.\n“We are very pleased to have been granted this bond underwriting license, which cements our status as one of only a select handful of full-service foreign banks in China,” said Werner Steinmueller, Deutsche Bank Asia Pacific CEO. “The ability to help offshore and onshore clients issue primary debt in China provides an important additional facet to our full suite of capabilities in the world’s third largest fixed income market. We remain committed to our pioneering platform in China, and intend to keep building on our offering for clients in this critical market.”\nAccording to financial information service provider Wind, as of the end of June 2018, CIBM reached a combined size of over CNY 78.7trn (EUR 11trn), with a net new issuance volume of RMB 4.1 trillion (EUR 525bn) in the first six months of this year of which 10% went to foreign investors. Deutsche Bank expects RMB bond investment flows to reach CNY 4.6 – 5.3 trillion (EUR 600-680 billion) over the next five years, including CNY 700bn (EUR 90bn) in 2018.\nThe so-called Panda bond market is becoming increasingly important for international corporate clients looking to tap the onshore market for funding their domestic business. The People’s Bank of China published new cross-border financing rules last year which make it easier to use funds raised via Panda bonds for financing onshore operations, while also allowing proceeds to be remitted outside the country.\nAs one of the world’s leading Fixed Income and Currencies players, Deutsche Bank has played a significant role in the continued opening-up of China’s capital markets, and is committed to contributing to the market’s continued development. As of end of May 2017, Deutsche Bank was among the top three foreign settlement agents in CIBM by both number of clients and total client depository balance*.\n*NAFMII data, end of May 2017.\nMedia contacts Deutsche Bank AG:\nBeijing\nGrace Zhang\nTel: +86 10 5969 8617\nEmail: grace.zhang@db.com\nHong Kong\nAmy Chang\nTel: +852 2203 8434\nEmail: amy.chang@db.com\nFrankfurt\nFrank Hartmann\nTel: +49 (69) 910 42744\nEmail: frank.hartmann@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}