{
    "url": "https://www.db.com/news/detail/20180711-made-for-good-making-a-positive-impact-and-creating-new-prospects?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 11, 2018",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Made for Good: making a positive impact and creating new prospects",
    "body": "A café and food delivery service staffed by mothers from low income families in the Philippines city of Parañaque is a place of hope, where its founders and the mothers can exchange and spawn their ideas for a better, fairer future. The café is part of the Mano Amiga School and offers some of the pupil’s mothers a secure job. The funds generated by the café go towards a scholarship programme for children from low-income families.\nThe café came about as part of the Made for Good enterprise programme set up by Deutsche Bank and its foundations. Made for Good is committed to ideas and projects that promote social progress around the world. Just under 12,000 social enterprises in 33 countries have benefited from the programme since 2016. “It is important to us to make a positive impact on society by making our skills and networks available to social entrepreneurs and non-profit initiatives to help them scale their business model,” says Lareena Hilton, Global Head of Brand Communications & CSR.\nIt is not just social entrepreneurs that benefit from these projects, Deutsche Bank’s employees do too: they get insights into non-profit organisations, learn about diverse life situations and experience social innovation. The exchange of knowledge between Deutsche Bank employees and the start-up scene is of benefit to all involved.\nLearning from each other\nIn the US, Deutsche Bank’s CSR Leadership Incubator equips employees to deepen their impact in the community through exceptional non-profit board service. The Incubator offers leadership development training and board placement in a supportive learning environment. Employees—those who are already active on boards and those still looking for the right commitment—CSR Americas staff and invited guests share insights and explore new strategies to help grow the capacity and sustainability of socially motivated organizations.\nIn South Africa, Deutsche Bank collaborates with social entrepreneurs in the Alternative Income Generation programme for non-profit organisations to help them find new opportunities to raise funds for their work. The more diverse the sources of funding, the less they depend on individual donors and can plan for the longer term. After all, even those who do good need a sustainable business model. Watch here how the programme works.\nAs different as the individual Made for Good projects may be, they all have one thing in common: they are not waiting for change, they are shaping it themselves.\nFor example, in densely populated Hong Kong, where there is hardly any agricultural land. Together with the Society of Rehabilitation and Crime Prevention of Hong Kong, Deutsche Bank has started an indoor vertical strawberry farm – the first of its kind in the city. This is where people with mental disabilities learn how to grow strawberries and vegetables, providing them not only an income but also a sense of self worth.\nThe Japanese social enterprise CHOCOLABO also employs people with disabilities. They produce chocolate and other confectionery – now made faster by the donation of a new machine from Deutsche Bank. This enables the company to work more efficiently and to create new jobs.\nIn Mumbai, India, Deutsche Bank supports the Atma Accelerator Programme for five non-profit organisations in the education space. The programme helps to develop them into sustainable and scalable organisations and provide improved access to quality education. In Singapore, the Made for Good programme focuses on young social entrepreneurs in the region. They need space to turn their ideas into action. Deutsche Bank and the Singapore International Foundation provide this platform as well as mentors and access to their networks.\nThe bank is pursuing a similar programme in China with the Non-Profit Incubator to support non-profit organisations and social enterprises involved in sports. The goal is to offer young people new opportunities to lead an independent life. The programme culminated in a Sports for Good competition where cash prizes were awarded to the winning organisations for further development of their work.\nBespoke programmes for budding founders help them to get enterprises off to a good start – and not only through knowledge building but also with advice, contacts and raising public awareness. For example, in the UK, Deutsche Bank’s partnership with Hatch supports 35 early-stage social entrepreneurs through Launchpad and Incubator programmes. The entrepreneurs also benefit from Deutsche Bank employees’ mentoring, providing financial and business experience to give them the best possible chance of success.\nIn Germany, more than 300 social enterprises and charities participate in the startsocial competition every year, and benefit from the feedback they get from their judges. Here, too, Deutsche Bank contributes more than money – its employees’ knowledge, thus making a positive impact on society. Over the next couple of months, the jury verdict will determine the shortlist of 100 initiatives who will receive a 4-month advisory scholarship to further develop and scale their idea.\nDeutsche Bank is committed to the United Nations’ Sustainable Development Goals (SDGs), which is why it supports social enterprises that do the same. This is in line with SDG 17 which calls for partnerships that make sustainable development possible by pooling resources. The new Global Goals Lab, a joined initiative with Social Impact combines the previous Impact fund and the Ready for Finance initiatives under one umbrella. The bank’s employees advise the social entrepreneurs on how to scale their offer and achieve impactful growth.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}