{
    "url": "https://www.db.com/news/detail/20180710-stay-invested-but-hedge?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 10, 2018",
    "tags": [
        "Capital markets",
        "Corporate products",
        "Investment Banking",
        "Wealth"
    ],
    "title": "Stay invested – but hedge",
    "body": "\"Stay invested – but hedge,\" says Christian Nolting, Chief Investment Officer for Deutsche Bank Wealth Management, in looking again at how the team's 10 themes for 2018 are performing in the light of recent economic and market developments.\nThe very first theme for 2018 was \"Forewarned is forearmed – investors should be prepared for an increase in volatility\". That rise in volatility has happened and it is not difficult to see the causes: US and China trade tensions, Italy and the Eurozone, higher rates and their implications for emerging markets, Nolting says in a new video.\nInvestment approach, portfolio positioning and security selection should reflect the fact that we are now late in the investment cycle, he says.\n\"We're still in the upward part of the cycle but moving into an area where the mantra should be 'stay invested but safeguard portfolios, ie hedge,\" Nolting says. \"But let's not forget, higher volatility can also be used as an opportunity.\"\nSome reassurance should be provided by Theme No. 2, \"Growth gazumps geopolitics\". Strong economic growth, led by the US, shows few signs of faltering and will push along Theme No. 3 \"Central banks in transition\". This process of monetary policy normalization is necessary but carries risks.\nClick on the video link for more on how the other themes, from \"Flashlight fixed income\" and \"Still some oxygen for equities\" to \"Explore investment alternatives\" and \"Tomorrow's theme today\".\nUseful links\nGet set for bumpy path ahead: Wealth Management investment specialists debate brewing trade tensions\nWealth Management publishes investment outlook for 2018",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}