{
    "url": "https://www.db.com/news/detail/20240222-rohini-devasher-is-deutsche-bank-s-artist-of-the-year-for-2024?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, February 22, 2024",
    "tags": [
        "Asia-Pacific",
        "Germany",
        "Art",
        "Awards",
        "Culture",
        "Diversity"
    ],
    "title": "Rohini Devasher is Deutsche Bank’s “Artist of the Year” for 2024",
    "body": "Deutsche Bank recognizes Rohini Devasher as the \"Artist of the Year\" for 2024. Born in 1978, the Indian artist studied painting and graphic art and currently resides in Delhi. In her intricate artistic endeavors, she delves into the intersections of science, art, and philosophy. For the inaugural occasion, Stephanie Rosenthal, an esteemed art expert and Director of the Guggenheim Abu Dhabi Project, suggested three artists, among whom Rohini Devasher was chosen by the bank.\nThe “Artist of the Year” award focuses on promising artists who have already produced artistically and socially significant works that align with the two focal points of the Deutsche Bank Collection: works on paper and photography. Starting from 2024, the conventional three-member jury of international curators has been replaced. Instead, a single distinguished personality from the global art world now nominates artists for the award every two years.\nStephanie Rosenthal, the Director of the Guggenheim Abu Dhabi Project, served until 2022 as the head of the Gropius Bau in Berlin. Before this role, she held prominent curatorial positions at the Hayward Gallery in London and the Haus der Kunst in Munich. In 2016, she assumed the role of Artistic Director for the 20th Biennale of Sydney, and in 2019, she chaired the jury for the 58th International Art Exhibition of the Venice Biennale.\nArtistic positions with a research-based approach\nRohini Devasher often collaborates with researchers, amateur astronomers, and global scientific institutions such as the Max Planck Institute for the History of Science (MPIWG) and CERN, the European Organization for Nuclear Research. Through these collaborations, Devasher intertwines scientific experiments and research on the physical phenomena of perception with her own artistic materials, resulting in captivating installations.\n“Rohini Devasher is the first Indian artist to be honored by Deutsche Bank as the ‘Artist of the Year,’ marking a groundbreaking convergence of art and science,” says Britta Färber, responsible for art and culture at Deutsche Bank. “I extend my gratitude to Stephanie Rosenthal; in an era of ecological and humanitarian crises, she has put forward an artist who, in a poetic yet factual manner, compels us to reconsider existing perceptions of the world and our place in it.”\n“Rohini Devasher utilizes a research-based approach to intricate complex narratives that address the pressing issues of our daily lives,\" remarked Stephanie Rosenthal. “Through the medium of drawing, she delves into societal structures and cultural dynamics, providing the viewer with a purposeful and contemplative space amidst the digital cacophony.”\nThe ambiguity of observation\nHer most recent 4-channel film, \"One Hundred Thousand Suns\" (2023), stands as an exemplary piece of work. Spanning material, ephemeral, personal, and historical dimensions, the work references over 100,000 portraits of the sun captured for over a century at the Kodaikanal Solar Observatory in India. Through a rich blend of the observatory’s archival material, NASA public-domain images, and her own data collections, Devasher invites us into a closer encounter with the Sun. In this exploration, she unravels the complexities and ambiguities of observation, challenging the perception of data as seemingly detached, disinterested or neutral.\n\"One Hundred Thousand Suns\" can be seen until March 24 at the Minnesota Street Project in San Francisco. Additionally, it can be experienced until June 2, 2024, as part of the group exhibition “The Creation of Science” at the Museum Catherijneconvent in Utrecht, and until April 14, as part of the exhibition “Punya 2.0” at the Kunsthalle Bern. From early April onward, the film will be shown at the Dr. Bhau Daji Lad Museum in Mumbai.\nThe “Artist of the Year” award focuses on promising artists who have already produced artistically and socially significant works that align with the two focal points of the Deutsche Bank Collection: works on paper and photography. Starting from 2024, the conventional three-member jury of international curators has been replaced. Instead, a single distinguished personality from the global art world now nominates artists for the award every two years.",
    "number_of_ratings": 5,
    "rating": 5.0,
    "likes": 8
}