{
    "url": "https://www.db.com/news/detail/20240201-full-year-results-2023?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "February 1, 2024",
    "tags": [
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank reports 2023 profit before tax of € 5.7 billion and announces € 1.6 billion of proposed capital distributions to shareholders",
    "body": "Continued revenue and business growth in 2023\nRevenues grow 6% year on year to € 28.9 billion, up 8% ex-specific items¹\nNet inflows of € 57 billion across Private Bank and Asset Management\nCost discipline: operational efficiency savings partly offset investments\nNoninterest expenses of € 21.7 billion, up 6%, include nonoperating costs of € 1.1 billion largely relating to strategy execution; cost/income ratio of 75%\nAdjusted costs1 up 3% to € 20.6 billion\nProfit before tax of € 5.7 billion, up 2% compared to 2022\nNet profit of € 4.9 billion, down 14%, reflecting higher income tax expense\nPost-tax return on average tangible shareholders’ equity (RoTE¹) of 7.4%\nPost-tax return on average shareholders’ equity (RoE)¹ of 6.7%\nCapital generation enables € 1.6 billion of distributions in H1 2024\nCommon Equity Tier 1 (CET1) capital ratio of 13.7%\n€ 675 million further share repurchase approved\n~€ 900 million in proposed dividends, € 0.45 per share, planned for 2023, up 50% over 2022\nRisk and balance sheet resilience\nProvision for credit losses of 31 basis points (bps) of average loans\nLiquidity coverage ratio of 140%, a surplus of € 62 billion\nDeposits rise to € 622 billion in fourth quarter, above year-end 2022\nFourth quarter of 2023: continued revenue growth and asset inflows\nNet revenues of € 6.7 billion, up 5% year on year, up 10% ex-specific items\nNet inflows of € 18 billion across Private Bank and Asset Management\nFourth quarter profit year-on-year development reflects nonoperating items\nProfit before tax of € 698 million, down 10%, includes goodwill impairment and non-recurrence of prior year gain on sale in Italy\nNet profit of € 1.4 billion, down 28%, reflects lower tax benefit\nPost-tax RoTE1 of 8.8%, RoE of 7.9%, and cost/income ratio of 82%\nAccelerated execution of Global Hausbank strategy: clear goals for 2025\n~€ 32 billion in revenues, with annual growth targets raised to 5.5%-6.5%\n~€ 20 billion in costs, with € 1.3 billion savings from measures completed\nPositioned to accelerate capital distributions; 2025 dividend guidance of € 1.00 per share, subject to 50% payout ratio\nOur performance in 2023 underlines the strength of our Global Hausbank strategy as we help our clients navigate an uncertain environment. We have achieved our highest profit before tax in 16 years, delivered growth well ahead of target and maintained our focus on cost discipline while investing in key areas. Our strong capital generation enables us to accelerate distributions to shareholders. This gives us firm confidence that we will deliver on our 2025 targets.\nChristian Sewing, Chief Executive Officer\nDeutsche Bank (XETRA: DBGn.DB / NYSE: DB) today announced profit before tax of € 5.7 billion for the full year 2023, up 2% over 2022. Revenues grew by 6% to € 28.9 billion, and by 8% excluding specific items¹. Noninterest expenses were € 21.7 billion, up 6%, with growth driven primarily by nonoperating costs¹ of € 1.1 billion, up from € 474 million in 2022. Adjusted costs, which exclude these nonoperating items, rose 3% to € 20.6 billion, as savings from efficiency measures partly offset costs relating to investments. The cost/income ratio was 75% in 2023, stable compared to 2022.\nRaising distributions to shareholders\nDeutsche Bank plans to increase both share repurchases and dividends by at least 50% year on year in 2024. The bank has received supervisory approval for a further share repurchase of € 675 million, which it aims to complete in the first half of 2024, having completed € 450 million in share repurchases in 2023. The bank plans to recommend 2023 dividends of € 900 million, or € 0.45 per share, up from € 0.30 per share for 2022, at its Annual General Meeting in May 2024. Having raised its capital outlook by € 3 billion in October 2023, the bank is well positioned to exceed its capital distribution goal of € 8 billion in respect of the financial years 2021-25, paid in 2022-26. The bank today published updated guidance for a proposed dividend of € 1.00 per share for the financial year 2025, subject to delivery of financial targets and to a 50% payout ratio.\nJames von Moltke, Chief Financial Officer, said: “We have reached an inflection point on key dimensions. We have delivered growth and capital strength while absorbing the twin impacts of continued investments and increased regulatory capital requirements. Looking ahead, with those impacts increasingly behind us, we are well positioned to accelerate our progress toward our 2025 goals.”\nAccelerating execution of the Global Hausbank strategy: a clear path towards 2025 targets\nDeutsche Bank made further progress on accelerating execution of its Global Hausbank strategy on all dimensions during 2023:\nRevenue growth: Deutsche Bank has raised its compound annual growth rate (CAGR) target for the period 2021-2025 by two percentage points, from between 3.5% and 4.5% to between 5.5% and 6.5%, after substantially outperforming its original target in both 2022 and 2023. The bank aims to generate revenues of around € 32 billion in 2025. The bank has invested to drive growth in capital light businesses, notably in the Corporate Bank, Origination & Advisory and Wealth Management, adding relationship manager hires in these businesses. In addition, the bank completed the acquisition of Numis which, the bank believes, will accelerate this strategy in the UK. Assets under management grew by € 115 billion in 2023, which is expected to drive revenue growth in the Private Bank and Asset Management in future periods.\nOperational Efficiency: Deutsche Bank made further progress on its € 2.5 billion operational efficiency programme during 2023. As at year-end 2023, savings either realised or expected from completed efficiency measures grew to € 1.3 billion, with around € 900 million in savings realised to date including approximately € 350 million in 2023. The bank expects the programme’s remaining savings of € 1.6 billion to be driven by measures relating to infrastructure and technology efficiencies, including application de-commissioning and operating model improvements; optimisation of the bank’s platform in Germany; and front-to-back process redesign, including simplified workflows and automation. The vast majority of these measures are expected to be reflected in the adjusted cost run-rate in 2025. The measures are expected to lead to a reduction of approximately 3,500 roles, mainly in non-client-facing areas. The bank has set a goal for a quarterly run-rate of adjusted costs of € 5 billion and aims to operate with total costs of around € 20 billion in 2025.\nCapital efficiency: Deutsche Bank achieved risk weighted asset (RWA) reductions of € 13 billion by year-end 2023, around halfway toward its target for RWA efficiencies of € 25-30 billion by 2025. This included a further € 3 billion in reductions in the fourth quarter, primarily due to securitisation transactions. These measures, together with strong organic capital generation, enabled the bank to increase its CET1 ratio to 13.7% by year-end, from 13.4% at year-end 2022. Deutsche Bank today announces capital distributions of € 1.6 billion in the first half of 2024 and now expects to exceed its goal of € 8 billion in capital distributions to shareholders paid in 2022-26. Subject to achievement of its published financial targets and to a payout ratio of 50%, the bank today publishes updated guidance for a proposed dividend of € 1.00 per share in respect of the financial year 2025.\n2023 profit development reflects nonoperating items and strategy execution\nPost-tax profit was € 4.9 billion, down 14% year on year, reflecting an increase in income tax expense of € 851 million over 2022. In 2023, income tax expense included a positive year-end deferred tax asset (DTA) valuation adjustment of € 1.0 billion, largely reflecting continuously strong performance in the UK, compared to a positive year-end DTA valuation adjustment of € 1.4 billion in 2022 which related to the bank’s US operations. 2022 also benefited from the geographical mix of income.\nPost-tax return on average tangible shareholders’ equity (RoTE¹) was 7.4%, compared to 9.4% in 2022. Post-tax return on average shareholders’ equity (RoE1) was 6.7% compared to 8.4% in the prior year. The year-on-year development in both ratios partly reflects increased total equity due to organic capital generation and the higher income tax expense compared to 2022.\nFourth-quarter pre-tax profit was € 698 million, down 10% compared to the fourth quarter of 2022. The year-on-year development largely reflects nonoperating items related to strategy execution: impairments of goodwill and other intangible assets rose to € 233 million, up from € 68 million in 2022, due entirely to a goodwill impairment charge related to the acquisition of Numis. In addition, the fourth quarter of 2022 included a € 305 million gain on the sale of Deutsche Bank Financial Advisors in Italy.\nFourth-quarter net profit was € 1.4 billion, down 28% from the prior year quarter. The year-on-year development primarily reflects the aforementioned non-operating items and lower DTA valuation adjustment compared to the prior year quarter. Fourth quarter post-tax RoTE1 was 8.8% and post-tax RoE1 was 7.9%.\nRevenues: continued outperformance supports increased 2021-25 CAGR target\nNet revenues were € 28.9 billion in 2023, up 6% year on year, and up 8% if adjusted for specific items. These items included a prior year gain on the sale of Deutsche Bank Financial Advisors in Italy of € 305 million and € 125 million from workout activities related to Sal. Oppenheim in 2022, neither of which recurred in 2023. Both of these items arose in the Private Bank. Additionally, debt valuation adjustments (DVAs) in the Investment Bank had a € 47 million negative impact in 2023 versus a € 49 million benefit in 2022. Compound annual revenue growth since 2021 was 6.6%, well above the bank’s original target of between 3.5% and 4.5% from 2021-2025. Fourth-quarter net revenues were € 6.7 billion, up 5% year on year and up 10% excluding specific items, predominantly the aforementioned gain on sale in the prior year quarter.\nCorporate Bank net revenues were € 7.7 billion in 2023, up 22% year on year. All businesses delivered double-digit year-on-year growth, driven by strong net interest income and continued pricing discipline. Revenues in Corporate Treasury Services rose 14% to € 4.4 billion, Institutional Client Services revenues grew by 20% to € 1.9 billion, and Business Banking revenues grew 55% to € 1.4 billion. In the fourth quarter, Corporate Bank revenues were € 1.9 billion, up 9% year on year, reflecting a continued favorable interest rate environment and pricing discipline, supported by a solid deposit base and higher fee and commission income. Corporate Treasury Services revenues were up 2% to € 1.1 billion, while revenues in Institutional Client Services grew 12% to € 495 million and Business Banking revenues grew 25% to € 364 million.\nInvestment Bank net revenues were € 9.2 billion in 2023, down 9% year on year, or down 8% excluding the aforementioned DVA impacts. Fixed Income & Currencies (FIC) revenues were € 8.0 billion, down 11% from an exceptionally strong prior year. Revenues in Foreign Exchange, Rates and Emerging Markets were substantially lower, reflecting reduced levels of volatility and market activity; this development was partly offset by strong growth in Credit Trading. Revenues in Origination & Advisory rose 25% year on year to € 1.2 billion, driven primarily by Debt Origination due to the non-recurrence of the prior year’s mark to market losses in Leveraged Debt Capital Markets. This more than offset a 38% decline in Advisory revenues which reflected very low levels of industry activity (source: Dealogic). In the fourth quarter, Investment Bank revenues were up 10% year on year. FIC revenues were € 1.5 billion, up 1% over the strong levels of the prior year quarter. Credit Trading revenues were significantly higher, driven by Distressed and improvements to the flow business, while strong growth in Emerging Markets was driven by increased client activity in Asia. This was partly offset by lower revenues in Rates and Foreign Exchange compared to the high levels of the prior year quarter. Origination & Advisory revenues grew by 56% to € 305 million, driven by Debt Origination revenues, primarily reflecting improvements in Leveraged Debt Capital Markets which benefitted from a non-repeat of prior year hedge losses and a partial recovery in the industry fee pool (source: Dealogic).\nPrivate Bank net revenues were € 9.6 billion in 2023, up 5% year on year, and up 10% if adjusted for the aforementioned specific items booked in the International Private Bank. Higher revenues from deposit products, driven by higher net interest margins, more than offset lower commissions and fee income driven by contractual and regulatory changes and the non-recurrence of revenues from Deutsche Bank Financial Advisors after its divestment. Revenues in the Private Bank Germany rose 14% to € 6.1 billion, while revenues in the International Private Bank were down 8%, or up 3% excluding specific items. Assets under Management grew by € 40 billion to € 559 billion during the year, largely driven by net inflows of € 29 billion. In the fourth quarter, Private Bank net revenues were € 2.4 billion, down 4% year on year, or up 9% ex-specific items. Private Bank Germany revenues grew 10% to € 1.5 billion, while revenues in the International Private Bank were € 907 million, down 21%, and up 8% ex-specific items. Assets under Management grew by € 12 billion during the quarter, driven mainly by net inflows of € 7 billion, the 16th consecutive quarter of net inflows, primarily reflecting successful deposit campaigns.\nAsset Management net revenues were € 2.4 billion in 2023, down 9% year on year. A 6% decline in management fees more than offset a slight rise in performance fees. Assets under Management grew by € 75 billion to € 896 billion during the year including net inflows of € 28 billion which were driven by Passive, Cash and Multi Asset products and including € 5 billion in ESG assets2. In the fourth quarter, Asset Management revenues were € 580 million, down 5% year on year. Management fees were down 3%, reflecting lower fees in Alternatives due to net outflows and lower real estate valuations, while Other revenues were negatively impacted by lower investment income and higher funding charges. These developments more than offset a 36% rise in performance fees. Assets under management grew € 37 billion in the quarter including net asset inflows of € 11 billion, driven by Passive and Cash.\nNoninterest expenses: continued discipline and investments in key areas\nNoninterest expenses were € 21.7 billion in 2023, up 6% year on year. This development largely reflected a rise in nonoperating costs to € 1.1 billion, up from € 474 million in 2022, largely related to the execution of the bank’s Global Hausbank strategy. The year-on-year increase in 2023 nonoperating costs was driven primarily by restructuring and severance expenses of € 566 million, compared to a release of € 8 million in 2022, and impairments of goodwill and other intangible assets of € 233 million, up from € 68 million in 2022, driven by the goodwill impairment charge related to Numis. Adjusted costs, which exclude nonoperating items, were € 20.6 billion, up 3%. Investments in business growth, controls and efficiency measures were partly offset by the aforementioned realised savings from the bank’s operational efficiency programme.\nIn the fourth quarter, noninterest expenses were € 5.5 billion, up 5% year on year. This development reflected the aforementioned restructuring and severance costs and Numis-related goodwill impairment, partly offset by a release of litigation provisions in the quarter. Fourth quarter adjusted costs were € 5.3 billion, up 9%, and included a number of exceptional items which are not expected to recur in future periods.\nThe workforce was 90,130 full-time equivalents (FTEs) at the end of 2023, an increase of 871 FTEs during the fourth quarter. This increase included 292 FTEs from Numis and 310 FTEs relating to the internalisation of external staff. These, together with other hires, more than offset leavers during the quarter.\nCredit provisions remain contained\nProvision for credit losses was € 1.5 billion in 2023, up from € 1.2 billion in 2022 and 31 bps of average loans, slightly above the bank’s guidance, reflecting the continued challenging impact of macro-economic and interest rate conditions on parts of the credit portfolio during 2023.\nIn the fourth quarter, provision for credit losses was € 488 million, up from € 245 million in the third quarter. The quarter-on-quarter development partly reflects the non-recurrence of model-related adjustments in the previous quarter. Provision for performing (stage 1 and 2) loans was € 30 million, compared to largely model-driven releases of € 101 million in the third quarter, while provision for non-performing (stage 3) loans was € 457 million, compared to € 346 million in the third quarter, mainly driven by higher provisions in the Private Bank and Corporate Bank which were partly offset by lower provisions in the Investment Bank. Stage 2 provisions in the Private Bank Germany continued to be impacted by operational backlogs arising from the Postbank integration, representing € 28 million, which are expected partially to reverse in future quarters.\nStrong capital generation supports 50% growth in shareholder distributions\nThe Common Equity Tier 1 (CET1) capital ratio was 13.7% at the end of 2023, up from 13.4% at the end of 2022. Organic capital generation more than offset the combined impacts of dividends, share buybacks, regulatory RWA inflation and business growth during the year. Capital efficiency measures, which form part of Deutsche Bank’s accelerated execution of its Global Hausbank strategy, delivered RWA reductions of € 13 billion during 2023.\nIn the fourth quarter, the CET1 ratio of 13.7% was slightly lower than 13.9% at the end of the third quarter, as organic capital generation in the quarter was more than offset by deductions for dividends and share buybacks and regulatory deductions for deferred tax assets. During the quarter, Deutsche Bank completed its € 450 million 2023 share repurchase programme as planned. Total distributions to shareholders from dividends and share repurchases amounted to over € 1 billion during 2023, up 50% over 2022, and bringing cumulative distributions to € 1.8 billion for 2022 and 2023.\nThe Leverage ratio was 4.5% in the fourth quarter of 2023, down from 4.7% in the previous quarter. The quarter-on-quarter development primarily reflected a slight rise in leverage exposure, partly driven by increased liquidity reserves due to higher deposits.\nLiquidity and funding strength\nLiquidity reserves were € 261 billion at the end of the fourth quarter of 2023, up from € 245 billion at the end of the third quarter, including High Quality Liquid Assets of € 219 billion, up from € 210 billion at the end of the third quarter. The Liquidity Coverage Ratio was 140%, above the regulatory requirement of 100%, representing a surplus of € 62 billion. The Net Stable Funding Ratio was 121%, slightly above the bank’s target range of 115-120% and representing a surplus of € 109 billion above required levels.\nDeposits were € 622 billion at year-end 2023, up by € 11 billion during the fourth quarter, and by € 29 billion during the second half of 2023, slightly above the level of year-end 2022.    \nSustainable Finance: volumes² reach € 279 billion in four years\nEnvironment, Social and Governance (ESG)-related financing and investment volumes² were € 14 billion excluding DWS in the quarter, bringing the cumulative total since January 1, 2020 to € 279 billion, including € 64 billion in 2023. \nIn the fourth quarter, Deutsche Bank’s businesses contributed as follows:\nCorporate Bank: € 3 billion in sustainable financing, raising the Corporate Bank’s cumulative total since January 1, 2020 to € 53 billion.\nInvestment Bank: € 8 billion in sustainable financing and capital market issuance, for a cumulative total of € 167 billion since January 1, 2020.\nPrivate Bank: € 3 billion growth in ESG assets under management and new client lending, and a cumulative total of € 59 billion since January 1, 2020\nDuring the fourth quarter of 2023, Deutsche Bank published its Initial Transition Plan, outlining its future roadmap for achieving net zero emissions by 2050. Furthermore, the bank announced the formation of a new Nature Advisory Panel, which aims to help the bank assess nature-related risks and identify new financial product offerings tied to the challenge of reversing biodiversity loss. Deutsche Bank also became the first bank to join #BackBlue, a UN-backed finance commitment which aims to support ocean protection. The bank hosted multiple events at the UN Climate Change Conference (COP28) in Dubai, one in partnership with six German industrial companies. Deutsche Bank acted as Co-Lead of the Net Zero Banking Alliance (NZBA) Real Estate Working Group which published its Emerging Practice Paper, Climate Target Setting for Real Estate Financing, during the quarter.\nMore details of Deutsche Bank’s sustainability strategy, policies, commitments and activities can be found on http://www.db.com/sustainability\nGroup results at a glance\nAnnual Media Conference\nDeutsche Bank will host its Annual Media Conference at 09:00 CET today. Christian Sewing, Chief Executive Officer, and James von Moltke, Chief Financial Officer, will discuss the bank’s fourth quarter and full year 2023 financial results and provide an update on the bank’s strategy and outlook. This event can be followed live on the bank’s website from 09:00 to 11:00 CET.  \nAnalyst call\nAn analyst call to discuss fourth quarter and full year 2023 financial results will take place at 11:00 CET today. The Financial Data Supplement (FDS), presentation and audio webcast for the analyst conference call are available at: www.db.com/quarterly-results\nA fixed income investor call will take place on February 2, 2024, at 15:00 CET. This conference call will be transmitted via internet: www.db.com/quarterly-results\nAnnual Report\nThe figures in this release are preliminary and unaudited. Deutsche Bank will publish its 2023 Annual Report and Form 20-F on March 14, 2024.\n¹For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ below, and on pp 15-20 of the fourth quarter 2023 Financial Data Supplement.\n¹Cumulative ESG volumes include sustainable financing (flow) and investments (stock) in the Corporate Bank, Investment Bank and Private Bank from January 1, 2020 to date, as set forth in Deutsche Bank’s Sustainability Deep Dive of May 20, 2021. Products in scope include capital market issuance (bookrunner share only), sustainable financing and period-end assets under management. Cumulative volumes and targets do not include ESG assets under management within DWS, which are reported separately by DWS.\nESG Classification\nWe defined our sustainable financing and investment activities in the “Sustainable Financing Framework – Deutsche Bank Group” which is available at investor-relations.db.com. Given the cumulative definition of our target, in cases where validation against the Framework cannot be completed before the end of the reporting quarter, volumes are reported upon completion of the validation in subsequent quarters. In Asset Management, DWS introduced its ESG Product Classification Framework (“ESG Framework”) in 2021 taking into account relevant legislation (including Regulation (EU) 2019/2088 – SFDR), market standards and internal developments. The ESG Framework is further described in the Annual Report 2021 of DWS under the heading ”Our Product Suite – Key Highlights / ESG Product Classification Framework” which is available at https://group.dws.com/ir/reports-and-events/annual-report/. There is no change in the ESG Framework in the fourth quarter of 2023. DWS will continue to develop and refine its ESG Framework in accordance with evolving regulation and market practice.\nRead the \nPDF\nfull media release as PDF document",
    "number_of_ratings": 24,
    "rating": 5.0,
    "likes": 48
}