{
    "url": "https://www.db.com/news/detail/20240201-best-manda-deal-digital-bridge-s-acquisition-of-aims-group-in-southeast-asia?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 1, 2024",
    "tags": [
        "Asia-Pacific",
        "Digital banking & services",
        "Investment Banking"
    ],
    "title": "Best M&A Deal: Digital Bridge’s acquisition of AIMS Group in Southeast Asia",
    "body": "Deutsche Bank won The Edge Malaysia's 'Best M&A Deal' for 2023 for its role in facilitating the acquisition of a major stake in AIMS Group by one of the world's largest digital infrastructure firms, DigitalBridge.\nDeutsche Bank served as buy-side advisor, showcasing its market-leading execution capabilities and commitment to creating lasting value for its clients. \nThe transaction united DigitalBridge with Time dotCom, a telecommunications provider specialising in connectivity, data centres, and managed services. AIMS Group, TIME dotCom's wholly owned subsidiary provides carrier-neutral data center services to a diverse customer base.\nA strategic digital collaboration\nThe transaction, valued at 700 million US dollars, strategically positions DigitalBridge in the ASEAN data centre market and secures Time dotCom a strategic partner. This partnership facilitates the pooling of expertise and resources, empowering both entities to drive growth and expansion in the ASEAN region and beyond. Together, they aim to provide best-in-class services to multinational corporations, large enterprises, content providers, internet infrastructure providers, and large financial institutions. \nThis strategic acquisition of a substantial stake in AIMS Group is a win-win outcome for both parties and demonstrates the bank's commitment to achieving enduring value for its clients. \n“The strategic acquisition of a majority stake in AIMS Group creates a mutually beneficial partnership, which will allow DigitalBridge to further accelerate its scaling up. We are pleased to provide them customised solutions to meet their specific needs, and collaborate with them to achieve their strategic goals.” says Vishwanath Elangovan, Mergers and Acquisitions, Deutsche Bank. \nThe strategic acquisition of a majority stake in AIMS Group creates a mutually beneficial partnership, which will allow DigitalBridge to further accelerate its scaling up.\nVishwanath Elangovan\nDeutsche Bank remains at the forefront of orchestrating deals that contribute to the growth and expansion of its clients in the ever-evolving digital landscape. \nThe bank last year helped arrange a 4.6 billion Australian dollar sustainability-linked loan (SLL) for hyperscale data centre specialist AirTrunk. The loan allows AirTrunk to grow its industry-leading cloud infrastructure platform across the Asia Pacific region, while being held accountable to improving its environmental and social commitments.",
    "number_of_ratings": 4,
    "rating": 5.0,
    "likes": 52
}