{
    "url": "https://www.db.com/news/detail/20151221-year-end-message-2015-from-john-cryan-and-juergen-fitschen?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 21, 2015",
    "tags": [
        "Company"
    ],
    "title": "Year-end message 2015 from John Cryan and Jürgen Fitschen",
    "body": "Dear Colleagues,\nAs year-end approaches and many of us anticipate the upcoming holidays, we want to pause and take stock of Deutsche Bank’s evolution over the past several months.\nWhile it has unquestionably been a year of challenges and changes, we believe it is important for us to recognise that the Bank is ending the year in better condition than we began it.\nSome signs of progress\nThanks to the work that commenced over a year ago, we have articulated a clear strategy for the Bank’s future. Subsequently, we have rightly shifted focus from contemplating strategy to recognising that Deutsche Bank’s future success depends no longer on further strategic debate, but rather on delivering on the commitments made to shareholders, clients, regulators, and one another.\nWe have restructured the Bank around the four types of clients that we serve – institutions, corporates, fiduciaries, and private clients – and devolved greater responsibility, along with consequent accountability, to our four business divisions.\nAccordingly, we have empowered the infrastructure functions and regions to help improve controls, reduce complex processes, and invest in systems that will help serve clients better and reduce costs so that they come into line with industry norms.\nFrom January 1, each of our business divisions will be represented on the Management Board by its leader, ensuring that we have one forum leading the Bank. We have abolished most of the Management Board committees and reassigned responsibilities to individuals wherever possible in order to accelerate decision-making and make more efficient use of time.\nOur business divisions and infrastructure functions subsequently appointed their new management teams, ensuring the right set of leadership skills to take the Bank forward.\nMoreover, we are making progress on our plans to dispose of non-core assets.\nCandour about challenges\nWe have tried at all times to be candid with you about the many challenges facing our Bank. We believe that only by identifying problems clearly and by being realistic about their scale, can we take the actions needed to overcome them.\nIt is only right that we accompany that candour about our challenges with heartfelt appreciation for your commitment, dedication, and hard work. Those of you who serve our clients every day, whether in branches or in the wholesale businesses, have not wavered throughout this year of challenge and change. Our revenues speak to the success of your work and client engagement. Others who serve in infrastructure roles have persevered in modernising the Bank, often while planning to do so with fewer resources in the future.\nOn behalf of the entire Management Board, we thank you all.\nThe year ahead\nAs we said in October when presenting further details of strategy, the year ahead will be part of a multi-year restructuring effort to transform Deutsche Bank. Restructuring programmes are rarely easy as they can bring about personal uncertainty while achieving institutional change. That change is necessary, however, in order to assure a stronger future.\nThe upside is that with diligent execution of our strategy in the years ahead, we have the potential to transform ourselves from a restructuring story into a strong, efficient, and well-run institution while serving our clients, counterparts, and society well. Being part of such a transformation is very rewarding both professionally and personally.\nWe do hope that you have the opportunity to take some time off in the weeks ahead and to energise yourself for 2016. In the meantime, thank you again for being part of building a better Deutsche Bank.\nYours sincerely,\nJohn Cryan               Jürgen Fitschen",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}