{
    "url": "https://www.db.com/news/detail/20151218-holiday-season-activities-around-the-world?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 18, 2015",
    "tags": [
        "Corporate Citizenship",
        "Education"
    ],
    "title": "Holiday season activities around the world",
    "body": "Spending time together\nDeutsche Bank employees across regions are participating in fundraising and volunteering projects in the run-up to Christmas. December began with the annual World AIDS Day, which saw Deutschbankers at numerous locations buying and selling stuffed bears to raise money for this important cause.\nThis year’s donation raised at just three locations in Germany amounted to almost EUR 22,000.\nIn South Africa, Deutsche Bank again held its annual Charity Trading Day in November. Since 2000, full day’s commissions have been donated to projects supported by Deutsche Bank South Africa Foundation. This year, the trading team raised a total of ZAR 3 million (approx. EUR 220,000) with the support of Deutsche’s clients.\nIn Germany, around 400 colleagues served as volunteers in Team Challenges during the Christmas season. They organised Santa Claus parties for refugee children, Christmas parties in kindergartens, schools and for people with disabilities, Christmas markets and dinners for people in need, a Christmas circus for almost 3,000 children or Christmas raffles. They baked and crafted artisan products with children and senior citizens, and organised gifts for disadvantaged people, e.g. through the project Christmas in a Shoebox (Weihnachten im Schuhkarton) with the charity Geschenke der Hoffnung e.V. Needless to say, projects for refugees remained a major pillar of our volunteering efforts.\nIn other regions, Deutsche Bank employees also pulled their weight for those in need.\nIn several locations in Asia, they organised Christmas parties, charity bazaars and fundraising activities for disadvantaged children.\nIn the Netherlands, they volunteered in a number of facilities for senior citizens.\nIn the United Arab Emirates, they teamed up with Dubai Cares to plan a fundraising event in support of an educational programme for Syrian refugees in Lebanon and Jordan.\nIn Japan, the entire month of December is “Volunteer Month” with colleagues participating in a range of activities, including Second Harvest where they help prepare and distribute meals to the homeless and the needy.\nStreetSmart: Since 2006, an amount of more than GBP 4,5 million has been donated to homelessness charities\nFurther projects for the homeless and others in need include StreetSmart / SleepSmart or Hilf Mahl!:\nIn the UK, StreetSmart is now receiving financial support for the first time directly from Deutsche Bank employees in London and Birmingham, who – through the StreetSmart lunch initiative – can add one pound to their lunch bill. Since the Bank began its partnership with StreetSmart in 2006, more than GBP 4.5 million have been raised,\nIn Munich, HilfMahl! raised some EUR 25,000 last winter,\nIn London, volunteers support the Whitechapel Mission, that delivers Day Care Services for the homeless and the excluded, and in Frankfurt am Main, several hundred colleagues have already signed up to support soup kitchens for disadvantaged people in the local churches in January and February 2016,\nIn the United States, the Deutsche Bank Americas Foundation recently donated USD 1 million to four organisations that are tackling the problem of homelessness in New York City.\nWe would like to thank our colleagues for all their efforts and continued commitment to serve as corporate volunteers!",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}