{
    "url": "https://www.db.com/news/detail/20151207-deutsche-bank-launches-maxblue-robo-advisor?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "December 7, 2015",
    "tags": [
        "Asset Management",
        "Company",
        "Corporate products",
        "Digitalisation",
        "Entrepreneurship",
        "Private products",
        "Research"
    ],
    "title": "Deutsche Bank launches maxblue robo-advisor",
    "body": "maxblue, Deutsche Bank’s online investment platform, is expanding its services to include the AnlageFinder robo-advisor. The robo-advisor uses algorithms to put together individual portfolios for investors who are looking to make investment decisions without taking advantage of advisory services. AnlageFinder is suitable for experienced and first-time investors in equities alike. It informs clients of potential investment related risks, such as an excessive focus on certain sectors, and highlights investment alternatives. The tool is free for maxblue clients and was developed in cooperation with the fintech company fincite.\nMarkus Pertlwieser, Chief Operating Officer (COO), Private & Business Clients, at Deutsche Bank says, “With our AnlageFinder robo-advisor, clients can professionally put together their portfolios and optimise their investment outcomes with just a few clicks.” In particular, the system makes it easy for first-time investors in equities to get started. “AnlageFinder provides clients with extensive support in making investment decisions with the help of tutorials and comprehensive financial market information,” says Pertlwieser, adding: “This investment tool helps Deutsche Bank position itself for the digital natives among its clients who are keen on seizing the opportunities offered by capital markets.”\nAnlageFinder: investing in just a few steps\nThanks to the new tool, the investment process consists of just a few steps, the first of which is settling key questions such as investment objectives, terms and risk appetite. Based on the client’s personal opportunity/risk profile, AnlageFinder comes up with a customised asset allocation in the second part of the process. Clients are then free to use this asset allocation in their investment or change it as they see fit. This gives clients the opportunity to rule out certain asset classes, for example. When this happens, the robo-advisor rounds out the portfolio with new investment recommendations.\nAnlageFinder offers a selection of securities in the respective asset class based on criteria selected by the client, such as rating, product costs and performance. Those asset classes may include actively managed investment funds as well as passively managed exchange-traded funds. As part of the individualised portfolio composition, the tool notifies clients if their allocation focuses too much on certain sectors, for example.\nIn the final step, clients can use maxblue to place securities orders. AnlageFinder will initially be available for use with internet browsers. An app version is scheduled for release in early 2016. Additional enhancements, such as peer-to-peer comparisons and risk management, are also slated to appear in the first half of 2016.\nmaxblue app: mobile securities trading made easy, transparent and convenient\nAlong with AnlageFinder, maxblue is also launching a new native app that is geared towards experienced investors. With their personal access data for Deutsche Bank’s online banking service, clients can use the app to check their accounts and portfolios and make securities trades any time.\n“The maxblue app allows our clients to react flexibly to the latest developments on capital markets any time. As a result, our clients can keep a constant eye on their portfolios and access them whenever they want. This makes trading from on the road just as easy, safe and convenient,” Pertlwieser says. The free app offers a complete overview of all stock exchanges and over-the-counter markets, enabling clients to directly compare the prices of various trading partners.\nThe maxblue app is initially available for iPad versions with iOS 8 and up.\nAbout maxblue\nmaxblue is Deutsche Bank’s online investment platform. Since 2001, maxblue has been making it possible for private investors to trade securities directly and independently.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 2
}