{
    "url": "https://www.db.com/news/detail/20190325-deutsche-bank-research-wins-top-research-house-for-both-asia-and-hong-kong-und-china?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 25, 2019",
    "tags": [
        "Asia-Pacific",
        "Awards",
        "Company"
    ],
    "title": "Deutsche Bank Research wins top Research House awards for Asia",
    "body": "Deutsche Bank Research has won StarMine’s top Research House award for both Hong Kong & China and the Asia ex-Japan region overall, winning a total of 22 analyst awards. This is the first time Deutsche Bank has ranked No. 1 across both regions, and it is also the first bank to ever achieve this feat. Last year Deutsche Bank Research had 16 analyst awards across the two surveys.\nJoe Liew, Head of Equity Research, APAC, said: “Ranking first across Asia, Hong Kong and China is an amazing achievement and I am very proud of our accomplishment. It is testament to the calibre of analysts we have in the equity research department across the region, who work tirelessly to analyse latest developments in their stocks and sectors.\n“I am excited and optimistic about 2019 given the quadrupling of weight given to China A shares in the MSCI Emerging Markets Index. With a dedicated and experienced research team, we are well placed to continue providing differentiated, thought leading research to our clients.”\nDeutsche Bank Research ranked No.1 in the following categories:\nAsia\nTop Earnings Estimators: Consumer Goods and Services, Real Estate Management & Development, Telecommunications\nTop Stock Pickers: Metals & Mining, Interactive Media & Services\nHong Kong and China\nTop Earnings Estimator: Overall Telecommunications Services, Consumer Discretionary, Real Estate, Telecommunications Services\nTop Stock Pickers: Retailing\nFor the past 15 years, StarMine has identified the leading global analysts in two main categories: stock recommendation performance relative to specific industry benchmarks (Stock Pickers) and accuracy in forecasting earnings as compared with peers (Earnings Estimators).\nRefinitiv Analyst Awards are globally recognised as the gold standard in objective measurement of sell-side analyst performance. The Refinitiv Analyst Awards, formerly Thomson Reuters StarMine Analyst Awards, measure the performance of sell-side analysts based on the returns of their buy and sell recommendations relative to industry benchmarks; and the accuracy of their earnings estimates in 14 regions across the globe.\nDeutsche Bank analysts also earned recognition in the StarMine Analyst Awards from Refinitiv in Australia and New Zealand. Ranking No.1 in Food, Beverages & Tobacco, No.2 in Diversified Industrials and No.1 as Top Stock Pickers in Chemicals & Forest Products.\nEarlier this month Institutional Investor Japan announced its annual rankings of equity research analysts. Deutsche Bank ranked No.1 in Insurance and Other Non-Bank Financials and No.2 in retailing.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 24
}