{
    "url": "https://www.db.com/news/detail/20190325-learn-save-earn?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 25, 2019",
    "tags": [
        "Corporate Citizenship",
        "Education"
    ],
    "title": "Learn.Save.Earn.",
    "body": "“Learn.Save.Earn.” is the official slogan of Global Money Week (GMW) which runs from March 25-29, 2019. The goal of the Week is to empower children and youth to not only learn to manage their money wisely, but to help them transfer their knowledge to their families and entire communities. The annual financial awareness campaign started in 2012 and has since touched the lives of 32 million children and young people in 169 countries.\nBorn to Be, Deutsche Bank’s CSR youth engagement programme includes various financial literacy projects around the world. “Research underpins that the financial lessons children learn have a huge positive impact on their later lives. We want to enable young people to embrace the responsibility for their present and future financial challenges. Many of our colleagues go to schools to work with students and teach them about the importance of solid financial planning,” says Lareena Hilton, Global Head of Brand Communications and Corporate Social Responsibility at Deutsche Bank.\nIn Spain, for example, 66 volunteers from Deutsche Bank participate in the Your Finance, Your Future programme to enhance financial literacy among more than 750 students aged 13-15. The initiative was launched in 2015 in cooperation with the Spanish Banking Association. In 2019, 18 financial institutions in total are joining forces during GMW.\nIn the Netherlands, Deutsche Bank hosts over 40 lectures for Bankers in front of the classroom – reaching some 1,000 elementary school students. The initiative aims to teach students cost-conscious habits from an early age and develop key money-management skills for later life. To do so, an interactive and appealing Cash Quiz brings various financial matters to life for the children.\nOur FinanzTuber project in Germany also takes a fresh approach to make learning fun. Launched last year, this hands-on video competition enables sixth to eighth graders to learn more about money and financial topics – by producing short video clips that teach their peers how to deal with financial issues they face. Volunteers from Deutsche Bank help them explore the world of finance by sharing their knowledge.\nBy 2020, India will have a large youth population, but only 2.3 percent of them are likely to have received formal skills training. The charity Plan India provides vulnerable children and youth with access to education, healthcare and the means to earn a living.\nAs part of the bank’s Born to Be programme, over 3,000 youth have been trained on job-oriented courses since 2016. Nearly 80 percent of the youth trained with skills are placed with jobs in a formal workplace.\nFor many, it is their first job and hence financial literacy becomes a key component of their training; e.g. on digital financial literacy such as online banking, online registration to access government social security schemes as well as on the importance of saving.\nSeven employees from Deutsche Bank offices in Mumbai, volunteered for 13 consecutive weekends, mentoring 150 youth, on skills needed at the workplace: “The biggest reason for this is the real-life examples we can share through our personal experience,” says Dharmesh Katrodia, who volunteered at this centre.\nIn Indonesia, Yayasan Kampus Diakoneia (KDM) cares for street children. Through its entrepreneurial programme, the children learn life skills and are given opportunities via apprenticeships in order to start a life on their own. 15 employees from Deutsche Bank in Jakarta visited the Museum Bank Indonesia with some former street children where they learnt about the circulation and use of cash, the importance of financial budgeting and Indonesia’s economy.\nIn Jacksonville (US) Deutsche Bank cooperates with Junior Achievement of North Florida to prepare young people for economic challenges through workforce readiness, entrepreneurship, and financial literacy programmes. In the 2017-2018 school year alone, Deutsche Bank employees volunteered over 5,000 hours in classrooms of high-need schools.\nIn partnership with the American University in Cairo, Deutsche Bank MENA Foundation supports 50 graduates from public universities in getting their Career Certificate in Finance, thus positively impacting their ability to compete in today’s job market.\nAll these financial literacy initiatives are part of our global Born to Be programme: since 2014, we have supported more than 180 education-led projects in 29 countries, making a #PositiveImpact on the lives of 4.4 million young people.",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 0
}