{
    "url": "https://www.db.com/news/detail/20190322-deutsche-bank-publishes-2018-financial-reports-human-resources-report-and-non-financial-report?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 22, 2019",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank publishes 2018 Financial Reports, Human Resources Report and Non-Financial Report",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) today published its 2018 Financial Reports. In addition, the bank published its Human Resources Report and Non-Financial Report.\nFinal and audited Group results at a glance\nIn its audited results, Deutsche Bank reported net income of 341 million euros for 2018 versus a net loss of 735 million euros for 2017, consistent with its preliminary and unaudited results published on 1 February 2019. Deutsche Bank delivered its first full-year net profit since 2014, exceeded its full-year adjusted cost targets and met its year-end headcount targets. The Common Equity Tier 1 (CET1) ratio, at 13.6%, was consistent with a target of over 13%. The Management Board and the Supervisory Board will propose a dividend of 11 cents per share to the Annual General Meeting. The Bank can service the payment of Additional Tier 1 (AT1) coupons.\nChristian Sewing, Chief Executive Officer, said: “With a return to profitability, reinforced controls and a strong balance sheet, we laid firm foundations for controlled growth which is now our strategic priority.”\nCompensation\nThe Management Board collectively received total compensation of 55.7 million euros for 2018, versus 29.8 million euros in the prior year. The year-on-year difference reflects the Supervisory Board’s decision to grant variable compensation to Management Board members for the first time since 2014. This was determined by performance against both individual and Deutsche Bank Group targets. Total compensation figures include compensation for the current Management Board members and for Management Board members who served during part of 2018. Christian Sewing, Management Board Chairman and Group Chief Executive Officer, was awarded a total compensation of 7.0 million euros. Total compensation awarded to Deutsche Bank employees in respect of 2018 was 10.6 billion euros (2017: 11.1 billion euros). Total compensation includes performance-based variable compensation (Group and individual components) for employees of 1.9 billion euros, versus 2.3 billion euros in 2017. The 14% year-on-year decline partly reflects a reduction in headcount. 37% of variable compensation awarded in respect of 2018 will be paid out in future years.\nOther Financial Reports\nToday, the bank also published its 2018 Pillar 3 Report and Annual Financial Statements and Management Report for Deutsche Bank AG under HGB. Final results under HGB allowed for 2.0 billion euros of additions to the fund for general banking risks according to Section 340g HGB, significantly higher than the estimate published on 1 February 2019. In addition, the Annual Report on Form 20-F will be made available in the course of the day.\nHuman Resources Report\nThe bank’s Human Resources Report complements the Annual Report. It contains information on Deutsche Bank’s strategic Human Resources (HR) priorities and initiatives during 2018, provides key employee statistics and gives details on key metrics and people-related activities.\nWorkforce reductions in line with targets, despite key investments\nThe number of employees (on a full-time equivalent basis) decreased in 2018 by 5,797 or 5.9 percent to 91,737 as of 31 December 2018. The partial disposal of retail operations in Poland in the fourth quarter of 2018 contributed to this development, as did a reduction of employees due to adjustments in the Corporate & Investment Bank as announced in the second quarter of 2018. Management continued to insource business-critical external roles during the year, especially in IT, and further strengthen controls, notably through sustained investments in its Anti-Financial Crime unit.\nGrowing investments in young talent\nDeutsche Bank hired 910 graduates in 2018, up by nearly 50% over the prior year. This increase was mainly due to additional graduate hires in parts of the Corporate & Investment Bank (CIB) and Technology. The proportion of female graduates in the new class has risen to 40 percent, up from 37 percent in 2017. In Germany, the bank sustained its apprenticeship programme by hiring 607 new apprentices during 2018. 45 percent of apprentices are women.\nA commitment to gender equality, diversity and inclusion\nDeutsche Bank made further progress on gender equality during 2018. The percentage of women one level below Management Board level rose to 20.8% (2017: 18.0%), while the percentage of women two levels below the Management Board rose to 20.9% (2017: 19.6 %). As of year-end 2018, the percentage of female Managing Directors and Directors rose to 22.8 percent (2017: 21.9%).\nDeutsche Bank operates in roughly 60 countries and had employees from 146 different nationalities as at the end of 2018. In 2018, for the first time, Deutsche Bank made the list of top 100 most inclusive companies on the Thomson Reuters Diversity and Inclusion (D&I) Index. At the World Economic Forum’s Annual Meeting in Davos, the bank announced it is joining Open For Business, a coalition that seeks to make the business and economic case for LGBTIQ rights. Once again, Deutsche Bank was awarded the maximum score of 100 in the Human Rights Campaign’s annual Corporate Equality Index.\nNon-Financial Report\nToday, Deutsche Bank also published its 2018 Non-Financial Report. This provides details of developments during the year in areas commonly referred to as Environmental, Social and Governance (ESG). The Corporate & Investment Bank was the sole or partial arranger of approximately 1.2 billion euros in funding for projects developing renewable energy sources generating more than 2,200 megawatts in capacity. Additionally, the bank arranged the issuance of green bonds worth more than 8 billion euros.\nThe bank’s asset management business, DWS, expanded its offering in this area. In 2018 DWS had 47.1 billion euros of ESG assets under management. This comprised 32.8 billion euros of ESG and sustainable assets under management, 13.4 billion euros in real estate investments in certified green buildings and 862 million euros in infrastructure investments in renewable energies.\nDeutsche Bank is also one of the first signatories to the Alliance for Development and Climate, an initiative launched by Germany’s Federal Ministry for Economic Cooperation and Development.\nDeutsche Bank maintained its commitment to good governance in 2018, strengthening internal policies in this area and updating its Code of Conduct. The bank actively promoted a culture of open dialogue among employees through a variety of measures, including an internal “Speak Up” campaign, and tightened its worldwide standards for ‘Know Your Client’ (KYC) processes.\nIn 2018, the bank’s corporate citizenship initiatives together made a positive impact on the lives of 1.8 million people. Born to Be education projects helped some 650,000 young people. In the Made for Good programme, Deutsche Bank worked with more than 5,000 pioneering social enterprises that had an impact on 525,000 people. The bank’s commitment to support local communities in areas such as affordable housing in the US, disaster relief and basic infrastructure touched 640,000 lives last year.\n18,000 colleagues worldwide participated in Deutsche Bank’s Plus You employee volunteering and giving community, acting as mentors for young people or advisors to social enterprises, or contributing to community projects. Deutsche Bank also delivered on its 2016 pledge to engage 1,000 employees as integration coaches for refugees by year-end 2018. Additionally, the Refugee Programme supports refugees with university education in Germany and helps them navigate the job market.\n  Availability\nAll reports, including an updated full-year 2018 Financial Data Supplement, can be downloaded from: https://www.db.com/ir/en/reports-and-events.htm\nThe Annual Report on Form 20-F, which will be submitted to the U.S. Securities and Exchange Commission (SEC) over the course of today, will also be made available following submission (in English only) on the website:\nhttps://www.db.com/ir/en/sec-filings-for-financial-results.htm\nFirst and Third Quarter Results\nGoing forward Deutsche Bank will replace its interim reports for the first and the third quarter with an Earnings Report. This document will provide a focused overview of financial results and other developments within these periods. Publication of first quarter results is scheduled for April 26, 2019.\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nChristian Streckert\nPhone: +49 69 910 38079\nE-mail: christian.streckert@db.com\nCharlie Olivier\nPhone: +44(207)54-57866\nE-mail: charlie.olivier@db.com\nInvestor Relations\n+49 800 910-8000 (Frankfurt)\n+44 20 7541-4100 (London)\n+1 212 250-0604 (New York)\ndb.ir@db.com",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 1
}