{
    "url": "https://www.db.com/news/detail/20190319-women-in-tech-for-social-change?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 19, 2019",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "Women in tech for social change",
    "body": "How can we bring together support for innovative IT solutions, social projects and female empowerment? Deutsche Bank’s answer is “We in Social Tech”, a new business accelerator programme for women that aims to reduce the gender imbalance in London’s technology sector, by supporting 60 ambitious female tech founders, to start, grow or scale their businesses. Whether they are starting out or are already established, the initiative’s unique criteria is that they are passionate about making a positive social impact with their business.\nThe initiative is designed to run for two years with three six-month programme cycles, each supporting 20 businesses. Participants will receive support regarding business growth plans, investment and finance and benefit from peer learning groups and free co-working space.\nThe first cohort of 20 entrepreneurs consisting of technologies ranging from wearables such as a smart insole that aids mobility; to an immersive virtual reality platform for people with dementia; to a digital procurement marketplace for social enterprises. All are well underway with Deutsche Bank mentors supporting them as they work through the programme of weekly workshops.\nJeremy Pattman, Deutsche Bank, is mentoring Danielle Connor, co-founder of Pocket Pals. “My mentee is using technology to inspire the next generation with natural history; something I am passionate about as a father of young children, so being able to support the early foundations of this social venture is really exciting. Mentoring is a great way to utilise and share my skills, whilst making personal gains from the experience too.”\nThe new programme is part of the bank’s Corporate Social Responsibility social enterprise programme Made for Good, and is being developed in partnership with Nwes, the largest not-for-profit enterprise agency in the United Kingdom. Nicole Lovett, Head of CSR UK, says: “Technology and innovative business models have the potential to solve some of the world’s most pressing environmental and societal problems, whilst also boosting economic competitiveness. The new programme can help to get obstacles out of their way to build sustainable business models that deliver user, social and financial value at scale.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}