{
    "url": "https://www.db.com/news/detail/20190314-how-deutsche-bank-is-forging-ever-closer-links-between-china-and-europe?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 14, 2019",
    "tags": [
        "Capital markets",
        "Corporate products",
        "Investment Banking",
        "Private products",
        "Research"
    ],
    "title": "How Deutsche Bank is forging ever-closer links between China and Europe",
    "body": "“Deutsche Bank has a unique ability to link China with Europe,” said Asia Pacific CEO Werner Steinmüller, in an interview with China Daily published this week. “We add significant value in cross-border work in both directions, outbound from China servicing the country's increasingly globally relevant companies as they expand abroad, and inbound as European investors and companies deepen their investments and operations here,” he said.\n“I hear examples of it every day from our client base in both geographies,” said Steinmüller talking of our clients’ growing focus on increasing their operations and capabilities in China. “We can support them in their efforts, not just in raising capital but in managing risk and establishing efficient payment flow systems,” he said. Given our strengths, there is “abundant opportunity” for the bank in China, said Steinmüller.\n  Key quotes from the story:\n“We have a unique ability to link China with Europe, given our long history and deep ties in both geographies. This is particularly relevant as we are starting to see closer collaboration and increased trade linkages along this corridor.”\n“We have consistently helped to drive the development of China's capital markets over the years, and occupy an important role in the ongoing smooth integration of China's capital markets with the global financial system. For example, as an industry leader in global foreign exchange and transaction banking, we have been an active pioneer in the internationalisation of the renminbi, both onshore and around the world.”\n“As a leading fixed income house globally, we have quickly become one of the leading players facilitating Bond Connect trading volume, and one of the top foreign settlement agents on the China Interbank Bond Market.”\n“Our advisory strength, particularly in global cross-border transactions, has also helped us win leading roles on some of the most ground-breaking global capital raises and mergers and acquisitions work for China's emerging champions.”\n“Deutsche Bank China has worked closely with regulators in introducing new financial market instruments, and we are widely recognised for some of our industry-leading breakthroughs.”\n“Just in the past few months, we've seen several big examples of German corporate investment into China, in the auto sector and in general industries as well. We are right there beside our European clients supporting them with this inward investment. At the same time, we are increasingly seeing that China's most important companies and investors cannot rely solely on the North American market for capital linkages or investment.”\n“Some 88 of our top 100 most important global clients are working with us on matters related to this region. The strength of our regional network is a key differentiator versus our peers, particularly our full product capability across segments locally in so many markets. We are leaning in to our business in the Asia-Pacific region, to defend our position, build on our existing edge here, and ensure that we are able to capture continued growth.”\nPDF\nRead the full story",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}