{
    "url": "https://www.db.com/news/detail/20150430-deutsche-bank-awards-for-creative-enterprise-provide-start-up-funding-and-support-to-budding-arts-entrepreneurs?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 30, 2015",
    "tags": [
        "Art",
        "Company",
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank Awards for Creative Enterprise provide start-up funding and support to budding arts entrepreneurs",
    "body": "Deutsche Bank today announced the shortlist for the Deutsche Bank Awards for Creative Enterprise (DBACE), which aim to support the next generation of creative entrepreneurs. The Awards provide investment, support and training to help arts students and recent graduates turn their talent into self employment and enterprise. The awards will be presented at a ceremony at Deutsche Bank’s London offices on Wednesday, May 13.\nNow in its 23rd year, the Awards have provided GBP 1.4 million in start-up capital to help arts graduates launch 177 new businesses in the UK, with over 2,000 arts students receiving business training to date. The Awards are much more than a capital injection, winners are also provided with a Deutsche Bank mentor for their first year as well as business training and access to experts and new networks.\nDeutsche Bank has significantly increased eligibility in 2015 to 50,000 graduating students from all the UK’s 200 art colleges.\nLareena Hilton, Global Head of Brand Communications & Corporate Citizenship said: “Through the national roll out of DBACE we’re widening the opportunities for graduating or recently graduated students to pursue their entrepreneurial ideas. This is an option which, though daunting for many creative young people, can be hugely beneficial both for themselves and the wider UK economy.”\nThe Awards have a prestigious judging panel representing the business, professional and academic worlds within creative disciplines including; Nigel Hurst, CEO of Saatchi Gallery, Louise Jeffreys, Director of Arts at Barbican, Richard Stevens, Creative Director at British Airways and Eileen Taylor, Chief Executive Officer of DB UK Bank Limited.\nThe Awards are part of Deutsche Bank’s Born to Be youth engagement programme, which aims to help young people fulfill their potential by developing skills, raising aspirations and providing opportunities that help them succeed.\nThe shortlist for the DBACE 2015:\nFine Art\nSung Eun Chin (with Derzu Campos)\nGoldsmiths, University of London | MFA Fine Art\nEdge of the Dark is a research-based art project about a disappeared site \"Kowloon Walled City\" in Hong Kong.\nEleanor Gibson (with Emily Parker and Georgie Parker)\nNewcastle University | BA (hons) Architecture\nTo transform the online magazine into an interactive digital art form where university students exhibit work, develop ideas and connect.\nMyra Ostacchini\nGlasgow School of Art | BA (hons) Sculpture and Environmental graduate\nM.A.P. is a commercial business, which supports graduates from creative industries, providing studios and internships in return for work within commercial contracts. Luke Pilkington is the joint artist in residence.\nSean Steadman\nRoyal Academy of Arts | MA Fine Art\nSean Steadman is going to travel to the Amazon Rainforest and make a book published in Rio de Janeiro.\nDarya Yafimava\nUniversity of Warwick | MA Creative & Media Enterprises\nPozniaje Dreva is the first ever collection of hand-printed home textiles inspired by the folk art of Belarus.\nFilm & Photography\nInés Duemig\nLondon College of Communication | MA Photojournalism and Documentary Photography graduate\nA social documentary project with young women coming to Europe as refugees to regain their lost dignity.\nNirma Madhoo-Chipps\nLondon College of Fashion | MA Fashion Photography\nFuture Bodies is a photography and film project that pushes the edges of aesthetic awareness in the context of digital fashion imagery.\nBradley Morgan Johnson\nNorwich University of the Arts | MA Moving Image and Sound\nBradleyMJ offers a pre-vis design service, taking ideas as words, and turning them into realised creative concepts for production.\nTim Simmons\nNorwich University of the Arts | MA Fine Art\nThis project investigates links between the speed of sound and the speed earth rotates, which are equal at latitude 42.97˚.\nEleanor Wright (with Jillian Engelhard Fosten)\nNorwich University of the Arts | BA (hons) Animation\nThe Unique Mind of Alexandra Mackie is a three-part art house documentary series exploring a young, blind woman’s imagination.\nDesign\nVictoria Ganusceac\nDe Montfort University | BA (hons) Fashion Buying and Marketing\nMuusa is an outfit building tool where fashion and music unite in order to revolutionise the way we shop online.\nAaron Griffin\nNorwich University of the Arts | BA Fine Art\nAaron Griffin is proposing to open a small commercial print studio in Norwich offering a professional collaborative atmosphere and ethos.\nKazz Morohashi\nNorwich University of the Arts | MA Communications Design\nDigital heritage-mapping project for children: Explore the physical world with \"Walkies!\" sausage dogs and share the experience online.\nAdelle Quiogue\nUniversity of the Arts London | MA Applied Imagination in the Creative Industries graduate\nResignified Collection is the pilot collection of Fruitions, a design-led social enterprise that connects Philippine indigenous artisans with well-known designers.\nMichael Tougher\nGlasgow School of Art | MA Product Design Engineering\nMichael Tougher : Inventor. Making what does not exist. Pushing the boundaries of innovation and what is possible.\nTing Ye (with Abigail Summerfield)\nUniversity of the Arts London | MA Material Futures\nTing and Abigail believe in designing sustainably for the future and are passionate about textiles. They created The Design Mine.\nMusic\nGuy Baron (with Aviram Barath and Robin Paul Braum)\nGoldsmiths, University of London | MMus Creative Practice\nAn artist collective that seeks to introduce new and unconventional approaches to music production and to empower young, innovative musicians.\nBeth Bellis (with Tom White)\nBirmingham Conservatoire | PGDip Music\nConversion of a goods lorry into unfolding mobile music/arts space, as a platform for emerging artists and unique venue for audiences.\nVincent Bruggeman\nGuildhall School of Music & Drama | BA (hons) Vocal Performance\nLyribox.com provides learning tools for classical singers. These tools are divided into three categories: recordings, manuscripts and videos.\nRobbie Jacobs\nRoyal Academy of Music | MA Choral Conducting\nReverie is a vocal ensemble, with expertise contemporary choral repertoire. It creates interactive and immersive artistic output to engage listeners.\nThomas Syson\nBirmingham Conservatoire | BMus Jazz Trumpet\nConscia is a jazz promotion and education company based in and around the Bedford area.\nPerformance\nVincent Bruggeman\nGuildhall School of Music & Drama | BA (hons) Vocal Performance\nLyribox.com provides learning tools for classical singers. These tools are divided into three categories: recordings, manuscripts and videos.\nHelen Cox (with Heather Stewart)\nLondon Contemporary Dance School | MA Contemporary Dance\nExploring obedience and strict self-observation, The Lapse Project is a thirteen-hour performance installation of dance, theatre, text and video.\nKatherine Lambeth (with Clara Biller, Katharina von Colson, Martha Evans and Elsabe Raath)\nBirmingham Conservatoire | MMus Viola Performance\nDedicated to promoting their instrument through musical social engagement, the Saturday Bridge Viola Ensemble proposes a year of international outreach.\nMaisy Taylor (with Michelle Ross, Laura Overton, Alice Gilmartin, Claudia Hughes, Kate Hill, Natalie James)\nNational Centre for Circus Arts | BA (hons) Circus Arts\nBrand new all female contemporary circus company The Cirquettes launch their début show \"A Day in the Life\".\nMiho Yoshimasu (with Marie Yamada)\nGoldsmiths, University of London | MA Creative & Cultural Entrepreneurship\nArtbees is an education company runs a private after school offering theatre and language programmes for children in Tokyo.\nAbout Deutsche Bank\nDeutsche Bank is a leading client-centric global universal bank serving 28 million clients worldwide. Deutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nAbout Deutsche Bank’s global youth engagement Programme\nDeutsche Bank’s global youth engagement programme, Born to Be, reached over 1.2m young people through 130 projects worldwide in 2014. In the UK, where youth unemployment affects nearly 1 million, Born to Be focuses on addressing this issue; enabling the next generation to develop the aspirations and skills they need to succeed. Born to Be supported 55,000 young people in the UK in 2014 alone. To find out more visit www.db.com/borntobe\nDisclaimer \nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement. Such factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission. Such factors are described in detail in our SEC Form 20-F of 20 March 2014 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}