{
    "url": "https://www.db.com/news/detail/20150428-25-plus-5-deutsche-bank-and-the-berliner-philharmoniker-continue-partnership-until-2020?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 28, 2015",
    "tags": [
        "Company",
        "Corporate Citizenship",
        "Culture"
    ],
    "title": "\"25 plus 5\": Deutsche Bank and the Berliner Philharmoniker continue partnership until 2020",
    "body": "Deutsche Bank and the Berliner Philharmoniker have extended their cooperation agreement for another five years, continuing their successful partnership, which has been in existence for over 25 years.\nJürgen Fitschen, Co-Chief Executive Officer of the Management Board of Deutsche Bank, said: “We are proud to be a partner of the Berliner Philharmoniker for more than a quarter of a century now and thrilled to continue actively supporting this first-rate orchestra in the years ahead. The exclusive and long-standing bond shared by the orchestra and the bank is unique anywhere in the world. The combination of discipline, skill and innovative strength make the Berliner Philharmoniker an ideal partner for Deutsche Bank.”\nDeutsche Bank has been lending its support to the Berliner Philharmoniker since 1989 and has been the organisation’s exclusive patron since 2002. Since then, the two partners have initiated and implemented a number of visionary projects together.\nOne truly unique project in the world of classical music that was made possible by the bank began in 2009 and aims to make music more accessible across national and social boundaries: the Digital Concert Hall. It allows music lovers worldwide to view the concerts of the Berliner Philharmoniker at any time over the internet in superb image and sound quality. Since its launch, more than 550,000 users have registered in the Digital Concert Hall.\nThe ability of music to transcend boundaries is also demonstrated by the Berliner Philharmoniker’s education programme, which has introduced more than 37,000 children and young people to classical music since 2002. Whether through dance, by singing or playing an instrument, every child is given the opportunity to go on his or her own journey of musical discovery. Since autumn 2013, the Vocal Heroes choir project has formed the focus of the education programme. Venues in three districts in Berlin have been created for the purpose of bringing people together to sing and make music.\nThe project is especially designed for children who have not had any exposure to classical music. The youth choir’s performances with the Berliner Philharmoniker are the highlight of the project. Vocal Heroes is one of the many initiatives of the Born to Be programme, through which Deutsche Bank and its foundations aim to improve the future outlook of children and young people.\nAs a reliable private patron, Deutsche Bank will accompany and support the Berliner Philharmoniker in the years ahead as they go on tour through Germany and abroad, and at the opening concert in Berlin of every new season.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}