{
    "url": "https://www.db.com/news/detail/20150423-deutsche-bank-agrees-to-joint-settlement-of-all-remaining-investigations-with-us-and-uk-regulators-over-interbank-offered-rates-benchmarks?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 23, 2015",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank agrees to joint settlement of all remaining investigations with US and UK regulators over interbank offered rates benchmarks",
    "body": "Deutsche Bank has reached a joint settlement with the Department of Justice (DOJ), Commodity Futures Trading Commission (CFTC) and New York State Department of Financial Services (NYDFS) in the US and Financial Conduct Authority (FCA) in the UK as part of an industry-wide investigation into past submissions for interbank offered rates benchmarks.\nDeutsche Bank agreed to pay penalties of USD 2.175 billion to the DOJ, CFTC and NYDFS and GBP 226.8 million to the FCA.\nDeutsche Bank will book an additional provision of approximately EUR 1.5 billion for IBOR and other matters in its first-quarter 2015 financial results.\nNo current or former member of the Management Board was found to have been involved in or aware of the trader misconduct.\nThe Bank has disciplined or dismissed individuals involved in the trader misconduct; has significantly strengthened its controls; and is conducting a thorough review of its actions in addressing this matter.\nDeutsche Bank (XETRA: DBKGn.DE / NYSE: DB) announced today that it has reached a joint settlement with US and UK regulators over all of their remaining investigations into past submissions for interbank offered rates (IBOR) benchmarks.\nThe resolution with the DOJ, CFTC and NYDFS in the US and FCA in the UK is part of an industry-wide investigation into the setting of IBOR across a range of currencies.\nAs part of the settlement, Deutsche Bank agreed to pay penalties of USD 2.175 billion to the DOJ, CFTC and NYDFS and GBP 226.8 million to the FCA. Deutsche Bank will book an additional provision of approximately EUR 1.5 billion for IBOR and other matters in its first-quarter 2015 financial results.\nNo current or former member of the Management Board was found to have been involved in or aware of the trader misconduct.\nJürgen Fitschen and Anshu Jain, Co-Chief Executive Officers of Deutsche Bank, said: “We deeply regret this matter but are pleased to have resolved it. The Bank accepts the findings of the regulators.\n“We have disciplined or dismissed individuals involved in the trader misconduct; have substantially strengthened our control teams, procedures and record-keeping; and are conducting a thorough review of the Bank’s actions in addressing this matter.\n“This agreement marks another step in addressing the past and ensuring that the Bank earns back the trust of its clients, shareholders and society at large.”\nDeutsche Bank holds accountable those found to have acted inconsistently with its standards. It has worked intensively in investigating the matter. The Bank’s internal investigation was the largest in its history, involving the collection of more than 150 million electronic documents and 850,000 audio files and the review of more than 21 million electronic documents and 320,000 audio files.\nThe Bank recognises that there were defects and delays in collecting and producing documents and audio. It has significantly increased the number of employees dedicated to electronic discovery to 200 and raised expenditure by 600% since 2012.\nSpecific changes to procedures and controls across Deutsche Bank include:\nCreating a Benchmark and Index Control Group, which now oversees the Bank’s IBOR submissions and reports to Risk Management, an independent control function;\nCompletely segregating duties between LIBOR/EURIBOR submitters and traders, including physical separation. Submissions are now based on observable transactions, not estimates, to the greatest extent possible;\nUpgrading the Bank’s systems and controls so that it can more quickly identify electronic and voice communications that are of interest to regulators and to the Bank. This is part of the previously announced EUR 1 billion programme to upgrade systems and controls.\n  For further information please contact:\nDeutsche Bank AG\nPress & Media Relations\nKathryn Hanes +44 (20) 754 56941\nMichele Allison +1 (212) 250 4735\ndb.presse@db.com\nInvestor Relations\n+49 69 910 35395 (Frankfurt)\n+1 212 250 1540 (New York)\ndb.ir@db.com\n   ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}