{
    "url": "https://www.db.com/news/detail/20150423-basim-magdy-is-deutsche-bank-s-artist-of-the-year-2016?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 23, 2015",
    "tags": [
        "Art",
        "Company",
        "Corporate Citizenship"
    ],
    "title": "Basim Magdy is Deutsche Bank's \"Artist of the Year\" 2016",
    "body": "Basim Magdy is Deutsche Bank’s “Artist of the Year” 2016 and will present his first institutional solo exhibition at the Deutsche Bank KunstHalle in Berlin next spring.\nThe artist, who was born in 1977 in Assiut, Egypt, and now lives in Basel and Cairo, has created a multifaceted oeuvre in recent years encompassing film, photography, slide projections, installations, and works on paper. At the center of all of his works are structures of seeing, remembering, and archiving.\nMany of Basim Magdy’s works, which are based on observations of reality, are akin to surreal tales full of cryptic humor. With paintings and assemblies boasting psychedelic-looking colors, the artist investigates collective utopias and formulates his doubts in dogmas and ideologies. At the same time, he appeals to the viewer’s imagination and reveals alternative realities and social blueprints. “Maybe I’m more interested in issues that are not particularly pleasant,” he says about his artistic production, “but I have to say that my favourite reaction to the work I make is when people look at it and smile or laugh.”\nBasim Magdy has participated in numerous international group exhibitions, including the Sharjah and Istanbul Biennials in 2013 and La Biennale de Montreal and MEDIACITY Seoul Biennial in 2014. Currently, he is prominently represented in the highly regarded show “Surround Audience: New Museum Triennial 2015” in New York and the exhibition “Lest The Two Seas Meet” at the Museum of Modern Art in Warsaw.\nAfter Wangechi Mutu (Kenya), Yto Barrada (France/Morocco), Roman Ondák (Slovakia), Imran Qureshi (Pakistan), Victor Man (Romania), and Koki Tanaka (Japan), Basim Magdy is the seventh international artist Deutsche Bank is honouring with the “Artist of the Year” award. The award is given on the recommendation of the Deutsche Bank Global Art Advisory Council, which consists of the renowned curators Okwui Enwezor, Hou Hanru, Udo Kittelmann, and Victoria Noorthoorn. The focus is on artists who have already amassed a substantial oeuvre and have blazed new trails both formally and in terms of content.\nFurther information on Deutsche Bank’s global art program is available at: www.db.com/art",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}