{
    "url": "https://www.db.com/news/detail/20240617-securities-services-and-trust-and-agency-services-shine-at-the-asset-awards?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 17, 2024",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Securities Services and Trust and Agency Services shine at The Asset Awards",
    "body": "Deutsche Bank’s APAC Securities Services and Trust and Agency Services teams took home a total of 28 awards at The Asset’s 2024 Triple A Sustainable Investing Awards last week in Hong Kong. This includes Best Depositary Receipts Bank in APAC, among several other accolades.\nThese recognitions highlight the strength of the bank’s core custody capabilities in key markets like India, Malaysia and the Philippines, as well for bespoke solutions, like its mandate for Shariah-compliant custody with CIMB Securities in Malaysia.\nDeutsche Bank was also recognised for its commitment to digitalisation and innovation. It won the ‘Editors Triple Star Award for Innovation’ for Project Aggie, an application (developed in conjunction with Kodex AI), which helps to simplify regulatory document processes using Artificial Intelligence.\nThe following employees were also recognised:\nTony Chao was named ‘Custodian Banker of the Year’ for Greater China.\nLucy Liu, Tiny Luan, Rachel Ann Oliveros, Kris Serrano, Dilan Jesudason, Daniel Mathews were all named ‘Best Individual in Asset Servicing‘ for their respective markets.\nThe bank’s TAS team won ‘Best Depositary Receipt Mandate of the Year for Asia Pacific’ for its partnership with Lotus Technology, and ‘Best Corporate Trust Mandate of the Year for Securitisation in Hong Kong’ for its partnership with Bauhinia ILBS 1 Limited.\nAnand Rengarajan, Head of Securities Services APAC & MEA and Global Head of Sales said “The breadth of our award wins is testament to the success of our Global Hausbank strategy in Asia Pacific, and our commitment to innovation and client service. We have truly established ourselves as an asset servicing leader across Asia Pacific, and the teams should all be very proud of what they have achieved.”\nDaniel Clark, Head of Trust and Agency Services APAC added: “These deals were highly complex and unique in nature and the successful client outcomes highlight our capability to deliver depositary receipt and corporate trust solutions. We look forward to continuing to support the capital market aspirations of our clients across Asia Pacific.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}