{
    "url": "https://www.db.com/news/detail/20240607-deutsche-bank-collaborates-with-industry-partners-to-launch-paper-on-blockchain-interoperability?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "June 7, 2024",
    "tags": [
        "Asia-Pacific",
        "Digitalisation"
    ],
    "title": "Deutsche Bank collaborates with industry partners to launch paper on blockchain interoperability",
    "body": "Deutsche Bank has joined a group of major financial institutions and Web3 innovators to produce an in-depth paper on how to achieve interoperability for tokenized assets across public and private blockchains and legacy systems.\nPublished today, “Institutional Interoperability: How Financial Institutions Navigate a Multichain World\" addresses how financial institutions can achieve increased accessibility and liquidity for tokenized assets, with flexibility, privacy, transparency and scalability. All the contributors to the paper emphasized the need for interlinked network models that embrace multiple blockchains.\nDeutsche Bank contributed firsthand insights to the paper, describing its experimentation with blockchain and tokenization from an asset servicing perspective. The bank outlines why it believes these technologies can achieve cost effective, efficient and faster value for clients with non-traditional business models. It also discusses why interoperability across blockchains, and with traditional systems, is a necessity and describes its challenges.\nThe paper acts as a road map for financial institutions developing tokenized-asset opportunities and facing a complex array of public and private blockchains, alongside client and regulatory requirements. It was authored by blockchain analyst Emily Parker, based on a framework laid by the Monetary Authority of Singapore’s Project Guardian in 2023. Other contributors to the paper include Citi, Mastercard and Northern Trust, which contributed spotlight sections. Web-3 native innovators Axelar Foundation led production of the report, which also included contributions from Centrifuge and Metrika.\nMultichain asset interoperability and servicing will likely become a necessity for asset servicers as their clients adopt different chains. It will be essential that asset servicers know how to address and service interoperability with scale, while ensuring digital asset safety to enable sustainable growth that multiple chains can amplify.\nAnand Rengarajan, Global Head of Sales & Head of Securities Services APAC, Corporate Bank, Deutsche Bank.\n“Tokenized assets are by nature interoperable, bridging assets recorded on off-chain ledgers with on-chain representations. The question isn’t, how do we facilitate one such connection – it’s how do we facilitate potentially thousands of connections across on-chain and off-chain ledgers, in a way that’s secure, scalable and open,” said Georgios Vlachos, director of Axelar Foundation and co-founder of Axelar protocol.\nContributors will discuss the paper’s findings in a panel event at Point Zero Forum in Zürich, July 1-3. ",
    "number_of_ratings": 3,
    "rating": 4.0,
    "likes": 11
}