{
    "url": "https://www.db.com/news/detail/20240605--volunteering-is-democracy-in-action?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 5, 2024",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "Volunteering is democracy in action",
    "body": "25 social initiatives that help shape our society, promote democratic values and bring people together were honoured at the Federal Chancellery in Berlin on June 4, 2024. They are all finalists in the startsocial competition, which Deutsche Bank has been the main partner of for more than 10 years.   \n\n\nAs patron of startsocial, Federal Chancellor Olaf Scholz thanked the social initiatives and applauded their commitment to social interaction in society. This year, the Chancellor presented his special award to Weilburg erinnert e. V. from Weilburg in Hesse. The charity is committed to an active culture of remembrance and commemoration in memory of the victims of the Nazi regime, or of those who showed themselves to be courageous and resistant against the regime. Weilburg erinnert e. V. works resolutely against racism and antisemitism.\nAlexander von zur Mühlen, Member of the Management Board of Deutsche Bank, honoured the charity Erica's Manna Mobil e. V., which distributes food and promotes community. Every school day, up to 80 young people from more than 60 different countries of origin and different types of school come together in Wiesbaden. They receive a free, hot meal. A 15-year-old guest explains it this way: “If you eat lunch together at the same table, you can no longer fight each other in the playground the next day!” In the past 17 years, 178,000 young guests have benefited from the initiative.\nCelebrating the integration project, von zur Mühlen said:\n“What does growing up in poverty mean? In addition to a lack of social participation, this often also means that there is not enough money for sufficient and healthy food. It’s not just about filling your stomach. Shared meals are an important opportunity to enter into dialogue, express compassion and experience community.”\nUnder the motto Help for Helpers, the nationwide startsocial competition awards 100 four-month scholarships to initiatives that tackle social challenges with the help of volunteers. Together with experts from business, the public sector and non-profits, they work on developing their organisations, projects and ideas. The 25 most convincing initiatives have now been invited to Berlin and seven of them have received awards totalling 35,000 euros to enhance their projects.\nSince 2012, employees of Deutsche Bank have already supported more than 1,300 initiatives in the competition. This year with particular success: three Deutsche Bank colleagues were active as coaches for the winning initiatives and were delighted that their volunteering efforts made a real impact on society.  \nFor the next startsocial competition (in Germany only), social initiatives, charities and projects can still apply for a scholarship until July 10, 2024.",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 8
}