{
    "url": "https://www.db.com/news/detail/20170305-deutsche-bank-intends-to-raise-capital-plans-additional-measures-and-announces-new-financial-targets?language_id=1",
    "language": "EN",
    "article_type": "Ad-hoc Release",
    "publish_date": "March 5, 2017",
    "tags": [
        "Company",
        "Management & Leadership",
        "Strategy"
    ],
    "title": "Deutsche Bank intends to raise capital, plans additional measures and announces new financial targets",
    "body": "  Deutsche Bank AG / Key word(s): Capital Increase/Strategic Company Decision\n05-March-2017 / 16:32 CET/CEST\nDisclosure of an inside information acc. to Article 17 MAR, transmitted by\nDGAP - a service of EQS Group AG.\nThe issuer is solely responsible for the content of this announcement.\n--------------------------------------------------------------------------------\nFrankfurt am Main, 5 March 2017 - Deutsche Bank (XETRA: DBKGn.DE / NYSE:\nDB) intends to increase its capital from the issuance of new shares with\nsubscription rights for existing shareholders with proceeds expected to be\naround EUR 8 billion. Additionally, the Bank plans to take a number of\nadditional measures and is announcing new financial targets.\nStrengthening capital\nDeutsche Bank expects to issue up to 687.5 million new shares with\nsubscription rights to existing shareholders and with the same dividend\nrights as all other outstanding shares. The volume of around EUR 8\nbillion in proceeds is underwritten by a syndicate of banks including\nCredit Suisse, Barclays, Goldman Sachs, BNP Paribas, Commerzbank, HSBC,\nMorgan Stanley, and UniCredit. Deutsche Bank will act as global\ncoordinator and joint bookrunner.\nSubject to approval by the BaFin, a securities prospectus is expected to be\npublished on March 20 2017. The subscription period of the rights is\nexpected to run through April 6 2017.\nUpon completion of the proposed capital raise, the Bank's fully loaded\nDecember 31 2016 pro forma CET1 ratio would be 14,1%, and its pro forma\nleverage ratio 4,1% (Footnote 1).\nAdditional measures\nThe Bank plans a series of additional actions and sets new financial\ntargets that replace the existing targets originally announced in October\n2015. These additional measures are intended to strengthen the Bank's\nstatus as a leading European bank with a global reach supported by its\nstrong home base in Germany. The Bank intends to continue serving the\nneeds of its clients across transaction banking, corporate finance, capital\nmarkets, asset management, wealth management and retail banking.\nThe planned measures include:\n— Retention of Postbank and over time integration with the Bank's existing\nGerman private and commercial banking and wealth management businesses\n— Reconfiguration of the existing Global Markets, Corporate Finance and\nTransaction Banking businesses into a single division, Corporate &\nInvestment Bank (CIB), a corporate client led investment bank\n— Disposal and run off of an identified pool of legacy assets within Global\nMarkets (approximately EUR 20 billion of Risk Weighted Assets (RWA)\nexcluding operational risk and EUR 60 billion of leverage exposure), that\nis currently estimated to represent a negative impact on the new CIB's\ncurrent post-tax return on tangible equity (RoTE) of approximately 200\nbasis points per annum\n— The legacy assets pool will be managed separately and is targeted to be\nreduced to approximately EUR 12 billion of RWA excluding operational risk\nand EUR 31 billion of CRD4 leverage exposure by 2020; the reduction will be\naccelerated whenever economically feasible\n— Sale of a minority stake in Deutsche Asset Management (Deutsche AM) via\nan initial public offering (IPO) over the next 24 months\n— Dispose of businesses with identified RWA of approximately EUR 10 billion\n(excluding related operational risk) and approximately EUR 30 billion in\nleverage exposure, with a majority of the disposals expected to be\ncompleted in the next 18 months\n— The business disposals and the proposed minority IPO in Deutsche AM are\nexpected to create up to EUR 2 billion of additional capital accretion\n— Severance and restructuring costs resulting from the planned measures are\nestimated to be approximately EUR 2 billion over the period 2017-2021 with\napproximately 70% to be incurred over the next two years; all other\nspending related to these measures will be included in Adjusted Costs\n(Footnote 2)\nNew financial targets\n— 2018 Adjusted Costs of approximately EUR 22 billion and a further\nreduction to approximately EUR 21 billion by 2021, both include Postbank's\nAdjusted Costs\n— Post-tax RoTE of approximately 10% in a normalized operating environment\n— Targeting a competitive dividend payout ratio for fiscal year 2018 and\nthereafter\n— Fully loaded CET1 ratio to be comfortably above 13%\n— Leverage ratio of 4.5%\nAdditionally, the Management Board has approved payment of the AT1 interest\ncoupons coming due in 2017 and intends to propose at the Annual General\nMeeting in May 2017 to pay a dividend of EUR 0.19 per share, including the\nshares to be issued in the announced capital raise. The dividend to be paid\nout of Deutsche Bank AG's distributable profit for 2016 contains a\ncomponent reflecting the distributable profit carried forward from 2015 of\napproximately EUR 165 million, and EUR 0.11 per share out of the\ndistributable profit for 2016. The aggregate amount of these proposed\ndividends is approximately EUR 400 million. Additionally, the Bank would\nexpect to recommend at least the payment of a minimum dividend of EUR 0.11\nper share for 2017.\nCurrent trading\nDeutsche Bank has made a positive start in the first two trading months of\n2017 (Footnote 3).\n* Global Markets has performed strongly against a weaker comparable period\nin 2016 with Debt Sales & Trading revenues up over 30% while Equities Sales\n& Trading was flat year on year.\n* Corporate Finance year to date performance was strong with revenues up\nover 15% year on year reflecting positive momentum in primary markets that\ndrove significant increases in debt and equity issuance.\n* Global Transaction Banking saw resilience in its client franchise, but\nsingle digit lower revenue performance in a macro environment that remains\nchallenging and from the consequences of intentional reductions in client\nperimeter during 2016.\n* In Private Wealth & Commercial Clients (PW&CC), revenues were flat versus\nthe comparable period in 2016 as the impact of low interest rates was\nmainly offset by positive developments in investment products supported by\nasset and deposit inflows.\n* In Postbank, operating performance was flat, but reported revenues were\nslightly down given the absence of one-off gains in the prior year and\nweaker hedging results.\n* Deutsche Asset Management had a modest improvement in revenues as well as\nthe reversal of negative asset flows seen in 2016.\nFootnotes:\n(1) Assumes capital raise of EUR 7.9 billion net of transaction costs and\nincluding associated impacts on reported 2016 CET1 capital of EUR 42.7\nbillion, RWA of EUR 358 billion and leverage exposure of EUR 1,348 billion.\nCapital accretion (through a combination of RWA reduction and capital\ncontribution) from Deutsche AM minority IPO and proposed disposals not\nincluded in pro-forma capital levels.\n(2) Adjusted Costs defined as total noninterest expense under IFRS,\nexcluding costs related to restructuring & severance, litigation,\nimpairment of goodwill and other intangibles.\n(3) Commentary on performance based on end-Feb 2017 financials compared to\nend-Feb 2016 financials and excluding material disposals in 2016 (Abbey\nLife, PCS, Hua Xia) and Funding Valuation Adjustment (FVA), Debt Valuation\nAdjustment (DVA), Credit Valuation Adjustment (CVA).\nAn analyst event will take place tomorrow, March 6, at 14:00 GMT in London\nto detail these actions and updated targets.\n\nContact:\nMonika Schaller\nGlobal Head External Communications\nPhone: +49 69 910 48098\ne-mail: monika.schaller@db.com\n  _________________________________________________________________\nDeutsche Bank AG\nTaunusanlage 12\n60325 Frankfurt am Main\nGermany\nISIN: DE0005140008\nWKN: 514000\nListed: Regulated market in Berlin-Bremen, Duesseldorf, Frankfurt (Prime Standard), Hamburg, Hanover, Munich und Stuttgart; EUREX; NYSE\nThe International Securities Identification Numbers (ISINs) of further financial instruments issued by Deutsche Bank AG, and admitted to trading on a domestic organized market or for which such admission has been applied for, are available on Deutsche Bank’s Investor Relations website under https://www.db.com/ir/ .\nIMPORTANT NOTICE\nForward-looking statements contain risks\nThis press release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations. Any statement in this release that states our intentions, beliefs, expectations or predictions (and the assumptions underlying them) is a forward-looking statement. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement. Such factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our trading revenues, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission (SEC). Such factors are described in our SEC Form 20-F of March 11, 2016 on pages 13 through 40 under the heading “Risk Factors.” Copies of this document are readily available upon request or can be downloaded from www.db.com/ir. This release also contains non-IFRS financial measures. For a reconciliation to directly comparable figures reported under IFRS, refer to the 4Q/FY2016 Financial Data Supplement, which is available at www.db.com/ir.\nFor readers in the European Economic Area\nThis release does not constitute an offer to sell, or the solicitation of an offer to buy or subscribe for, any securities of Deutsche Bank AG. This document does not constitute a prospectus within the meaning of the EC Directive 2003/71/EC of the European Parliament and Council dated 4 November 2003, as amended (the “Prospectus Directive”). The public offer in Germany and the United Kingdom will be made solely by means of, and on the basis of, a securities prospectus which is to be published following its approval by the German Federal Financial Supervisory Authority (BaFin). Any investment decision regarding any subscription rights or shares should only be made on the basis of the prospectus which will be published after its approval and will be available for download on the internet site of Deutsche Bank AG (www.db.com/ir). Copies of the prospectus will also be readily available upon request and free of charge at Deutsche Bank AG, Taunusanlage 12, 60325 Frankfurt am Main, Germany.\nIn any Member State of the European Economic Area that has implemented the Prospectus Directive (other than Germany or the United Kingdom) this communication is only addressed to, and directed at, qualified investors in that Member State within the meaning of the Prospectus Directive.\nFor readers in the United Kingdom\nThis communication is only being distributed to, and is only directed at, (i) persons who are outside the United Kingdom or (ii) investment professionals falling within Article 19(5) of the Financial Services and Markets Act 2000 (Financial Promotion) Order 2005 (the “Order”) or (iii) high net worth companies falling within Article 49(2)(a) to (d) of the Order, or (iv) other persons to whom it may lawfully be communicated, (all such persons together being referred to as “relevant persons”). The new shares are only available to, and any invitation, offer or agreement to subscribe for, purchase or otherwise acquire such new shares will be engaged in only with, relevant persons. Any person who is not a relevant person should not act or rely on this document or any of its contents.\nFor readers in the US\nDeutsche Bank has filed a registration statement (including a prospectus) with the U.S. Securities and Exchange Commission (the “SEC”) for the offering to which this communication relates. Before you invest, you should read the prospectus in that registration statement, the supplement to that prospectus Deutsche Bank expects to file with the SEC and other documents Deutsche Bank has filed and will file with the SEC for more complete information about Deutsche Bank and this offering. You may get these documents, once filed, free of charge by visiting EDGAR on the SEC Web site at www.sec.gov. Alternatively, Deutsche Bank, any underwriter or any dealer participating in the offering will arrange to send you the prospectus after filing if you request it by calling Deutsche Bank at +49 69 910-35395\nFor readers in Canada\nDeutsche Bank intends to make the offering to which this communication relates in Canada pursuant to a Canadian offering memorandum filed with the Canadian securities regulatory authorities under an exemption from the requirement to file a prospectus in Canada. Before you invest, you should read the Canadian offering memorandum and other documents Deutsche Bank has filed and will file with the Canadian securities regulatory authorities for more complete information about Deutsche Bank and this offering. You may get these documents, once filed, free of charge by visiting SEDAR at www.sedar.com. Alternatively, Deutsche Bank will arrange to send you the Canadian offering memorandum after filing if you request it by calling Deutsche Bank at +49 69 910-35395.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}