{
    "url": "https://www.db.com/news/detail/20170303-deutsche-bank-opens-new-zig-zag-office-for-deutsche-asset-management-and-wealth-management-employees-in-london?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 3, 2017",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank opens new Zig Zag office for Deutsche Asset Management and Wealth Management employees in London",
    "body": "Deutsche Bank’s London-based Asset Management and Wealth Management employees started their relocation this week to the state-of-the-art Zig Zag building in Victoria, London SW1.\nThe move will provide employees with more modern facilities, bring the businesses closer to many of their clients and enable more efficient working practices.\n“This building represents a significant investment in the future of our business and a vote of confidence by the leadership of the bank,” said Fabrizio Campelli, Global Head of Deutsche Bank Wealth Management. “It should also mark a step change in how we work together and an exciting new chapter for the future of our business.”\nYves Dermaux, Head of Deutsche Asset Management UK, added: “Set in the heart of Victoria, the Zig Zag building provides an environment that encourages efficiency and supports collaboration between our staff. Our new home represents an important milestone in Deutsche Asset Management's growth strategy.\"\nDeutsche Bank signed a 15-year lease in November 2015 for the two businesses to occupy six floors of the Zig Zag building. Deutsche Asset Management and Wealth Management employees will gradually relocate from Pinner’s Hall to the new office in Victoria over the coming weeks.\nThe new office space is 92,000 square feet in total and has been designed in partnership with employees to provide a more inspirational work space.\nKey features include:\nA range of working zones, which offer greater flexibility for employees, from think tanks to collaboration areas.\nA tech lounge, where employees can drop in to receive face-to-face support.\nMeeting rooms with state-of-the-art audio visual technology.\nContemporary client-meeting spaces, designed to offer maximum comfort and privacy.\nThe Terrace Café, offering employees a range of hot and cold food and drinks, which can also be enjoyed from a stunning roof terrace.\nCreative artworks on all floors from the Deutsche Bank Collection. The Deutsche AM working floors embrace the themes of Landscape and City, while the Wealth Management working floor has a scientific theme. Client-facing areas showcase well-known British artists, while the Terrace Café showcases a garden theme.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}