{
    "url": "https://www.db.com/news/detail/20170429-james-von-moltke-appointed-as-new-cfo-of-deutsche-bank?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 29, 2017",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "James von Moltke appointed as new CFO of Deutsche Bank",
    "body": "Deutsche Bank’s Supervisory Board has appointed James von Moltke as Chief Financial Officer and Member of the Management Board. He joins from Citigroup, where he served as Treasurer, and is expected to assume his new responsibilities at Deutsche Bank in July.\nVon Moltke, 48, succeeds Marcus Schenck, who was appointed Deutsche Bank’s Co-President in early March and who, as previously announced, will oversee the bank’s newly created Corporate & Investment Bank together with Garth Ritchie from July.\nVon Moltke was born in Heidelberg, Germany, and is a dual citizen of Germany and Australia.\nFollowing his studies at Oxford, he started his career at Credit Suisse First Boston in London 25 years ago. In 1995, he joined J.P. Morgan, working at the bank for 10 years in New York and Hong Kong and becoming a recognised specialist in advisory for financial services companies.\nAfter next working at Morgan Stanley for four years, where he led the Financial Technology advisory team globally, von Moltke joined Citigroup as Head of Corporate M&A in 2009. Three years later he became Global Head of Financial Planning and Analysis. In 2015, he was appointed Treasurer of Citigroup, managing its capital and funding as well as liquidity and interest rate risk. In these roles, von Moltke made significant contributions to Citigroup’s restructuring following the global financial crisis.\nPaul Achleitner, Chairman of Deutsche Bank’s Supervisory Board, said: “We are delighted to have such a well-regarded banker joining Deutsche Bank. Throughout his career, James von Moltke has proven in different roles that he can execute strategic and operational agendas. I thank Marcus Schenck for his excellent work as CFO and wish him success in his new role in our important Corporate & Investment Bank.”\nJohn Cryan, CEO of Deutsche Bank, praised the new CFO, who will be based in Frankfurt, as having deep expertise in the financial services sector. “His widespread experience in strategic planning and proven success in reshaping a multinational financial services company, will help us to reduce the complexity of our bank further and to achieve our ambitious targets.”\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nDisclaimer:\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 20 March 2017 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}