{
    "url": "https://www.db.com/news/detail/20170426-angela-merkel-christine-lagarde-ivanka-trump-and-sylvie-matherat-debate-female-leadership?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 26, 2017",
    "tags": [
        "Company",
        "Diversity",
        "Management & Leadership"
    ],
    "title": "Angela Merkel, Christine Lagarde, Ivanka Trump and Sylvie Matherat debate female leadership",
    "body": "Angela Merkel, Ivanka Trump and Christine Lagarde were among many influential women who attended a gala reception as part of the Women 20 (W20) conference at Deutsche Bank's Representative Office in Berlin on Tuesday evening.\nFor Chancellor Merkel it was an opportunity to discuss with other women in key positions how women can assume more responsibility. She was joined at her table by Lagarde, Managing Director of the International Monetary Fund, Trump, First Daughter and Advisor to the President of the United States of America, and Sylvie Matherat, Chief Regulatory Officer and Member of the Management Board of Deutsche Bank. The 200 guests also included the German Federal Minister of Family Affairs, Manuela Schwesig, and Chrystia Freeland, the Canadian Minister for Foreign Affairs.\nIn her opening speech, Matherat emphasised the importance of gender diversity for economic success: “The economic effect is clear: mixed teams take companies to another level – and enable increased growth and prosperity.”\nDeutsche Bank has achieved much in this area: seven of the 20 members of the Supervisory Board are female and for the first time in the bank's history, there are two women on the Management Board. The proportion of women in management positions at the bank has been rising steadily for many years. “We are proud of diversity at Deutsche Bank and want to continue down this path,” said Matherat.\nThe dinner was held as part of the two-day W20 conference in Berlin. The W20 unites leading female figures from around the globe who develop political proposals for the G20 – the international forum for the governments of 20 major economies. Germany currently holds the presidency of the G20.\nThe W20 summit is jointly organised by the Association of German Women Entrepreneurs (Verband deutscher Unternehmerinnen – VdU), a long-standing partner of Deutsche Bank, and the National Council of German Women’s Organisations (Deutscher Frauenrat) Deutsche Bank not only supports the W20, but also B20 (Business 20), which represents the G20 business community. CEO John Cryan is the Co-Chairman of the B20 working group on Financing Growth and Infrastructure.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}