{
    "url": "https://www.db.com/news/detail/20170425-four-girls-go-for-gold-in-robotics?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 25, 2017",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "Four girls go for gold in robotics",
    "body": "Sanjana, Beatrice, Hannah and Angelette from the Henrietta Barnett School formed a team at the school’s robotics club, engineered their own robot and made their way through a series of regional competitions and the UK national championship to the world final.\nThe team will represent the UK at the Vex IQ Challenge for middle schools from April 23-25 in Louisville, Kentucky, US. Teams from over 30 countries are tasked with designing and building a robot to play against other teams in a game-based engineering challenge.\nDeutsche Bank’s Chief Data Office and Innovation team, headed by JP Rangaswami, were eager to support the team as a sponsor. “Encouraging these young engineers perfectly aligns with the bank’s diversity aims of encouraging more women to make their way into the areas of science, technology, engineering and mathematics (STEM),” commented Rangaswami. Competitive robotics not only encompasses all four pillars of STEM education, but also encourages important life skills like teamwork and communication.\nIn the following interview the team talk about their motivation, experiences and future plans.\nWhy do you like robotics and what motivated you to enter this competition?\nWe share a common passion for science and technology, so we joined the school’s robotics club which involves building and testing the robots, writing code, designing on Computer Aided Design software and practising for the challenges.\nTell us about your journey, how did you make it into the final?\nA series of regional competitions, followed by the UK final, involved multiple challenges like driver skills, a teamwork challenge, as well as a STEM project around the theme robotic technology in the community.\nWe needed to score as many points as possible in every challenge to move higher on the leader board. We were delighted to receive the Excellence Award in the earlier stages of the competition and we also broke the UK national record twice! The Excellence Award gave us an automatic place in the world final.\n\nThe girls on their way to the world final in Louisville, Kentucky, US\nCould you tell us something about your robot?\nOur robot design is quite different to many of the others we have come across. It incorporates a ramp and claw, designed to pick up four \"hexballs\" and slot them into goals.\nIn the teamwork challenge, two robots work together whereas in the robot skills challenge, one robot takes the field. The robots are entirely driver controlled through our programming skills.\nWhat do you like about STEM subjects? Do you have any career aspirations?\nSanjana: I would like to be a genetic engineer because to understand the complexity of our DNA and to possibly improve the human race seems so thrilling. STEM subjects pervade almost every part of our lives and definitely the future of robotics and artificial intelligence.\nBeatrice: I think that the world is run by mathematics and science. Every person, no matter their gender or economic background, should be able to play a part in the running of our world and one of the ways is through STEM. Robots are the future and I want to stay a part of that, especially since I want to be a politician or an economist in the future.\nAngelette: I would like to go into medicine because I think helping people and saving lives is a lovely thing to do. At the same time, with biology and chemistry there's always something new to be discovered.\nHannah: I like STEM subjects because they help people. Lifesaving treatments such as kidney transplants or radiotherapy just wouldn't exist without STEM experts, which is why I would like to be a neurosurgeon.\nWhat would you say to other young people to encourage them to get involved in technology?\nThe world needs the students of today to become the scientists, engineers, and problem-solving leaders of tomorrow. Science constantly presents us with new breakthroughs and challenges, creating greater opportunities for problem-solving through technology.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}