{
    "url": "https://www.db.com/news/detail/20170424-french-presidential-elections?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 24, 2017",
    "tags": [
        "Capital markets",
        "Investment Banking"
    ],
    "title": "French Presidential Elections",
    "body": "“The results from the first round of vote counting strengthen our confidence that, from this summer, France will have a president in favour of reforms for the first time.” said Stefan Kreuzkamp, Chief Investment Officer with Deutsche Asset Management.\n“Even though this is what we thought the outcome would be, we are still relieved that this election is very different to the previous one and yet is more unpredictable. However, to this result I say: Vive la France, Europe lives on! And European equities as well, which we have upgraded to over-weight after yesterday’s results.”\n“We have been convinced by the macro-economic environment and the profits dynamism shown by European companies for some time now. Having said that, in our view political uncertainties have deterred foreign investors in particular from increasing their commitments in Europe. After the elections in the Netherlands and Austria, coupled with AfD’s falling poll ratings in Germany, the first ballot in France suggests that the populists have been losing considerable ground in 2017. Despite all the challenges that still lie ahead, at the end of this year Europe could be much more stable than it was in January.”\n“Looking at France our optimism is a bit muted. A lot depends on the outcome of the parliamentary election and how this outcome supports Macron’s mandate. So far he can neither rely on an own party or vast political experience. This means that with his presidency France is also entering unchartered territory.”\nDeutsche Asset Management\nWith about EUR 706 billion of assets under management (as of December 31, 2016), Deutsche Asset Management¹ is one of the world’s leading investment management organizations. Deutsche Asset Management offers individuals and institutions traditional and alternative investments across all major asset classes.\n¹ Deutsche Asset Management is the brand name of the Asset Management division of the Deutsche Bank Group. The respective legal entities offering products or services under the Deutsche Asset Management brand are specified in the respective contracts, sales materials and other product information documents.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}