{
    "url": "https://www.db.com/news/detail/20170407-deutsche-bank-successfully-completes-capital-increase?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 7, 2017",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank successfully completes capital increase",
    "body": "Deutsche Bank AG (XETRA: DBKGn.DE / NYSE: DB) has successfully completed the capital increase from authorized capital against cash contributions it announced on 5 March 2017. The number of no par value shares of Deutsche Bank AG has increased by 687.5 million, from 1,379.3 million to 2,066.8 million through the public offering of new shares via subscription rights. The gross proceeds amount to approximately EUR 8.0 billion. The subscription price was 11.65 euros per share. 98.9 per cent of the subscription rights were exercised. The remaining new shares that were not subscribed will be sold in the market.\nHad the capital increase been completed on 31 December 2016, Deutsche Bank’s Common Equity Tier 1 (CET1) ratio on that date would have been 14.1% on a pro forma CRD4 fully loaded basis rather than 11.8%. Including the capital increase, the pro forma CRD4 fully loaded leverage ratio at year end of 2016 would have been 4.1% rather than 3.5%.\nCommencing Friday, 7 April 2017, the new shares are included in the existing listing of Deutsche Bank shares on the German stock exchanges and on the New York Stock Exchange.\n  IMPORTANT NOTICE\nFor readers in the European Economic Area\nThis release does not constitute an offer to sell, or the solicitation of an offer to buy or subscribe for, any securities of Deutsche Bank AG. This document does not constitute a prospectus within the meaning of the EC Directive 2003/71/EC of the European Parliament and Council dated 4 November 2003, as amended (the “Prospectus Directive”).\nThe public offer in Germany and the United Kingdom will be made solely by means of, and on the basis of, a securities prospectus which was published following its approval by the German Federal Financial Supervisory Authority (BaFin).\nAny investment decision regarding any subscription rights or shares should only be made on the basis of such prospectus which is available for download on the internet site of Deutsche Bank AG (www.db.com/ir). Copies of the prospectus are also readily available upon request and free of charge at Deutsche Bank AG, Taunusanlage 12, 60325 Frankfurt am Main, Germany.\nIn any Member State of the European Economic Area that has implemented the Prospectus Directive (other than Germany or the United Kingdom) this communication is only addressed to, and directed at, qualified investors in that Member State within the meaning of the Prospectus Directive.\nStabilization\nIn connection with the offering of the New Shares, Credit Suisse Securities (Europe) Limited will be acting as the stabilization manager and it (or one of its affiliates) may take stabilization measures aimed at supporting the market price of the shares of Deutsche Bank AG in order to offset any existing selling pressure in such shares (stabilization measures).\nThe stabilization manager has no obligation to undertake stabilization measures. Accordingly, it cannot be guaranteed that stabilization measures will be taken at all. If stabilization measures are taken, they may be discontinued at any time without prior announcement. Such stabilization measures may be taken on the Frankfurt Stock Exchange (Frankfurter Wertpapierbörse) or the New York Stock Exchange as from the date of the publication of the Subscription Offer and must cease at the latest on the 30th calendar day following expiration of the subscription period, expected to be May 6, 2017 (stabilization period).\nStabilization measures may result in a (quoted) market price of the shares of the Company that is higher than would be the case in the absence of such measures. Furthermore, the (quoted) market price may temporarily reach a level that is not sustainable.\nFor readers in the United Kingdom\nThis communication is only being distributed to, and is only directed at, (i) persons who are outside the United Kingdom or (ii) investment professionals falling within Article 19(5) of the Financial Services and Markets Act 2000 (Financial Promotion) Order 2005 (the “Order”) or (iii) high net worth companies falling within Article 49(2)(a) to (d) of the Order, or (iv) other persons to whom it may lawfully be communicated, (all such persons together being referred to as “relevant persons”).\nThe new shares are only available to, and any invitation, offer or agreement to subscribe for, purchase or otherwise acquire such new shares will be engaged in only with, relevant persons. Any person who is not a relevant person should not act or rely on this document or any of its contents.\nFor readers in the US\nDeutsche Bank has filed a registration statement (including a prospectus) with the U.S. Securities and Exchange Commission (the “SEC”) for the offering to which this communication relates. Before you invest, you should read the prospectus in that registration statement, the supplement to that prospectus Deutsche Bank has filed with the SEC and other documents Deutsche Bank has filed and will file with the SEC for more complete information about Deutsche Bank and this offering.\nYou may get these documents free of charge by visiting EDGAR on the SEC Web site at www.sec.gov. Alternatively, Deutsche Bank, any underwriter or any dealer participating in the offering will arrange to send you the prospectus if you request it by calling Deutsche Bank at +49 69 910-35395.\nFor readers in Canada\nDeutsche Bank intends to make the offering to which this communication relates in Canada pursuant to a Canadian offering memorandum filed with the Canadian securities regulatory authorities under an exemption from the requirement to file a prospectus in Canada. Before you invest, you should read the Canadian offering memorandum and other documents Deutsche Bank has filed and will file with the Canadian securities regulatory authorities for more complete information about Deutsche Bank and this offering.\nYou may get these documents free of charge by visiting SEDAR at www.sedar.com. Alternatively, Deutsche Bank will arrange to send you the Canadian offering memorandum after filing if you request it by calling Deutsche Bank at +49 69 910-35395.\nNot for publication in Australia or Japan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}