{
    "url": "https://www.db.com/news/detail/20170407-a-message-from-john-cryan-to-all-employees?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 7, 2017",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "A message from John Cryan to all employees",
    "body": "Dear Colleagues,\nSome of my messages in recent months have started off rather sombre by looking back on difficult periods. This time, things are different. The past few weeks have been challenging – but in a good way. This is because we met many investors following our capital increase announcement at the start of March. You get nothing for free in these discussions – anyone entrusting us with fresh capital examines every detail closely.\nNevertheless, we returned feeling positive. The capital increase has now been completed and the majority of our shareholders support our course. 98.9 per cent of the subscription rights were exercised and the remaining new shares will be sold in the market. Our investors are confident that we are now in a stronger position to work with our clients and continue on our strategy. This confidence should be an incentive for us all.\nOf course, there were regional differences. While many investors and analysts in Europe are still sceptical about the banking sector in general, and us specifically, our US investors are more positive. They have seen first-hand how well banks are recovering in their home market and how profitable they can be. They expect us to turn the corner too.\nIt is clear that the US will continue to play an important role for our bank. This is where economic growth is particularly dynamic and margins for banks remain high. In global terms, the US market accounts for half of the revenue pool in the financing and capital markets. This is why our integrated Corporate & Investment Bank, whose new structure is taking shape – Garth Ritchie and Marcus Schenck have already appointed their management teams – has, and will retain, a strong presence there. Wealth Management and Asset Management are also set to benefit from the attractive US market. My town hall in New York and meeting newly-promoted Managing Directors there last week strengthened my confidence in this regard.\nHowever, I am also optimistic about the markets in Asia and Europe. In particular, in our home of Germany, where we stand by our customers as they grow – companies and individuals, who have been our partners for generations, are performing well. In Germany, we provide banking services for over 20 million people and companies. Working groups, led by our two Private & Commercial Banking heads Christian Sewing and Frank Strauss, have already started to plan the integration of Postbank with Deutsche Bank.\nSo our perspective has become much clearer: we know we have to reduce costs further – and we have demonstrated already that we are on the right path. On the other hand, our capital increase should eliminate any remaining doubt about Deutsche Bank’s stability. This is why it’s even more important to focus on a topic that has been in the background for quite some time: growth.\nThanks to a stronger balance sheet, we have the ability to increase business. We will be able to grow again in a more focused way. After all, it is clear that we will not succeed by shrinking further, rather we have to work together successfully with our clients – without losing sight of costs, controls and potential risks. None of us want to generate revenues that will need to be paid back in future, for example due to litigation costs. None of us want to experience a multi-billion dollar request arising from this ever again.\nPrudent growth should be our byword going forward. Now I would like to wish those of you who will be taking advantage of the upcoming break a relaxing time, and continued success to everyone working over this period.\n  With best wishes,\nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}