{
    "url": "https://www.db.com/news/detail/20170406-john-cryan-europe-needs-a-counterweight-to-the-us-capital-market-machine?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 6, 2017",
    "tags": [
        "Corporate products"
    ],
    "title": "John Cryan: “Europe needs a counterweight to the US capital market machine”",
    "body": "John Cryan, Deutsche Bank’s CEO, provided his support for a Capital Markets Union in Europe during a panel discussion at the recent German Banking Congress in Berlin. “It is important that Europe builds a counterweight to the US capital market machine,” said Cryan.\nDespite the progress made over 50 years, Europe’s capital markets remain underdeveloped and fragmented. The panel, which included the Vice President of the European Commission, Valdis Dombrovskis, the Frankfurt-based finance professor Jan Pieter Krahnen and Elke Koenig, Chairwoman of The Single Resolution Board, debated how the region could establish a single market for financial services to boost Europe’s economy and stimulate investment.\nDespite Brexit, Cryan said he remains “optimistic” about the project “but there is an awful lot of work to do”. The benefits of succeeding make the effort worthwhile however, with Cryan stating that “Capital Markets Union will stimulate investment in small and midsize companies and make the financial system more stable.”\nWhen compared to the US, Cryan said prices for banking products in Europe are “very low” and so “we need to be even better and more efficient”. With the failed merger between Deutsche Börse and the London Stock Exchange still fresh in the memory, Cryan asserted that “Europe needs a trading venue” or risk seeing “American capital markets dominance develop further.”\nCryan warned that there are still too many banks in Europe. But even though he expects the sector to consolidate, Deutsche Bank’s stance is clear. “We are not thinking about it. There are plenty of other things to think about.”\nThe conference, organised every three years by the Association of German Banks (Bundesverband deutscher Banken – BdB), is one of the most important banking industry events in Germany. Some 700 guests attended the event at the BCC Congress Centre on Berlin's Alexanderplatz. Cryan is a deputy president of the BdB.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}