{
    "url": "https://www.db.com/news/detail/20170405-deutsche-bank-brings-mobile-payments-to-germany-the-smartphone-as-a-wallet?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 5, 2017",
    "tags": [
        "Corporate products",
        "Digitalisation",
        "Private products",
        "Research"
    ],
    "title": "Deutsche Bank brings mobile payments to Germany: The smartphone as a wallet",
    "body": "Easy, contactless mobile payments have arrived in Germany. From April 5, 2017, Deutsche Bank customers will now be able to use their smartphones to make purchases. Deutsche Bank has become the first bank to offer mobile payments in Germany via its “Deutsche Bank Mobile” app to Android device users enabled with Near Field Communication (NFC).\nThe procedure is as follows. The customer's Deutsche Bank Mastercard is displayed automatically in the app; no need to order a new credit card or to replace the smartphone's SIM card. In just two simple steps the payment function can be activated and then used immediately. Customers who have the app loaded on their Android smartphone (version 4.4 and above) can make cashless payments worldwide at six million Mastercard acceptance points.\n“Paying by smartphone is already commonplace in Asia, North America and many European countries such as the UK and Italy. We are convinced that it will also become established in Germany. From today, all our clients with an Android smartphone and a Deutsche Bank Mastercard can make mobile payments very easily,” says Jan Lisaus, Head of Cards and Payment Systems for private and commercial clients of Deutsche Bank.\nArne Pache, Head of Digital Payments and Labs Central Europe of Mastercard, added: “The Deutsche Bank mobile payment solution provides consumers with a simple, straightforward and safe way to make purchases at every location where contactless Mastercards are accepted by merchants – in Germany and the rest of the world. From 2018, contactless payments will be possible at all Mastercard acceptance points in Germany.”\nPayments of up to 25 euros without a PIN\nFor payments of up to 25 euros in Germany the customer only has to unlock his smartphone and hold it next to the point-of-sale (POS) terminal. Payment is then registered automatically and the Mastercard is charged. The whole payment process is encrypted. No card information is transmitted during the process. For amounts exceeding 25 euros the customer has to enter the PIN of the respective Mastercard at the merchant's POS terminal similar to standard credit card payments. Confirmation of payment is displayed immediately. The customer is also informed via their smartphone that a payment has been made.\nVirtual wallet: simpler and safer than cash or credit card\nWhen a customer activates a Mastercard for mobile payment, a copy of the card is displayed in the app. In addition, the customer's smartphone stores ten unique numbers, or tokens, each of which validates one payment. This provides customers with additional security: for each payment only the token and its expiry date are required, but not the confidential credit card information. During the payment process, the token is transmitted together with the expiry date in a standardised encrypted form to the POS terminal. The tokens are available even if the smartphone has no access to a mobile network or the internet. When all the tokens have been used, the next batch of ten is loaded automatically when the customer next logs on to the app via the internet.\nThis ensures that users and merchants receive the same security, guarantees and additional services for each Mastercard purchase a Deutsche Bank customer makes via a smartphone as for every other Mastercard transaction.\nRequirements for mobile payment\nIn order to make a mobile payment the customer requires an NFC-enabled smartphone that runs on Android 4.4 and above. The Deutsche Bank Mobile app must also be installed on the customer's smartphone. In the app the customer selects the “mobile payment” function, accepts the conditions of use, and confirms the intended Mastercard credit or debit card as the means of payment by entering a one-time authorisation number – only then is the function activated. Unlike other contactless payment procedures, the in-app embedding of this mobile payment facility means that customers are not tied to a specific network provider. In Germany the function will first be available exclusively to customers with Android smartphones, which make up 75 percent of the market, according to Statista.\nFor further information, please contact:\nDeutsche Bank AG\nPress and Media Relations\nChristoph Blumenthal\nTel.: +49 (0)69 910 47048\nEmail: christoph.blumenthal@db.com\nMarkus Weik\nTel.: +49 (0)69 910 41349\nE-mail: markus.weik@db.com\nMastercard Europe SA\nJuliane Wolff\nTel.: +49 (0)172 1880720\nE-Mail: juliane.wolff@mastercard.com\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nAbout MasterCard\nMastercard (NYSE: MA), www.mastercard.com, is a technology company in the global payments industry. We operate the world’s fastest payments processing network, connecting consumers, financial institutions, merchants, governments and businesses in more than 210 countries and territories. Mastercard’s products and solutions make everyday commerce activities – such as shopping, traveling, running a business and managing finances – easier, more secure and more efficient for everyone.",
    "number_of_ratings": 3,
    "rating": 2.7,
    "likes": 1
}