{
    "url": "https://www.db.com/news/detail/20170404-deutsche-bank-acquires-stake-in-fintech-trustbills?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 4, 2017",
    "tags": [
        "Company",
        "Corporate products",
        "Digitalisation",
        "Entrepreneurship",
        "Investment Banking",
        "Research"
    ],
    "title": "Deutsche Bank acquires stake in FinTech TrustBills",
    "body": "Deutsche Bank AG today announced the acquisition of a 12.5 percent share interest in the receivables auction platform TrustBills. Founded in 2015, the Germany based FinTech TrustBills is an electronic True Sale marketplace for national and international trade receivables. TrustBill’s goal is to become an international receivables market place for companies of all sizes. Terms of the agreement are not being disclosed. Deutsche Bank’s investment follows an earlier investment by DZ BANK AG in 2016.\n\nCommenting on the investment, Michael Spiegel, Head of Global Transaction Banking Germany, Deutsche Bank, said: “Advancements in technology will significantly change the trade finance market. The digital solution offered by TrustBills is an excellent add-on to our value proposition in corporate banking.\n\nJoerg Hoerster, Founder and CEO of TrustBills said: “We are very pleased that Deutsche Bank invests in TrustBills. Deutsche Bank’s position as one of the world’s largest trade finance banks will provide a great basis for the international roll out of TrustBills.”\n\nAbout TrustBills\nTrust Bills is a FinTech company established in 2015 and based in Hamburg, Germany. Based on a digital auction platform, TrustBills offers a fast and easy to operate global market place for trade receivables. The founder of TrustBills is the business consultancy Maravon GmbH who specialises in digitalisation of banking business models and financial market places.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 32
}