{
    "url": "https://www.db.com/news/detail/20190812-deutsche-bank-pledges-its-support-to-the-uluru-statement-from-the-heart?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "August 12, 2019",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank pledges its support to the Uluru Statement from the Heart",
    "body": "Deutsche Bank in Australia has joined a growing number of organisations pledging support to the Uluru Statement from the Heart.\nIssued in May 2017 at an Indigenous leaders’ summit, the Uluru Statement from the Heart demands a “First Nations Voice” that would be enshrined in the Australian constitution.\nAccording to the statement, it promotes the rights of: “Our Aboriginal and Torres Strait Islander tribes were the first sovereign Nations of the Australian continent and its adjacent islands, and possessed it under our own laws and customs…more than 60,000 years ago.”\nAustralia CEO Anthony Miller said: “We believe that as a foreign bank operating in Australia we have a responsibility to take a leadership position on matters that impact the society in which we operate. It takes voices from all corners of society, including businesses likes ours, to drive momentum and achieve real change. That’s why we are joining many of our peers and clients in pledging our support.”\nThe Uluru Statement demands three key reforms:\nVoice: a constitutionally-enshrined Indigenous Voice to advise parliaments on policies, laws and programs aimed at closing the gap between Indigenous and non-Indigenous Australians. This requires a referendum to succeed.\nTreaty: the establishment of a Makaratta Commission to guide the process of striking treaty agreements between governments and First Nations, similar to those in New Zealand, the US and Canada. Makaratta is a term from the Yolngu Peoples of north east Arnhem Land in the Northern Territory that means coming together after a struggle.\nTruth: a truth-telling process about Australian history. In telling and sharing this truth Indigenous and non-Indigenous Australians will finally achieve deep and lasting reconciliation.\nMiller continued: “Many of our staff in Australia are involved with our charity partner, the Clontarf Foundation, which seeks to improve the lives of young Indigenous men all over Australia. We see our commitment to the Statement as an extension of our support to the Indigenous community and Australia’s future.”\nDeutsche Bank has been a partner of Clontarf for two years. Together with the Federal Government and State Government, the bank provides funding for an academy in Sydney that supports 50 aboriginal boys.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}