{
    "url": "https://www.db.com/news/detail/20190808-deutsche-bank-continues-to-implement-digital-solutions-to-enhance-client-experience?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "August 8, 2019",
    "tags": [
        "Company",
        "Digitalisation",
        "Research"
    ],
    "title": "Deutsche Bank continues to implement digital solutions to enhance client experience",
    "body": "Deutsche Bank today announced that digital signatures are now being rolled out for clients in Asia Pacific, following the bank’s global launch in 2018. As cross-border document and contract signing can be a time consuming process, this solution helps to streamline and expedite the client experience.\nDeutsche Bank has now facilitated its first digitally signed document in Asia Pacific for BASF’s Regional Treasury Centre (RTC) in Hong Kong, a long-term client of the bank.\nJimmy Lui, Regional Treasurer for BASF - Asia Pacific, said: “Being a regional treasury, we often execute agreements with our banking providers that impact a number of our entities across the region. Having a digital signing process that is available in all markets where we operate, makes banking with Deutsche Bank easy and efficient.”\n“This development also aligns with our corporate focus to drive digitalisation in our processes” added Lui.\nChintan Shah, APAC Head of Cash Products at Deutsche Bank, said: “We strive to streamline our clients’ processes wherever possible to support their business demands, and we believe that solutions like digital signatures are a key way to achieve this.”\nClients can use digital solutions to accelerate the opening of accounts, sign documents and agree contracts with the bank. This solution is available to Deutsche Bank’s clients across 21 countries worldwide. BASF, a leading chemical producer headquartered in Germany, is the first Deutsche Bank client to use this solution in Asia Pacific.\nContact:\nMia Popplewell\n+61(2)8258-2092",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}