{
    "url": "https://www.db.com/news/detail/20190927-new-deutsche-bank-research-study-out-the-history-and-future-of-debt?language_id=1",
    "language": "EN",
    "article_type": "Research",
    "publish_date": "September 27, 2019",
    "tags": [
        "Corporate products",
        "Research"
    ],
    "title": "Deutsche Bank Research – the history and future of debt",
    "body": "With many countries today above the recommended prudent upper threshold for debt, there is a risk that growth will slow, creating an unsustainable and negative debt/GDP cycle.\nThat is what Jim Reid, Global Head of Thematic Research & Credit Research at Deutsche Bank Research highlights in his annual Long-Term Asset Return Study, this year focusing on the history and future of debt. Government debt/GDP levels have soared since the 2008 financial crisis and bond yields are at record lows.\nReid asks whether we have to rethink our view on debt sustainability.\nMuch depends on the future interaction between governments and central banks and whether governments can successfully and consistently issue the holy grail of funding – zero-coupon perpetual bonds. If they can do that, spend the money, and central banks buy the bonds, then that is pure helicopter money. Governments have yet to fully embrace the spending power that this may offer them, though.\nThe key to a sustainable debt environment over the next decade(s), he writes, will be about keeping nominal yields well below nominal GDP. As such, financial repression and aggressive central bank purchases might still be in the early stages. The big difference – relative to the last decade – will likely be that governments start spending the \"free\" money that central banks have served up. Infrastructure (tech led) and green investment may give even the most prudent of countries the political cover to spend.\nYou can read an extract of the report on the Deutsche Bank Research website. If you don’t have access please contact a Deutsche Bank sales representative.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}