{
    "url": "https://www.db.com/news/detail/20190926-securities-services-in-india-celebrates-25-years-and-a-series-of-firsts?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 26, 2019",
    "tags": [
        "Corporate products",
        "Private products"
    ],
    "title": "Securities Services in India celebrates 25 years – and a series of firsts",
    "body": "Set up in 1994, against the backdrop of India’s economic liberalisation, Deutsche Bank’s Securities Services team in India has come a long way over the past 25 years. The team is not only India’s leading custodian, but also has a string of firsts to its credit.\nIn 2006, Deutsche Bank was India’s first custodian to enable the National Stock Exchange to accept US treasury bills as collateral. Just one year later it was the first to offer custody for gold exchange-traded funds and to date, holds the distinction of being the only custodian to offer this service in India. With other significant milestones along the way, just this year, the bank was the first in the country to apply for a commodity custody license.\n“In business, 25 years is a long time - especially in developing markets because of rapidly evolving client demands and regulatory changes. Congratulations to the team in India for staying ahead of the game and continuing to deliver innovative solutions for our customers,” said Stefan Hoops, Global Head of Corporate Bank, at the anniversary dinner for clients on September 13.\nKaushik Shaparia, Chief Country officer for India said, “The decision to establish Securities Services in India was not driven by the expectation of large flows from foreign institutional investors, in the near-term, but by a deep-rooted conviction that this was a market that would grow sustainably in the long-term.” When the business was set up in India 25 years ago, the available investable global funds for emerging markets were estimated at 65 billion US dollars and now, in 2019, the total foreign portfolio investments into India alone have risen to over 400 billion US dollars.\nTo further streamline the process for foreign investors, Securities Services launched the AccessIndia portal at the event. This interactive web-based solution aims to introduce automated digital market entry to expedite licensing for foreign portfolio investors.\n“As the largest custodian in India, Deutsche Bank has fittingly taken the lead in digitalisation of pre-investment compliance for foreign investors around licensing and account set-ups,” said Sriram Krishnan, Head of Securities Services in India.\nSix years ago, the business was the first in India to launch an annual regulatory reference guide for foreign investors. Namaste India, as the guide is called, is published in English, Japanese and Korean.\nSome important awards won by the business include:\nTop rated Indian custodian in the Global Custodian Agent Bank Survey from 2004 to 2018\nBest Bank for Securities Services, 2018 at The Banker Transaction Banking Awards\nBest Sub-Custodian, Domestic Custodian & Fund Administration award at The Asset Triple A Awards 2019\nCustodian Member of the Year, in NSE Market Achiever’s Awards for 2018\nTop volume performer in Securities Lending & Borrowing segment in Bombay Stock Exchange for 2017 and 2018",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}