{
    "url": "https://www.db.com/news/detail/20190926-adding-purpose-to-performance-at-deutsche-bank-s-4th-annual-esg-conference?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 26, 2019",
    "tags": [
        "Corporate products",
        "Investment Banking",
        "Private products",
        "Sustainability"
    ],
    "title": "Adding purpose to performance at Deutsche Bank's 4th annual ESG Conference",
    "body": "Deutsche Bank is committed to evolving its platform so it can serve clients by aligning their investments to their values without compromising returns, Christiana Riley told Deutsche Bank’s 4th annual ESG Conference in New York on September 19.\nOpening the conference for nearly 150 thought leaders, investors and clients, the nominated CEO of the Americas and Management Board Member summarised the bank’s approach as: “We are adding purpose to performance”.\n“While the conversation around Environmental, Social and Governance is not as mature in the US, Deutsche Bank is steeped in European tradition and can bring the dialogue forward,” she said.\nThe bank is doing this in two ways: “First we use the ESG factor to make sure we understand and reduce risks, and second is to use ESG to uncover emerging opportunities, assessments and transparencies for clients and their investments,” Riley said.\nThis year’s agenda featured topics and discussions showcasing insights designed for ESG investors and how ESG factors into forward-thinking portfolio decisions. This year the bank widened the lens to also include impact investing and sustainable finance.\nA discussion between two impact investing visionaries, Liesel Pritzker Simmons, Co-Founder and Principal, Blue Haven Initiative, and Jim Sorenson, Founder, Sorenson Impact Foundation, addressed how they adopted ESG strategies, their approaches to decision making, and measuring success. Asked what advice they would offer investors interested in the impact space, they agreed the best approach is to just get started, get engaged and move forward.\nA series of flash talks looking at the “E,” the “S” and the “G” in ESG followed.\nRon Gonen, Co-Founder & CEO, Closed Loop Partners, covered the environment and predicted that the circular economy – which is based on the principles of recycling – will be worth 4.5 trillion dollars by 2030. Gonen’s presentation - Widening Margins by Closing the Loop” – explained how a circular economy reduces costs, increases efficiency and protects the environment. It achieves this by being guided by innovation drivers such as product design and recycled materials, and business drivers including commodity risk management and consumer preference.\nThe social module highlighted innovative business models designed to serve and grow tomorrow’s society. Clara Brenner, Managing Partner, Urban Innovation Fund, presented a flash talk on “Investing in the Future of Cities” to show how investing in start-ups addressing urban challenges such as transportation and housing can yield sustainable returns. Brenner advised investors to look for high-profile investments such as those facing regulatory or political pushback; undervalued investments in areas like water and the workforce, and geographic and demographic diversity.\nBy putting performance with a purpose front and center, the governance factor puts an emphasis on how a business operates and uses this as an indicator of long-term profitability. In the flash talk “Taking the Long-Term View,” Brian Tomlinson, Research Director, Strategic Investor Initiative, CECP, laid out the investment advantages of companies that look beyond short-term reporting by issuing long-term guidance. As investors look at long-term goals, Tomlinson called on companies to re-orient disclosures to meet these goals; talk more about ESG including corporate governance, human capital, risks and opportunities; and purpose.\nESG offers a positive narrative for the bank’s future\nRiley attended a ceremony on September 22 at the United Nations where Deutsche Bank endorsed the Principles for Responsible Banking by the UN Environment Programme Finance Initiative (UNEP FI). The Principles provide a framework for the sustainable banking system of the future.\nThe purpose of the Principles is for the banking industry to play a leading role in supporting the UN Sustainable Development Goals (SDGs) and the Paris Climate Agreement. The Principles were officially signed and launched during the United Nations General Assembly.\nDeutsche Bank Research recently launched a new product to elevate awareness of ESG and related issues while also helping to pick investments. In another new series tailored to Corporate Bank clients, the first publication refutes the idea that what's good for the earth is bad for investors.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 1
}