{
    "url": "https://www.db.com/news/detail/20190923-agreement-between-bnp-paribas-and-deutsche-bank-regarding-prime-finance-and-electronic-equities?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 23, 2019",
    "tags": [
        "Investment Banking"
    ],
    "title": "Agreement between BNP Paribas and Deutsche Bank regarding prime finance and electronic equities",
    "body": "Following on from their preliminary agreement, BNP Paribas and Deutsche Bank have signed a master transaction agreement to provide continuity of service to Deutsche Bank’s Global Prime Finance and Electronic Equities clients. Under the agreement Deutsche Bank will continue to operate the platform until clients can be migrated to BNP Paribas.\nBoth firms will work closely together to ensure a seamless transition for clients, through the migration of technology and key staff from Deutsche Bank to BNP Paribas. This binding agreement remains subject to regulatory approvals of the relevant authorities.\n“We are pleased to have signed the master transaction agreement with BNP Paribas on schedule. This is an important milestone for our Capital Release Unit and attests to the strength of our client offering and technology in these products. We are already making progress and are on the right track to implement this transaction, thereby providing a clear path for clients and staff,” said Frank Kuhnke, Chief Operating Officer, Deutsche Bank.\n“I'm excited to announce the signing of this agreement, thanks to the close cooperation between BNP Paribas and Deutsche Bank teams. We are now looking forward to welcoming staff and serving these new clients. This agreement demonstrates BNP Paribas’ strong commitment to institutional investors globally,” said Yann Gérardin, Deputy Chief Operating Officer and Head of Corporate and Institutional Banking, BNP Paribas.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}