{
    "url": "https://www.db.com/news/detail/20190919-deutsche-bank-acquires-a-5-percent-stake-in-fintech-deposit-solutions?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 19, 2019",
    "tags": [
        "Company",
        "Corporate products",
        "Digitalisation",
        "Entrepreneurship",
        "Investment Banking",
        "Private products",
        "Research"
    ],
    "title": "Deutsche Bank acquires a 5 percent stake in fintech Deposit Solutions",
    "body": "Deutsche Bank to benefit from the expected growth in valuation of the Hamburg-based fintech and to expand its Zinsmarkt deposit offering\nTim Sievers, CEO and founder of Deposit Solutions: “This is the first time we have allowed one of our clients to acquire a stake in our company.”\nKarl von Rohr, Member of the Management Board and President of Deutsche Bank: “This investment underlines our intention to operate as a digital platform.”\nDeutsche Bank is a new shareholder of Deposit Solutions GmbH, as announced by the two companies today. Deutsche Bank has acquired a 4.9 percent stake in the Hamburg-based company. Both parties agreed not to disclose details about the volume of the investment.\nThe bank’s objective with this investment is to benefit from the expected growth in valuation of Deposit Solutions. Deutsche Bank already operates its “Zinsmarkt” deposit offering using technology supplied by Deposit Solutions. Since 2017 Zinsmarkt has enabled Deutsche Bank customers to access fixed-term deposit products from other European banks that pay higher interest. Deutsche Bank is pursuing two goals with Zinsmarkt: offering clients alternative investment opportunities in addition to the bank’s own products and at the same time increasing its fee income from the deposit business, particularly during a period of sustained low interest rates. Zinsmarkt as well as the cooperation with Deposit Solutions are elements of Deutsche Bank's platform strategy. To date, Deutsche Bank’s Zinsmarkt can be used by Deutsche Bank customers and online broker Maxblue clients. The bank is now planning to open it up to a wider range of clients within Deutsche Bank Group.\nWith our open banking platform we are building the infrastructure for the deposits business of the future. The investment of Deutsche Bank is a milestone for us in two respects. Firstly, the expansion of our platform to include other Deutsche Bank businesses in Germany and abroad will help us grow even faster. Secondly, for the first time a client of ours becomes a shareholder of the infrastructure they use.\nTim Sievers, CEO and founder of Deposit Solutions\nKarl von Rohr, President of Deutsche Bank and the Management Board member responsible for private clients, said regarding the signing of the contract: “We have been investing in our capabilities to also operate as a digital platform for a considerable length of time. In the digital age the only players who will maintain client contact are those who can offer the best products, even if they are provided by third party vendors. Deposit Solutions has the right infrastructure to enable this in the important business segment of fixed-income deposits. We are looking forward to growing the business with such a strong and reliable partner.”\nTo date, around two billion euros of deposits have already been transmitted via Zinsmarkt. It currently offers more than 23 fixed-term deposit products with different maturities from three banks. Two additional banks are due to be added in the near future.\nBesides Deutsche Bank, nearly 100 other banks from 18 countries are using the Deposit Solutions platform either to offer their clients deposit products from third-party banks or to source deposits for their balance sheet. The company is further expanding internationally: In early 2019, Deposit Solutions launched in Switzerland as the first market outside the European Union; in the coming months the United States will follow.\nFor further information please contact:\nDeutsche Bank AG\nCommunication\nChristoph Blumenthal\nTel. +49 69 910 47048\nEmail: christoph.blumenthal@db.com\nDeposit Solutions GmbH\nAttila Rosenbaum\nLeiter Unternehmenskommunikation\nTel. +49 40 696 328 894\nEmail: attila.rosenbaum@deposit-solutions.com\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}