{
    "url": "https://www.db.com/news/detail/20190918-no-more-trees-should-fall-than-can-regrow-esg-yesterday-today-tomorrow?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 18, 2019",
    "tags": [
        "Sustainability"
    ],
    "title": "\"No more trees should fall than can regrow\": ESG yesterday, today, tomorrow",
    "body": "“No more trees should fall than can regrow,” Hans Carl von Carlowitz, a German mining administrator and the first person to clearly formulate the concept of sustainability in forestry, wrote in 1713.\nThe idea of sustainable living in harmony with nature dates back centuries and arguably to prehistoric times, according to a brief history of Environmental, Social, Governance (ESG) investing by Deutsche Bank’s Chief Investment Office entitled “\nPDF\nESG yesterday, today, tomorrow”.\nAfter generations of ecological damage, the growing field of ESG investing offers hope of a more sustainable era that could achieve not just ecological balance but also economic security and social justice.\n“The agrarian and industrial revolutions created huge benefits for humanity but also the present threat of environmental collapse,” according to author Markus Müller, Global Head of the WM CIO. However, “with ESG investing, the power of finance can be channelled to support the broader objectives of society.”\nSustainability must be built into the “system” and not imposed retrospectively, Müller argues. That includes the careful use of resources, environmentally friendly production processes, an integrated economic order for the preservation of our natural habitat and an inclusive understanding of growth and society.\nDeutsche Bank Wealth Management is significantly accelerating its ESG strategy as a new generation of wealthy clients increasingly ask their advisers to help them add purpose to investment performance. Its new approach includes adopting ESG ratings from MSCI, a leading provider of critical decision support tools and services for the global investment community, to give clients valuable standardised information on non-financial risks and opportunities when making investment decisions.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}