{
    "url": "https://www.db.com/news/detail/20220127-a-message-from-christian-sewing-on-our-full-year-results-2021?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 27, 2022",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "A message from Christian Sewing on our full-year results 2021",
    "body": "Dear Colleagues,\nIn July 2019, when we published our transformation strategy and our goals for 2022, our plans were met with scepticism. Few observers were confident that we would be able to achieve such ambitious objectives within three and a half years.\nThey were just as doubtful that we would successfully realign our business model or that we would manage to significantly reduce costs, to make Deutsche Bank sustainably profitable once again. Hardly anyone believed that we would finance the transformation from our own resources and be able to return capital to our shareholders, as we promised.\nToday we are proving that we keep our promises. At the beginning of the third and final year of our \"Compete to Win\" strategy, we are once again presenting a set of results we can all be proud of.\nOur profit before tax for 2021 was 3.4 billion euros and we reported net profit of 2.5 billion euros. Not only is this last figure more than four times the amount we reported in 2020, it is also the highest we have reported since 2011. This will allow us to resume distributing a significant amount of capital to our shareholders.\nYesterday, we announced our plans to propose at our AGM in May to distribute around 400 million euros in the form of dividends. Additionally, the Management Board decided to repurchase shares worth 300 million euros. This is an important milestone and is the result of all your hard work for our stakeholders and for our bank.\nOn behalf of the entire Management Board, thank you!\nOur excellent full-year results for 2021 are all the more remarkable when you bear in mind how heavily we invested last year to accelerate our transformation. Almost all of the anticipated costs related to our bank’s transformation have now been recognised: 97 percent to be precise. And we achieved all of this in what has been a persistently tough economic environment.\nIn 2021, Covid prevented us from working in the way we would have liked in many areas. I have a great deal of respect for how you dealt with all the constraints and setbacks in what was the second year of the pandemic and kept reacting in a flexible way to an environment that was rapidly changing, often completely unexpectedly.\nOur profit is particularly pleasing because all our businesses contributed to its growth. In 2021, we increased profit and revenues across the four pillars of the Core Bank and proved the worth of our balanced business model.\nFull-year net revenues for the group were 25.4 billion euros. That is an increase of 6 percent over 2020. And we owe this increase largely to strong growth in new business and gains in market share. Revenue development in 2021 in our core businesses was as follows:\nOur Corporate Bank grew business volumes, with 8 billion euros in loan growth in 2021 and 18 billion euros in deposit growth during the year. At the same time, we charged fees on a greater proportion of our deposits, bringing us a total of 364 million euros in revenues in 2021. These repricing arrangements and business growth offset interest rate headwinds, enabling us to grow profit before tax by 86 percent, while revenues were stable. The final quarter was particularly good as negative interest rate effects declined significantly, lifting revenues by 10 percent year-on-year.\nThe Investment Bank succeeded in increasing its revenues by 4 percent compared to an already strong previous year. Profit before tax was also up by 17 percent. We owe this positive development not only to a resilient performance by our trading and financing businesses, but also to a revenue increase of 23 percent in Origination & Advisory. In 2021, we regained our Number 1 position in Germany in this area. And in the fast-growing ESG debt business, we ranked fifth globally, after coming in at 13th place two years ago (Source: Dealogic).\nThe Private Bank returned to profitability in 2021 and grew its revenues by 1 percent year on year. This meant it was able to offset both the effects of the negative interest rate environment and the adverse impact of the German Federal Court of Justice (BGH) ruling on current account fees. The main growth driver here was new business volumes. We booked net inflows of 23 billion euros into investment products and granted net new client loans worth 15 billion euros. Deposits in the Private Bank grew by 7 billion euros.\nOur Asset Management business had a very successful year. After net inflows of 48 billion euros and good performance on investments, it now has 928 billion euros of assets under management ­– both record levels. Consequently, net revenues rose by 21 percent to 2.7 billion euros in 2021. Profit before tax increased by 50 percent to 816 million euros. We are particularly pleased that 40 percent of total net inflows were invested in DWS funds with a focus on environmental, social and corporate governance (ESG) aspects.\nThis heightened interest in ESG is not only being seen in Asset Management; enthusiasm for ESG products is growing rapidly in all our businesses. By the end of the year, ESG-related financing and investments reached 157 billion euros. We will therefore most probably achieve our target of at least 200 billion euros as early as 2022 instead of at the end of 2023.\nThe fact that we defined Sustainability as a top management priority in the summer of 2019 has paid off. We have not only expanded our Sustainability team but have also hired additional ESG experts in the regions and in our businesses. And that is just the beginning.\nOur achievements in the field of sustainability also show that our transformation is about more than just numbers. It concerns bringing about profound change; it is about defining our bank’s purpose. We are the Global Hausbank and as such we want to be the best possible adviser, partner and risk manager for our clients.\nTo achieve this, we have been making targeted investments in our business and we have also set aside additional money for variable compensation.\nIn doing so, we are responding to recent wage developments in some highly competitive areas of the banking sector, where the race to attract the best and most talented people is now much tougher. We have also increased technology spending and accelerated our transformation, because that will enable us to permanently reduce costs and support business growth. And we have continued to invest to optimise our anti-money laundering systems and to further strengthen our controls.\nThese investments are the main reason our adjusted costs fell more slowly in 2021 than in previous years. At 19.3 billion euros, adjusted costs ex-transformation charges and reimbursable Prime Finance expenses were about 250 million euros lower than a year earlier.\nWe remain fully disciplined on costs and aim to continue to reduce our spending as planned to achieve our 8 percent return on tangible equity target as well as our cost/income ratio target of 70 percent this year.\nWith our Capital Release Unit performing ahead of its year-end 2022 plan, we have already created the necessary conditions for both these targets to be met. At the end of last year, we also successfully completed the transfer of clients, technology and personnel from our Prime Finance business and electronic brokerage to BNP Paribas.\nThe fact that we will be able to distribute capital again this year is down to our solid balance sheet. Our Common Equity Tier 1 (CET1) capital ratio at the end of 2021 was higher than we had planned, despite the negative impact of regulatory methodology changes.\nAt 13.2 percent it remains well above our minimum target and regulatory requirements.\nWith this strong capital base and our excellent market position relative to our global competitors, it is now in our hands to successfully complete our three-and-a-half-year transformation strategy. This requires that we once again work hard and stay absolutely focused on our goals.\nThis year we can finally prove to the market that we are sustainably profitable. There is incredible potential – not least for our share price. We are still at around 45 percent of book value, which would not do justice to a bank that earns a return on tangible equity of 8 percent. Let's prove together that we can do it. The year has started well; now we must build on this – day after day, week after week, month after month, quarter after quarter.\nSo far, we have shown what our bank is made of – and what all of you, our colleagues all over the world, are made of. We have put Deutsche Bank back on a path towards sustainable profitability and growth. And we are determined that nothing will throw us off course. Now let’s convince those who still doubt us.\nBest wishes,\nChristian Sewing",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 160
}