{
    "url": "https://www.db.com/news/detail/20220127-full-year-results-2021?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "January 27, 2022",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank reports 2021 profit before tax of € 3.4 billion",
    "body": "Net profit for 2021 rises more than fourfold to € 2.5 billion, highest since 2011\nProfit before tax rises threefold to € 3.4 billion\nAdjusted profit before tax¹of € 4.8 billion, more than double 2020\nFourth quarter profit before tax of € 82 million after transformation-related effects¹of €456 million\nAnnounced intention to distribute approximately € 700 million of capital to shareholders\nCore Bank: 2021 profit before tax rises 48% year on year to € 4.8 billion\nProfit growth across all four core businesses\nPost-tax RoTE¹of 6.4%, up from 4.0% in 2020, with adjusted post-tax RoTE¹of 8.5%\nAdjusted profit before tax¹up 46% year on year to € 6.1 billion\nCapital Release Unit: RWA reduction ahead of end-2022 target with further P&L improvement\nRWAs reduced from € 34 billion to € 28 billion during 2021\nLeverage exposure reduced to € 39 billion, down from € 72 billion at end-2020\nLoss before tax reduced by 38% year on year to € 1.4 billion\nPrime Finance transfer to BNP Paribas completed on schedule\nRevenue growth maintained in 2021\nGroup full year net revenues rise 6% year on year to € 25.4 billion\nMomentum sustained in fourth quarter: net revenues up 8% to € 5.9 billion\n2021 noninterest expenses up 1%, or € 289 million, to € 21.5 billion\nTransformation-related effects¹of € 1.5 billion, up 21%\n97% of total expected transformation-related effects¹through end-2022 recognised\nAdjusted costs ex-transformation charges¹and reimbursable Prime Finance-related expenses down 1% to € 19.3 billion\nRisk, capital and balance sheet in line with goals\nProvision for credit losses down 71% to € 515 million, 12 bps of average loans\nCommon Equity Tier 1 (CET1) capital ratio of 13.2% at end-2021\nLeverage ratio of 4.9% fully loaded and 5.0% on a phase-in basis\nSustainable Finance: record quarterly volume and rating upgrades\nFourth quarter sustainable financing and investment volumes of € 32 billion\nCumulative total of € 157 billion since beginning of 2020, of which € 112 billion in 2021\nOn track to exceed end-2023 target of at least € 200 billion\n¹ For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ on pp 17-25 of the fourth quarter 2021 Financial Data Supplement\nIn 2021, we increased our net profit fourfold and delivered our best result in ten years while putting almost all of our expected transformation costs behind us. All four core businesses performed at or ahead of our plan, and our reduction of legacy assets progressed faster than expected. We are delighted to be resuming capital distributions to our shareholders as we promised in the summer of 2019. Our transformation progress and financial performance in 2021 provide a strong step-off point to achieve our target of a return on tangible equity of 8% in 2022.\nChristian Sewing, Chief Executive Officer\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today reported its highest full-year net profit since 2011. Profit before tax was € 3.4 billion in 2021, up by more than three times year on year, also the best for ten years. Net profit was € 2.5 billion, a more than fourfold increase over 2020.\nFull-year 2021 results included transformation-related effects¹of € 1.5 billion, up 21% versus 2020, as Deutsche Bank continued to execute its transformation programme.\nAdjusted profit before tax1, which excludes transformation-related effects¹and specific revenue items, more than doubled versus 2020 to € 4.8 billion. Post-tax return on average shareholders’ equity was 3.4%, up from 0.2% in 2020. Post-tax return on average tangible shareholders’ equity (RoTE)¹was 3.8%, versus 0.2% in the prior year.  \nIn the fourth quarter, profit before tax was € 82 million and net profit was € 315 million, up 67% year on year. The fourth quarter tax benefit reflected a positive deferred tax asset valuation adjustment of € 274 million resulting from the strong performance of Deutsche Bank’s US operations.\nNet revenues in the quarter were € 5.9 billion, up 8% year on year, while noninterest expenses rose 11% year on year. This increase partly reflected a 17% year on year rise in transformation-related effects¹to € 456 million. Adjusted profit before tax¹, which excludes these effects, was € 527 million, down 15% year on year.\nOn January 26, 2022, Deutsche Bank announced actions which would provide total capital distributions to shareholders of approximately € 700 million. This represents the first step towards the bank’s previously announced commitment to return € 5 billion of capital to shareholders over time. The Management Board has decided to initiate a share repurchase programme of € 300 million, to be completed in the first half of 2022, and intends to propose to the Annual General Meeting a cash dividend of € 0.20 per share for the financial year 2021.  \nCore Bank: profit before tax up 48% to € 4.8 billion in 2021\nIn the Core Bank, which excludes the Capital Release Unit, profit before tax was € 4.8 billion, up 48% year on year, while adjusted profit before tax¹rose 46% to € 6.1 billion. Post-tax RoTE was 6.4%, up from 4.0% in the prior year, while adjusted post-tax RoTE¹ was 8.5%, up from 5.7%. The Core Bank’s cost/income ratio was 79%, unchanged from 2020.\nAll core businesses contributed to year on year growth in profit before tax in 2021, as follows:\nCorporate Bank: up 86% to € 1.0 billion;\nInvestment Bank: up 17% to € 3.7 billion;\nPrivate Bank: up by € 465 million to € 366 million;\nAsset Management: up 50% to € 816 million.\nIn the fourth quarter, Core Bank profit before tax was € 434 million, down 27% year on year. Revenue growth of 7% was offset by growth of 12% in noninterest expenses which partly reflected a 31% year on year rise in transformation-related effects¹to € 435 million. Adjusted profit before tax1, which excludes these effects, was € 860 million in the quarter, down 13% year on year.\nCapital Release Unit: continued portfolio reduction, bottom line improvement and completion of Prime Finance transfer\nThe Capital Release Unit delivered another year of significant portfolio reduction while further reducing the cost of de-leveraging in 2021. The transfer of clients, technology and key staff from Deutsche Bank’s Global Prime Finance and Electronic Equities businesses to BNP Paribas was successfully completed by the end of 2021, meeting the targeted timeline.\nAt year-end, risk weighted assets (RWAs) were reduced to € 28 billion, down from € 34 billion at the end of 2020 and ahead of Deutsche Bank’s end-2022 target of € 32 billion. As at year end, the Unit’s RWAs included Operational Risk RWAs of € 20 billion. Leverage exposure was € 39 billion at the end of 2021, down 46% from € 72 billion at the end of 2020.\nSince its inception in mid-2019, the Capital Release Unit has reduced RWAs by 57%, or € 37 billion, and leverage exposure by 84%, or € 210 billion.\nThe Capital Release Unit reported a substantial improvement in P&L in 2021. The loss before tax was € 1.4 billion, down 38% from a loss before tax of € 2.2 billion in 2020. This improvement was primarily driven by a 26% reduction in noninterest expenses, reflecting a 35% reduction in adjusted costs ex-transformation charges¹during the year.\nIn the fourth quarter, the Capital Release Unit reported a loss before tax of € 352 million, a 15% loss reduction compared to the fourth quarter of 2020.\nRevenues: fourth quarter growth includes record revenues in Asset Management\nNet revenues were € 25.4 billion in 2021, up 6% versus 2020. Revenue growth continued in the fourth quarter, with net revenues up 8% year on year to € 5.9 billion. Within Deutsche Bank’s core businesses, revenue development in 2021 was as follows:\nCorporate Bank net revenues were € 5.2 billion, flat versus 2020. The Corporate Bank grew business volumes, with € 8 billion in loan growth and € 18 billion in deposit growth during 2021. Accounts with deposits of € 101 billion were covered by deposit repricing agreements by year-end, which contributed revenues of € 364 million in 2021. These factors successfully offset interest rate headwinds. In the fourth quarter, net revenues were € 1.4 billion, up 10% year on year, the highest revenues of any quarter since the formation of the Corporate Bank in 2019, as an easing of interest rate headwinds and business volume growth positively impacted revenues. Both Corporate Treasury Services and Institutional Client Services achieved revenue growth of 12%, while Business Banking revenues declined 1%, reflecting ongoing interest rate headwinds.\nInvestment Bank net revenues rose 4% to € 9.6 billion in 2021. Revenues in Fixed Income & Currencies (FIC) Sales & trading were essentially flat year on year, while revenues in Origination & Advisory rose 23%. Deutsche Bank regained the No. 1 position in Origination & Advisory in Germany for the year 2021 with a share of 9.2% (source: Dealogic). In the fourth quarter, Investment Bank net revenues were € 1.9 billion, up 1% year on year. A 14% decline in FIC revenues versus a strong prior year quarter was offset by 29% growth in Origination & Advisory revenues, the eighth consecutive quarter of year-on-year revenue growth.\nPrivate Bank net revenues were € 8.2 billion in 2021, up 1% year on year, or up 2% if adjusted for forgone revenues resulting from the German Federal Court of Justice (BGH) ruling on customer consent for pricing changes on current accounts and the non-recurrence of a negative prior year impact from the sale of Postbank Systems AG. The Private Bank generated business volume growth of € 45 billion in 2021, 50% ahead of its target threshold, including € 23 billion in net inflows into investment products and € 15 billion in net new client loans. Volume growth more than offset the adverse revenue impact of interest rate headwinds. Business volumes in 2021 included environmental, social and governance (ESG) assets under management of € 26 billion and growth in ESG client loans of € 4 billion. In the fourth quarter, Private Bank net revenues were € 2.0 billion, up 4%. Revenues in Private Bank Germany were up 8%, or down 2% if adjusted for the prior year impact of Postbank Systems and the BGH ruling. Revenues in the International Private Bank were down 2%, or up 6% if adjusted for the non-recurrence of prior year revenues relating to Sal. Oppenheim workout activities.\nAsset Management net revenues grew 21% to € 2.7 billion in 2021, reflecting growth in both management fees and performance fees. Assets under management grew to a record € 928 billion at the end of 2021, up € 135 billion or 17% during the year. This was partly driven by record 12-month net inflows of € 48 billion, with inflows across Active, Passive and Alternative assets. Full year inflows in ESG assets were € 19 billion, or around 40% of total net inflows. In the fourth quarter, Asset Management net revenues were a record € 789 million, up 32% versus the fourth quarter of 2020. Assets under management grew by € 45 billion in the quarter, including net inflows of € 15 billion, the seventh consecutive quarter of net inflows, including € 6 billion of ESG assets. \nExpenses: 97% of total transformation-related effects already recognised\nNoninterest expenses were € 21.5 billion in 2021, up 1% year on year. These included transformation-related effects¹of € 1.5 billion, up 21% year on year, predominantly driven by transformation charges of € 1.0 billion, up from € 490 million in 2020. By the end of 2021, 97% of total transformation-related effects¹anticipated through the end of 2022 were already recognised. Adjusted costs ex-transformation charges¹and reimbursable expenses related to Prime Finance were down 1% year on year to € 19.3 billion, a reduction of 10% since 2019.\nDeutsche Bank’s workforce was reduced to 82,969 full-time equivalents (FTEs) at the end of 2021, down by 1,690 FTEs since the end of 2020, despite continued internalisation of external contract staff and selective hiring to support business growth. This compares to 90,866 FTEs at the launch of the transformation programme in July 2019.\nIn the fourth quarter, noninterest expenses rose by 11% to € 5.6 billion. These include transformation-related effects of € 456 million, up 17% year on year, primarily reflecting a 46% rise in restructuring and severance expenses. Adjusted costs ex-transformation charges and reimbursable expenses related to Prime Finance¹rose 6% to € 4.9 billion, or 4% if adjusted for exchange rate movements. This development was driven by higher compensation expenses which primarily reflected improved business performance, and technology costs reflecting the execution of the bank’s technology and platform strategies.\nCredit provisions: significant reduction versus 2020\nProvision for credit losses was € 515 million in 2021, down 71% versus 2020, reflecting a supportive credit environment, high quality loan book and continued strict risk discipline against a backdrop of economic recovery due to the easing of COVID-19 restrictions during 2021. Provision for credit losses was 12 basis points of average loans, down from 41 basis points in 2020.\nIn the fourth quarter, provision for credit losses was € 254 million, essentially flat compared to the fourth quarter of 2020. A lower net release for performing (Stage 1 and 2) loans of € 5 million, down from a net release of € 101 million in the prior year quarter, was offset by a 26% year on year reduction in provision for non-performing (Stage 3) loans to € 259 million.\nConservative capital and balance sheet management throughout 2021\nThe Common Equity Tier 1 (CET1) capital ratio was 13.2% at the end of 2021, compared to 13.6% at the end of 2020. RWAs increased from € 329 billion to € 352 billion during the year. The full-year CET1 ratio development reflects a net negative impact of approximately 90 basis points from regulatory and methodology changes during 2021, partly offset by reductions in Market Risk and Operational Risk RWAs and organic capital growth through retained earnings.\nThese enabled Deutsche Bank to support both increased lending to clients and future distributions to shareholders, while maintaining its commitment to a CET1 ratio above 12.5%.\nIn the fourth quarter, the CET1 capital ratio, at 13.2%, was 22 basis points higher than in the third quarter. The ratio benefited from an increase in CET1 capital, reflecting the positive impact of a regulatory-driven reversal of capital deductions. RWA remained essentially flat during the quarter, as growth in Credit Risk RWAs, reflecting business growth in the Core Bank, was largely offset by reductions in Market Risk and Operational Risk RWAs.\nThe Leverage ratio was 5.0% in the fourth quarter on a phase-in basis and 4.9% on a fully loaded basis, compared to a phase-in leverage ratio of 4.9% and 4.8% fully loaded at the end of the third quarter. This improvement primarily reflected the issuance of € 1.25 billion of Additional Tier 1 (AT1) capital during the quarter.\nThese ratios exclude certain central bank balances under applicable rules. Including these balances, the fully loaded Leverage ratio would have been 4.5% in the quarter, and 4.6% on a phase-in basis, in line with the bank’s 2022 financial target of around 4.5% fully loaded.\nLiquidity reserves were € 241 billion at year-end, versus € 249 billion at the end of the third quarter, including High Quality Liquid Assets of € 207 billion. The Liquidity Coverage Ratio was 133%, well above the regulatory requirement of 100% and a surplus of € 52 billion. The Net Stable Funding Ratio was 120% at year-end, at the top of the bank’s target range of 115-120%, with a surplus of € 101 billion above required levels.\nSustainable Finance: record quarterly volume accelerates progress\nBy the end of 2021, cumulative environmental, social and governance (ESG)-related financing and investment volumes reached € 157 billion ex-DWS since the beginning of 2020. This significantly exceeds Deutsche Bank’s target of at least € 100 billion by year-end 2021 and is on track to exceed the bank’s target of at least € 200 billion by year-end 2023.\nESG-related financing and investment volumes were a record € 32 billion ex-DWS in the fourth quarter, bringing the full year 2021 total to € 112 billion. In the fourth quarter, Deutsche Bank’s businesses contributed as follows:\nCorporate Bank: € 8 billion in sustainable financing in the quarter, raising the business’ cumulative total since the beginning of 2020 to € 26 billion;\nInvestment Bank: € 14 billion in fourth quarter sustainable financing and capital market issuance, for a cumulative total of € 87 billion. In 2021, Deutsche Bank ranked 5th globally in ESG-related debt and sustainability-linked bond issuance as measured by fees, up from 8th in the full year 2020 and 13th in 2019 (Source: Dealogic);\nPrivate Bank: € 9 billion growth in ESG assets under management and a further €1 billion in new client lending, raising the Private Bank’s cumulative total to € 44 billion.\nDuring the fourth quarter, Deutsche Bank’s progress in sustainable banking was recognised by ratings upgrades from several independent agencies:\nThe UK-based non-profit organisation CDP raised Deutsche Bank’s rating to B, reflecting a more active approach and taking co-ordinated action on climate issues;\nS&P raised Deutsche Bank’s rating in its annual Global Corporate Sustainability assessment, enabling the bank to return to the Dow Jones Sustainability Europe Index;\nDeutsche Bank’s Sustainalytics score improved, reducing the risk rating from ‘high’ to ‘medium’.\nRead the\nPDF\nfull media release in the downloadable PDF.\nCumulative ESG volumes include sustainable financing (flow) and investments (stock) in the Corporate Bank, Investment Bank and Private Bank from January 1, 2020, to date, as set forth in Deutsche Bank’s Sustainability Deep Dive of May 20, 2021. Products in scope include capital market issuance (bookrunner share only), sustainable financing and period-end assets under management. Cumulative volumes and targets do not include ESG assets under management within DWS, which are reported separately by DWS.",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 43
}