{
    "url": "https://www.db.com/news/detail/20220113-headline-deutsche-bank-ranked-top-five-arranger-of-esg-debt-in-2021?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 13, 2022",
    "tags": [
        "Investment Banking",
        "Sustainability"
    ],
    "title": "Deutsche Bank ranked top five arranger of ESG debt in 2021",
    "body": "Deutsche Bank finished 2021 as the fifth most prominent arranger of ESG debt (Dealogic, by fees), up from eighth position last year and 13th in 2019. The bank achieved a 4.6 percent market share, up from 2.2 percent in 2019, during which time it has made a dedicated effort within Origination & Advisory to focus on advising clients on issuing ESG debt via its ESG Advisory team.\nHere are some of the team’s highlight transactions from 2021:\na 10 billion pound green bond for the UK Debt Management Office with Deutsche Bank acting as joint bookrunner;\nthe inaugural 12 billion euro green bond for the European Union – to date the largest green bond ever issued with the largest ever green bond order book. Deutsche Bank was joint bookrunner;\nthe 707 million US dollar senior secured green notes for JSW Hydro Energy Ltd – a highly successful debut green bond transaction for the company and debut hydro transaction from Asia. Deutsche Bank was left lead and green structuring agent;\na 500 million US dollar sustainability-linked senior notes offering for Constellium in the United States – the first sustainability-linked bond (SLB) in the metals sector and first SLB in the US high yield industrials sector. Deutsche Bank acted as left lead bookrunner, sustainability structuring advisor and sole dealer manager;\nthe 3.1 billion Swiss franc financing package to support Bain and Cinven’s acquisition of Lonza Speciality Ingredients, one of the largest European leveraged buyouts (LBO) in 2021, marking the first issuance of SLBs in an LBO context. Deutsche Bank acted as joint global coordinator and sustainability structurer;\nVirgin Media O2 joint venture’s 1.284 billion pound sterling/US dollar senior secured notes in green format. Deutsche Bank acted as joint bookrunner and green bond structurer.\nThis week the ESG Advisory team published its 2022 outlook, with three trends identified for the year ahead:\nThe net-zero transition: the energy transition to net-zero by 2050 has 130 trillion US dollars of capital linked to it, impacting not just how energy is generated and distributed, but also on how energy is consumed. Corporates will face investor demands to communicate clear transition strategies; invest in smart infrastructure to prepare for energy-as-a-service business models; demonstrate emission reduction in the medium-long term.\nThe impact of ESG regulations on investments and financing: rapid growth in ESG investments is creating differing regulatory regimes, fragmenting ESG investor expectations for corporates with a cross-border investor base. Regulations standardising the definition of green in Europe could result in differentiation for “dark green” debt that is demonstrably aligned with a net-zero by 2050 objective.\nThe growth of ESG in private markets: as more investors turn to alternate strategies, ESG is becoming mainstream in private markets at all stages. ESG is relevant for assessing a company’s return profile, scaling decarbonization technology and demonstrating exit preparedness in mature companies.\nRead the full report: \nPDF\nESG 2022 Outlook",
    "number_of_ratings": 5,
    "rating": 1.8,
    "likes": 23
}