{
    "url": "https://www.db.com/news/detail/20220113-best-high-yield-bond-house-in-asia?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 13, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Best High Yield Bond House in Asia",
    "body": "Global Capital has named Deutsche Bank as the Best High Yield Bond House in Asia in 2021, underscoring the bank’s consistent track record and execution capabilities in debt capital markets across the region\n“In a particularly challenging year for high yield, Deutsche showed its prowess by offering clients timely and relevant advice and positioning them correctly to capture market windows,” said GlobalCapital. The publication praised the bank for its “spot-on reading of market conditions”, unwavering focus on high yield and consistent performance, positioning it at the forefront of advising clients in one of the toughest periods for Asia’s high yield debt market.  \nGlobalCapital also called out the bank’s track-record in advisory and execution for borrowers and investors on ESG, describing the bank as one of the ”go-to banks for corporates on ESG”.\nHaitham Ghattas, Head of Capital Markets for Asia Pacific said: “This is our second regional win for Best HY Bond House in the past year, and an important external recognition for our financing platform in the region, made possible by first class cross-bank collaboration across multiple teams, including with our Coverage, Sales and Infrastructure partners.”\nIFR named Deutsche Bank ‘Asia’s Best High Yield Bond House’ last year, reflecting the strength of the bank’s ongoing momentum and commitment to issuers across Asia. Deutsche Bank also remained a clear leader in Asia G3 high yield markets in all categories in 2021.\nDriving award-winning deals\nDeutsche Bank also won five deal awards from GlobalCapital, including ‘Best ESG Bond’ and ‘Best Leveraged/Acquisition Finance’ deal.\nAmit Khattar, APAC Head of Investment Banking, said: “These wins once again reinforce that Deutsche Bank is not only a trusted partner for executing complex and innovative transactions in the region, but we are a leading financing house in Asia Pacific.”\nThe GlobalCapital awards span both global and Asian firms across Equity Capital Markets (ECM), Debt Capital Markets (DCM) and loan syndication. \nGlobalCapital Asia 2021 Awards for Deutsche Bank\nHigh Yield Bond House\nBest High Yield Syndicated Land Best Loan: Grab Holding’s 2 billion US dollar five year term loan B\nBest Leveraged / Acquisition Finance: 817.9 million US dollar five year loan for Blackstone’s leveraged buyout of Mphasis\nBest Investment Grade Bond: Indofood CBP Sukses Makmur’s 1.75 billion US dollar dual-tranche bond\nBest Financial Bond: AIA Group’s 750 million US dollar subordinated 12NC7 tier two bond\nBest ESG Bond: JSW Hydro Energy’s 707 million US dollar green bond",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 1
}