{
    "url": "https://www.db.com/news/detail/20220105-bnp-paribas-and-deutsche-bank-complete-the-transfer-of-global-prime-finance-and-electronic-equities-to-bnp-paribas?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "January 5, 2022",
    "tags": [
        "Investment Banking"
    ],
    "title": "BNP Paribas and Deutsche Bank complete the transfer of global prime finance & electronic equities to BNP Paribas",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB)\nBNP Paribas and Deutsche Bank announce that the transfer of clients, technology and key staff from Deutsche Bank’s Global Prime Finance and Electronic Equities businesses to BNP Paribas has been successfully completed by the end of 2021, in line with the targeted timeline.\nThe successful global integration was driven by strong collaboration between the teams of both firms as well as full support from the management at BNP Paribas and Deutsche Bank. Over the course of the past two years, BNP Paribas has transferred approximately 900 staff globally from Deutsche Bank.\nOlivier Osty, Head of Global Markets and member of the Executive Committee at BNP Paribas said: “We are delighted to have completed this global migration on schedule. By leveraging the strengths of the integrated platform, BNP Paribas is well-positioned to be the leading European Prime Services player on the global stage, establishing the new standard in prime services and electronic equities for institutional investors and corporate clients across the world.”\nRebecca Short, Chief Transformation Officer and member of the Management Board, Deutsche Bank said: “We are pleased to have completed this complex transition on schedule. It is the result of strong and sustained collaboration between both teams who worked seamlessly to provide continuity to clients as well as a significant number of employees. With this, Deutsche Bank has achieved a key milestone in its ongoing transformation that is seeing it re-focus its business to become sustainably profitable.”\nFor further information please contact the names on the right at Deutsche Bank or:\nBNP Paribas\nMedia Relations                         \ngiaime.porcu@bnpparibas.com\n+33(0)6 07 06 08 55",
    "number_of_ratings": 5,
    "rating": 1.6,
    "likes": 45
}