{
    "url": "https://www.db.com/news/detail/20181219-cookstoves-and-wind-parks-how-deutsche-bank-is-helping-to-create-a-low-carbon-economy?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "December 19, 2018",
    "tags": [
        "Company",
        "Sustainability"
    ],
    "title": "Cookstoves and wind parks: how Deutsche Bank is helping to create a low-carbon economy",
    "body": "Deutsche Bank’s business operations have been carbon neutral since 2012* – one of only a few companies in the German DAX30 to achieve this feat. Since 2008, the bank has switched to renewable energy sources where possible, investing in wind farms and hydroelectrics to wholly power its business in Germany, the US and the UK.\nThe Corporate Services team also continually improves the bank’s energy consumption by operating buildings more efficiently, for example with automated lighting and efficient heating and cooling systems.\nHowever, “no business can achieve 100% carbon neutrality until plane, train and automotive travel becomes fully green,” said Samson Jeremiah from Corporate Services. Jeremiah’s team measures the bank’s entire energy consumption – distances flown, rail and automotive travel and energy consumption in buildings – and converts it into CO₂e (carbon dioxide equivalent). “Taking this into account, it means we produce an unavoidable emissions level of 250,000 tons of carbon dioxide per year – but our commitment to carbon neutrality means we reduce our carbon footprint through 100% carbon offsetting.”\nCarbon offsetting means reducing carbon dioxide emissions or greenhouse gases to counterbalance an emission made elsewhere. Carbon retirement is purchasing “pollution permits”, EU Allowances, and permanently removing them from the system so they can no longer be used.\nThis means that heavily polluting industries are required to reduce their emissions instead of buying permits and continuing to pollute. Deutsche Bank voluntarily purchases and retires the equivalent of its 250,000 tons of CO₂ in order to neutralise its carbon footprint.\n“Project developers create energy-efficient products – like the Ugandan cookstoves – but these incur costs for materials, educational training, production and the like,” said Jeremiah. “These costs are rendered as ‘carbon certificates’, which Deutsche Bank buys. The funding is then fed directly into the project to allow the product to reach the market.”\nContributing to sustainable development\nGroup Sustainability works with service providers like FirstClimate to select the projects. This year, Deutsche Bank has been supporting a project run by a startup called impactcarbon.\nThe project is centred on a new type of cookstove that would change the lives – and the environment – of the Ugandan people: it is locally produced, uses up to fifty per cent less charcoal, cooks faster and produces less smoke than its predecessors.\nThese features help reduce deforestation, greenhouse gas emissions and dangerous pollutants that lead to serious health risks, while increasing water availability. It also saves the average Ugandan household more than 100 US dollars each year.\n“Deutsche Bank is about enabling business with a purpose and that’s a mandate that fits with this project,” said Jochen Gassner, FirstClimate CEO. “Not only are the carbon reductions from this project certified by the highest Gold Standard; it also supports social and economic development by training the manufacturers, supporting retailers and setting up efficient distribution channels. To date, it has distributed 500,000 cookstoves and positively impacted two million people in Uganda.”\nThis year, in addition to the cookstoves, the bank has supported five projects in Zimbabwe, Indonesia, Peru and on the Caribbean island of Aruba, where by building a wind park greenhouse gas emissions are to be reduced by an estimated 153,000 tons of CO₂ per year.\n“We seek out partners and projects like these to ensure that we’re not only achieving the goals set out by our Management Board around reducing, avoiding and offsetting our own carbon emissions, but to contribute to a sustainable development” said Viktoriya Borysova, Head of Group Sustainability.\nFor Deutsche Bank to accept certificates from projects, they must support the transition to a low-carbon economy, for example solar, wind, and s hydro. Only projects that invest in mature technologies are considered, unless the NGO can prove the robustness and continuity of emission reduction in innovative technologies. And projects must be certified, verified, validated and monitored by a recognised governing body, such as Gold Standard or the American Carbon Registry.\nA long-term commitment\nIn its continued commitment to carbon neutrality, Deutsche Bank has joined the “Development and Climate Alliance”, launched this November by German Development Minister Gerd Mueller.\nThe climate protection and sustainable development initiative calls on German organisations, companies to avoid or reduce CO₂ emissions and offset unavoidable emissions through projects in developing and emerging countries. Seventy partners across Germany, including Deutsche Bank, have already signed up.\n“This is an important step in Germany’s contribution to the Paris Agreement and combating climate change globally,” said Borysova. “The private sector must do its part in achieving the goals set out in 2015 – it is our responsibility to participate.”\nFirstClimate has also joined the Alliance and Gassner agrees that signing up is crucial in the fight against climate change. “This initiative will give many German corporates the confidence to commit to carbon offsetting because they’ll see what others are achieving and can exchange ideas on carbon activities,” he said. “It’s important for well established companies like Deutsche Bank to lead by example in creating a low-carbon economy.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}