{
    "url": "https://www.db.com/news/detail/20181213-positiveimpact-in-the-holiday-season?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "December 13, 2018",
    "tags": [
        "Employee engagement"
    ],
    "title": "#PositiveImpact in the holiday season",
    "body": "The holiday season is a time for giving and sharing; a time for Deutsche Bank staff across the world to get involved in charitable projects and fundraising activities like these:\nDecember always kicks off with the World AIDS Day, with colleagues at a number of our offices buying and selling teddy bears to raise money and send a strong signal for a world without prejudice and social exclusion. This year, we raised more than 17,000 euros for the AIDS-Hilfe.\n\n\nOur charity bazaars have also become something of a holiday tradition at a number of locations: We invited our Made for Good partner charities and social enterprises to our offices in Birmingham, London, Milan, New York and Singapore where they had the chance to showcase their offers and sell their products.\nDuring this year's bazaar in Singapore, we announced the 2018 total amount for the bank's \"Donate One Day\" campaign. By donating a day's salary, employees in Singapore raised almost 420,000 Singapore dollars, the equivalent of about 270,000 euros! \"Donate One Day\" was launched back in 2010 and has raised a total 5.28 million Singapore dollars (3.7 million euros) to date.\nOne of our long-standing partnerships in the UK is with StreetSmart, a fundraising charity for homeless people. Guests at participating restaurants across the UK can donate by adding a voluntary amount of £1 to their bill. Deutsche Bank started supporting StreetSmart in 2006 and has enabled the charity to raise 6.8 million pounds since then.\nIn Germany, more than 400 colleagues have volunteered in 43 team challenges in the run up to Christmas. Some have organized charity bazaars, Christmas parties or baking and handicraft sessions with children and senior citizens, while others have supported “Christmas in a Shoebox”, packing 1,000 presents for disadvantaged children in Eastern Europe – or fulfilled a wish written on one of the 1,400 wish cards hanging on Christmas trees in Deutsche Bank office buildings.\nOur New York employees are just as active. Since 2010, they too fulfill “Winter Wishes” – 1,165 letters this season alone. And our Spanish colleagues support a campaign by Cooperacion Internacional ONG to distribute more than 10,000 presents to children at risk of social exclusion.\nIn the UK, employees have collected over 470 presents for seriously ill children and over £2,000 in donations, others play an active role in children’s entertainment in local London hospitals alongside the Rays of Sunshine team.\n“Our various holiday season activities round off another very successful year of our Plus You volunteering and giving community. Once again, lots of colleagues have gone out of their way to support our programmes that enable communities and economies to prosper,” says Lareena Hilton, Global Head of Brand Communications & CSR.\nAll this commitment will continue in the upcoming winter months, with colleagues already looking forward to supporting soup kitchens in local Frankfurt churches and the Whitechapel Mission in London that delivers Day Care Services for the homeless and the marginalised.\nThanks to all our colleagues who have a positive impact in their community. And Seasons Greetings to all!",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}