{
    "url": "https://www.db.com/news/detail/20181204-claudio-de-sanctis-appointed-ceo-of-deutsche-bank-switzerland-ltd?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "December 4, 2018",
    "tags": [
        "Company"
    ],
    "title": "Claudio de Sanctis appointed CEO of Deutsche Bank (Switzerland) Ltd",
    "body": "Deutsche Bank has appointed Claudio de Sanctis as the new Chief Executive Officer of Deutsche Bank (Switzerland) Ltd, effective February 1, 2019, after Peter (Pedro) Hinder decided to step down.\nThe appointment by the Board of Directors of Deutsche Bank (Switzerland) Ltd occurred ahead of de Sanctis’ first day today in the new role of Head of Deutsche Bank Wealth Management (WM) Europe under a regional reorganisation announced in August.\nClaudio de Sanctis is an experienced professional with a longstanding and proven track record in wealth management and as a leader. He has known the Swiss financial industry for many years and is well positioned to take the helm of Deutsche Bank’s operations in Switzerland in addition to his role as Head of Wealth Management Europe.\nFabrizio Campelli, Global Head of Deutsche Bank Wealth Management\nDe Sanctis succeeds Hinder in Switzerland, who informed the bank of his decision to pursue other opportunities outside the bank after the regional reorganisation. Hinder will leave the bank at the end of January 2019 after an orderly handover to de Sanctis.\nHinder joined Deutsche Bank in 2015 as Chief of Staff for Private, Wealth & Commercial Clients (PW&CC) in Frankfurt where his role included working closely with the leadership of the WM division on its strategy. In 2016, Hinder was appointed Head of WM Europe, the Middle East and Africa (EMEA), CEO of Deutsche Bank (Switzerland) Ltd and Chief Country Officer in Switzerland.\nThe business has taken significant steps since then including building up Luxembourg as a second cross-border booking centre; almost halving the number of booking centres; installing a new management team in the UK; and significantly increasing gross inflows into Discretionary and Wealth Advisory Mandate solutions.\nFabrizio Campelli said: “We are very grateful for the contribution Pedro has made to our business and his sincere dedication at a time of transition. Under his leadership, the WM EMEA platform was made leaner, more effective and more cost efficient. This is a success we can now build upon.”\nFor further information:\nDeutsche Bank (Switzerland) Ltd.\nYves Kaufmann Lobato\nTelephone: +41(44)224-5864\nE-mail: yves.kaufmann-lobato@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}