{
    "url": "https://www.db.com/news/detail/20240326-deutsche-bank-s-annual-general-meeting-2024-shareholders-to-vote-on-50-per-cent-increase-in-dividend?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, March 26, 2024",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank’s Annual General Meeting 2024 – shareholders to vote on 50% increase in dividend",
    "body": "The Management Board and Supervisory Board propose a dividend of € 0.45 per share for 2023, up from € 0.30 per share for 2022\nVirtual AGM 2024 will provide extensive opportunities for shareholder questions and contributions and will again be publicly broadcast on the internet, including the general debate and voting results\nProposal for the Management Board compensation system to be adjusted and simplified\nDeutsche Bank (XETRA: DBKGn.DE / NYSE: DB) will this year again hold its Annual General Meeting in a virtual format. The entire AGM on May 16, 2024, will be broadcast live on the bank’s website agm.db.com.\n\"We are pleased to be able to propose another 50 percent year-on-year increase in our dividend. Deutsche Bank’s successful transformation sharpens our focus on clients and enables us to boost returns to shareholders,” said Supervisory Board Chairman Alex Wynaendts. He added: \"Our virtual format, which worked well last year, will once again allow shareholders from Germany and abroad to fully exercise their rights in an efficient manner without having to be physically present. We very much look forward to a lively exchange with our shareholders.\"\nShareholders who register by midnight (CEST) on May 10, 2024, can participate online via the access-protected shareholder portal, where they can also exercise their voting rights, speak live during the meeting and raise questions as provided by law.\nThe agenda, which comprises 9 items in total, was published in the German Federal Gazette (Bundesanzeiger) and on Deutsche Bank’s website (agm.db.com) on March 26, 2024.\nAs announced in early February 2024, the Management Board and Supervisory Board propose a cash dividend of € 900 million, or € 0.45 per share for the financial year 2023. This represents a year-on-year increase of 50% from a dividend of € 0.30 per share paid for 2022 and is in line with Deutsche Bank’s ambition to distribute around € 8 billion of capital to shareholders in respect of the financial years 2021 to 2025.\nHaving raised its capital outlook by € 3 billion in October 2023, management sees the bank well positioned to exceed its capital distribution goal of € 8 billion in respect of the financial years 2021-2025, paid in 2022-2026. From 2025 onwards, the Management Board aims to distribute a total of 50% of the net profit attributable to shareholders, and in February 2024 published its additional goal for a dividend of € 1.00 per share in respect of the year 2025.\nThe Supervisory Board proposes to the General Meeting to approve a simplified compensation system of the Management Board. In February, the Supervisory Board approved a corresponding recommendation by the Compensation Control Committee which, among other points, significantly reduces the number of targets in the Management Board compensation system. In addition, the long-term component of variable compensation will in future be based on a forward-looking assessment period instead of the previous, retrospective view when measuring performance, in order to align Management Board compensation even closer to shareholders’ long-term interests. The new remuneration system has been in use since January 1, 2024, and is set out on the company’s website.\nParticipation in the AGM 2024\nThis year’s AGM format provides the opportunity for Deutsche Bank shareholders to fully exercise their rights.\nRegistered shareholders can submit questions in advance via the shareholder portal by midnight (CEST) on May 12, 2024. Registration for the AGM is possible until midnight (CEST) on May 10, 2024.\nThe bank's responses to pre-submitted questions will be published on the website at agm.db.com no later than midnight (CEST) on May 14, 2024, further improving transparency for shareholders. \nAs in previous years, shareholders will again be able to speak through the means of video communication during the AGM. All relevant types of requests for information (i.e. follow-up questions as well as questions on new topics in accordance with § 131 (1d) and (1e) Stock Corporation Act) may be part of the speeches. \nThe speeches of the Chairman, Alexander Wynaendts, and Chief Executive Officer, Christian Sewing, will be published on the bank’s website at agm.db.com by midnight (CEST) on Wednesday, May 8, 2024. \nShareholders have the right to submit statements on the agenda items in text form by means of electronic communication by no later than midnight (CEST) on Friday, May 10, 2024. The company will make the statements available on the website at agm.db.com. \nDetails on the interactive options are included in the Invitation to the AGM, which can be downloaded from agm.db.com.",
    "number_of_ratings": 28,
    "rating": 4.1,
    "likes": 63
}