{
    "url": "https://www.db.com/news/detail/20240322-deutsche-bank-s-private-bank-wins-a-record-15-euromoney-awards?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "March 22, 2024",
    "tags": [
        "Europe",
        "Germany",
        "Awards",
        "Wealth"
    ],
    "title": "Deutsche Bank’s Private Bank wins a record 15 Euromoney awards",
    "body": "Deutsche Bank today announced its Private Bank has won a record 15 awards in this year’s Euromoney Global Private Banking Awards, the gold standard for global private banking and wealth management excellence and leadership.\nIn addition to being named World’s Best for Entrepreneurs, World’s Best for Ultra High Net Worth and World’s Best Transformation, Deutsche Bank was named Western Europe’s Best for Ultra High Net Worth and High Net Worth, and won many other individual awards for its private banking business in Germany, Belgium, Italy, Spain and Switzerland.\nDeutsche Bank’s Private Bank won the following in the Euromoney Global Private Banking Awards 2024:\nWorld's Best for Entrepreneurs\nWorld's Best for Transformation\nWorld's Best for UHNW\nWestern Europe's Best for UHNW\nWestern Europe's Best for HNW\nBelgium's Best for HNW\nGermany's Best Domestic Private Bank\nGermany's Best for UHNW\nItaly's Best International Private Bank\nItaly's Best for Family Office Services\nItaly's Best for Sustainability\nSpain’s Best International Private Bank\nSpain’s Best for Next-Gen\nSpain’s Best for Sustainability\nSwitzerland’s Best for HNW\nHead of Private Bank and member of the Management Board, Claudio de Sanctis, said: “Winning a trifecta of global private banking titles speaks volumes of what we have achieved together for our private banking and wealth management business. Furthermore, winning a great number of individual awards for our European business reflects our leadership role as a European champion. I am extremely proud of these awards, because they not only highlight the success of our own transformation, but the impact we are having on the competitive landscape.”\nCommenting on Deutsche Bank’s accomplishments, Euromoney publishers said: “Coming away with 15 awards, Deutsche Bank was among the top five financial institutions in terms of individual wins in Euromoney's 2024 Global Private Banking Awards. It achieved its position after impressing judges and the internal panel through its commitment to enhancing its private banking offering and by demonstrating impressive financial performance and market share.”",
    "number_of_ratings": 14,
    "rating": 4.7,
    "likes": 49
}