{
    "url": "https://www.db.com/news/detail/20240321-deutsche-bank-hires-tony-kerrison-as-head-of-group-technology-infrastructure?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "March 21, 2024",
    "tags": [
        "Digitalisation"
    ],
    "title": "Deutsche Bank hires Tony Kerrison as Head of Group Technology Infrastructure",
    "body": "Deutsche Bank today announced that it has hired Tony Kerrison to be Head of Group Technology Infrastructure and Head of Technology, Data and Innovation Americas, effective May 1, 2024. He will be based in New York and report to Bernd Leukert, Chief Technology, Data and Innovation Officer and Member of the Management Board. In his regional role, he will have an additional reporting line into Stefan Simon, Chief Administrative Officer and Head of Americas.\nKerrison will lead the newly established Group Technology Infrastructure function and be responsible for the continued transformation of Deutsche Bank’s technology environment to support business success, reduce cost and improve resilience. He will oversee the performance and continuous improvement of the bank’s hardware, software, networks, data centres and storage. This includes enabling our developers to focus on coding by accelerating our hybrid cloud strategy and automating the administration and controls needed to power our applications. Shared services and components will deliver ease and consistency to application development, while modern collaboration tools will support the productivity of all employees.\n“In Tony Kerrison, we welcome a highly respected leader who has delivered major technology transformations during his distinguished career,” said Bernd Leukert. “We have ambitious goals to deliver automated, effective and well-controlled technology infrastructure to support our client activities and significantly reduce costs. Tony brings the required expertise and track record to take our technology transformation to the next level.”\nKerrison joins from Bank of America where he was most recently Chief Technology Officer and led Core Technology Infrastructure. In this role, he was responsible for the strategy, architecture, engineering and operations for Technology Infrastructure globally across all businesses. Kerrison has held senior technology positions at a number of large US and European banks.\n“Technology is at the centre of Deutsche Bank’s sustainable growth ambitions, and it is impressive to see the foundations and talent already in place,” said Tony Kerrison. “Delivering a technology environment that is efficient, reliable and resilient is essential for business success, and I look forward to helping deliver the next stage of its strategy.”",
    "number_of_ratings": 5,
    "rating": 5.0,
    "likes": 9
}