{
    "url": "https://www.db.com/news/detail/20240314-deutsche-bank-publishes-annual-report-2023?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "March 14, 2024",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy",
        "Sustainability"
    ],
    "title": "Deutsche Bank reports growth, raised capital distributions and sustainability progress in 2023",
    "body": "2023 Annual Report: business growth, cost discipline and raised capital distributions\nFinancial performance:\nRevenue growth of 6%, 8% ex-specific items¹; net inflows of € 57 billion\nNoninterest expenses up 6%, with adjusted costs¹ up 3%\nProfit before tax up 2% to € 5.7 billion with net profit of € 4.9 billion\nPost-tax return on average shareholders’ equity (RoE)¹ of 6.7%, post-tax return on average tangible shareholders’ equity (RoTE)¹ of 7.4%\nCost/income ratio stable at 75%\nCompensation cost discipline:\nTotal compensation costs of € 10.3 billion, up 1%\nFixed Pay up 3% to € 7.9 billion\nPerformance-based variable compensation down 6% to € 2.0 billion\nCapital strength enables growth in capital distributions to shareholders\nCommon Equity Tier 1 (CET1) ratio of 13.7% at year-end 2023\nProposed dividend of € 0.45 per share in respect of 2023 and € 675 million in announced share buybacks in 2024 bring capital distributions to € 1.6 billion during the first half of 2024, up 50% year on year\n2023 Non-Financial Report: further progress on sustainability\nManagement Board compensation linked to decarbonization targets\nNet-zero targets for seven carbon-intensive sectors, covering 54% of financed emissions of the corporate loan book\nIn-house (Scope 1 and 2) carbon emissions down 71% since 2019, with 97% of electricity from renewable sources\nSustainable finance and ESG investment volumes rise by € 64 billion to € 279 billion cumulatively since the beginning of 20202\nGender diversity: 46% of all staff, 32% of senior roles and 40% of Supervisory Board positions held by women\nControls: ~500 additional Anti-Financial Crime specialists in 2023\n€ 52.6 million invested into Corporate Social Responsibility projects by Deutsche Bank and its foundations, reaching 1.7 million people in 2023\n“In 2023 we proved the strength of our Global Hausbank and its value for clients,” said Christian Sewing, Chief Executive Officer. “Business growth, combined with cost and risk discipline, enabled us to drive substantial increases in capital distributions to shareholders while making key investments in revenue generation, technology and controls. These investments have started to pay off, and this gives us great confidence that we will deliver on our 2025 targets.” He added: “We also made significant progress toward our goals of building a more sustainable Deutsche Bank and creating a diverse, inclusive work environment for all our talents.”\nDeutsche Bank (XETRA: DBKGn.DE / NYSE: DB) today published its 2023 Annual Report containing its audited results for the year. There were no divergences from the bank’s preliminary, unaudited results published on February 1, 2024, and presented at the bank’s Annual Media Conference on the same day.\n2023: business growth and accelerated execution of the Global Hausbank strategy\nDeutsche Bank’s 2023 audited financial results confirm the strategic and financial progress of the bank in 2023, with business growth and organic capital generation, combined with cost and risk discipline, enabling sustained momentum in capital distributions to shareholders.\nAs noted in the 2023 Annual Report, financial performance included:\nProfit before tax up 2% year on year to € 5.7 billion\nNet revenues of € 28.9 billion, up 6%, and up 8% excluding specific items¹\nNoninterest expenses of € 21.7 billion, up 6%, reflecting higher nonoperating items, while adjusted costs¹ rose 3% to € 20.6 billion\nProvision for credit losses contained, at 31 basis points of average loans\nNet income of € 4.9 billion, down 14%, reflecting higher tax expenses\nPost-tax RoTE¹ of 7.4% and a cost/income ratio of 75%\n\nStrong capital management enabled Deutsche Bank to make further progress towards its capital distribution goals in 2023:\nThe CET1 ratio rose to 13.7% at year-end 2023, from 13.4% at the end of 2022\n€ 1.05 billion in distributions paid in 2023, up 50% over 2022, comprising dividends of € 0.30 per share for 2022 and share buybacks of € 450 million\n€ 1.6 billion in proposed distributions for 2024, up 50% over 2023, comprising dividends of € 0.45 per share for 2023 and share buybacks of € 675 million\nDeutsche Bank raised its capital outlook for 2025 by € 3 billion in 2023 and is well positioned to exceed its goal of € 8 billion in total distributions to shareholders paid in 2022-2026\nAccelerated execution of the Global Hausbank strategy enabled further updates to Deutsche Bank’s goals for 2025. These include:\nRevenues of around € 32 billion, with an annual revenue growth target raised to 5.5%-6.5% compounded between 2021 and 2025, up from 3.5%-4.5%\nNon-interest expenses of around € 20 billion, reflecting lower nonoperating costs1 and further savings from the bank’s € 2.5 billion operational efficiency programme, and a quarterly run rate of adjusted costs1 of around € 5 billion\nPositioning the bank to accelerate capital distributions, with updated dividend guidance of € 1.00 per share in respect of the financial year 2025 \nCompensation: rewarding performance while maintaining cost discipline\nTotal compensation awarded to Deutsche Bank employees in respect of 2023 was € 10.3 billion, up 1% compared to € 10.2 billion in 2022.\nFixed Pay was € 7.9 billion, up 3% year on year. This development primarily reflected a rise in the workforce of 5,200 full-time equivalents (FTEs) to 90,130 FTEs during the year, driven by growth in the bank’s businesses and control functions and by internalisations of external staff\nPerformance-based variable compensation was € 2.0 billion, down 6% year on year. This development reflected recognition of the bank’s financial performance and business growth, balanced with cost discipline \nThe Management Board received total compensation for 2023 of € 64.6 million, down slightly versus € 64.9 million in 2022. Management Board compensation is set by the Supervisory Board and reflects performance against the bank’s financial and non-financial objectives, including 2023 financial performance, progress on implementing the bank’s Global Hausbank strategy, attainment of ESG objectives and measures to improve controls and accelerate regulatory remediation. Variable compensation for Management Board members includes both short-term and long-term awards, with payouts deferred over several years.\nIn the 2024 Annual General Meeting, the bank will propose amendments to the Management Board Compensation framework for 2024 and beyond. These will aim to reduce complexity, increase transparency, and align variable compensation awards for Management Board members still more closely to the longer-term interests of shareholders.\nThe Compensation Report, published today on pages 387-447 of the Annual Report, contains further information on Deutsche Bank’s compensation policies, frameworks and governance, and additional details of compensation for Management Board and Supervisory Board members.\n2023 Non-Financial Report\nDeutsche Bank’s 2023 Non-Financial Report, also published today, outlines the bank’s progress on its sustainability agenda and targets, including governance and operations; technology, data and innovation; and employees and corporate social responsibility activities during 2023.\nSustainability: significant steps forward in 2023\nManagement Board compensation linked to decarbonization targets: for the first time, Deutsche Bank links part of the compensation of the Management Board to the decarbonization of its corporate loan portfolio. This is reflected in the ESG component of the Long-Term Incentive for Management Board members from 2024 onwards. The environmental aspect is solely contingent upon achieving reduction targets for reducing financed emissions in specific carbon-intensive sectors on the bank’s pathway to net zero. This measure goes beyond the carbon-related targets which formed part of Management Board compensation-setting in recent years.\nNet-zero targets for seven carbon-intensive sectors: in October 2023, as part of its Initial Transition Plan, Deutsche Bank expanded the scope of its decarbonization plans by publishing net-zero targets for its corporate loan book in three additional industry sectors: coal mining (both thermal and metallurgical), cement and shipping. As a result, seven carbon-intensive sectors, representing 54% of the total financed emissions of the corporate loan book (scope 1 and 2 of the corporate clients), are now covered by net-zero targets by 2030 (interim) and 2050 (final). Together with the publication of Deutsche Bank’s\nPDF\nwhite paper on European Residential Real Estate in May 2023, 60% of the bank’s total loan book is covered by financed emissions disclosures. Deutsche Bank plans to continue this progress in 2024 with the publication of net-zero targets for at least two further industry sectors.\nProgress on decarbonization: Deutsche Bank today reports progress on reducing financed emissions in the sectors now covered by net-zero targets during 2023:\nOil & Gas (upstream): Scope 3 financed emissions were 18.5 million tons of CO2 per year (MtCO2/y) at year-end 2023, up 11% year on year but down 21% versus the 2021 baseline of 23.4 MtCO2/y. The year-on-year increase in 2023 reflected client portfolio effects and FX movements, as a strengthening US dollar increased loan exposure reported in euros, partly offset by lower client emission factors due to rising Enterprise Values Including Cash (EVICs) in 2022\nPower generation: Scope 1 emission intensity of the bank’s portfolio was down 3.9% year on year to 371 kilograms of CO2 equivalent per megawatt hour (kgCO2e/MWh), down from a 2021 baseline of 396 kgCO2e/MWh, reflecting improvements in the physical emission intensity of the portfolio\nAutomotive (light duty vehicles): Scope 3 physical emission intensity was down 15% year on year to 159 grams of CO2 per vehicle kilometer (gCO2/vkm), down from a 2021 baseline of 190 gCO2/vkm, reflecting lower emission intensity driven by decarbonization efforts of clients\nSteel: Scope 1 and 2 physical emission intensity was reduced by 7.5% year on year to 1,384 kilograms of CO2 equivalent per ton (kgCO2e/t), down from the 2021 baseline of 1,519 kgCO2e/t, reflecting data quality improvements for selected client assets\nCoal Mining: Scope 3 financed emissions down 23% year on year to 6.1 million tons of CO2 per year (MtCO2/y), roughly equally split between thermal and metallurgical coal and down from the 2022 baseline of 7.9 MtCO2/y. This development partly reflected selected client exits, client portfolio effects and a decline in client emission factors due to rising EVICs in 2022. This was partly offset by the aforementioned FX movements\nCement: Scope 1 and 2 physical emission intensity was 764 kilograms of CO2 equivalent per ton (kgCO2e/t), up slightly versus the 2022 baseline of 731 kgCO2e/t, reflecting volatility in a small portfolio with total loan commitments of € 0.3 billion\nShipping: Deutsche Bank’s Poseidon Principles Portfolio Climate Alignment Scores, of 14.1% (Minimum trajectory) and 18.3% (Striving trajectory), both compared favorably with industry average according to the Revised Strategy of the UN’s International Maritime Organisation in respect of 2022 (Source: Poseidon Principles). In line with the Poseidon Principles methodology, Deutsche Bank plans to publish its 2023 scores with its 2024 reporting\nSustained progress and raised targets for in-house ecology: Deutsche Bank has reduced emissions from its own operations (scope 1 and 2) by 71% since 2019. The bank also raised its target for reducing total energy consumption by 2025 to 30% below 2019 levels, up from 20%. The share of Deutsche Bank’s electricity sourced from renewables reached 97% in 2023 and the bank is on track to reach 100% by 2025. Supply chain emissions were 1,286,521 metric tons of CO2 equivalent in 2023, up 3.8%, over 2022, partly reflecting a higher number of employees.  Deutsche Bank tightened sustainability criteria for suppliers in 2023 and set a 2030 interim target for a 46% reduction in emissions from its own operations and supply chain versus 2019.\nSustainable finance and ESG investment volumes² rise to € 279 billion: business volumes in sustainable finance and ESG investments (ex-DWS) rose by € 64 billon during 2023 to reach a cumulative € 279 billion since the beginning of 2020. Cumulative financing volumes grew 35% to € 119 billion, capital market issuance volumes rose 27% to € 114 billion, and assets under management grew 24% to € 46 billion during 2023. In addition, DWS’s ESG assets under management grew by € 16 billion to € 133 billion in 2023.\nNew commitments to nature and biodiversity: in 2023, Deutsche Bank expanded its sustainability activities in new areas. The bank established a Nature Advisory Panel, which includes distinguished external experts, to assess nature-related risks and identify new financial offerings to combat biodiversity loss. Deutsche Bank became the first bank to join #BackBlue, a UN-backed initiative to support ocean protection.\nFurther investments in fighting financial crime: Deutsche Bank continued to invest in Anti-Financial Crime (AFC) capabilities during 2023. The number of dedicated AFC specialists rose by nearly 500 FTEs to 2,431 during the year. The AFC programme also delivered process and control enhancements in risk assessment, Know-Your-Client (KYC) controls and transaction controls, including monitoring and filtering.\nEmployees: sustained investments in talent and diversity\nImprovement in key people indices: In Deutsche Bank’s 2023 People Survey, which saw its highest response rate since 2011, the Employee Commitment Index improved to 70%, versus 69% in 2022. The Employee Feedback Culture Index also improved, from 73% to 74%.\nFurther progress on gender diversity: in 2023, women accounted for 46.3% of Deutsche Bank’s total workforce. Deutsche Bank made further progress towards its goal of promoting gender diversity in senior roles and in inclusion in talent development programmes:\nWomen accounted for 32.3% of Management Director, Director and Vice President roles in 2023, up from 30.7% in 2022. The bank remains on track to meet its ’35 by 25’ commitment, of raising this proportion to 35% by 2025\nWomen accounted for 42% of the bank’s Director Acceleration Programme and 49% of the Vice President Acceleration Programme\n40% of Supervisory Board members were women, up from 30% in 2022\nIncreased investment in talent: Deutsche Bank hired 1,177 graduates in 2023, up by nearly half over 793 in 2022, and 547 vocational trainees, up from 485 in the prior year. Employees completed around 725,000 hours of training, some 100,000 more than in 2022, and training expenses increased by 30% year on year to € 43.7 million.\nCorporate Social Responsibility: further support for communities\nDeutsche Bank and its employees continued their support for communities during 2023. The bank invested € 52.6 million into social commitments, and its Corporate Social Responsibility (CSR) and Art, Culture and Sport programmes reached 3.9 million people, up from 3.3 million in 2022. CSR programmes, which reached 1.7 million people in the year, up from 1.4 million in 2022, included:\nDeutsche Bank’s youth engagement programme, comprising 138 education projects in 34 countries with the aim of raising aspirations, fostering skills and improving access to education and employment opportunities for young people. The bank pledged € 1 million for youth education initiatives aimed at countering antisemitism and other forms of racial and ethnic discrimination\nPromoting financial literacy: Deutsche Bank and its employees support over 10 projects worldwide aimed at improving financial literacy and inclusion, which have reached more than 65,000 young people since 2021. In 2023, more than 100 Deutsche Bank employees shared financial knowledge with more than 6,000 young people in a four-week school tour across Germany\nBuilding strong, inclusive communities: in 2023, Deutsche Bank supported 141 community projects in 29 countries providing basic welfare, supporting homeless people, promoting affordable housing together with emergency relief and disaster recovery in crises\nDeutsche Bank’s environmental impact programme, which in 2023 supported 47 projects in 20 countries focused on oceans, coastlines, rivers and wetlands, forests, farmland and urban green spaces, both through protection and restoration and by raising understanding through education\nDeutsche Bank’s enterprise programme, which provides advice, support and better access to networks and funding for social and creative enterprises in eight countries\nIncreased employee volunteering: more than 23,400 of Deutsche Bank’s employees gave their time to volunteering for social initiatives in 2023, or 27% of the total workforce, up from 22% in 2022. Employees dedicated more than 212,000 hours to volunteering in 2023, up from around 187,000 hours in 2022.\nOther financial and regulatory reports\nToday Deutsche Bank also published its 2023 Pillar 3 Report and Annual Financial Statements of Deutsche Bank AG under German accounting rules (HGB). In addition, the Annual Report on Form-20-F 2023 will be made available.\n¹ For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ on pp 15-24 of the fourth quarter 2023 Financial Data Supplement\n² Cumulative ESG volumes include sustainable financing (flow) and investments (stock) in the Corporate Bank, Investment Bank and Private Bank from January 1, 2020 to date, as set forth in Deutsche Bank’s Sustainability Deep Dive of May 20, 2021. Products in scope include capital market issuance (bookrunner share only), sustainable financing and period-end assets under management. Cumulative volumes and targets do not include ESG assets under management within DWS, which are reported separately by DWS.\n  Final and audited results at a glance\nAll reports can be downloaded at www.db.com/annual-reports. The Annual Report on Form 20-F 2023, which will be submitted to the US Securities and Exchange Commission today, will also be made available following submission (English only) on the Investor Relations website at www.db.com/SEC-Filings. The Financial Data Supplement can be downloaded at www.db.com/quarterly-results.",
    "number_of_ratings": 7,
    "rating": 4.3,
    "likes": 51
}