{
    "url": "https://www.db.com/news/detail/20230725-deutsche-bank-plans-to-initiate-share-repurchases-of-up-to-EUR450-million-in-2023-starting-in-august?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "July 25, 2023",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank plans to initiate share repurchases of up to €450 million in 2023 starting in August",
    "body": "Deutsche Bank (XETRA: DBGn.DB / NYSE: DB) plans to recommence share repurchases over the remainder of 2023. The bank targets a volume of 2023 share repurchases of up to € 450 million, roughly 50% higher than in 2022, in line with the 50% rise in its dividend per share from € 0.20 to € 0.30 in respect of 2022 which was paid following Deutsche Bank’s Annual General Meeting in May this year. The bank has received the requisite supervisory approvals and aims to commence repurchases in August.\n“We are very pleased that, with the approval of our supervisor, we are able to continue on the path of distributing capital to our shareholders,” said Christian Sewing, Chief Executive Officer. “This represents an important step towards our capital distribution objectives, a key element of our Global Hausbank strategy.”\nJames von Moltke, Chief Financial Officer, added: “This is an important milestone for us. Deutsche Bank’s successful transformation has delivered strong organic capital generation as we promised, and we are very pleased to be able to turn this strength into returns for our shareholders. We have committed to return € 8 billion of capital to shareholders in respect of the years 2021-25, and today we reaffirm that objective.”\nThe bank expects total capital returned to shareholders in 2023, through dividends and share repurchases, to be over € 1 billion, compared to around € 700 million during 2022. This is expected to bring the total capital distributed to shareholders during 2022 and 2023 to be approximately € 1.75 billion. Deutsche Bank reaffirms its capital objectives for total anticipated distributions to shareholders of € 8 billion in respect of the financial years 2021-2025, for a 50% payout ratio from 2025, and for 50% annual dividend growth in respect of the financial years 2022-24.",
    "number_of_ratings": 37,
    "rating": 3.3,
    "likes": 1
}