{
    "url": "https://www.db.com/news/detail/20230713-deutsche-bank-awards-for-creative-entrepreneurs?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 13, 2023",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank Awards for Creative Entrepreneurs",
    "body": "On Thursday, July 6, the Deutsche Bank Awards for Creative Entrepreneurs (DBACE) announced the winners for the 2023 programme. Marking 30 years of the annual awards, DBACE celebrates and supports exceptional creative entrepreneurs driving positive social impact through business across the UK.\nWorking in partnership with MeWe360, a not-for-profit incubator for the creative industries, five outstanding entrepreneurs were awarded in a special ceremony held at The Royal Society of Arts. Hosted by Arts, Culture and Entertainment Correspondent Brenda Emmanus OBE with a keynote speech from Farooq Chaudhry OBE, co-founder Akram Khan Dance Company, the evening celebrated visionary thinkers who are working to bring their business goals to life.\nThe programme sits at the heart of the bank’s global Corporate Social Responsibility Made for Good pillar, which aims to support entrepreneurial ventures driven to create wider social good. Winners of DBACE will receive a collective prize fund of £60,000 and £100,000 of tailored business support and leadership development from MeWe360’s roster of high calibre industry mentors, consultants and vibrant network of creatives. In addition to the winners, five of the strongest shortlisted candidates will also receive a 12-month incubator membership, offering business and leadership support and training.\nThis year’s DBACE winners, selected for their exceptional commitment to driving positive societal change through creative enterprise, are:\nArtistry Youth Dance – a London based youth dance company that supports young people of African and Caribbean heritage, dedicated to empowering and developing the next generation of Black dance artists whilst cultivating a more culturally diverse UK dance community. Awarded £12,000\nLEVILE – a casting and media agency that specialises in providing genuine opportunities for diverse and underrepresented creative talent to the TV and film industries, both in front of and behind the camera. Awarded £15,000\nRehema Cultural Arts – an arts organisation that partners with cultural institutions to decolonise their collections relating to African history, ensuring African stories are told from an African perspective, widening access to Black communities. Awarded £10,000\nThe Bitten Peach – the UK’s first queer pan-Asian cabaret casting agency and production company on a mission to diversify Asian representation on stage. Cabaret art forms include drag, burlesque, dance, circus, comedy, music and spoken word. Awarded £13,000\nUnited in Design - a charity founded in 2020 to address the lack of equality, diversity and inclusion in the Interior Design Industry with a focus on those from ethnic minorities and lower socio-economic backgrounds. Awarded £10,000\nThis year, for the first time, DBACE was open to all applicants over the age of 18, with 573 entries received from a wide range of industries from creative arts organisations to podcast producers, fashion, media agencies and more. Eleven finalists pitched their business ideas to a distinguished judging panel at Deutsche Bank’s UK head office. The judging panel was made up of Lea Williams, Global Head of Financial Control Oversight, Deutsche Bank; Kevin Osborne, Create Equity Founder and CEO; Erika Brodnock, Co-Founder and CEO of Kinhub; Andrew Missingham, Executive Director of Consumer Insights at AKQA; Charlie Blair, The Blair Academy and DBACE winner 2021.\nAmy Harris, Head of Corporate Social Responsibility UK, Deutsche Bank, said: “This year marks a significant milestone for the programme, with three decades of Deutsche Bank recognising and celebrating creative enterprise. We are incredibly proud of the talented founders DBACE has supported over the years and look forward to witnessing the growth and societal impact 2023’s winners will have. Credit to the fantastic MeWe360 team too, for their continued expertise and commitment to our DBACE partnership.”\nLouise Nkosi, CEO, MeWe360, added: \"MeWe360 is honoured to play a part in the 30-year history of DBACE celebrating, and creating a path for, creative talent. In the five years since MeWe360 has come on board as delivery partner, we are proud to have seen DBACE continue to grow, quadrupling applications and broadening access to those less likely to connect with traditional investment and funding. The quality of applications gets stronger every year and we are excited to support DBACE 2023 winners in their journey towards transforming the world for the better.\"\nAs one of the UK’s longest-running creative enterprise programmes, DBACE has invested in over 400 talented entrepreneurs to date and supported 320 creative ventures, with thousands more applicants gaining valuable knowledge and skills through business knowledge building.\nSince launching in 1993 the awards have continued to drive innovation and evolve in response to the changing landscape of the UK’s creative sector, which has seen huge growth over the last three decades, along with an ever-deepening connection of ways in which creative entrepreneurship are addressing some of the most challenging issues facing society. \nTo keep up to date with DBACE and future year’s of the programme visit Deutsche Bank Awards for Creative Entrepreneurs. ",
    "number_of_ratings": 2,
    "rating": 1.5,
    "likes": 0
}