{
    "url": "https://www.db.com/news/detail/20230713-ceo-christian-sewing-named-banker-of-the-year-by-euromoney?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 13, 2023",
    "tags": [
        "Africa",
        "Germany",
        "Awards",
        "Investment Banking"
    ],
    "title": "CEO Christian Sewing named Banker of the Year by Euromoney",
    "body": "Deutsche Bank CEO Christian Sewing has been named Banker of the Year by Euromoney, the UK-based monthly business and finance trade publication. The first Deutsche Bank CEO to receive the long-running award, Sewing was singled out for transforming the bank and advocating for financial integration in Europe.\n“Since becoming chief executive of Deutsche Bank in 2018, Christian Sewing has driven a transformation of the firm, bringing a disciplined approach to costs and a radical reshaping of the scope of the bank's businesses,” Euromoney said. “At the same time, Sewing has been a passionate advocate for the European banking sector and closer union of the region's financial markets to tackle the transition financing challenge that Europe's economy faces.”\nIn his acceptance speech, Sewing said: “My goal when I took over as CEO in 2018 was to re-establish Deutsche Bank as a leading global bank – this time with a focused, balanced and more stable business with revenues coming from private banking, corporate banking and asset management as well as investment banking.”\nHe thanked all staff at Deutsche Bank for their “irrepressible will” to drive the bank forward. “I am grateful to each and every one of them for their passion and commitment,” he said.\nDeutsche Bank won in three other categories at the Euromoney 2023 Awards for Excellence, which have been running annually since 1992:\nBest Bank in Germany\nBest Investment Bank in Germany\nBest Bank for Financing in Africa\nOn the three other awards, Euromoney said:\nBest Bank in Germany\n“Deutsche Bank generates well over a third of its revenues in its home market, benefiting from rising rates that boosted business banking earnings, while at the same time containing credit costs on a diverse and high-quality loan book.”\nBest Investment Bank in Germany\n“The VTG deal was the second-largest European transport infrastructure transaction in 2022 and demonstrates Deutsche’s leadership in infrastructure M&A advisory following successful deals in 2021 – including BASF’s wind park acquisition and subsequent sale to Allianz Capital Partners.”\nBest Bank for Financing in Africa\n“Deutsche Bank has long had important corporate and investment banking operations on the African continent. It is one of the largest correspondent banks for African financial institutions and in the previous decade it helped many African sovereigns issue debut international bonds. Since Eurobond funding became unaffordable for many African states, Deutsche has stepped up by providing funding with backing from development finance institutions and export credit agencies.”",
    "number_of_ratings": 35,
    "rating": 3.2,
    "likes": 21
}