{
    "url": "https://www.db.com/news/detail/20230703-fitch-upgrades-deutsche-bank-s-credit-ratings?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 3, 2023",
    "tags": [
        "Company"
    ],
    "title": "Fitch upgrades Deutsche Bank’s credit ratings",
    "body": "The credit rating agency Fitch has upgraded Deutsche Bank’s ratings, placing the bank’s principal ratings in ‘A’ territory. Deutsche Bank’s Issuer Default Rating has been raised to ‘A-‘ from ‘BBB+’, with a Stable outlook, while the Viability Rating rises to ‘a-‘ from ‘bbb+’. Fitch raises both the bank’s Long-Term Deposit Rating and Senior Preferred Debt Rating from ‘A-‘ to ‘A’, while the Senior Non-Preferred Debt Rating rises to ‘A-‘, up from ‘BBB+’. \nThis represents the third positive move on Deutsche Bank’s credit ratings in the past two months, including upgrades from two agencies in the past two weeks. Last week, DBRS upgraded Deutsche Bank’s ratings, while S&P raised the Outlook on the bank’s ratings to Positive on May 17.\n“It is very encouraging to see yet more recognition for our transformation efforts from an important stakeholder,” Christian Sewing, Chief Executive Officer. “With a profitable and well-balanced business model and a strong balance sheet, we have built a solid platform to deepen our partnerships with clients and deliver sustainable growth.”\nJames von Moltke, Chief Financial Officer, added: “This upgrade underlines the strength and resilience of Deutsche Bank, which we demonstrated in challenging conditions earlier this year. We have transformed our stable businesses, which now complement our strength in investment banking. We have proven our risk discipline and our capital, liquidity and funding are strong.” \nKey factors driving this upgrade\nDelivery on transformation\nFitch comments: “Deutsche Bank’s ratings reflect the completion of the bulk of its restructuring and its more stable, fairly diversified business model,” adding, “The bank’s sound risk appetite, asset quality, funding and liquidity also support the ratings.” Fitch also notes that “Profitability has substantially improved in the past four years.”\nA balanced business model…\nFitch adds that transformation has improved the bank’s earnings mix, with stable businesses complementing a still-strong Investment Bank: “Deutsche Bank has a fairly diversified business model focused on four businesses: Corporate Bank (CB), Investment Bank (IB), Private Bank (PB) and Asset Management (AM). The revenue contribution and cost/income ratios of the CB and PB have substantially improved and, together with AM, these businesses accounted for 65% of total revenue in 1Q23.”\n…which has improved earnings quality\nFitch continues: “We view the generation of stable revenue from these businesses in combination with the execution of the planned cost-savings as key to mitigating the earnings volatility inherent in the IB. The latter has successfully stabilised its franchise and has maintained leading global positions in fixed-income and currency trading, which have performed well in 2022.” \nAsset quality: resilient in the face of headwinds\nFitch notes that looking ahead, asset quality will be challenged by economic headwinds; however, the agency comments, “we expect the impaired loans ratio to remain overall resilient due to the bank’s large exposure to Germany and good record of managing credit risk. This mitigates lower precautionary loan loss allowances compared to peers.”\nBalance sheet strength is reflected in solid capital …\nIn Fitch’s view, “capitalisation is adequate in light of lower risks from the bank's restructuring.” The agency expresses confidence that the bank will deliver on its goals, adding: “We expect the common equity Tier 1 (CET1) capital ratio and the Basel leverage ratio to remain in line with management’s targets of about 13% and at least 4.5%, respectively, in the next two years.”\n… and a sound funding and liquidity base\nFitch sees Deutsche Bank’s funding base as robust after the turbulences of earlier this year. The agency notes, “We expect the bank to take measures to maintain its solid domestic deposit franchise, limiting its reliance on market funding in the next two years.” Fitch sees liquidity and deposits as solid in a post-TLTRO environment, commenting, “We expect liquidity to decline close to the management’s target as TLTRO drawings mature and loans and deposits balances to remain broadly in line with their end-March 2023 levels.”\nAn overview of Deutsche Bank’s ratings, including these upgrades, is as follows:",
    "number_of_ratings": 11,
    "rating": 4.7,
    "likes": 12
}