{
    "url": "https://www.db.com/news/detail/20150528-deutsche-awm-signs-investor-letter-to-g7-finance-ministers-on-climate-change?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "May 28, 2015",
    "tags": [
        "Sustainability"
    ],
    "title": "Deutsche AWM signs investor letter to G7 Finance Ministers on climate change",
    "body": "Climate change is one of the biggest systemic risks but the benefits of reducing emissions outweigh the costs.\nIn Paris in December, governments are aiming to reach a new agreement to reduce carbon emissions. To give encouragement to this process,\nPDF\nthe letter calls on governments to make a long-term global emissions reduction goal part of the Paris agreement and to submit short to medium-term national pledges and country level action plans to reduce emissions.\nAn agreement in Paris would set a clear pathway in favour of a low carbon future and give investors clarity. This will serve to reduce policy risk, incentivize R&D, facilitate the deployment of new technologies and ultimately create new jobs.\nThe German Presidency of the G7 has made climate change and resource efficiency a critical part of the upcoming summit of Heads of State on 7th and 8th of June 2015, with G7 Finance Ministers meeting on 26th and 27th May. The G7 countries represent a major share of global emissions and have considerable influence in the UN climate process. The letter will also be sent to other major economies.\nThe letter was initiated by the European based Institutional Investors Group on Climate Change (IIGCC), IGCC in Australia/New Zealand, Ceres/INCR in North America, AIGCC in Asia and the Principles for Responsible Investment. The letter builds on the global investor statement published in September 2014 which brought together 367 investors (including AWM) with more than $24 trillion of assets under management.\nMost AWM entities are signatories to the UN PRI and AWM is a member of IIGCC and Ceres Investor Network on Climate Risk and Sustainability.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}