{
    "url": "https://www.db.com/news/detail/20150526-settlement-with-u-s-securities-and-exchange-commission?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "May 26, 2015",
    "tags": [
        "Company"
    ],
    "title": "Settlement with U.S. Securities and Exchange Commission",
    "body": "Deutsche Bank today announced a settlement with the U.S. Securities and Exchange Commission (SEC) to resolve an investigation into the valuation of Leveraged Super Senior (LSS) trades during the fourth quarter of 2008 and the first quarter of 2009. The SEC acknowledged the Bank’s cooperation throughout the investigation, and did not bring any charges against individuals in this matter. The Bank does not admit or deny the charges outlined in the Order.\nPer the Order, Deutsche Bank will pay USD 55 million to the SEC. The Bank is fully reserved for this settlement.\nIn its investigation, the SEC determined that the Bank did not properly value Gap Risk on certain LSS trades in its Credit Correlation Book over a two quarter period during the financial crisis. Gap Risk is the risk that the present value of a trade could exceed the value of posted collateral. At no point did the present value exceed the value of the collateral based on the terms of the Montreal Accord, a market wide restructuring of LSS trades completed in January 2009.\nDuring the fourth quarter of 2008 and the first quarter of 2009, which was immediately preceded by the collapse of Lehman Brothers in September 2008, the Bank did not value the Gap Risk on the LSS because it did not believe there was a reliable method for measuring the Gap Risk in light of the existing market conditions. The SEC’s Order acknowledges that no industry standard model existed for measuring the Gap Risk during the relevant period.\nThe settlement will have no impact on previous financial reports. The Bank has not experienced any losses attributed to the Gap Risk on the LSS securities as this risk never materialized. Over the last several years, the Bank has been exiting the LSS positions, reducing the notional value by nearly 95%.\nSince the financial crisis, the Bank has enhanced policies, procedures and internal controls regarding the valuation of illiquid assets.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}