{
    "url": "https://www.db.com/news/detail/20150519-caio-koch-weser-addresses-g7-governments-on-climate-finance-and-responsible-investing?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "May 19, 2015",
    "tags": [
        "Sustainability"
    ],
    "title": "Caio Koch-Weser addresses G7 governments on climate finance and responsible investing",
    "body": "He noted that sustainable social and economic wellbeing will not work unless we jointly strive for economic growth, security of energy supply and climate protection. This is the emphasis of the New Climate Economy Report \"Better Growth, Better Climate\", which the Vice Chairman helped to guide as a member of a Global Commission of business and political leaders.\nFour areas of action\nThe G7 has a distinguished history of leadership, such as the process that led to the creation of the Financial Stability Board and of the G20. It was in this spirit that he suggested ideas for how this leadership could be applied to the low-carbon transition. He recommended four areas of action for the G7.\nFirstly to do no harm by working to phase out subsidies for agricultural inputs, urban sprawl and fossil fuels, including the role of export credit agencies in financing coal projects.\nSecondly, G7 countries can lead by example through developing a finance package for the Paris climate summit and for governments’ aim to agree new sustainable development goals. Governments can also help expand responsible ownership practices in the investment community and by working with public sector pension funds to deepen efforts to incorporate carbon, environmental, social and governance factors into investment decision making. He also challenged the G7 governments as to which will be the first to issue a green government bond.\nThirdly, governments should intensify efforts to create an enabling policy framework including carbon pricing. There are many regulations on companies' environmental practices but not many for the financial sector. He called for sustainability to be applied through different types of initiatives, regulations and standards in several areas of the financial sector including:\nIntegrated annual reporting by companies and investors,\ndue diligence and risk models,\nInstitutional investor contracts with asset managers,\nhow asset managers and investors analyse and work with the companies and real estate they invest in,\nhow investors engage with governments and companies in the bond market and\nhow research analysts and credit rating agencies assess sustainability.\nFor instance, it is notable that governments in Brazil, China and Peru have already enacted some environmental regulations for the finance sector. Indeed, G20 finance ministers recently requested the Financial Stability Board to examine the topic of climate change.\nFourthly, new partnerships and instruments are needed. For instance, development banks can build on their leadership as key financing partners to do even more to leverage private investment. For new development banks like the Asia Infrastructure Investment Bank, sustainability and low-carbon should become a core mandate. Dialogue between governments and private finance is also needed.\nCollaboration among different sectors of societies, different departments and experts, and close alignment of activity at multiple governance levels is needed to realize these ideas. He concluded that collective action in climate finance and responsible investment surely constitutes the basis for sustained economic growth, for energy security and for climate protection.\n“We are aiming for economic growth, security of energy supply and climate protection. These three goals could be visualized as being bound to each other via a triangular relationship. They are interdependent. Sustainable social and economic wellbeing will not work unless we strive towards all three of them.” said Caio Koch-Weser, Vice Chairman Deutsche Bank",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}