{
    "url": "https://www.db.com/news/detail/20150513-paul-saltzman-to-join-deutsche-bank?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "May 13, 2015",
    "tags": [
        "Company"
    ],
    "title": "Paul Saltzman to join Deutsche Bank",
    "body": "Deutsche Bank today announced that Paul Saltzman will join as Vice Chairman and Executive Sponsor of the Comprehensive Capital Analysis and Review (CCAR) process.\nSaltzman was most recently President of The Clearing House Association, and Executive Vice President and General Counsel of The Clearing House Payments Company. Previously, he served as General Counsel of Ellington Management Group. Prior to that, he served as the Chief Operating Officer of ESPEED. Earlier in his career, he spent nearly 10 years in senior management roles at The Bond Market Association.\nAt Deutsche Bank, Saltzman will oversee all regional and global CCAR activity as the Bank continues its investments and preparation for Deutsche Bank Trust Company Americas (DBTCA), and its planned Intermediate Holding Company (IHC), for CCAR readiness and to fully comply with the guidelines set forth by the Federal Reserve.\nSaltzman will report to Jacques Brand, Chief Executive Officer of North America and member of the Group Executive Committee, and Dr. Marcus Schenck, designated member of the Management Board and Chief Financial Officer. Saltzman will become a member of the North America Regional Executive Committee and will be based in New York.\n“We are delighted to welcome Paul to the Bank,” said Brand. “His significant experience will complement the extensive resources we have dedicated to the CCAR process and the internal leadership team we have in place.”\n“Paul’s leadership skills, deep knowledge of the US regulatory environment, and highly relevant experience at The Clearing House will enhance our robust global effort to succeed within the dynamic regulatory environment,” said Schenck.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}