{
    "url": "https://www.db.com/news/detail/20170925-chief-economist-david-folkerts-landau-comments-on-the-german-election-results?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "September 25, 2017",
    "tags": [
        "Investment Banking",
        "Research"
    ],
    "title": "Chief Economist David Folkerts-Landau comments on the German election results",
    "body": "Chancellor Merkel secured her fourth term. No little achievement after 12 years in office and especially following the challenges in the third term. It is definitely good for Germany, the EU and the world that such an experienced leader remains at the helm. Necessary reforms of the EU – together with France – as well as possible headwinds from Italian politics, Brexit and geo-political challenges require more German engagement, with Merkel perfectly suited to take this role given her experience and her rational, non-testosterone-driven approach.\nGiven the strong pro-EU momentum in markets we do not expect any lasting negative response.\nMerkel’s fourth term reflects Germanys’ economic and political stability. At a time when in other countries voters’ discontent has fueled attitudes critical of globalization and multilateralism, she remains a staunch defender of a rule-based, multilateral approach. But even in Germany parties at both ends of the political spectrum have mustered close to a quarter of the votes.\nOn the domestic side Merkel’s biggest challenge will be to make a likely Jamaica coalition work. The chasm between the two junior partners in such a coalition, FDP and Greens, is particularly wide in the areas of social policy, EU policy and environmental policy. In these fields both parties have occupied strong positions during the campaign and their voters will certainly expect delivery. Of course they will have to compromise, but this could backfire. For the Greens, things could already go wrong when their party basis has to approve government participation.\nA Jamaica coalition at the federal level – a prototype just started working in Schleswig-Holstein – will be a risk and a chance at the same time. With the risk obviously the inherent heterogeneity of the partners, including the CDU and particularly the CSU, which might start gravitating towards the right in reaction to the election outcome. If it works – the chance – it will be a proof of the pragmatic policy approach of German political parties, in contrast to the caustic partisanship causing political gridlock in some other countries. Who else if not Merkel with her moderating approach could make such a constellation work?",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}