{
    "url": "https://www.db.com/news/detail/20170922-deutsche-bank-s-corporate-und-investment-bank-regains-industry-rankings-in-h1-2017?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 22, 2017",
    "tags": [
        "Awards",
        "Company"
    ],
    "title": "Deutsche Bank's Corporate & Investment Bank regains industry rankings in H1 2017",
    "body": "Deutsche Bank improved its investment banking rankings in the first half of 2017 according to revenue league tables published today by industry research group Coalition.\nThe bank regained its outright top 2 position in European investment banking, the Coalition H1 2017 Investment Banking report found, after slipping in 2016, and moved up the rankings in fixed income within the No. 4 to 6 group.\n“The results show that first half of 2016 was an outlier. We're back nearer our rightful place,'' said Ram Nayak, Co-head of Corporate & Investment Bank EMEA, and Head of Fixed Income & Currencies Sales & Trading.\nThe bank stabilised its overall position in investment banking, ranking No. 6 globally for the second half-year running, and maintaining its position as the top-ranked non-US firm globally.\nTogether with positive results in recent corporate finance league tables, the Coalition report indicates that important parts of the Corporate and Investment Bank (CIB) franchise are now winning back some of the market share that was ceded during the challenging market conditions and restructuring of 2016.\nDeutsche Bank ranked No 1 in German Corporate Finance in the Thomson Reuters preliminary Q3 league tables published yesterday.\nThe bank’s fixed income business ranked strongly across multiple asset classes and regions in the H1 2017 Coalition report, achieving a No.2 position globally in Foreign Exchange, No.3 in Credit and top 4-6 in Rates, Emerging Market Debt, Securitisation and Municipal Finance; No.2 in Europe, the Middle East and Africa, No. 3 in Asia, and top 4-6 in the Americas.\nThe bank also ranked No. 4 in the Asia Pacific region in the overall investment banking league tables and top 4-6 in EMEA Equities.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}