{
    "url": "https://www.db.com/news/detail/20170920-karl-von-rohr-a-culture-of-learning-from-mistakes-is-crucial?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 20, 2017",
    "tags": [
        "Careers"
    ],
    "title": "Karl von Rohr: \"A culture of learning from mistakes is crucial\"",
    "body": "Deutsche Bank has had to take some tough decisions in the past. Karl von Rohr, a member of the bank's Management Board, is optimistic about the future – and has a secret dream of his own.\nJust as apple wine and herb sauce both have a firm place among the region’s culinary specialities, so too are the Deutsche Bank twin towers inseparably linked to the Frankfurt city skyline. On the upper floors of one of these towers is Karl von Rohr’s office. Member of the Management Board and Chief Administrative Officer at Germany's largest bank, the 51-year-old executive knows the internal workings of the bank better than just about anybody else.\nMr von Rohr, has Deutsche Bank learned from its mistakes?\nWe have learned a few things over the past 18 months while dealing with legacy issues. We have strengthened our control mechanisms, improved our systems and introduced new processes to ensure that we can work better in future. By doing so, we have made sure that our structures and control systems are also able to expand during periods of rapid growth. A number of things went wrong here in the past. We have developed a structured lessons-learned process from this experience. We carefully examine mistakes that have been made, also to determine the extent to which lessons from individual cases can be applied throughout the bank to related areas with similar risks. We want to prevent such things from reoccurring.\nHow important is it to admit mistakes?\nIt is crucial for companies to foster a culture of learning from mistakes. Employees must understand that errors may be made and that they must learn from them and take appropriate action. We need to talk openly about anything that has gone wrong. We at Deutsche Bank have done this at considerable length. I think it is vital for the Management Board to assume responsibility for the bank's mistakes – regardless of whether they were made during or before our watch. This is all a part of the change that we are going through right now.\nAfter being involved in dubious mortgage business activities before the financial crisis in 2008, Deutsche Bank reached a settlement with the Department of Justice in the United States last year and agreed to pay penalties totalling USD 7.2 billion. How many cases have now been addressed?\nThe total of USD 7 billion is broken down into a civil monetary penalty of USD 3.1 billion and USD 4.1 billion in interest-rate relief for consumers in the United States. The relief to consumers may cost us much less than the nominal amount of USD 4.1 billion. This means that the overall profit and loss effect will actually be much lower. In the last 18 months, we have worked on the major cases in a focused and disciplined manner. About half the cases have already been resolved or will be very soon. In actual figures, at the beginning of 2016, we had 20 major litigation cases, which accounted for almost 90 percent of our legal risks. We have resolved 11 cases to date, either completely or partially and made impressive progress with the remaining ones.\nA year ago, Deutsche Bank was rated as the bank with the world's highest systemic risk in the IMF country report. What has happened since then?\nToday, we are more stable than we have ever been. We recently completed a major capital increase. Our liquidity reserves now total more than EUR 250 billion. As a result, Deutsche Bank’s key figures are very stable. We are continuously hiring quality-control staff and take more care when selecting business partners. And while we once rated 30 countries as particularly high risk, today we see that level of risk in more than 100 countries.\nWhen you look back at the past few turbulent years, would you still choose to go into banking?\nThere are certainly other things in life that are interesting. But during the 20 years I have worked at Deutsche Bank, I have realised on numerous occasions that the company provides me with an unbelievable number of opportunities, and I am very happy here. The financial services business continues to fascinate me and many other people – despite all of the things that have gone wrong. The industry is particularly interesting right now, at a time when the banking business is facing fundamental change. The only other option would be to start my own business.\nWhat is the best thing about your job? And what gets on your nerves the most?\nThe thing that gets on my nerves the most is the fight I have to wage against preconceptions, perceptions and feelings that arise in society for understandable reasons. Of course, Deutsche Bank has not just covered itself in glory. At the same time, I realise that it is a privilege to be in a key position from which I can help this unique institution to get back on its feet.\nHow do you normally take important decisions?\nI am relatively analytical, and I weigh the arguments. That is brain work. But a good decision is also based on your gut feeling, your emotions.\nHave you ever made an important decision that you now regret?\nI have no doubt made many mistakes over the years. But the interplay of reason and emotion has worked quite well in the major decisions I have taken in my life. Looking back, I do not think that I have made too many mistakes – neither in my professional nor personal life. I have a great wife and four wonderful children. Our oldest is 22 and is preparing for his law exams. Our 19-year-old daughter is taking her preliminary medical exams at university right now, and our two youngest daughters are both still in school. I really can't complain.\nDo you have any firm goals for the future?\nI want to travel the Pan-American Highway with my wife once I have a little less to do workwise, but it will be some time before that is possible. If it were up to me, we could ride motorbikes, but I fear I would be on my own then.\nWhat do you do in your leisure time?\nLeisure time is in short supply. That is why I prefer to spend it with my family. My wife and I go to concerts, operas and plays. I enjoy reading while I am on holiday, too. For my next summer holiday on the North Sea coast, I plan to take along a real tome: “Luther: A German Rebel” by Willi Winkler.\nWhat do you like about Rotary?\nAs a student, I received a Rotary scholarship and was able to earn my master's degree at Cornell University in the United States. This was certainly one of the best years of my life. I am really grateful to Rotary for this opportunity. It was a great experience to be welcomed into the group of Rotary members and to be invited to visit families. The relationship now goes back 25 years. Two years ago, I became a Rotary member myself because I believe in helping people who have a difficult time in life. Of course, I also enjoy meeting people from all sorts of professions, people whom I would not have met otherwise. I find conversations like those I recently had with a heart surgeon and a musician to be really enriching.\nOne final question: How would your wife describe you in one sentence?\nI think she would say something like this: He is respectful, caring – and a terrible back-seat driver … and that brings us back to our original topic: I prefer to take the wheel myself.\nThis interview was originally published in German in \"Rotary Magazin\", issue 9/2017 – Author: Anne Klesse",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}