{
    "url": "https://www.db.com/news/detail/20200130-fy2019-results-i-am-very-optimistic-for-2020-and-beyond-message-from-christian-sewing-to-staff?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 30, 2020",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "FY2019 results: “I am very optimistic for 2020 and beyond”",
    "body": "Dear Colleagues,\nToday we reported a sizeable loss for 2019 – and yet I feel satisfied and positive. How can that be?\n2019 was the year of landmark decisions. We announced the most radical transformation of Deutsche Bank for two decades and we have already made major strides in implementing it. That progress comes at a price, no question – you can see that in our full-year net loss of 5.3 billion euros. But we were expecting this loss. And it shows one thing above all: how much of the transformation of our bank we have achieved in 2019. We have already absorbed 70 percent of the transformation costs that we have anticipated for the period until 2022. This means we are not only on track – in some areas we are even ahead of schedule. We are progressing faster than expected.\nThis step forward enabled us to hit all our financial targets for the past year:\nWe reduced adjusted costs to 21.5 billion euros excluding transformation charges and expenses related to the Prime Finance platform that is being transferred to BNP Paribas. Inevitably, workforce reduction contributed to this. Staff numbers fell well below 90,000. This is painful, but unfortunately unavoidable.\nDespite the burden of transformation-related effects, we have bolstered our strong capital position. This is reflected in the Common Equity Tier 1 (CET1) capital ratio: with a year-end level of 13.6 percent we comfortably met our target of a ratio in excess of 13 percent and surpassed expectations.\nA key factor in this has been our Capital Release Unit, which reduced risk-weighted assets faster than expected while consuming fewer capital resources than anticipated.\nThis rapid progress means that we can focus our full attention on our clients once again and is already a clear sign of how strongly positioned we are in the businesses we have retained.\nStripping out the transformation-related effects and specific revenue items, we see a positive trend in our Core Bank, as we call it – despite all the uncertainty and despite an even tougher interest rate environment. We not only kept revenues stable; we actually managed to grow them slightly. And because we succeeded in our disciplined cost-cutting at the same time, the picture for results looks even more encouraging: the pre-tax profit of the Core Bank excluding specific revenue items, transformation charges, goodwill impairments and restructuring and severance expenses grew by 7 percent to 2.8 billion euros.\nThis positive development is particularly clear in the second half of 2019 – the period since we announced our new strategy in early July.\nIn our new Corporate Bank we kept revenues stable despite the interest rate headwinds in the second half of the year. The key to this was our growth in Asia as well as in lending, where we increased volume by 5 percent during 2019, predominantly in Germany. In our payments business we cleared almost three billion cash transactions for corporates – 9 percent more than in 2018. And the revenues we generate with digital platforms increased by more than 15 percent.\nWe stabilised our Investment Bank faster than many people expected. Our revenues adjusted for specific items rose by 7 percent in the second half of last year – thanks to a very strong fourth quarter, when revenues on the same basis grew by 22 percent year-on-year. So in the last quarter we delivered year-on-year growth for the first time in almost three years – mainly thanks to Fixed Income & Currencies (FIC) Sales & Trading, where revenues climbed by more than 30 percent. So the measures we took to stabilise the areas of this business which were recently weaker have indeed shown results. Our Debt Origination business has also continued to develop very well.\nOur Private Bank did well, too, although negative interest rates are of course affecting this business in particular. Even so, we were able to offset this to a substantial degree. We extended our loan volume by 4 percent over the full year and grew our investment products business. In addition, we are also benefiting from having hired a number of new client advisors across the world in our Wealth Management business.\nOur Asset Management business continued on its growth path, generating revenue growth of 12 percent in the second half of last year. The key to this was net inflows in all four quarters of 2019 – a total of 25 billion euros for the year.\nOf course, we’re still a long way off where we want to be – but considering 2019 was a year of transformation, we’re satisfied with the result. This encouraging development is first and foremost down to all of you: your dedication and discipline were particularly impressive in this unsettling year and indeed the key to our business success. I would like to thank you sincerely for this.\nThe capital markets are increasingly recognising our progress. The cost of credit default protection on Deutsche Bank, in other words our CDS spreads, is down by more than 50 percent compared to the time of our 2019 Annual General Meeting. And the spread over our peers has narrowed significantly. This directly benefits our business activities: the lower our funding costs on the market, the more competitive we are in many business segments. This will also help us to resume growth following our stabilisation phase.\nThat is what the next phase of our transformation will increasingly be about. In 2018, we laid the foundation for transforming our bank. 2019 was the year of strategic course-setting and we made a rapid start to its implementation. In 2020 we will continue with this implementation: we will continue to cut our costs and shrink the balance sheet of our Capital Release Unit. And at the same time we will shift our focus over to growth. We don’t just want to defend our market position; we want to build on it.\nAnd as we do so, sustainability will be key. On the one hand, we at Deutsche Bank see it as our social responsibility to make a decisive contribution to the fight against climate change. On the other, we see Deutsche Bank as ideally positioned not only to make a positive impact on society, but also to develop our sustainable business right across our bank.\nAs I recently announced, we will gradually increase the allocation to sustainable financing in our loan book of around 430 billion euros. Our Corporate Bank and our Investment Bank will contribute to this as will our Private Bank. We will then be able to structure green bonds and other investment products.\nWe’re on the right track. We issued a little over 20 billion euros in green bonds for our clients in 2019 – which was about 10 percent of the total market volume and two and a half times more than in the previous year. This year we are planning to issue our first Deutsche Bank green bond and we aim to present detailed and ambitious sustainability targets.\nAll this means that this year, we’ll be able to spend less time focused on ourselves and more time on our clients and our business.\nLet’s not forget that Deutsche Bank was not founded as an end in itself. We were founded, 150 years ago, to accompany German and later international companies worldwide. Deutsche Bank was founded to connect worlds. We were founded to step up to our social responsibility.\nThere’s still much work to do before our transformation is complete. But if we continue to make the kind of progress we have seen in the last six months – consistent, disciplined and dedicated – then I am very optimistic for 2020 and beyond.\nBest wishes,\nChristian Sewing",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}