{
    "url": "https://www.db.com/news/detail/20200124-sigmar-gabriel-nominated-to-join-deutsche-bank-s-supervisory-board?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "January 24, 2020",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Sigmar Gabriel nominated to join Deutsche Bank's Supervisory Board",
    "body": "The Nomination Committee has nominated Sigmar Gabriel to join Deutsche Bank’s Supervisory Board as a new member. He will succeed Jürg Zeltner who stepped down from the Supervisory Board at the end of 2019.\nIn accordance with German stock corporation law, Gabriel is to be appointed by the court as a member of the Supervisory Board and stand for election by the shareholders at the next Annual General Meeting. The relevant application was filed with the local court in Frankfurt today.\nPaul Achleitner, Chairman of the Supervisory Board of Deutsche Bank, said: “We are very pleased to have won a dedicated proponent of Europe and transatlantic relations for our Supervisory Board. We are experiencing a challenging geopolitical, economic and social era in which a global bank has to face completely new expectations and demands. With his wealth of experience, having served as Environment Minister, Economic Affairs Minister and Foreign Minister, Sigmar Gabriel will make a unique contribution and complement the expertise of our Supervisory Board.”\nI consider it a great honour to be appointed to the Supervisory Board of Deutsche Bank. With a clear strategy and its strong management team, Deutsche Bank, as one of the most important financial institutions in Europe, has the opportunity and the responsibility to help shape the future of the German and European economy. I want to play a part in this.\nSigmar Gabriel\nSigmar Gabriel has held senior political positions for decades. He was Germany’s Vice Chancellor from December 2013 to March 2018 and a member of Chancellor Angela Merkel’s cabinet for nine years in total, initially serving as Federal Minister for the Environment, Nature Conservation and Nuclear Safety, then as Federal Minister for Economic Affairs and Energy and lastly as Federal Minister for Foreign Affairs. He was Leader of the Social Democratic Party of Germany from 2009 to 2017 and a member of the federal parliament (German Bundestag) from 2005 to November 2019. Prior to his career at the federal level he was Prime Minister of Lower Saxony from 1999 to 2003. Back then he was also a member of the Chairman’s Committee of Volkswagen’s Supervisory Board. Moreover, he was a member of the Board of Supervisory Directors at KfW Group from 2005 to 2009 and one of its alternating chairmen from 2013 to 2017.\nSince leaving the federal government Gabriel has been engaged in several international committees and organisations. Since June 2019 he has been the honorary chairman of the Atlantik-Brücke, a member of the Board of Directors of the International Crisis Group, a member of the Trilateral Commission and of the European Council on Foreign Relations. Gabriel also works as an advisor for corporates on international affairs.\nGabriel was born in Goslar in Lower Saxony and holds a degree in German Language and Literature, Politics and Sociology from the University of Göttingen. He is a lecturer at the University of Bonn and a Senior Fellow at the Center for European Studies at Harvard University.\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nSebastian Krämer-Bach \n+49 69-910 43330  \nEmail: sebastian.kraemer-bach@db.com  \nChristine Peters\n+49 69-910 62303\nEmail: christine.peters@db.com\nInvestor Relations\n+49 800 910-8000 (Frankfurt)\n+44 20 7541-4100 (London)\ndb.ir@db.com\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}