{
    "url": "https://www.db.com/news/detail/20200123-spending-set-to-skyrocket-with-year-of-the-rat-celebrations?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 23, 2020",
    "tags": [
        "Research",
        "Sustainability"
    ],
    "title": "Spending set to skyrocket with Year of the Rat celebrations",
    "body": "Consumer spending in China will rocket this week as people buy gifts for friends and family to usher in the new Lunar year: the Year of the Rat.\nExports, investment and consumption have been the three main growth drivers for China, but the next decade will be firmly about consumption, according to Deutsche Bank’s China economist, Yi Xiong.\nLast year’s annual online shopping festival “Double 11” or “Single’s Day” on November 11 saw Chinese consumers spend a staggering one billion US dollars in the first 68 seconds on e-commerce site Taobao (source: Taobao). And according to McKinsey, total online sales for the day far exceeded the global Cyber Monday and Black Friday events combined, reaching 58 billion US dollars – up 31 percent on the previous year.\nChinese New Year will see another spending peak, with retail and catering sales from February 2 to 10, the ”golden week” of Chinese New Year, expected to hit 160 billion US dollars.\nGlobal products playing a bigger role\nDespite ups and downs in economic cycles, China’s spending per person has grown by around eight percent per year since the 1980s. This puts China on track to become one of the world’s largest consumer markets by 2030, according to Deutsche Bank Research.\nAnd according to Amazon China, import sales shot up by double digits annually between 2017 and 2019. Imported food such as Australian beef, Boston lobster, and Chilean cherries are commonly found on dining tables. Ahead of Chinese New Year, imported fruit sales jumped by 110 percent in January compared to December. (source: JD.com)\nThe silents and the silvers\nChina’s “silent consumers”, said Xiong, are another factor behind the rise in consumer purchasing power. 60 percent of the country’s population live in lower-tier cities and rural areas and as income and living standards are improving rapidly in these areas, online retailers are harnessing social networks and mobile payment systems to tap in.\nAccording to JD.com, ahead of Chinese New Year, consumers from lower-tier cities increased their spending by 560 percent compared with the same period in the previous year.\nChina’s 320 million post-war baby boomers are another spending force to watch. Wealthier than both the previous and later generations and set to retire during the next decade due to China’s early retirement age, this “silver economy” will have significant buying power.\nMore green spending\nThe next decade will also welcome a greener consumer market. Mandatory waste sorting in major cities as part of the Chinese government’s environmental protection policy is expected to expand to lower-tier cities. Once widespread, producers will likely have to develop greener, recyclable products for Chinese consumers.\nWhile the number of cars on China’s roads is set to increase, emissions per vehicle will likely drop thanks to new emission standards passed in 2019 and the use of new energy vehicles (NEVs). The government aims to raise NEV car sales to 40 percent by 2030.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}