{
    "url": "https://www.db.com/news/detail/20200122-wealth-management-offers-clients-new-access-to-well-proven-strategic-asset-allocation-process?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 22, 2020",
    "tags": [
        "Wealth"
    ],
    "title": "Wealth Management offers clients new access to well-proven strategic asset allocation process",
    "body": "Deutsche Bank Wealth Management has started offering clients access to its strategic asset allocation (SAA) process in response to demand for tailored long-term portfolio strategies set by the business’s Chief Investment Office.\nThe Wealth Management arm of Deutsche Bank has launched segregated SAA account mandates for clients in Germany, Luxembourg and Switzerland, with target allocations for investments across a number of asset classes. Clients can now access SAA’s global ability to generate long-term portfolio returns in a highly cost-efficient way. Euro-based investors can also select SAA mandates that include Deutsche Bank Wealth Management’s well-established risk-return engineering (RRE) service.\nOver the coming weeks, the bank is intending to complement this offering with a number of SAA funds. Clients will be able to complement their SAA segregated accounts and funds with satellite investments, aiming to supplement their core allocation with higher “alpha” returns from thematic investments.\nThe underlying concept behind SAA is that market timing is not a sustainable source of investment returns. Instead, clients who invest now and stay invested can benefit from the positive impacts of SAA and time diversification to optimise risk-adjusted returns.\nWhile discretionary investments typically focus on tactical positioning to meet or exceed market benchmarks with a medium-term horizon, Deutsche Bank Wealth Management’s new SAA offering allows clients to directly access and invest in the CIO’s long-term view on structural economic shifts lasting a decade or more. The offering is particularly cost efficient because it invests in low-fee liquid ETFs and is expected rarely to need to be rebalanced. The fund solution will be wrapped in-house by Deutsche Bank’s DWS asset management arm.\nClients are increasingly looking for competitively priced discretionary mandates that give them peace of mind that their portfolio is being managed to reduce risk while retaining upside potential.\nAlessandro Caironi, Head of Advisory & Sales – Institutional Wealth Partners at Deutsche Bank Wealth Management\nWealth Management’s SAA offering benefits from analysis by a leading Chief Investment Office with a proven multi-asset track record dating back to 1968; broad diversification and global reach, with experts on the ground in every major region; efficient implementation of a robust strategy through index-based solutions; and open architecture to access the widest range of suitable instruments.\n“The majority of long-term portfolio returns are attributable to strategic asset allocation,” said Christian Nolting, Global Chief Investment Officer for Deutsche Bank Wealth Management. “SAA is therefore the key to managing multi-asset portfolios.”\nHe added: “Effective SAA does not claim to have perfect knowledge of future asset class returns – we do it not only via analysis of risk and return, but also through an in-depth understanding of correlations between asset classes.”\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}