{
    "url": "https://www.db.com/news/detail/20200120-we-ve-done-more-in-sustainable-finance-than-people-have-given-us-credit-for?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 20, 2020",
    "tags": [
        "Asset Management",
        "Corporate products",
        "Sustainability"
    ],
    "title": "Advocacy for more sustainable financial practices",
    "body": "Sustainable Finance refers to the way in which the financial industry supports the economy through sustainable actions. How companies, projects and governments are financed by banks and capital markets contributes to their own environmental, social or governance (ESG) goals, such as fighting against climate change or fulfilling the objectives of the Paris Agreement. Recently, several companies in Germany strengthened their link to sustainability by refinancing their credit lines ahead of schedule and linking them to sustainability components, such as getting electricity from renewable sources.\nIn this interview, Gerald Podobnik, Chief Financial Officer of the Corporate Bank and long term advocate for greater sustainable finance practices, talks about the bank’s responsibilities and opportunities in this space and what the industry needs to move forward with sustainability.\nDeutsche Bank is a global organisation with major influence. What is the bank’s responsibility in driving sustainable finance?\nOur first responsibility is to respond to our clients’ needs and develop the products they are asking for. We have seen a substantial shift in client interest for sustainable financial products that can help them fulfil their goals, from retail customers all the way up to the biggest multinationals.\nBut we must not forget that we are a bank with our own loan and exposure portfolio. Whether it is our balance sheet, our own products or those we underwrite, like bonds or our asset management business, we need to act appropriately when it comes to our own business and portfolio.\nOne way to do this is by setting measurable targets for the sustainable financing we undertake on loan and bond market underwriting and in asset management, to ensure we strategically develop our portfolio in a way that is in line with our sustainability goals.\nIs Deutsche Bank doing enough?\nWe have done more in sustainable finance than people have given us credit for. Deutsche Bank has a long track record in financing renewable energy projects or providing energy efficient mortgages.\nDWS is one of the pioneers in ESG investing and we have structured and underwritten green bonds for a number of large multinational corporations and financial institutions, in addition to being active in the nascent green loan market.\nWe have a Group Sustainability team that develops policies while ensuring that they are strictly adhered to. And we established the Sustainability Council in 2018, chaired by our CEO, in which the business and infrastructure functions work together to define a cohesive sustainable finance strategy for Deutsche Bank.\nThis will help us achieve our sustainability goals by setting targets and setting out how best to use our product range. You may also have heard Christian Sewing say that we are planning to issue our own green bond in 2020 to make sure we are contributing to this growing market as well. So we have done a lot in this space and we are going to do even more.\nIs Deutsche Bank seen as a strong advocate for sustainable finance?\nAbsolutely. We are as strongly represented in the public and political dialogue on the subject as we are in the dialogue with regulators. I was recently selected as member of the ”Sustainable Finance Committee” of the German government, a group of 30 experts tasked with writing the sustainable finance strategy to position Germany as a leading player in this space.\nI think a representative of Deutsche Bank in this committee speaks to the fact that we are seen as thought leaders with in-depth knowledge in this area. Colleagues around the bank are being approached to speak as experts in various formats on the topic and we make sure we as Deutsche Bank are being heard on the right occasions on the relevant panels.\nWhat do you think financial institutions need in order to make greater strides in sustainable finance?\nCrystal clear definitions with no room for misunderstanding or misinterpretation. What criteria make renewable energy green? What energy efficient measures define a new home as green, and which use of proceeds is deemed climate friendly? The EU taxonomy project is working on this and has recently reached a compromise on the framework.\nBut I think we need to go a step further and also define what makes a company green or ESG friendly. Clarity on these issues will be important especially as we define how we plan to grow our loan business and thus our balance sheet.\nWe also need clarity on the prudential regulatory rules for banks. If climate stress tests are introduced, for example, then we need to understand what scenarios they would use and what the consequences of the results could be. Capital is a bank’s most important commodity; it is the fuel; so a regulatory driven system that encourages greater ESG friendly deployment of capital will be beneficial for all.\nWhat about technology and innovation?\nI think there is a strong link between digitalisation and sustainable finance, and the availability of data. So far, banks have not tracked environmental, social or governance data for their business portfolios with the same level of detail that they have tracked credit risk, or economic and market data.\nSo we do not have that methodical, granular data that we need to assess the effect our portfolios have on, for example, the environment. There is great opportunity for technology and digitalisation to step in here and help procure, analyse and package this data in a way that financial institutions can use systematically. This is yet another avenue we are exploring.\nSpeaking of opportunities, where do you see Deutsche Bank’s prospects in sustainable finance?\nI see three big opportunities:\nOne is the whole new world of products that we can develop and structure to meet our clients’ sustainability needs. The fact that we are one of the largest banks in the financing business worldwide – with a loan portfolio of around EUR 430 billion – is a particular help. By financing our clients' sustainable projects, we can generate the investment products that our clients demand.\nAnother opportunity, which is particularly important to me, is getting back into the heart of society. The banking industry’s reputation took a major blow during the financial crisis, but sustainable finance is one area where we can directly contribute to climate protection and thus for the common good.\nAnd third, we have a great opportunity to guide our clients into a new era of ESG commitment. This gives us the opportunity to play to the full our consulting expertise and gain trust.\nSo, what are our next steps?\nSustainability must become a natural part of our actions, in all areas, at all levels. This message must be clear: Deutsche Bank has internalized sustainability. Our biggest task now is to ensure that all employees of the entire company are on board and that our voice is heard in society. This will be helped by the European Green Deal recently presented by the European Commission, which we also welcome heartily and will do everything in our power to support.\nYou were appointed CFO for the Corporate Bank in summer 2019. How will you personally embed the topic of sustainable finance in the business?\nIn my previous role I worked on finding the right sustainable financial solutions for my clients, so now it is just a matter of broadening my perspective. A CFO is responsible for tasks like resource allocation, balance sheet, steering revenues and costs and sustainability will be a core part of how this is done. I am also working with my colleagues to develop a specific sustainable finance strategy for the Corporate Bank. I am committed to integrating sustainability, both financial and non-financial, throughout the whole division and am working with Group Sustainability and other divisions on this Group wide priority.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}