{
    "url": "https://www.db.com/news/detail/20170428-platform-replaces-pipeline?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 28, 2017",
    "tags": [
        "Company",
        "Digitalisation",
        "Research",
        "Strategy"
    ],
    "title": "Platform replaces pipeline",
    "body": "Markus Pertlwieser and Jürgen von der Lehr are two employees who are thinking about how the bank is going to earn money in the future. And in the future, most transactions will be carried out via platforms, on that they agree – after all, the bank's customers are also moving in that direction.\nBut what are platforms exactly? How does Deutsche Bank fit into the platform economy and how must it adapt to do so? Will close relationships with customers become less important or are they perhaps the key to survival? And who will be the bank's new competitors and what are they good at?\n“Deutsche Bank is one of the first banks in Europe to consider platform models and the immense potential that they have for a company's future growth”, says Geoffrey Parker, guest professor at the prestigious US Massachusetts Institute of Technology (MIT), forward thinker and co-author of Platform Revolution. Together with two dozen other employees, Pertlwieser and von der Lehr met him at the digital factory at the start of April. The meeting officially kicked off a joint strategic research project by the bank and MIT as announced nine months ago.\nGeoffrey Parker, Visiting Scholar at MIT, Co-Author of “Platform Revolution”:\n“Deutsche Bank is a traditional company, it’s been in business for a very long time, and it’s got well-established customer relationships. That’s all great. However, it’s also, in effect, in harm’s way. And the reason it’s in harm’s way is you’ve got a set of competitors, who have dramatically lower costs of production and they’ll be able to enter markets where Deutsche Bank has traditionally had relatively high margins. And so those margins are going to be under pressure.”\n“As an incumbent business you have a set of assets and relationships that a start-up would kill for. You have existing customers, you actually have a data layer and ongoing transactions. Those are huge assets that you can build new businesses, products and services upon.”\nMarkus Pertlwieser, Chief Digital Officer, Private & Commercial Bank:\n“The ‘platformication’ has already begun and in financial services also. It’s important that we have a wide array of people from different parts of the bank so we have to think about how we can grow our business, how can we increase our profits. And the key strategic question is: do we have to extend our business models?”\n“Nobody knows how banking will look like in five or ten years time, but we are in a great position as Deutsche Bank to shape these industries because there are not many banks out there so far who have these kind of discussions about platformication. If our intention is to lead in banking, we also have to lead on that topic.”\nJürgen von der Lehr, Head of Digital Innovation & Think Tank, Private & Commercial Bank:\n“If we speak about customer centricity it also means going beyond banking. Roughly 50 percent of the clients said:\n\"Look, I want to receive advice from banks on non-banking products. The good thing is: we don’t have to build these services. There are so many services provided by fintechs or start-ups and even some more mature companies and if we will be able to partner with the right people and have a proper partner management in place, we can deliver to the whole set of needs.”\nEdward Budd, Chief Digital Office GTB, Corporate & Investment Bank:\n“The platform-based business model is the next big change to come to banking and not just any particular segment. And that’s driven purely by our clients’ businesses changing. And the way they change and business models change is the way we need to change because ultimately we are here to support what they do in commerce.”\nMarcus Heidmann, Head of Strategy and Architecture for COO PW&CC Technology:\n“That’s a central element that platform models aim to have: they draw together various providers that can offer solutions, understand customers and provide them with an uncomplicated interface that they can interact with. This creates value for everyone involved. And our dbAPI, which we launched together with the hackathon in 2016, is a very important step towards achieving this.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}