{
    "url": "https://www.db.com/news/detail/20170427-a-message-from-john-cryan-on-deutsche-bank-s-first-quarter-financial-results-2017?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 27, 2017",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "A message from John Cryan on Deutsche Bank's first quarter financial results 2017",
    "body": "Dear Colleagues,\nFor Deutsche Bank, a busy first quarter of 2017 ended on a positive note with the successful completion of our capital increase. Nearly 99 percent of the subscription rights were exercised and we are now able to dispel any doubts about our capital position. We can finally focus on continuing the disciplined restructuring of our bank and position ourselves for prudent growth.\nOur financial results for the first three months clearly show how important it is to do more in this respect. We generated pre-tax profits of 878 million euros. Although this is over one-half more than in the difficult opening quarter of 2016, we must set our sights higher for the longer term.\nNevertheless, we can and should look forward to the rest of 2017 with a good degree of optimism. I see five reasons to do so:\n1. Our first-quarter results were made weaker by Deutsche Bank getting stronger. As we make Deutsche Bank safer, market participants have greater trust in the bank. The value of our liabilities rises as spreads narrow on our debt. Paradoxically, this initially has a negative accounting impact on our results. The same phenomenon also creates negative valuation adjustments in our Global Markets business. All in all, our revenues in the first quarter were 722 million euros lower year-on-year – but without these accounting effects, revenues would have been broadly flat.\n2. We are making good progress in our restructuring efforts. That progress is beginning to show through in our adjusted costs, which were 5 percent lower than in the first quarter of last year.\nOur Private & Commercial Bank has closed 130 branches in Germany so far, with 58 more to follow as planned, most of them due by the end of June. All eight advisory centres are up and running and are serving clients in the evenings and during weekends as well. We now offer a video advice service in more than 500 branches.\nAt the same time planning for the integration of Postbank and the Private & Commercial Bank in Germany has started well. The preparations for the partial IPO of Deutsche Asset Management are also progressing.\nWe have sharpened the focus of our Corporate & Investment Bank, having exited 18 out of 20 countries as planned in the Global Markets business.\n3. Clients are returning following the turbulence late last year, and we see this in every business area. Deutsche Asset Management attracted net inflows of 5 billion euros during the first quarter. In Wealth Management and our Private & Commercial Clients businesses we achieved net inflows of 3 billion euros, providing the potential for future business. Of course, the low interest rate environment continues to make life difficult for us. This made the first quarter for Postbank all the more encouraging, as loan growth partly offset the decline in revenues due to low interest rates.\n4. Our Corporate & Investment Bank has made a good start. In our capital markets business revenues in sales & trading debt were up 11 percent year-on-year. Our prime finance business began to recover from a tough fourth quarter. We placed corporate bonds for important clients including BMW, Nokia, Novartis, Roche and Siemens. With our support, clients were able to raise 133 billion euros in equity and debt, a 40 percent increase on the first quarter of last year. We placed shares in Covestro and Snap, among others.\nGlobally we are No. 2 in IPOs, while in the US we are No. 1. Moreover, we advised on mergers and acquisitions worth a total of 40 billion euros, an increase of 17 percent compared with the prior year quarter, and grew our market share, while maintaining a robust forward pipeline.\n5. We continue to digitize our business. We are the first bank in Germany to enable customers to make contactless payments through a smartphone. Our private clients can now open online accounts in just seven minutes. With WISE, our new robo advisor, Deutsche Asset Management will combine human investment expertise with computer algorithms to launch a new digital service for our asset management sales partners.\nWe opened our fourth Innovation Lab in New York in March. Our development centres, including our Digital Factory in Frankfurt, are producing impressive results – such as a new software programme that enables us to appraise our clients' credit risks more accurately and to identify new business opportunities.\nSo when we look at our performance in the first three months of the year, we should recognise these successes. They are, after all, the foundation for us to deliver improved sustainable returns once again. We can do better and want to do better. Together we have all worked hard to make this possible. I would like to thank you for this.\nBut, of course, we also have to do our homework. We still have work to do to catch up with regulators' and our own expectations about our control environment and risk management. And we have to strengthen our systems and processes further to detect and prevent financial crime.\nLet's try not to go through some of the low points of 2016 again. One such experience in a lifetime is more than enough. Always deal with others with the utmost honesty and integrity, just as you would wish others to treat you.\nWith best wishes,\nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}