{
    "url": "https://www.db.com/news/detail/20170427-deutsche-bank-reports-first-quarter-2017-net-income-of-EUR-575-million?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 27, 2017",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank reports first-quarter 2017 net income of € 575 million",
    "body": "John Cryan, Chief Executive Officer, said: “I am pleased with the start we have made to 2017. Client engagement is strong, asset flows are returning across the bank and activity is picking up. Our cost-cutting efforts are starting to pay off, while we have reduced complexity significantly. We have laid firm foundations upon which Deutsche Bank can once again deliver good results.”\nProfitability\nPre-tax profit of € 878 million, up 52% year-on-year\nNet income of € 575 million, up 143% year-on-year\nRevenues\n€ 7.3 billion, down 9% year-on-year\nThe decline was predominantly due to a negative swing of € 0.7 billion year-on-year resulting mainly from the development of Deutsche Bank’s credit spreads\nAdjusted for this effect, revenues would have been broadly flat year-on-year\nProvision for credit losses\n€ 133 million, down 56% year on year, primarily due to improved performance in the metals and mining and oil and gas portfolios\nCosts\nNoninterest expenses of € 6.3 billion, down 12% year-on-year\nAdjusted costs of € 6.3 billion, down 5% year-on-year, reflecting restructuring progress and closure of Non-Core Operations Unit (NCOU) at the end of 2016\nHeadcount reduced by ~1,600 during the quarter, despite internalisation of ~200 external staff\nHeadcount reduced by ~3,300 versus the end of the first quarter of 2016 despite internalisation of ~1,900 external staff in the COO function and ~370 net hires in Compliance and Anti-Financial Crime\nBranch optimisation: 130 out of planned 188 branch closures in Germany now complete. All eight advisory centres are now up and running\nCapital\nFully loaded CRD 4 Common Equity Tier 1 (CET1) ratio of 11.9%, slightly up versus 31 December 2016\nImpact of capital raising: pro-forma fully loaded CET1 ratio of 14.1% at 31 March 2017\nRisk Weighted Assets (RWA), fully loaded, of € 358 billion, stable since year-end. CRD 4 leverage exposures of € 1,369 billion, up 2% versus 31 December 2016, reflecting a return of client activity\nNet money inflows across asset-gathering businesses\nDeutsche Asset Management: € 5 billion of net new money across most regions and products\nPrivate, Wealth & Commercial Clients: € 3 billion of net new money with inflows in both Wealth Management and Private & Commercial Clients\nThe\nPDF\ncomplete press release is available in the download area.\nFor further information please contact:\nDeutsche Bank AG\nPress & Media Relations:\nMichael Golden +49 69 910 24611 +49 69 910 35395 (Frankfurt)\nMonika Schaller +49 69 910 48098 +44 20 754 50279 (London)\ndb.presse@db.com\nInvestor Relations:\ndb.ir@db.com\nAn analyst call to discuss first quarter 2017 financial results will take place today at 14.00 (CET). This conference call will be transmitted via internet.\nA Fixed Income investor call will take place on Tuesday, 02 May 2017, at 15.00 (CET). This conference call will be transmitted via internet.\nA Financial Data Supplement (FDS), presentation and audio-webcast for the analyst conference call are available at https://www.db.com/quarterly-results\n\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 20 March 2017 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.\nThis document contains non-IFRS financial measures. For a reconciliation to directly comparable figures under IFRS, to the extent not provided herein, please refer to the Financial Data Supplement.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}