{
    "url": "https://www.db.com/news/detail/20170421-the-french-vote-an-election-like-no-one-before?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 21, 2017",
    "tags": [
        "Capital markets",
        "Investment Banking"
    ],
    "title": "The French Vote – an election like no one before",
    "body": "In his latest CIO View, Kreuzkamp notes that although much has happened in the weeks since his last analysis of the French presidential elections, very little has changed in terms of the likely outcome.\n\"For the past month, Macron and Le Pen have been in a statistical dead heat, currently at around 22% to 24% in public polling,\" he says in the report. \"The next two candidates are now close behind. Former right-wing Prime Minister François Fillon is currently at around 20%. Far-left firebrand Jean-Luc Mélenchon has been rapidly catching up.”\nBut Kreuzkamp warns that statistical simulations based on polling data are only as good as the data fed into them.\n\"France has never seen an election quite like this one – with neither the traditional left-wing nor the traditional right-wing candidate among the top-two contenders,\" he explains. \"Modelling any regional differences in turn-out correctly has probably become more difficult. It may also prove more consequential, this time around, given big gaps in the voting preferences between rural and urban voters in particular.”\nKreuzkamp adds that the fact that all public polls have been so consistent in terms of Le Pen’s and Macron’s relative strength, for so long, is itself slightly troubling. \"It could reflect pollsters tweaking their methodology to get close to what their colleagues are predicting – increasing the risk of all of them getting it wrong for the first round.\"\nAssuming there is a Le Pen and Macron match-up, Macron’s second-round prospects appear to be better than they were a month ago, according to Kreuzkamp. “A political newcomer, he has largely avoided major missteps and cut an increasingly confident figure.”\nAgainst this backdrop, Deutsche AM’s base case is that markets will price in the prospect of a Macron presidency immediately after the first round, fairly independently of the precise results.\n“Spreads between French and German government bonds should swiftly shrink to close to where they were before markets began to worry about the potential of Le Pen taking France out of the Eurozone,” Kreuzkamp notes. “The euro should get a moderate boost. Sentiment in equity markets should also benefit, but the potential immediate upside is likely to be limited. There appears little Le Pen risk priced in.\"\nKreuzkamp believes that Macron’s reform agenda should eventually provide further upside for French equities and may also improve sentiment towards Europe more broadly. However, Macron’s ability to effectively govern will critically depend on the results of the parliamentary elections on June 11, with a run-off on June 18.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}