{
    "url": "https://www.db.com/news/detail/20170412-populism-and-geopolitical-risk-what-investors-need-to-know?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 12, 2017",
    "tags": [
        "Investment Banking"
    ],
    "title": "Populism and Geopolitical risk – what investors need to know",
    "body": "The wave of populism that has swept across Europe remains a risk for investors as France and Germany prepare to go to the polls, Deutsche Asset Management’s Global Head of Research told a media roundtable in London on April 12.\nPhil Poole, who is a member of Deutsche AM’s Chief Investment Office Executive Committee, said that although anti-establishment movements did not lead to an upset in the recent Austrian and Dutch elections, it remains a risk in the European election cycle - with bond markets particularly nervous about the outcome\n“Following on from the UK Brexit vote and the election of Donald Trump - both of which were not expected by the market - it seemed as though a nativist, anti-establishment anti-migration wave was about to sweep into Europe which was facing a slew of elections and a rising right wing challenge to traditional political parties. So far it has not materialised,” said Poole.\nHowever, Poole’s view is that bond markets remains fearful of a Le Pen victory in the French elections, with the risk premium - the return above that of a risk free asset such as a government bond - increasing over recent days. The risk premium has also risen in European equity markets despite a reduction over recent weeks.\nThe populist concern has certainly negatively impacted markets and even though the perceived risk has subsided since the Dutch election there is still a risk premium embedded in European markets, both equity and fixed income and also the euro.\nHosting 20 senior reporters and editors representing newswires, national newspapers and the asset management trade press, Poole covered the broader implications of Brexit and the Trump administration.\nOn Brexit, Poole said Deutsche AM expects the impact on the UK economy to be less than previously thought and has therefore revised its growth forecast upwards to 1.6 percent from 1.1 percent for 2017. Poole outlined how investors have learnt lessons from Trump’s election victory and the Brexit vote and are more actively hedging and less reliant on base case scenarios.\nTurning to asset allocation, Poole highlighted two key market drivers – the French elections and a likely reappraisal and downgrading of the timing and extent of Trump’s policy stimulus. “We decided it was an appropriate time to scale back risk by moving from a slight overweight in equities to a slight underweight,” Poole said.\nThe session took place in Deutsche Asset Management’s new state-of-the-art offices in the Zig Zag Building in Victoria, London, and closed with an interactive Q&A session.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}