{
    "url": "https://www.db.com/news/detail/20201118-deutsche-bank-nominates-maxwell-alexandre-conny-maier-and-zhang-xu-zhan-as-artists-of-the-year-2020?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 18, 2020",
    "tags": [
        "Art"
    ],
    "title": "Deutsche Bank nominates Maxwell Alexandre, Conny Maier, and Zhang Xu Zhan as Artists of the Year 2020",
    "body": "In the tenth year of the award, three up-and-coming artists are being honored simultaneously for the first time / “Absolutely independent and unique positions”\nFor the first time, Deutsche Bank has selected three emerging artists simultaneously as Artists of the Year for 2020. In the tenth year of the award, Maxwell Alexandre (Brazil), Conny Maier (Germany), and Zhang Xu Zhan (Taiwan) will be honored on the recommendation of the bank’s Global Art Advisory Council.\n“All three positions are absolutely independent and unique, yet they all reflect on elementary, global issues: community, spirituality, and our relationship to nature. It is through creativity that humanity is able to have a voice and imagine a path for freedom and equality of rights,” says Victoria Noorthoorn, director of the Museum of Modern Art in Buenos Aires, who, along with the curators Hou Hanru, based in Rome, and Udo Kittelmann, based in Berlin, advises Deutsche Bank on this award in the Global Art Advisory Council.\n“Deutsche Bank has been honoring the Artist of the Year since the year 2010 with what in the beginning was a new concept. The Kenyan artist Wangechi Mutu was the first recipient; today she is a constant in the international art world. And many of the other award winners, including Yto Barrada, Koki Tanaka, Basim Magdy, and Kemang Wa Lehulere, have also made their international breakthrough on the art scene,” says Anna Herrhausen, who heads Deutsche Bank's Art, Culture & Sports unit.\nThe works of Brazilian Maxwell Alexandre (born in Rio de Janeiro in 1990) center on racism and police violence, as well as community and spirituality. They were inspired by his life as he grew up in Rio de Janeiro’s largest favela, Rocinha.\nWith Conny Maier (born in Berlin), the bank is presenting the award to a German artist for the first time. In her works, Maier combines neo-expressive style with a distinct sense of color and composition. Her impressive work cycles focus on the existential interrelation between human beings and nature as personified in a variety of animals. \nIn his animated films, sculptures, and video installations, the Taiwanese artist Zhang Xu Zhan (born in Taipei in 1988) has created a fantastic cosmos populated by mythical creatures, singing animals, plants, and nature spirits and dominated by ancient rituals— a world that is at once apocalyptic and fairytale-like.\nDeutsche Bank gives this prize to up-and-coming artists who work primarily with paper or photography; this is also the focus of the Deutsche Bank Collection. Instead of granting a cash prize, Deutsche Bank supports its Artists of the Year by helping to make them better known to the general public—by purchasing their works for the Deutsche Bank Collection, through a comprehensive catalog, and by means of their own exhibition. The group exhibition “Artists of the Year 2020” will be on view in the bank’s PalaisPopulaire in Berlin starting September 15, 2021.",
    "number_of_ratings": 2,
    "rating": 1.0,
    "likes": 29
}