{
    "url": "https://www.db.com/news/detail/20201118-deutsche-bank-becomes-anchor-investor-in-illumen-capital?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 18, 2020",
    "tags": [
        "Corporate Citizenship",
        "Diversity"
    ],
    "title": "Deutsche Bank becomes anchor investor in Illumen Capital",
    "body": "Deutsche Bank, through its Community Development Finance Group (CDFG), has committed 4.2 million dollars to Illumen Capital, a Black-owned and led fund that develops and incorporates strategies to reduce racial and gender bias in investment decisions. Illumen Capital recently closed 87.9 million dollars of commitments on its first fund, with Deutsche Bank playing a key role as one of its earliest anchor investors.  \nJim Baek of CDFG commented that this investment signals Deutsche Bank’s commitment to strengthening diversity and inclusion not only within its own organisation but also in the broader financial services sector. As CDFG seeks new ways to improve the diversity within its community development investment portfolio, it looks forward to an ongoing partnership with Illumen Capital.\n\nIn asset management, diversity remains a significant challenge as firms owned by women and minorities manage only 1.3 percent of assets under management in the 69 trillion dollar industry. Prior to launching Illumen, founder and Managing Director Daryn Dodson led the Special Equities Programme as a consultant to the Board of the Calvert Funds for close to a decade – sometimes investing in impact funds alongside Deutsche Bank’s CDFG. Illumen’s strategy is based on research that shows that reductions in implicit bias at the company level, management level and for private equity funds has economic value that contributes to improved financial performance. Illumen aims to generate competitive financial returns alongside measurable impact.\nAccording to Dodson, racial and gender bias is a structural problem in need of a structural solution. He added that Deutsche Bank’s early commitment provides Illumen Capital with the credibility to attract additional capital and the resources to leverage its power as investors to deliver evidence-based coaching and tools to the funds in which it invests.\nIllumen invests in best-in-class impact fund managers in the areas of education, health and wellness, sustainability and financial inclusion, with an emphasis on selecting funds managed by women and people of colour. Illumen combines its investing activities with evidence-based research in implicit bias conducted in partnership with Stanford University’s SPARQ programme and provides opportunities for its fund managers and limited partners to experience working alongside marginalized, low, and moderate-income communities, gaining proximity and reducing bias.\nOther investors in Illumen include the Ford Foundation, Open Society Foundation’s Soros Economic Development Fund, The W.K. Kellogg Foundation, family offices and high net worth individuals.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 5
}