{
    "url": "https://www.db.com/news/detail/20201116-christian-sewing-s-speech-at-the-euro-finance-week-2020?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "Frankfurt am Main, November 16, 2020",
    "tags": [
        "Corporate products",
        "Private products",
        "Research"
    ],
    "title": "Christian Sewing's Speech at the Euro Finance Week 2020",
    "body": "Thank you, Mr. Scholz, for your kind words and for inviting me to speak here today.\nMinister,\nSecretary of State,\nLadies and gentlemen,\nToday I am opening Euro Finance Week for the first time, so this speech is something special for me. Sure, I didn't choose the best year - as circumstances dictate that today's meeting is virtual, which cannot replace personal exchanges. But dialog, even if only digital, is becoming all the more important in these times.\nSo let's console ourselves with the wisdom of Rainer Maria Rilke, who at the beginning of the 20th century already knew that: \"In essence, distance is not an obstacle to reaching each other.” So nowadays, we should be able to experience a stimulating conference even under strict Covid rules.\nA conference that will of course be strongly influenced by the ubiquitous virus and its economic consequences. We are currently experiencing the sharpest economic slump in post-war history. And despite that, ladies and gentlemen, there is not much noise around Europe's banks. We are perceived as part of the solution rather than the problem. That was quite different in past crises, especially in 2008.\nBut we all know that this crisis is not over yet. In Germany we are in the middle of the second wave, in some other countries like the United States they are already talking about a third wave. It is already clear that our economy is facing a tough winter. Germany’s gross domestic product is now likely to shrink in the fourth quarter.\nDevelopments in the coming year will depend to a large extent on whether hopes of an early launch of an effective vaccine are fulfilled. If Pfizer and Biontech successfully launch their vaccine, it would certainly accelerate the economic recovery. But it will take months before even the at-risk groups are vaccinated. And we all know that setbacks remain possible - which could cause the mood in the economy to become more clouded again.\n\nEurope is facing a triple transformation\nBut that is not all. The short-term consequences of the crisis should not obscure our view of the fundamental upheavals that are currently taking place worldwide - and which will profoundly shape the economy in the decades to come.\nIt begins with government debt: thanks to governments' corona programs, this will exceed the 100 percent of GDP mark this year in many key economies. At this order of magnitude, studies indicate that the economy will suffer from the debt burden in the medium term. It is also clear that for many countries this debt burden is only manageable at very low interest rates - one reason why an end to extremely loose monetary policy is becoming increasingly unrealistic.\nWe are also facing a gigantic transformation, the likes of which have not been seen since the end of the Second World War.\nOn the one hand, there is digital disruption, which is bringing about a profound change in the economy. The Zoom video conferencing service is now worth more on the stock market than any European bank, and Tesla has overtaken the traditional car manufacturers in terms of market capitalization.\nAt the same time, we need to move away from a carbon-intensive economy within a short period of time if humanity is to have a future worth living. This transformation comes with significant investment needs.\nAll this must be designed and financed – and by a global economy in which the rules of the game are currently undergoing fundamental changes.\nThis is the third important variable: the golden era of world trade and almost unhindered globalization is coming to an end. The clearest sign of this is the confrontation between China and the United States. While the USA has become increasingly protectionist in recent years, China has just sealed the world's largest free trade agreement in Asia – making the country more independent of the West and expanding its influence.\nMost experts agree that President-elect Biden will not simply turn this development back – even if it is now easier to build bridges again. Contrary to what we have often perceived over the past four years, this is not just about individual politicians. It is about the race for economic hegemony in the 21st century. It's about setting standards in those areas that offer the greatest growth opportunities in the coming decades: in digital technologies and associated business models.\nEurope must now prepare itself for precisely this. It is not just geographically in the middle of this conflict, but an active business partner of both sides so far – a position that will be difficult to maintain. That is why our economists describe what lies ahead of us as an \"age of disorder\".\n\nWe can characterise it as a triple transformation:\nWe will have to bid farewell to many certainties of the past 30 years, during which Europe, and especially Germany, has benefited from an increasingly open global market.\n\nWe must keep pace with an unprecedented technological revolution.\n\nAnd we must make our economy more sustainable and climate-friendly at the same pace.\nHow Europe masters this triple transformation will determine whether we are still economically relevant in the second half of the 21st century.\n\nThe role of the financial sector\nWhy am I outlining this overall picture in such detail when this conference is supposed to be about the financial sector? Because I am completely convinced: our industry is playing a crucial role in this development. We must make our contribution, we must - and we want to - finance this transformation - and to do so we must become stronger ourselves.\nOnly with strong banks and a strong capital market will Europe be able to raise the funds to fight the economic consequences of the corona pandemic. And for the transformation of the economy, which requires enormous investment - for example in digital innovation and infrastructure, and in creating a more sustainable economy.\n \nBanks\nIf the European financial sector is to make its contribution, then we, the banks, are the first to be called upon. Just 16 percent of corporate financing in Europe is channelled directly via the capital market - so if companies are to invest more, the traditional banking industry is crucial.\nUnfortunately, however, the strength of European banks does not really match this enormous economic significance. It's a paradox: in the United States, banks are much less important for financing the economy, with around two-thirds of financing going through the capital market. Nevertheless, American banks are bigger and much stronger than those in Europe. \nNone of the 20 largest banks in the world is still located in the European Union. Last year, the profits of the ten largest EU banks totalled 36 billion euros - for the ten largest Americans it was three and a half times that amount. And when it comes to IPOs or advice on mergers and acquisitions, the top of the rankings are almost exclusively made up of non-European institutions. Deutsche Bank is one of the very few Europeans who can keep up with them.\nFor a long time, hardly anyone in Europe seemed to be interested in this imbalance - not even in parts of our industry. Instead, it was often discussed whether it was sufficient for companies to rely on strong foreign banks.\nBut, ladies and gentlemen, this should be the lesson of the past few years: if globalization becomes more and more of a patchwork quilt, then we cannot rely primarily on imports of banking services and capital to finance our economies. That would be negligent. So when we talk about the European banking system, we are dealing with a question of geopolitical importance.\nWhat follows from this?\nFirst and foremost, of course, banks are in demand. In the corona crisis, the sector is proving to be more robust than ten years ago, which is undoubtedly a major step forward. But in many cases we are simply not profitable enough to generate further capital and thus additional capacity for our business. We banks must continue to work on our costs, we must invest in our technology, we must become more innovative.\nBut above all, we need more focus. That is why we at Deutsche Bank decided last year to focus consistently on our strengths. We only do what we are particularly good at.\nThis includes, among other things, being one of the world's largest financing houses: we have a loan portfolio of more than 430 billion euros, we are one of the major bond issuers, and our platform, together with a few other banks, underpins global fixed income trading. But above all: we have the expertise, the risk management and the capital to do so.\nSo we are right in the middle of the game when it comes to meeting current financing needs.\nOur realignment is already paying off: we have been able to increase our earnings and our market share in some key areas in recent quarters despite all the headwinds. And we believe that most of this earnings growth is sustainable.\nBut the efforts of individual institutions will not be enough. As a sector, we will have to tackle our biggest structural problem in Europe in the medium term: fragmentation. I have mentioned this figure many times before, and I beg your indulgence if I have to bother you with it once again: more than 5,000 financial institutions in Europe is simply far too many! Too many for a business where economies of scale are more important than in most other industries - both in terms of costs and investment capacity.\n\nBut why is there no consolidation?\nBecause it needs the right framework, which does not exist in Europe. Cross-border mergers will only become really attractive once we have completed the Banking Union. The last open questions – particularly deposit protection – have not been addressed for years. I would hope that the sheer scale of the current challenges will help politicians to finally overcome this barrier.\nSo we welcome the Federal Ministry of Finance's constructive proposals to get this issue moving again and hopefully conclude negotiations soon. Now other interested parties who have been slowing down the project should also shift - especially within the financial sector.\nIn this environment I would once again like to see us discussing openly what kind of regulation makes sense for Europe. The regulators and supervisory authorities reacted quickly in the corona crisis and introduced temporary measures to ensure that banks can support the economy. But we do have additional potential: in our view, it’s justified to ask whether it really makes sense to increase funding for the European common settlement fund even further than originally planned in this difficult phase for the economy.\nOne figure tells you what I mean by this: one billion euros of equity capital in banks will provide around 20 billion euros in credit for the economy. For this year alone, however, European banks have paid 9.2 billion euros into the Single Resolution Fund - more than was expected and 18 percent more than the year before. We should therefore stick to the originally agreed size of the fund of 55 billion euros to create planning security. The funds released could be used to finance the economy right now.\nLast but not least, it is important to address long term structural issues. Why, for example, should we use the Basel process to introduce new regulations for risk-weighted assets in the European Union that fit the banking landscape in Europe and our loan-focused corporate financing structure to only a limited extent? When at the same time other regions of the world have always been quite liberal in adapting the Basel framework? \nEspecially now, when the economy particularly needs the credit supply from banks, we should take the time to carefully assess the consequences of the Basel rules for Europe's banks. We should not make things even more difficult for ourselves in the upcoming transformation of our economy than they will be anyway.\n  Capital Market\nBut we should also not believe that the triple transformation could be financed solely through bank balance sheets. Europe must develop its capital market and make better use of it – when, if not now? If we want to make it easier for companies to finance themselves via the capital market – and not only large corporations, but also SMEs – then we have to overcome our small-mindedness.\nThen a bond investor should no longer have to deal with 27 different securities trading laws and insolvency regulations in Europe. And a well-functioning capital market also means that companies are basically free to decide whether or not to pay a dividend.\nThe plans for a Capital Market Union have been largely untouched for years. The corona crisis has now brought back some momentum to the issue. For example, the Commission has proposed simplifications to the rigid rules on customer information. We must now build on such initiatives.\n\n\nSustainability as an opportunity\nA more developed capital market is above all a prerequisite for financing the change towards a sustainable economy. With regard to climate protection alone, the OECD calculates that the world will have to spend six trillion euros per year up to 2030. This is a great opportunity for Europe: we can claim to have recognized earlier than other parts of the world that we have to do much more for sustainability, above all climate protection and biodiversity – and can combine this with economic growth.\nThis pioneering role is also reflected in market developments: while the European market accounts for only around a quarter of all bonds traded worldwide, Europe’s share of green bonds is more than twice as high. And if you look at which banks worldwide are bringing the most of these bonds to the market, seven of the top ten in the third quarter came from Europe and five from the EU.\nSo it is all the more encouraging that many environmentally and climate-friendly technologies are being developed here. However, other parts of the world are catching up rapidly, for instance in e-mobility. So we have to speed up – also on the financing side.\nIn addition to a unified capital market, this includes using the so-called EU taxonomy to create uniform criteria as to which financing can be classified as sustainable and which cannot. And thereby set a global standard.\nWe should also examine where targeted regulatory advantages for sustainable loans could make sense – for example in the form of equity discounts for demonstrably low-risk financing such as green mortgages.\nRemaining a leader in sustainable financing is in the best interests of our European economy - and our financial sector.\n\nConclusion\nSo, ladies and gentlemen, we are facing great challenges, a great transformation. It is not only about the world with COVID, but also about the world after COVID. We must now quickly create the conditions to be able to shape the triple transformation in Europe, instead of being shaped by it. We must be the driving force behind a new form of globalization, a more digital and sustainable economy - so that we are not driven by others.\nSo it is no exaggeration to say that we could be facing a decade of decisive importance. A decade that will define Europe's economic place in the world for a long time to come. It is a challenge that affects politics, the economy and society alike. If we as banks want to show that we are at the center of this society, then now is the best time to do so. We must make our contribution to this historic change so that Europe remains relevant. And so that we ourselves remain relevant.\nI am sure that this Euro Finance Week can provide important impulses for how we can move forward on this path.\nThank you very much.  \n\nUseful links\nEuro Finance Week 2020",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 7
}