{
    "url": "https://www.db.com/news/detail/20201112-understanding-the-blue-economy-ipb-cio-says-it-s-time-for-a-sustainable-revolution-in-our-oceans?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 12, 2020",
    "tags": [
        "Corporate Citizenship",
        "Private products",
        "Research",
        "Sustainability"
    ],
    "title": "Understanding the blue economy",
    "body": "The blue economy\nThe world’s eighth-largest economy is based not on land but in the oceans, with at least USD 2.5 trillion a year generated by marine resources, estimates from the World Wide Fund for Nature show. Yet even this may be understating the power and importance of the “blue economy”, according to a new report from the Chief Investment Office of Deutsche Bank’s International Private Bank (IPB).\n“The concept of the blue economy is inextricably linked with biodiversity – and biodiversity underpins the ‘ecosystem services’ that humans receive from nature,” writes Christian Nolting, Global Chief Investment Officer and Head of Investment Solutions at the IPB.A complex economic system. The blue economy should be regarded not as a simple resource in isolation but as a complex economic system, Nolting writes. The challenge is to conserve marine resources – estimated by the WWF to be worth USD 24.2 trillion – while allowing for sustainable development.\nEnvironmental, social and governance (ESG) investing, international collaboration and sustainable business practices will be critical to the oceans’ future, according to the report, which includes contributions both from the CIO team and from external specialists.\nOcean biodiversity is thought to provide so-called regenerative returns worth around USD 125 trillion to USD 140 trillion a year, or more than 1.5 times that of conventionally measured global GDP, the independent Dasgupta Review found earlier this year. “This will not be a situation where everything is fixed quickly,” Nolting writes. Nevertheless, “the blue economy has an immediate importance for investors – both in terms of opportunities and risks.”\nThe report was published to coincide with “Wealth with Responsibility: Healing and Protecting Our Oceans”, an IPB event that brought together some of the world’s leading authorities in ocean conservation and the blue economy.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 11
}