{
    "url": "https://www.db.com/news/detail/20201111-deutsche-bank-opens-cash-management-business-in-australia-for-its-multinational-clients?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "November 11, 2020",
    "tags": [
        "Corporate products"
    ],
    "title": "Deutsche Bank opens cash management business in Australia for its multinational clients",
    "body": "Deutsche Bank has added to its global network of Cash Management locations with the establishment of a new business in Australia. The bank now operates cash management services in 35 locations globally, 14 of which are in Asia Pacific.\nAustralia’s interim CEO Glenn Morgan says adding Australia to the bank’s global network of cash management businesses will be “a terrific boost for local employees.”\nLaunching a new business that is a key to the bank’s global growth and global client base reaffirms the commitment to our local franchise as a whole.\nGlenn Morgan\n14 new roles have been added to support the new business, including John Godlonton who joins from Deutsche Bank Singapore as Head of Cash Product, Australia. The business offers a range of services including current accounts and deposit products, domestic and cross- border payments and collections as well as liquidity management services.\nCash Management is strategically important for the bank’s Australian franchise says Australia’s Head of Corporate Bank Peter Connor. “Cash Management will expand our footprint by servicing a larger set of our multi-national corporates. Clients have been asking us to introduce cash management services for some time now so we’re excited to add that capability to our product suite. We are in a strong competitive position and are confident we can build market share.” \nDeutsche Bank has operated a Corporate Transactional Banking business in Australia for over five years providing a range of products including Trade Finance, Foreign Exchange and Trust and Agency Services. Cash Management rounds out that offering.   \nAustralia presents a significant opportunity for the bank and for our European clients operating there. Over 250 of our existing global Cash Management clients operating there are using other banks and our initial dialogue with them around our new business has been really encouraging. We also plan to expand our coverage of domestic clients with global needs.\nStefan Hoops, Global Head of Corporate Bank\nCash Management is not only at the centre of the Corporate Bank and key to its growth ambitions, says Ole Matthiessen, Global Head of Cash Management. “During the current crisis, it became very clear that it is even more important for treasurers to analyze and act upon the continuously evolving developments in the market. Thus, investing in our global footprint is also a sign to our clients that we are even more committed to be a part of the solution in these unprecedented circumstances.” \nFor further information, please contact:\nKarène Dufour\nDeutsche Bank AG\nMedia Relations\nPhone: +852 2203 7846\nE-mail: karene.dufour@db.com\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nThis press release has been approved and/or communicated by Deutsche Bank AG or by its subsidiaries and/or affiliates (“DB”). Deutsche Bank AG is authorized under German Banking Law (competent authority: BaFin - Federal Financial Supervisory Authority) and by the Prudential Regulation Authority and subject to limited regulation by the Financial Conduct Authority and Prudential Regulation Authority. Details about the extent of our authorization and regulation by the Prudential Regulation Authority, and regulation by the Financial Conduct Authority are available from us on request. Securities and investment banking activities in the United States are performed by Deutsche Bank Securities Inc., member NYSE, NASD and SIPC, and its broker-dealer affiliates. Lending and other commercial banking activities in the United States are performed by Deutsche Bank AG, and its banking affiliates. Copyright (C) 2020 Deutsche Bank AG\n\nUseful links\nDeutsche Bank Australia\nDeutsche Bank Corporate Bank",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 4
}