{
    "url": "https://www.db.com/news/detail/20201104-deutsche-bank-extends-inr-12bn-lifeline-to-indian-micro-small-and-medium-enterprises?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 4, 2020",
    "tags": [
        "Corporate products",
        "Entrepreneurship",
        "Research"
    ],
    "title": "Deutsche Bank extends INR 12bn lifeline to Indian micro, small and medium enterprises",
    "body": "Deutsche Bank is supporting India’s micro, small and medium enterprises (MSME) through the pandemic by extending over 12 billion Indian rupees (~138 million euros) of credit to more than 2,000 clients.\nThe loans are part of the Government of India’s Emergency Credit Line Guarantee Scheme (ECLGS) for MSMEs, launched in May 2020, and are provided in the form of a working capital term loan, backed by a 100 percent sovereign credit guarantee from the government.\nClients benefit from a 12-month moratorium on the principal amount (repaying interest only) and start paying back the loan in equated installments over 36 months, after this relief period is over.\nCash flows in India’s MSME sector have been severely impacted by the COVID-19 pandemic because of reduced demand for their goods and services, coupled with disruption in supply chains.\nThis relief package, which is part of the government’s Atmanirbhar Bharat (Self-Reliant India) initiative, is expected to help the ailing sector meet its operational liabilities and restart businesses.\n“It is in times such as this that our clients need us the most and I am glad that we were part of the solution,” said Amit Bhatia, Head of International Private Bank, India. “We put the clients at the core of our efforts and left no stone unturned to help them through the difficult times.”\nThe road to this solution was not easy. The new offering came with hurdles such as system changes, documentation protocols and the time-bound seamless processing requirements of the scheme. Daryl D’Souza, Head of Lending and Business products said, “This was indeed the largest ever time-bound coordinated project effort for us. Every department from Sales to Risk worked in tandem to ensure that we could seamlessly support our clients.”\nIndia has an estimated 63 million MSMEs employing over 110 million people across the country.\nThe ECLGS, which was initially scheduled to end of October 31, has now been extended by the government of India until November 30.\n\nUseful Links\nDeutsche Bank India",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 14
}