{
    "url": "https://www.db.com/news/detail/20201104-deutsche-bank-honoured-for-its-commitment-in-the-fight-against-lgbtq-persecution?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 4, 2020",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "Deutsche Bank honoured for its commitment in the fight against LGBTQ persecution",
    "body": "US LGBTQ and HIV-positive immigrant rights organisation “Immigration Equality” has awarded its first Safe Haven Corporate Award to Deutsche Bank, recognising the bank’s pro bono legal assistance in the fight for asylum for LGBTQ and HIV-positive immigrants facing persecution and brutality in their home countries.\nSince 2018, the bank has represented seven individuals free of charge. Of those, four have been granted asylum and three cases are still pending. Sarah Levitt, who has led many of these efforts together with colleagues in the New York Legal team and in partnership with other departments of the bank, said: “Over the past few years, Deutsche Bank volunteers have given hundreds of hours of their free time working to help LGBTQ refugees escape persecution and discrimination. It’s incredibly rewarding to see the positive impact this work is having.”\nAccepting the award on behalf of the bank at a virtual award ceremony that was streamed online, Joe Salama, Global Head of Litigation and Regulatory Enforcement and Interim General Counsel for the Americas said: “The work which has been accomplished is nothing short of saving lives. I want to thank Immigration Equality for the incredible job they do and for giving us the opportunity to be a part of it. I especially want to thank all my colleagues at the bank who have recognised these injustices and have worked so hard to do something about it.”\nFounded in 1994, Immigration Equality represents and advocates for people from around the world fleeing violence, abuse, and persecution because of their sexual orientation, gender identity or HIV status. As of today, it is still illegal to be gay in almost 80 countries around the world, and dangerous in many more. The Safe Haven Awards honour the dedication of attorneys and corporate supporters working pro bono to fight these injustices.\nDeutsche Bank has had a long track record of corporate activism in supporting LGBTQ rights, including Amicus Curiae Briefs, public advocacy, and through all of the work of dbPride.\n\nAbout Deutsche Bank\nDeutsche Bank provides retail and private banking, corporate and transaction banking, lending, asset and wealth management products and services as well as focused investment banking to private individuals, small and medium-sized companies, corporations, governments and institutional investors. Deutsche Bank is the leading bank in Germany with strong European roots and a global network.\n\nUseful Links\nDeutsche Bank - Diversity & Inclusion",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 9
}