{
    "url": "https://www.db.com/news/detail/20201103-management-changes-at-deutsche-bank-luxembourg?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Luxembourg, November 3, 2020",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Management changes at Deutsche Bank Luxembourg",
    "body": "Deutsche Bank today announced a number of changes in the supervisory and management bodies of its subsidiary Deutsche Bank Luxembourg S.A., the Management of Deutsche Bank AG Luxembourg branch and the Country Management for Luxembourg. These will take effect at the turn of the year.\nFrank Krings, CEO of Deutsche Bank Luxembourg S.A. since 2016 and the Group’s CEO for Western Europe since July 2020, will in future work from Paris and, in Luxembourg, move from the Management Board to the Supervisory Board of Deutsche Bank Luxembourg S.A.. In France he will also become General Manager of Deutsche Bank and the Group’s Chief Country Officer for France.\nFrank Rückbrodt, the Group’s Chief Operating Officer for the Europe, Middle East and Africa Region, will move from Frankfurt to Luxembourg and will become CEO of Deutsche Bank Luxembourg S.A., General Manager of Deutsche Bank as well as the Group's Chief Country Officer for the Grand Duchy. \nFrank Rückbrodt has been working for Deutsche Bank for over 20 years in various roles including as member of the Board of Directors of Deutsche Bank S.A.E. (Spain) and the Supervisory Board of Deutsche Bank S.p.A. (Italy). In addition, he has been a member of the Supervisory Board and the Audit Committee of Deutsche Bank Luxembourg S.A. since 2016 and is therefore familiar with the bank as well as with the financial centre. He will retain his COO EMEA function.\nAlexander Ilgen, Chief Financial Officer and Chief Operating Officer of the Group’s Private Bank Division, reporting into the Group Management Board, will in addition become the Chairman of the Supervisory Board of Deutsche Bank Luxembourg S.A. and succeed Ashok Aram in this function, who is resigning from his statutory position upon leaving the Group.\nIn addition, Bas Marteijn, Amsterdam, and Michelle Owen, London, will succeed Kees Hoving, Dubai, and Rachel Blanshard, London, who are leaving the Supervisory Board of Deutsche Bank Luxembourg S.A. after several years of service.\nClaudio de Sanctis, Deutsche Bank CEO for Europe, Middle East and Africa said:\n“The forthcoming personal changes are a sign of the ongoing development of our Group’s management team. At the same time, in the 50th anniversary year of Deutsche Bank Luxembourg S.A. they set an example of continuity and highlight the great importance of Luxembourg for our customers and the Group.\n\"We would like to thank Frank Krings for his successful management and transformation of the Bank in Luxembourg over the past 5 years and are delighted that with Alexander Ilgen as Chairman of the Supervisory Board and Frank Rückbrodt as CEO of the Management Board, two long standing and experienced executives of our Bank will take charge of the fortunes of the Bank in Luxembourg to continue its success story.”\nAll the above mentioned new appointments are subject by the relevant regulatory authorities to final approval.\n\nFor further information please contact:\nDeutsche Bank AG\nCommunications\nTim Oliver Ambrosius\nPhone: +49 173 6531326\nEmail: tim-oliver.ambrosius@db.com\nDeutsche Bank Luxembourg S.A\nOffice of the Management Board\nDiane Delvaux\nPhone: +352 421 2222 30\nEmail: diane.delvaux@db.com\n\nAbout Deutsche Bank\nDeutsche Bank provides retail and private banking, corporate and transaction banking, lending, asset and wealth management products and services as well as focused investment banking to private individuals, small and medium-sized companies, corporations, governments and institutional investors. Deutsche Bank is the leading bank in Germany with strong European roots and a global network.\n\nAbout Deutsche Bank Luxembourg S.A.\nDeutsche Bank Luxembourg S.A. (established 1970) provides commercial and investment banking, private banking and wealth management products and services to businesses, institutional investors and individuals. The bank is a direct subsidiary of the parent company, Deutsche Bank AG (established in 1870), and is one of the systemic banks in the Grand Duchy of Luxembourg. It is supervised by the European Central Bank (ECB).\n\nUseful Links\nDeutsche Bank Luxembourg S.A.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 8
}