{
    "url": "https://www.db.com/news/detail/20201103-deutsche-bank-appoints-frank-krings-as-chief-country-officer-for-france?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Paris, November 3, 2020",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank appoints Frank Krings as Chief Country Officer for France",
    "body": "Deutsche Bank today announced the appointment of Frank Krings as Chief Country Officer (CCO) France and General Manager of the Deutsche Bank AG Paris Branch.\nKrings is CEO of Deutsche Bank Group for Western Europe and currently Chairman of the Management Board of Deutsche Bank Luxembourg S.A.\nAs CCO France, Krings will assume responsibility for overseeing the Group's strategy and relationships with regulatory stakeholders in France in addition to his responsibilities as CEO of Deutsche Bank Group for Western Europe. Krings takes over from Laure Lemonnier, Country Chief Operating Officer, who assumed interim responsibility for the country.\nClaudio de Sanctis, CEO EMEA and Global Head of the International Private Bank, said: “France is essential to Deutsche Bank's ambitious growth plans in Europe, as demonstrated by the fact that our CEO of Western Europe will now be based in Paris.”\nHe added: “Frank has proven his leadership qualities throughout his career within and outside the Group and is well positioned to build on the success of our established franchise in France.”\nDuring his career, Krings has held various positions on the management, supervisory boards and boards of directors of banks, asset management and investment companies, holding companies, trade associations and chambers of commerce in Europe and Asia.\nKrings first joined Deutsche Bank in 1996 and spent 12 years in Frankfurt and New York. He then spent two years on the Management Boards of Hypo Real Estate Holding and Deutsche Pfandbriefbank, mandated to assure their restructuring. He rejoined Deutsche Bank in 2011 as General Manager and Chief Country Officer in Thailand. He became Chairman of the Management Board of Deutsche Bank Luxembourg S.A. in March 2016 and was appointed CEO of Western Europe earlier this year. He is also a member of the Supervisory Board of DWS Investment S.A.\nKrings has dual German and French nationality and a degree in industrial engineering from the Technical University of Brunswick.\nKrings’ appointment will be effective on January 1, 2021, subject to regulatory approval.\n\nFor further information please contact:\nDeutsche Bank AG\nYann Couronneaud\nTelephone: 01 44 95 63 58\nEmail: yann.couronneaud@db.com\n\nAbout Deutsche Bank\nDeutsche Bank provides retail and private banking, corporate and transaction banking, lending, asset and wealth management products and services as well as focused investment banking to private individuals, small and medium-sized companies, corporations, governments and institutional investors. Deutsche Bank is the leading bank in Germany with strong European roots and a global network.\n\nUseful Links\nDeutsche Bank France",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 3
}