{
    "url": "https://www.db.com/news/detail/20200331-how-asia-is-managing-coronavirus?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 31, 2020",
    "tags": [
        "Company",
        "Corporate Citizenship",
        "Strategy"
    ],
    "title": "How Asia is managing coronavirus",
    "body": "Deutsche Bank Research Asia economists Michael Spencer, Juliana Lee and Yi Xiong examine how Asia has fought the virus crisis and what strategies have helped flatten the epidemic curve in the world’s most densely populated region.\nWith only 610 new cases in China in the past two weeks and 98 percent of those coming from abroad, local transmission of coronavirus has almost stopped and the country is now slowing returning to work as the government starts to lift movement restrictions. Meanwhile, the rest of the world is grappling with coronavirus containment.\nAsia Pacific chief economist Michael Spencer wrote in a note published on March 25: “In our view, stopping the transmission of the virus requires changing peoples' behaviour, not locking them in their homes.”\nWith the right information, people naturally begin social distancing, which helps flatten the curve.\nInformation: the most potent anti-viral\nPeople need reliable information to be able to decide how much social distancing they should practice.\nOur economists said that a slow start in providing such data in China at the outset of the crisis cost authorities time and credibility, but that the subsequent release of detailed information about cases, particularly outside Hubei where the numbers were lower, showed marked improvement.\nIn Hong Kong, Singapore, South Korea and Taiwan, authorities have been providing daily updates since early January on confirmed infections, treatments and deaths.\n“And because the case numbers are much smaller”, Spencer said, “They can provide much more information. In Hong Kong and Singapore, each case is described with detailed locations, travel history and, where known, how they relate to other cases. This detailed data is on government websites that show maps marking where infected people live so that people can readily assess their own risk of infection.”\nNew information technologies offer hope\nGovernments have also used information technology to aid in their containment effort and the private sector has helped to make government data more accessible.\nContact tracing of infected people can be laborious and painstaking. At one point the Wuhan government had 1,800 teams of more than five people each following up on tens of thousands of contacts every day.\nTelecom companies and software providers quickly supported this by providing additional data. Geolocation data was used to identify people’s travel histories and additional data was collated showing recent bus, plane or train ticket purchases as well as seat locations relative to travellers confirmed as having Covid-19.\nLike China, both South Korea and Singapore have released apps to enable citizens to opt in for contact tracing.\nAnd in terms of testing for infected persons, South Korea quickly recognised its importance, Asia Chief Economist Juliana Lee, writes: “The South Korean government and industry moved quickly and as local law allows the fast-tracking of approval for testing kits, Covid-19 test kits were approved within a week. Normally, it would have taken more than a year.” Most governments in Asia only test the most obvious at-risk: the symptomatic and their close contacts\nFinal observations\nObservers outside this region frequently refer to the use of stringent measures by governments in Asia in combating the virus and conclude that it is not possible to flatten the curve in more liberal political systems.\nSpencer writes: “In our view, this misses the point, and not just because lockdowns have been imposed not only in China's Hubei province but also in India, Malaysia and the Philippines and governments everywhere are encouraging rigorous social distancing.”\n“We think the epidemiological data offer important information about how this coronavirus pandemic and others can be fought,” Spencer added.\nExperience in Hong Kong, Japan, Singapore, South Korea and Taiwan tells us that people's behaviour can change if they are provided with accurate and reliable information. By allowing people to make their own decisions based on this kind of information, governments can achieve social distancing and flatten the epidemic curve without forced measures",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}