{
    "url": "https://www.db.com/news/detail/20200320-financial-reports-confirm-delivery-on-targets-in-2019?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 20, 2020",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Financial reports confirm delivery on targets in 2019",
    "body": "Deutsche Bank’s (XETRA: DBKGn.DE / NYSE: DB) audited financial results for 2019, published today, confirm that the bank delivered on or ahead of all targets in executing its transformation strategy in 2019. Deutsche Bank also substantially increased sustainable banking activities, maintained investments in young talent and continued to make progress on diversity and inclusion, as outlined in Deutsche Bank’s Non-Financial Report and Human Resources Report which were also published today.\n2019 Annual Report: delivery on or ahead of objectives in 2019\nCommon Equity Tier 1 ratio of 13.6% and fully-loaded leverage ratio of 4.2%\nCapital Release Unit deleveraging ahead of plan, with leverage exposure down 55% and risk weighted assets down 36% in 2019\nWorkforce down 5% to 87,597\nAdjusted costs of 21.5 billion euros¹, in line with target, with 7% reduction in total compensation and 22% reduction in variable compensation versus 2018\nManagement Board compensation down 35% year-on-year\n2019 Non-Financial Report:\nDeutsche Bank helped clients raise over 22 billion euros in ESG (Environmental, Social, Governance) and sustainability-linked bonds\nIt participated in arranging over 50 billion euros of sustainability-linked loans\nDWS had 70 billion euros of sustainable assets under management, real estate investments in certified green buildings and infrastructure investments in renewable energy projects at year-end, up 41% year-on-year\nDeutsche Bank devoted 58 million euros to corporate social responsibility (CSR) initiatives, up 8%. This had a positive impact on the lives of 1.6 million people\n2019 Human Resources Report:\nDeutsche Bank hired 955 graduates, close to historic high levels, and 667 apprentices selected from 24,000 applicants in Germany\n9th successive annual increase in proportion of female Directors and Managing Directors but further progress required to meet the bank’s own targets for 2021\nDiversity and inclusion: 17th successive 100-point score in Human Rights Campaign Corporate Equality Index\nChristian Sewing, Chief Executive Officer, said: “Deutsche Bank made a good start to 2020, after delivering in line with or slightly ahead of the targets of our transformation strategy in 2019. We remain absolutely dedicated to continuing on that path.”\nSewing added: “Our financial strength positions us well to support our clients in the current period of uncertainty. At this time it is of course not possible to predict all the repercussions on the economy as a whole. But our new strategy leaves us far better equipped for financial market turbulence now than we were a year ago.”\n¹Excluding transformation charges and fourth-quarter expenses associated with Prime Finance platform being transferred to BNP Paribas\nAnnual Report\nDeutsche Bank confirmed that 70% of total anticipated transformation-related effects were already recognised as at year-end 2019.\nAs indicated at the launch of Deutsche Bank’s transformation strategy in July 2019, the Management Board and the Supervisory Board will propose in the 2020 Annual General Meeting not to pay a dividend in respect of 2019. Deutsche Bank will pay coupons on its additional Tier 1 (AT1) instruments of some 350 million euros in April 2020 from Additional Distributable Items (ADIs), which stood at 30 billion euros as at year end 2019 as set out in the Annual Financial Statements and Management Report for Deutsche Bank AG under HGB.\nThe Outlook section of the Annual Report includes commentary on COVID 19. While it is too early to predict the impacts on business or the bank’s financial targets that the expanding pandemic, and the governmental responses to it, may have, the bank may be materially adversely affected by a protracted downturn in local, regional or global economic conditions. Given the uncertainty around extent, duration and market spillover of COVID 19, forward looking assumptions do not currently consider any of its potential impacts.\nCompensation\nTotal compensation awarded to Deutsche Bank employees in respect of 2019 was 10.0 billion euros (2018: 10.7 billion euros), down 7%. Total compensation includes variable compensation (Group and individual components) for employees of 1.5 billion euros, versus 1.9 billion euros in 2018. The year-on-year decline of approximately 22% was driven by a reduction in headcount and lower variable compensation levels reflecting the bank’s net result. 36% of variable compensation awarded in respect of 2019 will be paid out in future years.\nThe Management Board, comprising eight members on a full year equivalent basis, received total compensation of 36.0 million euros for 2019, down 35% versus 55.7 million euros in the prior year, when the Management Board comprised ten members on a full-year equivalent basis. The year-on-year difference primarily reflects the decision by the Management Board to waive the individual component of its variable compensation for 2019 which led to a reduction of total variable compensation by 48%.\nTotal compensation figures include compensation for the current Management Board members and for Management Board members who served during part of 2019. Christian Sewing, Management Board Chairman and Group Chief Executive Officer, was awarded a total compensation of 5.0 million euros.\nOther Financial Reports\nToday, the bank also published its 2019 Pillar 3 Report and Annual Financial Statements and Management Report for Deutsche Bank AG under HGB.\nIn addition to the aforementioned financial reports, the Annual Report on Form 20-F will be made available in the course of today.\nHuman Resources Report\nDeutsche Bank’s Human Resources Report contains information on Deutsche Bank’s strategic Human Resources priorities and initiatives during 2019, provides key employee statistics and gives details on key metrics and people-related activities.\nWorkforce reductions remain in line with targets despite investments in IT and controls\nOn a full-time equivalent basis, the number of employees decreased in 2019 by 4,140 or 5 percent to 87,597 as of 31 December 2019. The restructuring of the equities business contributed to this development, as did the sale of the private and commercial banking business in Portugal, which reduced the workforce by over 300 full-time equivalents.\nManagement continued to insource business-critical external roles during the year, especially in IT, which added to the internal workforce. It also further strengthened controls, notably through sustained investments in its Anti-Financial Crime unit which added some 250 people in the year. The bank raised its spending on non-financial risk management to approximately 600 million euros in 2019, a three-fold increase over 2013.\nGrowing investments in young talent\nDeutsche Bank hired 955 graduates in 2019, compared to 910 in 2018 and 617 in 2017. In 2019, women made up 39% of the graduate intake, essentially stable versus 2018. In Germany, the bank hired 667 new apprentices, selected from some 24,000 applicants, during 2019. 41.9 percent of the bank’s total apprentices are women.\nA commitment to gender equality, diversity and inclusion\nDeutsche Bank made further progress on gender equality during 2019, including at the most senior corporate title levels. The percentage of women Managing Directors rose to 18.3% (2018: 18.1%), while the percentage of female Directors rose to 25.1% (2018: 24.5 %).\nDeutsche Bank has increased the proportion of women at Managing Director and Director level in every year since 2010, when the bank first published voluntary global gender diversity goals, but has not yet reached its target of 21% women at Managing Director level and 28% at Director level by the end of 2021. Overall, the percentage of women at the bank remained essentially stable at 46.3%.\nDeutsche Bank operates in 59 countries and had employees from 140 different nationalities as at the end of 2019. In 2019, Deutsche Bank was awarded the maximum score of 100 in the Human Rights Campaign’s annual Corporate Equality Index for the seventeenth consecutive year, and was designated as a ‘Best Place to Work for LGBTQ Equality’ by that body. Deutsche Bank’s ground-breaking internship program for graduates with autism, launched in the UK four years ago, was expanded into the US.\nNon-Financial Report\nDeutsche Bank also published its 2019 Non-Financial Report today. In addition to information about the bank’s management of non-financial risk (culture and integrity, anti-financial crime) this also provides details of developments during the year in areas commonly referred to as Environmental, Social and Governance (ESG).\nCommitment to climate-friendly and socially responsible solutions\nAs a global financial intermediary, Deutsche Bank aims to play an important role in facilitating the transition to a low carbon and sustainable economy by providing capital. The bank is determined to facilitate the direction of financial flows towards innovation and growth for climate-friendly and socially responsible solutions.\nIn 2019, Deutsche Bank signed the UN Principles for Responsible Banking as a founding signatory. Deutsche Bank is working towards implementation of The Task Force on Climate-related Financial Disclosures (TCFD) recommendations through internal efforts as well as external industry initiatives.\nAll Deutsche Bank’s core businesses contributed to this goal in 2019:\nDeutsche Bank helped clients raise more than 22 billion euros in ESG- and sustainability-linked bonds, approximately two and a half times more than in the prior year. It also arranged project finance totaling around 2.5 billion euros for renewable energy projects generating over 2,200 MW.\nDeutsche Bank acted as global coordinator for eight sustainability-linked loans and overall participated in over 20 sustainability linked loans with a total deal volume of more than 50 billion euros.\nDeutsche Bank captured gross inflows of approximately 248 million euros in a new fund investing in companies contributing to Sustainable Development Goals, or around 22% of total gross inflows into themed funds. The Wealth Management business grew client assets in ESG-funds by 56% to over 300 million euros in 2019.\nDWS reported 70 billion euros of ESG assets under management as at year-end 2019, up 41% from 49 billion euros at year-end 2018. These include ESG and sustainable assets under management, real estate investments in certified green buildings and infrastructure investments in renewable energies. DWS was also recognised for its ESG proxy voting in the US, ending 2019 among the leading asset managers with the most votes on shareholder resolutions linked to climate change over the past five years, according to Morningstar.\nEnabling communities and economies to prosper\nIn 2019, Deutsche Bank invested 58 million euros, up from 54 million euros in 2018, in a range of corporate social responsibility (CSR) initiatives which together made a positive impact on the lives of 1.6 million people. Born to Be education projects enabled some 460,000 young people in 25 countries to develop their potential.\nThese also include initiatives to improve financial literacy and inclusion. In its Made for Good program for social entrepreneurship, Deutsche Bank has supported 5,735 social enterprises and charities that had an impact on more than 560,000 people. The bank’s commitment to help to build stronger communities in basic welfare and infrastructure touched the lives of some 585,000 people last year.\nAlmost 19,000 or 25% of staff members (ex Postbank) worldwide participated in Deutsche Bank’s Plus You employee volunteering and giving community. This compares with 23% in 2018. Volunteers invested some 220,000 hours of their time in 2019. Matched giving and employee giving schemes helped raise 8.4 million euros for good causes in 2019 in spite of increasing budget pressures.\nFinal and audited results at a glance\nAvailability\nAll reports can be downloaded from investor-relations.db.com/reports-and-events \nThe Annual Report on Form 20-F, which will be submitted to the U.S. Securities and Exchange Commission (SEC) over the course of today, will also be made available following submission (in English only) on the website:\nhttps://www.db.com/ir/en/sec-filings-for-financial-results.htm\nFirst Quarter Results\nPublication of first quarter results is scheduled for April 29, 2020.\nEffective 1 January 2020, the Group will prepare financial statements in accordance with the EU IAS Regulation (Regulation (EC) No. 1606/2002 of the European Parliament and of the Council of 19 July 2002) and will apply portfolio fair value hedge accounting for non-maturing deposits under the IAS 39 carve-out provisions (commonly referred to as ‘EU carve-out’). The purpose is to align the Group’s hedge accounting approach with its risk management practice and the accounting practice of its major European Union peers. The Group’s SEC reporting remains unchanged.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}