{
    "url": "https://www.db.com/news/detail/20200316-christian-sewing-on-the-coronavirus-crash-we-can-be-part-of-the-solution?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 16, 2020",
    "tags": [
        "Company"
    ],
    "title": "Christian Sewing on the coronavirus crash: \"We can be part of the solution\"",
    "body": "In an interview with German Sunday paper FAS, CEO Christian Sewing talks about the coronavirus crash, our bank's resilience and our 150th anniversary.\nIntroduction of the FAS article: The year started off well for Christian Sewing. After a long period, Deutsche Bank was finally back among the winners on the stock market, and confidence was returning, just in time for the 150th anniversary, which was to be celebrated with the German President and the Philharmonic Orchestra in Berlin. The coronavirus is changing everything. Deutsche Bank shares plunged to a new record low last week, and the boss is rushing from one crisis meeting to the next. Nevertheless, Sewing does not cancel our arranged interview. The man is brave.\nMr Sewing, will the coronavirus trigger a financial crisis like the Lehman collapse did in autumn 2008?\nThe situation today is completely different. The 2008 crisis had its origins in the financial system, partly because banks were no longer able to control their risks, and spread from there to the economy as a whole. This time it's the other way around, and we can be part of the solution.\nWe are dealing with a macroeconomic shock; the supply chains are broken, demand is collapsing in some sectors such as tourism, and there are also distortions on the oil market. We now have to secure the liquidity of our customers with the help of government programs.\nHowever, in their basic scenario, our economists are assuming there will be a temporary slump, and expect the global economy to recover from the fourth quarter of 2020 onwards.\nThe stress tests for banks assumed a 30 percent stock market crash as a horror scenario. This is getting close. When will the first bank collapse?\nOf course a situation like this is challenging for many sectors of the economy, but the banking system today is much more stable than it was before the financial crisis. We have significantly larger capital and liquidity buffers, our balance sheets have been cleaned up and are much more transparent and tend to be smaller than they were then.\nWe alone have reduced our balance sheet by around one trillion euros since 2011 and have removed the corresponding risks. I can say here that our balance sheet is more robust than I have ever experienced in my 30 years at Deutsche Bank.\nHow high is the risk of massive loan defaults if companies lose income because of the coronavirus?\nThis basically depends on how much and, above all, how long the coronavirus burdens the economy. And that can’t yet be reliably predicted. However, I am confident about Deutsche Bank because we continue to manage our balance sheet very conservatively.\nWe had credit risks well under control even during the 2008 financial crisis, and our default rates remained low, partly because we have a very diverse loan book. Many companies have also done their homework.\nNevertheless, we are now thinking about how we can support our customers in this difficult stage. Now it is important for the companies to remain liquid.\nWhat is to be done about it? Who has to face the challenge? What resources do central banks and governments have?\nGiven that money is already very cheap, monetary policy resources are limited, at least in Europe. However, we welcome the decisions made by the European Central Bank this week. It is particularly important that the ECB and the European Banking Authority (EBA) are now giving banks more flexibility to support their customers. In principle, policymakers still have more leeway than the central banks, especially in countries like Germany, with its budget surplus.\nShort-term assistance for affected companies is important. The German government is doing exactly the right thing by providing with short-time work allowances and liquidity assistance. The experience of 2008 can help to cushion external shocks in this area. Furthermore, Finance Minister Olaf Scholz and Economy Minister Peter Altmaier announced on Friday that all necessary measures would be taken to combat the crisis.\nThat was a correct, strong signal. I fear that in the coming weeks or months we will see that a classic economic stimulus package will also be necessary to stimulate longer-term demand. However, the ministers have already signalled their willingness to take measures of this kind. For a change of mood to occur on the capital markets, this determined action by fiscal policymakers is necessary. It should be coordinated internationally wherever possible. Germany has now submitted a proposal.\nOn Thursday, your shares reached a new historic low. Are you powerless against the stock market panic?\nOf course we can’t escape such a broad downward trend. The corona crisis and the sharp drop in oil prices have fuelled fears of a global recession, with many securities barely being traded. So these are not Deutsche Bank-specific topics; we saw those more at the beginning of the year, when the share price had decoupled itself upward from other sector stocks. With our new strategy, we are on the right path to making our bank profitable again on a sustainable basis.\nYou have reported your first infected employees. What precautions are you taking for your staff? Is it possible to keep a bank ticking over from a home office?\nFirst and foremost, the health of our employees and our customers must come first. This is also about our social responsibility. We companies must do everything possible to ensure that the virus spreads more slowly and that healthcare systems are not overloaded. As a bank, we are responsible for this, just as every individual is. Many colleagues now have the opportunity to work from home, and we have spread teams across several locations.\nThis is working well overall. This is how we are ensuring that we can continue to be there for our customers to the fullest extent. After all, it is precisely in turbulent times like these that they need our advice on and our solutions to their financial issues. We are currently setting up a corona helpdesk for SMEs –- and it's not just about financing issues, but also about how to get short-time work allowances if the worst comes to the worst.\nThe bank’s 150th anniversary ceremony has been cancelled. Will you be holding the celebration later?\nThe last-minute cancellation was distressing. We would very much have liked to celebrate our 150th anniversary with our Federal President, the Berlin Philharmonic and our customers. But it was the only right decision in the current environment. We are now looking into whether and how we can celebrate our anniversary appropriately in the second half of the year. There are other priorities at the moment.\nWhich of the heads of Deutsche Bank in its 150-year history do you regard as a role model?\nThe question of role models is always difficult. But when it comes to who stands out in the history of our bank for me, the first ones were the founding fathers, because of their foresight in those days. I think the achievements of Hermann Josef Abs equally impressive. He rebuilt Deutsche Bank after the Second World War and was instrumental in determining its significance for the development of Germany.\nThirdly, I would certainly include Alfred Herrhausen, for his courage in tackling challenges that were significant for our bank and for the global economy. The international expansion that he pursued, including the bank’s entry into the international capital market business, was both right and courageous. I was also impressed by the way he embodied Deutsche Bank in public, and how he also championed issues outside the actual banking business. He embodied social responsibility. I must add one thing. I have not met any of these people myself.\nYou're too young for that.\nCorrect. I was in the third month of my apprenticeship with Deutsche Bank when Herrhausen was murdered. It really affected all of us at the time. Herrhausen was leading figure for the employees.\nTwo years ago, you yourself became CEO with the aim of giving Deutsche Bank back its pride. How far do you think you have come?\nWe're on the right track, but still a long way from where I want us to be in the long term. We completed one stage by achieving our targets for 2019. In addition, an important major shareholder joined the company at the beginning of the year. One thing leads to another. Those things together improved the overall mood. In the past four years, I have not experienced a spirit of optimism like that at the beginning of this year. The last time that happened was when John Cryan was appointed CEO in 2015.\nThat mood didn’t last long. After three years, Cryan had to leave suddenly.\nWhen I succeeded John, internal morale was not good at first because our bank's reputation had suffered badly at that time. One individual can’t be blamed for that. It is attributable to a whole series of developments that go far back into the past. But now the employees feel that we have cleaned up, our strategy is obviously right, and we can go into our meetings with customers for the first time without having to justify ourselves for five to ten minutes. That makes a big difference. It is bringing back some pride and some self-confidence.\nThe coronavirus is now setting you back again badly.\nNo, it isn’t setting us back structurally. We have the right strategy. What was right until the end of February is not wrong now. And I'm not worried that the coronavirus will attack our bank fundamentally. We have an equity ratio of more than 13 percent, we have 200 billion euros in liquidity, we have a clean credit book and we made a good start to the year.\nHowever, no one can fully assess the impact of the virus on the global economy at present. It depends on how market participants and governments behave. I can’t see any dramatic consequences for the bank in the short term. But of course, focus and discipline are still needed.\nWhen did you sense the first signs of the crisis?\nAs early as the beginning of February, because of our international character. In their discussions with customers, especially in Asia, people noticed that the mood was changing.\nMr. Sewing, you praise your role models for their work above and beyond the bank. Can a banker still actually interfere in politics these days?\nYes, if you're in a stable position. My parents always said to me: “Don’t get involved until you’ve sorted yourself out.” We’ve done this in the past few years. So, I think that we, as a bank, can also speak out again. Last autumn, for example, we began to take a more critical stance on the low-interest-rate policy, not only because it is costing us a billion euros in profits a year, but because we are concerned that negative interest rates are dividing society.\nMost Germans have nothing to gain from the fact that real estate prices and rents are rising rapidly while wages and retirement income are stagnating. This is dangerous for democracy. We can only be successful in the long term as a society and an economy if the large majority in the country benefit.\nAre the politicians now listening to you again after years of alienation owing to the financial crisis?\nWe’re in a close dialogue, and I am finding it very constructive. Especially in the current situation, our global network can help to mitigate the consequences of this crisis.\nAre you getting invitations in Berlin again?\nOf course. And I notice that we are welcome in Berlin, right across the democratic-minded parties.\nDoes it help that Deutsche Bank’s management board has now become more German again?\nI find the term “become more German\" difficult to understand. We are a global bank. If by \"becoming more German\" you mean that it helps to be closely networked with politics and business in Germany, then I can say yes. I like being in Berlin two or three days a month. It is enriching, and it creates trust.\nThese days, many business leaders are worried about the general political climate. Are you, too?\nYes, I am. We must all ask ourselves what Europe wants to be like in three, four or five years' time. After all, Germany has no chance of surviving on its own economically against the great powers, the United States and China. We have to be a counterweight to this. This is only possible with a common market for 450 million people.\nThe common internal market has been achieved.\nFor goods, yes, but not for services. And certainly not for the financial sector. If we develop an app today, it should be immediately usable everywhere, throughout Europe. But it isn’t. Just ask our legal department which national consumer rights have to be considered in France, Italy and Spain, just to name a few.\nThis is a huge competitive disadvantage compared to the United States or China. We need a European banking union. For this to happen, Germany must also be prepared to compromise, for example, on European deposit insurance. We must make sensible compromises to strengthen Europe. I can only support our finance minister here.\nSavings banks and cooperative banks oppose this, arguing that German savers should not be liable for bankrupt Italian banks.\nYes, there are different views. And, of course, certain conditions still have to be met. Nevertheless, the development has to come, and in the long run, our colleagues in the savings bank and cooperative sector will not be able to stand in its way. What ultimately matters is that every saver in Europe is equally well protected, regardless of the country in which they invest their money. We can't be half pregnant. We must finally understand that Germany and Europe need each other and don’t have much time left.\nDo you think the European deposit insurance system will come?\nYes. And hopefully sooner than some people think. Otherwise the US banks will dominate the market. JP Morgan alone now makes more profit than all the European banks together.\nNot only in Europe, but worldwide, the signs seem to be pointing to disintegration. Are international policymakers still capable of acting, now, during the coronavirus crisis, for example?\nWith regard to global politics, I’m certainly concerned about cooperation at the highest level. It was possible to tackle the 2008 financial crisis, as bad as it was, because policymakers, and business, cooperated globally. Today, I no longer see this willingness to solve problems together, as Angela Merkel and Barack Obama did at the time, for example. That's dangerous.\nIs that why you are hoping President Trump will be voted out of office in autumn? Would you prefer a Democrat in the White House?\nIt’s not about individuals, and I certainly won’t make any party political recommendations, either in Germany or anywhere else in the world. What really concerns me is the general situation, the lack of a common will in world politics. When you travel in America, you quickly feel that this \"America First\" movement, economic nationalism, is not solely the concern of the current president, nor is the trade conflict between the US and China.\nWe are seeing a worldwide return to strong nation states that always put their own interests first, and do so even at the expense of others. We have learned one thing since the end of the Second World War. Economics is not a zero-sum game, international cooperation can be worthwhile for everyone.\nDoes Deutsche Bank still have the claim to be a global player today?\nAbsolutely, we have made a conscious decision to remain global. We generate almost half of our income outside Europe. This diversification is very important. Our global identification with a strong presence in the US and Asia is a competitive advantage, which serves the German and European economy. That is why we will remain global.\nIs that why Christiana Riley, an American, was appointed to the management board, with New York as her official seat – as a signal that the US remains important, despite all the debates about a withdrawal?\nChristiana Riley's appointment was a sign, also in our bank, of how important this international network is for us. She knows our bank inside out, and because she is American she understands the local conditions very well. Building this bridge is extremely important for us and our customers. Around 20 percent of our income comes from the US.\nIf the majority of shareholders and earnings come from abroad, what is still German about your daily business?\nOur claim is: We are the global principal bank. That says it all. We are German enough to know our way around our home market, and to live the culture and values. But we are equally global. Over the past 20 years, Deutsche Bank has sometimes forgotten its roots, with devastating consequences. But that does not call into question our reason for being here for 150 years – to advise and support companies worldwide.\nWhen I visit the US West Coast these days, every third question there is about the German economy. If we weren't firmly established here, we’d get nowhere. We will only be successful if we manage to achieve this balance between native country and our global aspirations. Deutsche Bank is, if you like, a copy of Germany: strongly anchored in its home market, but geared to a global business.\nAre German companies actually still waiting for Deutsche Bank? The choice of banks is large.\nYou ask me that during the coronavirus? I think we’ll see very soon how important it is in a crisis to have strong banks at home. Family businesses and medium-sized companies appreciate the fact that there is a Deutsche Bank. We stand by their side and will do everything in our power to support our loyal corporate customers in difficult periods.\nAnd large corporations or institutional investors want to be less dependent on American banks – not least because of the conditions or sovereignty over the data. No entrepreneur likes to be dependent, that's why everyone says: We also need European players.\nSo when will a European banking champion finally develop?\nOnly when we have the same regulatory requirements in the Netherlands, France and Germany. Or, to put it more dramatically: if you merge two European banks, but can't reduce the administrative costs by nearly half afterwards, it doesn't help much.\nIt is not rather questions of power that prevent such mergers: Who's in charge afterward? Where is the seat of the new champion?\nI don't believe that. I believe that cross-border mergers will occur once the legal conditions are in place, simply because there is so much pressure on the banks and we need economies of scale. In addition, we’re dealing with a new generation of board members who, despite their pride in their own company, see many things from a different perspective. They are willing to compromise when it is right and important for the big picture and for society.\nSo, could you also imagine Deutsche Bank as a junior partner in a merger?\nOur goal is to merge when we can fully exploit our strengths. And our name is undoubtedly one of these strengths.\nSo, the name \"Deutsche Bank\" must remain. Would you be prepared to sacrifice the Frankfurt headquarters for this?\nIt's clear to me that there will always be a Deutsche Bank in Frankfurt. Given our roots here in Frankfurt and the fact that the European Central Bank is based here, anything else would be a mistake. We must therefore be in a strong position to move towards European consolidation.\nWhat has to happen?\nWe must reach the targets we have set ourselves for 2022, with an eight percent return on capital invested. The stock market will reward this, and then we’ll be in a different position. The fact is, you can negotiate differently if the stock market value is relatively higher than if it is lower.\nAre you now paying the price for letting the domestic market slide for so long?\nWe are catching up in many areas, and we’re doing it even faster than I had hoped in the SME sector. The challenge here is that some customers are very disappointed with the way the bank behaved in the past. It turned off the for credit flow for entrepreneurs, because it was thought there was more money to be made in London.\nAn entrepreneur does not forget that so quickly. However, we have been regaining the trust, especially of medium-sized and family businesses, for some time now. At the same time, we have to defend our position with large corporations. And we're well on our way.\nSpeaking of home, will we be going to the \"Deutsche Bank Arena\" in the future? What do you expect from a partnership with Eintracht Frankfurt? Why are you putting millions into football?\nIt is true that we’ve had a business partnership with Eintracht for a long time and are talking about how we can expand it. It’s not just about sponsoring, but also about a comprehensive regional commitment, together with even closer business cooperation - for example with payment platforms inside and outside the stadium. Furthermore, we feel very closely connected to Eintracht. In my opinion, the club has a very good management with the right values. We are two strong partners for the region.\nNot so long ago, liveried servants wearing white gloves served the management boards at Deutsche Bank. Will these customs ever return?\nDefinitely not under my leadership. I was recently visiting a customer in the US, a great CEO, billion-dollar turnover – but with a very plain office where he taps the water out of the cooler himself. We are also more likely to go in this direction than backwards.\nIs the relaxed style also reflected in your leadership behaviour?\nIn my view, the most important things for managers are clear communication, team spirit, transparent goals, high credibility, combined with an open culture of criticism. The openness to admit mistakes is fundamentally important, and this is exactly what we used to lack to some extent. This is one of the reasons why we got into the situation that is still hanging over us today.\nAnd what is absolutely essential to me is that when I set ambitious goals, I have to show that I am also doing everything to achieve them. That's how you set an example. It also has something to do with fairness. Only then can trust be built. Especially in turbulent times.\nThe interview was conducted by Gerald Braunberger, Georg Meck and Inken Schönauer.\n-------------------------------------------\nFrankfurter Allgemeine Sonntagszeitung, 15.03.2020, page 20 -- © All rights reserved, Frankfurter Allgemeine Zeitung GmbH, Frankfurt. Provided by Frankfurter Allgemeine Archive.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}