{
    "url": "https://www.db.com/news/detail/20200312-update-on-the-coronavirus-situation-message-from-christian-sewing-to-staff-members?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 12, 2020",
    "tags": [
        "Company",
        "Personnel announcements"
    ],
    "title": "Update on the coronavirus situation – message from Christian Sewing to staff members",
    "body": "Dear Colleagues,\nAs more and more countries take action to manage and mitigate the impact of coronavirus, increasing numbers of our employees around the world are also being affected. Several of our colleagues have been confirmed as having contracted the virus; fortunately they appear to be only mildly affected so far and we wish them a speedy and full recovery. We would also like to assure our colleagues in those countries that are hardest hit – Italy at the moment, for instance – that we stand by you.\nAs you will have seen from a number of our crisis management communications, our main objective is to protect our staff, ensure business continuity across our global activities and take all responsible action to help stop the virus spreading further. It is our social responsibility to support clients and the economy while helping to avoid overstretching health systems in the countries in which we operate.\nThus, we help to protect those in society most at risk from COVID-19, especially the elderly. The efforts of many governments and authorities as well as healthcare staff worldwide to fight this pandemic deserve the greatest respect.\nWe have implemented appropriate measures in line with the situation on the ground or in the respective area of the bank. Many teams have switched to split mode, while others are partially relying on staff working from home. We have reduced business travel to a minimum and have cancelled large-scale events.\nI would like to say a big thank you to all those who have made this possible – and to you for complying with these arrangements and continuing to show great dedication in your day-to-day work. We ask you to continue taking our advice and instructions – posted on our intranet – very seriously.\nIf we take these precautions I am confident that we will manage this situation together. We have devised comprehensive crisis plans, we have the discipline, and we have the financial strength to manage through this period. First and foremost, however, we have you. And all of you have proven time and again that we stand together and deliver outstanding performance when faced with complex challenges.\nOur businesses are in good shape as the positive momentum of the fourth quarter has continued. We have a solid foundation with a strong capital and liquidity base and high credit quality.\nWatching our performance in the quarter to date, it is clear to me that our new strategy is not only an important prerequisite for growth and sustainable profitability, but that it has enhanced our flexibility and resilience – especially in an unfavourable environment. We are far better equipped for a difficult phase in the financial markets now than we were just a year ago.\nOur clients must be at the centre of our considerations. Right now they require our advice, our expertise and our solutions in order to overcome their short-term financial challenges. In this kind of situation especially we can prove to our clients that we stand by them when times are tough and fulfil our obligations.\nThank you once again for all your hard work. Let us help one another and look out for one another. The Management Board and the Group Management Committee will do everything in their power to support you in this.\nBest regards,\nChristian Sewing\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}