{
    "url": "https://www.db.com/news/detail/20200310-deutsche-bank-support-800-healthcare-workers-fighting-the-coronavirus?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 10, 2020",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank support 800 healthcare workers fighting the coronavirus",
    "body": "Deutsche Bank is sponsoring 800 hot meals for medical support staff in Singapore to help in their efforts to manage the COVID-19 crisis, as part of our CSR In the Community initiative.\nOver the next fortnight, the bento box meals will be given to doctors, nurses and medical support staff during their shifts at Singapore’s largest hospital.\nThe bank is partnering with long-term charity partner, Dignity Kitchen to produce the meals. Dignity Kitchen is a social enterprise that trains and employs people with disabilities.\nA thank you\nTo show their support and gratitude to healthcare workers, staff are preparing hand-made thank you cards to go along with the bento boxes.\nAnnie Yeo, APAC Head of CSR explained: “Our healthcare workers are going above and beyond to keep everyone safe and judging by the heartfelt messages in the cards and creative effort everyone has made, their efforts really mean a lot to people.”\nGoing further\nDeutsche Bank is donating and distributing 6,000 protective face masks to low-income families and vulnerable community members in Hong Kong.\nLast month, the bank in China pledged 1mn Yuan (around EUR 130,000) to the China Charity Federation, an organisation providing critical medical supplies to hospitals and protecting front-line medical staff and their families from the virus.\nAlso in February, Deutsche Bank's Corporate Bank Operations helped a global medical company get crucial equipment to hospitals in Wuhan, confirming payments over the lunar new year holiday.\nChina’s donation is being used to distribute protective and surgical masks, disposable protective clothing and medical goggles to medical staff and volunteers and to fund prevention and control programmes in the Hubei Province and other affected cities in China.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}