{
    "url": "https://www.db.com/news/detail/20190625-angel-chen-and-donald-taylor-to-join-deutsche-bank-wealth-management-in-los-angeles?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 25, 2019",
    "tags": [
        "Company",
        "Personnel announcements"
    ],
    "title": "Angel Chen and Donald Taylor to join Deutsche Bank Wealth Management in Los Angeles",
    "body": "Deutsche Bank Wealth Management has announced that it has hired Angel Chen and Donald Taylor as senior Relationship Managers in Los Angeles, strengthening its offering to ultra-high-net-worth individuals in the region.\n“We are thrilled to welcome Angel Chen and Donald Taylor to Deutsche Bank Wealth Management. They both bring extensive industry experience that will help us serve our growing number of ultra-high-net-worth clients on the West Coast,” said Patrick Campion, Head of Deutsche Bank Wealth Management Americas. “We continue to hire top industry talent as we grow our presence in key markets in the Americas.”\nChen joins from City National Bank’s Private Client Services where she oversaw a team managing client relationships with complex trust, investment and lending needs. She has nearly 20 years of executive-level management experience and previously held roles at Bank of the West, Wells Fargo, Union Bank of California and Bank of America.\nTaylor, who has over 20 years of industry experience, also joins from City National Bank’s Private Client Services where he was a senior advisor to high-net-worth families, non-profit organisations, foundations and professional services firms. Prior to City National Bank, he was a financial advisor at Merrill Lynch.\nBoth Chen and Taylor will report to Michael Rogers, who joined this month from Merrill Lynch Private Banking and Investment Group as the West Coast Head of Deutsche Bank Wealth Management Americas.\nDeutsche Bank Wealth Management seeks to deliver a premium wealth management experience while leveraging the vast resources of Deutsche Bank for high-net-worth and ultra-high-net worth individuals, families and select institutions.\nFor further information please contact:\nDeutsche Bank AG\nPress & Media Relations\nChristina Partyka or Adrian Cox\n+1 212 250 1013 / +44 (0) 207 541 7775\n  About Deutsche Bank Wealth Management\nWith client assets of approximately 300 billion euros (as at 31 March 2019), Deutsche Bank’s Wealth Management business is one of the largest wealth managers worldwide. It offers clients a broad range of traditional and alternative investment solutions, as well as comprehensive advice on all aspects of Wealth Management.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}