{
    "url": "https://www.db.com/news/detail/20190624-deutsche-bank-appoints-kevin-burke-head-of-institutional-and-treasury-coverage-asia-pacific?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 24, 2019",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank appoints Kevin Burke Head of Institutional and Treasury Coverage, Asia Pacific",
    "body": "Deutsche Bank announced today that Kevin Burke will join the bank as Head of Institutional and Treasury Coverage, Asia Pacific. The business was created in 2018 to consolidate and strengthen multiple interfaces between the bank and its clients globally. It brings together 1500 staff in 78 cities across the world to deliver the Corporate & Investment Bank to clients.\nBurke rejoins the bank from Standard Chartered, where he was Global Head of Financial Markets Sales for two years.\nPrior to this he was Head of Deutsche Bank’s Institutional Client Group for Asia Pacific in which position he played a key role in making Deutsche Bank one of the leading investment banking providers in the region.\nThe bank has positive momentum in the region, ranking equal 6th in Coalition’s industry revenue league tables for FY 2018, up from equal 7th at the half year. In Corporate Finance APAC, the bank was highlighted as being one of the two strongest performers in the region versus 2017.\nIn this newly-created role, Burke will be responsible for client coverage strategy across the region, including coordinating client prioritisation and engagement to drive the bank’s growth strategy. He will be based in Singapore and will report to Louise Kitchen, Head of Institutional and Treasury Coverage based in London, and Werner Steinmueller, CEO Asia Pacific based in Hong Kong.\nKitchen said: “Kevin Burke has a deep understanding of our priority client group in the region and is a great re-hire for Deutsche Bank. We have regained market share in key sectors in APAC and Kevin’s expertise and network, built over 25 years, will accelerate that momentum.”\nFor further information please contact:\nDeutsche Bank AG\nPress & Media Relations\nJo Court or Charlie Olivier\n+44 (0) 207 545 5459 / +44 (0) 207 545 7866\n\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nForward-Looking Statements\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on the plans, estimates and projections currently available to the management of Deutsche Bank.\nForward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update any of them in light of new information or future events. By their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which Deutsche Bank derives a substantial portion of its revenues and in which the bank holds a substantial portion of its assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of strategic initiatives of the bank, the reliability of the bank’s risk management policies, procedures and methods, and other risks referenced in the bank’s filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in the bank’s SEC Form 20-F of 16 March 2018 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}