{
    "url": "https://www.db.com/news/detail/20190613-deutsche-bank-rises-to-2-in-euromoney-s-2019-foreign-exchange-survey?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 13, 2019",
    "tags": [
        "Awards",
        "Company"
    ],
    "title": "Deutsche Bank rises to #2 in Euromoney's 2019 Foreign Exchange Survey",
    "body": "Euromoney announced the results of its 2019 FX Survey, an industry leading review of FX trading, research and e-business capabilities. Deutsche Bank performed strongly across the board, rising or maintaining its position in almost every category.\nMost impressively, the bank rose to #2 globally with market share of 8.41%, having been #8 overall in the 2018 survey with market share of 5.41%. In Western Europe, the bank returned to #1 position from #5, increasing market share to 10.75%, the only bank to get to double digits. In other categories, Deutsche Bank also performed strongly, notably:\nFX Options: #3 compared to #7 in 2018, with market share increasing to 9.25% (2018: 7.29%)\nSpot/Forward: #3 compared to #7 in 2018, with market share increasing to 8.39% (2018: 5.56%)\nSwaps: #4 compared to #9, with market share of 8.40% (2018: 4.79%)\nOverall electronic trading: #3 compared to #7 in 2018, with market share increasing to 8.97% (2018: 5.45%)\nIn its write up, Euromoney commented that Deutsche Bank was “This year’s poll hero-slash-monster”, describing the bank’s FX business as “an area of core strength”.\nGarth Ritchie, President and Head of Corporate & Investment Bank, commented: “This is an outstanding result and is testament to a culture that drives continuous innovation, technical excellence and long-term commitment to our global client base.”\nThis year’s Euromoney survey canvased the views of nearly 2,000 market participants and showed overall FX volumes in 2018 of USD 121.1 trillion, the highest overall captured volume since 2015.\nFor further information, visit Euromoney’s website.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}