{
    "url": "https://www.db.com/news/detail/20190607-positiveimpact-wins-gold-at-german-brand-awards?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 7, 2019",
    "tags": [
        "Company",
        "Corporate Citizenship",
        "Research"
    ],
    "title": "#PositiveImpact wins Gold at German Brand Awards",
    "body": "The #PositiveImpact campaign has been recognised with a prestigious brand award in Germany. Our global brand strategy and campaign was awarded Gold at the 2019 German Brand Awards for its excellence in brand strategy and creation.\n#PositiveImpact was named ‘Best Integrated Campaign’ – a category in which brands like Zurich Insurance or Deutsche Telekom have also previously won awards.\nThe jury praised Deutsche Bank’s ambition to create a dialogue about its role serving clients, society and the economy, while at the same time uniting its employees behind a common goal via a new purpose for the bank.\nIt also commented on how the campaign had taken a courageous approach that signals a new openness to the outside world while promoting global togetherness across the organisation.\nGlobal Head of Brand Communications & CSR Lareena Hilton said: “We’re thrilled to win this award in a category featuring some very well-known global brands. The jury noted how #PositiveImpact has created a clear sense of purpose across the bank. We made a conscious decision to launch the campaign internally first because we wanted employees to feel part of it. The response has been amazing. It’s great to see colleagues engaged with why we all come to work every day and what that means for our clients.”\nEmployee engagement with #PositiveImpact began with the internal launch of the campaign in May 2017. Colleagues have been part of the conversation ever since, through the internal #PositiveImpact hub and ongoing campaigning.\nPositiveImpact made its public debut in June 2018 using client stories from all parts of the bank.\nThese stories are told through ads, films and case studies, all of which describe how each client’s relationship with Deutsche Bank has helped them achieve their plans and ambitions. The most recent additions are PADI (M&A in the US) and Siemens (financing new energy infrastructure in Egypt).\nCEO Christian Sewing’s words underline the strategic relevance of the campaign’s focus on client relationships. In a recent message to employees he said: “The trust of our clients is our most precious asset. There is no better way to get positive recognition than by delivering great service to our clients.”\nSome of the milestones achieved by the #PositiveImpact campaign over the past two years:\nOver 300 million advertising impressions\nOver 18 million videos have been watched in full on digital and social media\n90 percent of Deutsche Bank employees asked are aware of the campaign\n75 percent of employees have visited or posted something on the hub\n70 percent of employees asked support and agree with the purpose statement\nMore than 5,000 posts and 24,000 employees feature on the hub",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}