{
    "url": "https://www.db.com/news/detail/20190515-mentor-coach-advocate-supporter?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 15, 2019",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "Mentor. Coach. Advocate. Supporter.",
    "body": "Deutsche Bank strongly encourages employee volunteering. “Being involved in our community is central to how we do business. Volunteering supports our commitment to employee development, motivation, work/life balance and diversity as well as increases the impact of our CSR programmes”, says Lareena Hilton, Global Head of Brand Communications and Corporate Social Responsibility at Deutsche Bank. “Through the Plus You programme, our colleagues share their skills and their time by volunteering as mentors, advisers and advocates.\nIn teams, they add hands-on support to local projects, and we help them donate to causes close to their hearts by matching donations and offering payroll giving.”\n\n\nIn 2018, some 18,000 Deutsche Bank colleagues volunteered almost 210,000 hours to support community projects around the world. And the commitment continues – this spring offers a lot of opportunities to get involved and make a positive impact, for example in …\n… the UK\nIn the UK, May marks the start of the new application round for the Charities of the Year (CotY). The programme is a two-year partnership with pioneering charities. Since CotY was established in 1999, it has made a powerful impact on our partners, raising more than GBP 22.5 million for 26 charities, and building resources and expertise that helps them advance their cause.\nFor the next round 2020-21, the initiative will support one charity partner, with a focus on mental wellbeing. Charities are invited to apply from May 18 onwards by sending their submissions directly to dbCOTY.2021@db.com.\nThis is the second year of the current partnership working with Cure Leukaemia which offers hope to patients with currently incurable forms of leukaemia, and Rays of Sunshine Children’s Charity which exists to brighten up the lives of courageous children in the UK living with a serious or life-limiting illness, and their families.\nEmployees are invited to support Rays of Sunshine’s Summer Solstice appeal, Ray for a Day: They can help make a child’s wish come true, by raising funds as a team, making a personal pledge or wearing yellow to work on June 20 and 21 in support of the appeal. For all employee giving Deutsche Bank will match any funds raised or pledged – up to the value of GBP 1,000 for fundraising and GBP 3,000 for personal donations. \n… the Netherlands\nIn June, 24 colleagues in the Netherlands will also tackle a physical challenge for a good cause: They are committed to climb – by bike or on foot – the infamous ‘alpine giant’ Alpe d’Huez as many times as they can – no less than ninety times all together – to raise money for the KWF Cancer Fund.\nThe overarching goal is to raise EUR 100,000 in 2019 and again involve as many colleagues as possible. Currently, the counter is already well over EUR 60,000.\n\n… Germany\nIn Germany, 45 cyclists from Deutsche Bank took part in the Eschborn-Frankfurt race and donated in total EUR 3,000 to Rollstuhl-Sport-Club Frankfurt e.V., a charity dedicated to wheelchair sports. And Deutsche Bank employees repaired bikes that will be donated to refugees and people in need at the 6th Gallus fährt Rad Day held in Frankfurt.\nThe German payroll initiative RestCent also has a new partner: Employees had the opportunity to cast a vote for their favourite charity. Deutscher Kinderschutzbund gained over 60 percent of the 2,750 votes and will receive the RestCent donations until September 2020.\n… the US\nIn the US, the numbers are in from a recent fundraising initiative with DonorsChoose.org: the campaign raised USD 700,000 for more than 1,500 classrooms in all 50 states. The bank teamed up with DonorsChoose.org to address student homelessness, and provided US employees with a USD 50 credit to fund the classroom project of their choice on the innovative online platform.\nWith no prompting, employees also contributed $335,000 of their own, often forming teams to fund projects fully. These contributions accessed matching funds from the bank’s philanthropic partners, the Bill and Melinda Gates Foundation, the Raikes Foundation and the rock band Pearl Jam.\n\n… Dubai\nDeutsche Bank staff in Dubai participated in a nationwide event organised by the Dubai Chamber called Give & Gain. This week-long initiative takes place every year in the second week of April and encourages employees from private sector companies to give their time to volunteer for a good cause at a local community-based organisation.\nDeutsche Bank colleagues volunteered at the Manzil Centre, a non-profit organisation dedicated to actively promoting inclusion by providing a professional learning environment for children and young people with disabilities.\n… India\nIn India, employees make a positive impact by regularly spending time with the elderly at retirement homes as they recover from cataract surgery. This commitment is part of Deutsche Bank’s three-year partnership with HelpAge India that has provided free corrective eye surgery to 50,000 elderly people from low-income backgrounds.\nCataract, although it can be treated with a minor surgery, is believed to be responsible for up to 80% of cases of bilateral blindness in India. Through the bank’s In The Community programme, HelpAge India has screened over 250,000 patients across 15 cities in 10 states. The partnership includes screening camps for the elderly, timely identification of those needing surgery, provision of high-quality operation theatres in leading hospitals, transportation to and from their homes and post-surgery follow-up care and medication.\n\nIf you want to get involved learn more about our Plus You volunteering and giving community, visit our CSR website.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 0
}