{
    "url": "https://www.db.com/news/detail/20190514-deutsche-bank-helps-transform-how-payments-are-made-in-malaysia?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 14, 2019",
    "tags": [
        "Corporate products",
        "Digitalisation",
        "Private products",
        "Research"
    ],
    "title": "Deutsche Bank helps transform how payments are made in Malaysia",
    "body": "From today, Deutsche Bank will process payments for corporate clients using Malaysia’s instant credit clearing system, DuitNow (do-it-now).\nThis real-time fund transfer platform transforms how corporate clients make payments and receive funds nationwide.\nDuitNow moves the country from a cheque-based payment infrastructure to one where any participant in the instant credit clearing system can process a payment instantly at a much lower cost.\n\nAny ID\nDuitNow facilitates payment processing through a concept called “Any ID”, where companies no longer have to maintain the bank details of their employees in order to pay them. All they need is their employee’s National ID number to remit salaries or reimbursements. Even if employees change their bank accounts, funds are automatically routed to their preferred account linked to their National ID number (this is called payment by proxy).\nClients in the telecommunications industry will no longer need to keep cash in-house or issue cheques to repay deposits; all they need is a mobile phone number to pay back deposits. Insurance companies will be able to pay out urgent claims using the accepted proxy of their clients.\nJacqueline William, Head of Global Transaction Banking for Malaysia, said: “We are supportive of the government’s efforts to modernise the payments infrastructure in Malaysia and will continue to invest in such initiatives. DuitNow stands to greatly benefit our corporate clients by increasing the speed of local payments.”\nInstant Payment by proxy has already been introduced in Singapore, Thailand and Malaysia to help facilitate the first cross-border flows within ASEAN in the next 12 months. DuitNow is another key step forward in achieving a regional real-time payment ecosystem for ASEAN.\n\nRelated articles\n9 things you need to know about ASEAN\nGTB’s Boon-Hiong Chan on how digitalisation is supporting ASEAN Trade",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}