{
    "url": "https://www.db.com/news/detail/20190513-deutsche-bank-senior-preferred-cds-to-reduce-hedging-costs-for-clients-and-to-improve-comparability-with-peers?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 13, 2019",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank: Senior Preferred CDS to reduce hedging costs for clients and to improve comparability with peers",
    "body": "Frankfurt, 13 May 2019 - With effect from today, dealers are expected to start making markets in Deutsche Bank’s (XETRA: DBKGn.DB / NYSE: DB) Senior Preferred Credit Default Swaps (CDS). This follows legal changes on 21 July 2018 which enabled German banks to issue Senior Preferred debt. To date, Deutsche Bank’s Senior Non-Preferred bonds have been the reference securities for Deutsche Bank CDS.\nThe introduction of a new CDS contract referencing the Senior Preferred obligations of German banks will reduce hedging costs for clients and other trading counterparties of German banks, including Deutsche Bank, and lead to an accurate pricing of counterparty credit risk.\nThese changes will also bring CDS contracts for Deutsche Bank and other German banks into line with EU and US peers where holding structures or Preferred Senior CDS instruments were already available.\nJames von Moltke, Chief Financial Officer of Deutsche Bank, said: “We welcome the introduction of Senior Preferred CDS in Germany. This will lower the cost for counterparties hedging exposures to Deutsche Bank and more accurately reflect the position for counterparties and clients in the hierarchy of creditors. It also creates a level playing field for German Banks versus their EU and US peers.”\nCDS for German banks referenced Senior Non-Preferred instruments since 2017, following an amendment of the German bail-in law. These instruments rank junior to counterparty claims in the hierarchy of creditors overstating the risk to clients and counterparties.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 0
}