{
    "url": "https://www.db.com/news/detail/20190510-trade-war-between-usa-and-china-apac-chief-economist-michael-spencer-about-the-impact?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 10, 2019",
    "tags": [
        "Research"
    ],
    "title": "Trade war between USA and China",
    "body": "The United States has made good its promise to more than double tariffs (up from 10 to 25 percent) on 200 billion US dollars’ worth of Chinese produced goods imported by the United States, following a stand-off in trade negotiations. The tariff hike deadline is the most dramatic escalation so far in the US-China trade war, which threatens to rock the global economy.\nAsia Pacific Chief Economist Michael Spencer told Bloomberg TV in Hong Kong the impact of higher tariffs will be that “everybody slows down” in the global economy as tariff hikes depress trade.\n“Deadlines are starting to dampen business investment. The global economy will be slowing down as these tariffs rise,” Spencer said.\n“Ahead of this [deadline] equity markets fell across the globe,” Deutsche Bank strategist Jim Reid wrote in a note.\nIn a scenario that included a 25 percent tariff on all US imports from China and on automobile imports from Europe, and retaliation from China and Europe, Deutsche Bank Research estimates US and Euro area growth will be lower by 2 percent or more over the next two years – enough to push the US and Europe into recession – even with some monetary and fiscal stimulus. Other Asian economies would be less affected – some will benefit from the diversion of US imports away from China.\nOver the past year China has seen an abrupt slowdown in trade, with export growth falling from 12 percent through the first three quarters of 2018 to 4 percent in the final quarter and only 0.2 percent so far this year. Import growth has fallen even faster – from 20 percent to minus 2.5 percent year to date – as supply chains have contracted or moved production out of China.\n“China has already applied some policy levers. To prevent domestic growth slowing down too much, the government has had to suspend its deleveraging efforts and the fiscal deficit rose by more than 1 percent of gross domestic product,” Spencer added.\nIn response to the United States’ hardline stance, Spencer expects Chinese authorities to take reciprocal tariff action on US imports worth 60 billion US dollars, reduce purchases of US grown soybeans, discriminate opening up of inward foreign direct investment in favour of non-US firms and allow the renminbi to depreciate to 7.0 to the US dollar.\nHead of Asia Macro Strategy Sameer Goel added: “With downside global growth risks increasing, the Japanese yen should outperform as the world’s best safe haven, especially against Asian currencies.”\nInvestors continue to hope for a de-escalation by the Chinese and US governments. “[Both sides] want an end to the trade war soon,” Spencer concluded.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}