{
    "url": "https://www.db.com/news/detail/20190503-greening-china-s-belt-and-road?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 3, 2019",
    "tags": [
        "Company",
        "Sustainability"
    ],
    "title": "Greening China's Belt and Road",
    "body": "Deutsche Bank last week became a founding signatory and supporter of China’s Green Investment Principles (GIP) for the Belt and Road Initiative (BRI), committing to a voluntary set of green principles aimed at promoting green investment for Belt and Road. Deutsche Bank is one of 27 financial institutions that signed the GIP on April 25 in Beijing at the second Belt and Road High-level Forum hosted by the People’s Bank of China (PBOC) and the Ministry of Finance.\nThe Green Investment Principles for the Belt and Road were jointly developed by the Green Finance Committee of China Society for Finance and Banking and the City of London Corporation’s Green Finance Initiative. Signatories include all major Chinese banks and China’s investors in the Belt and Road region, as well as some of the world’s largest financial institutions.\nDeutsche Bank Asia Pacific CEO and Member of the Management Board Werner Steinmueller welcomed the development, saying: “Business and economic ties between China, Europe, and BRI countries continue to strengthen. We are one of the most active foreign banks participating in BRI with full corporate and investment banking offerings along the route. By committing to the GIP, we are pledging that we will not only help steer BRI’s open collaboration across countries from China to Europe, but also strive to ensure these projects are as sustainable as possible.”\nAttending the forum in Beijing with other finance sector leaders and signing the GIP was Feng Gao, Chief Country Officer for Deutsche Bank China.\nFirst published in November last year, the GIP are well aligned with Deutsche Bank’s own Group Sustainability policies and commitments.\nThe Belt and Road Green Investment Principles are:\nPrinciple 1: Embedding sustainability into corporate governance\nPrinciple 2: Understanding environmental, social and governance risks\nPrinciple 3: Disclosing environmental information\nPrinciple 4: Enhancing communication with stakeholders\nPrinciple 5: Utilising green financial instruments\nPrinciple 6: Adopting green supply chain management\nPrinciple 7: Building capacity through collective action\nSignatories to the investment principles include all major Chinese banks, Silk Road investors and some of the world's largest financial institutions:\nAgricultural Bank of China,\nAgricultural Development Bank of China,\nAl Hilal Bank, Astana International Exchange,\nBank of China,\nBank of East Asia,\nChina Construction Bank,\nChina Development Bank,\nChina International Contractors Association,\nChina International Capital Corporation,\nCrédit Agricole-CIB,\nDBS Bank,\nDeutsche Bank,\nExport-Import Bank of China,\nFirst Abu Dhabi Bank,\nHabib Bank of Pakistan,\nHong Kong Exchanges and Clearing,\nIndustrial and Commercial Bank of China,\nIndustrial Bank,\nKhan Bank,\nLuxembourg Stock Exchange,\nMizuho Bank,\nNatixis Bank,\nSilk Road Fund,\nStandard Chartered Bank,\nTrade and Development Bank of Mongolia,\nUBS Group.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}