{
    "url": "https://www.db.com/news/detail/20190503-paul-achleitner-intolerance-should-never-ever-be-tolerated?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 3, 2019",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Paul Achleitner: \"Intolerance should never, ever be tolerated\"",
    "body": "At the Yad Vashem World Holocaust Remembrance Center the foundation stone has been laid for the new Shoah Heritage Collections Center. One of the roughly 150 guests and deeply moved by the ceremony was Paul Achleitner, Chairman of the Supervisory Board of Deutsche Bank, who was joined by representatives from Daimler, Volkswagen, Deutsche Bahn and Borussia Dortmund. The five companies each donated one million euros for the new building.\nYad Vashem houses the largest collection of Holocaust-related artefacts in the world, safeguarding them for generations to come. Opened in 1953, the site hosts more than one million visitors every year.\n\nYad Vashem groundbreaking ceremony with Paul Achleitner, Chairman of the Supervisory Board of Deutsche Bank AG; Hans-Joachim Watzke, CEO of Borussia Dortmund; and Richard Lutz, Deutsche Bahn CEO (f.l.t.r.)\nThe new Heritage Collections Center will be built over the next three years, right at the heart of Yad Vashem in Jerusalem. It will create space for several hundred thousand artefacts donated by Holocaust survivors and their families: letters sent from people living in Jewish ghettos, drawings from inmates of Germany’s concentration camps during the Nazi regime or everyday items such as shoes, cups and photographs. All of them tell the stories of 6 million Jews and their families who were murdered by the Nazis.\n“Reconciliation and a close bond with the Israeli people are very important to us at Deutsche Bank. The special relationship between Israel and Germany needs to be constantly nurtured – and we want to make our contribution to this,” Paul Achleitner said during the ceremony, which was also attended by Holocaust survivors, Israeli politicians and the German and Austrian ambassadors to Israel.\nHowever, intolerance and exclusion are not things of the past. Achleitner reminded everyone that “especially at this time it is important to remember where social and religious intolerance and exclusion can lead. We therefore also regard our commitment as sending a signal against antisemitism, racism and intolerance of any kind. Intolerance should never, ever be tolerated.” He added that Deutsche Bank’s employees come from 143 nations, and “social and religious tolerance are key elements of our values and beliefs”.\nThorsten Strauss, Global Head of Art, Culture & Sports, highlighted the historic significance of the donation: it is the first time that Yad Vashem has ever accepted such a large donation from German companies. “Our commitment to Yad Vashem is, at the same time, a commitment to remembering the past and is aimed at helping Israel and Europe to continue growing together”, Strauss said.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}