{
    "url": "https://www.db.com/news/detail/20190501-the-pope-of-the-euro-cheque-was-one-of-us?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 1, 2019",
    "tags": [
        "Company",
        "History"
    ],
    "title": "The \"pope\" of the euro cheque was one of us",
    "body": "It is commonly thought that Germans prefer to pay with cash, but actually, that’s apparently no longer the case. Germany’s central bank – the Deutsche Bundesbank – did a survey and found out that for the first time less than 50 percent of transactions are paid for with cash. And the German digital association Bitkom estimates that nowadays 44 percent of Germans can imagine life without cash.\nThat’s where innovations like Apple Pay come in: mobile and contactless, this new payment method is a real time-saver for bank clients; it reduces queues at ATMs and it saves iPhone users from having to rummage around for coins or notes. All they need to do now is hold their device up at the payment terminal and hey presto, payment complete! According to the card company “Euro Kartensysteme”, German businesses have already converted more than 820,000 card devices to accept Apple Pay.\nAnother innovation which Deutsche Bank helped to promote took a bit longer to establish itself: the euro cheque. In May 1969 the euro cheque system was launched in 15 countries – the first ever common European form of payment. For some time, cheques were not widely accepted in Germany, mainly due to the fact that beneficiaries in Germany were not offered much in the way of protection against cheque scams. Unlike in the US, it was not considered a crime to write a cheque that later bounced due to lack of funds. The BfG Bank (now owned by SEB) tried to dispel people’s mistrust of cheques in 1960. It proposed issuing cheques with a built-in cash-in guarantee but the Bundesbank was against the idea. It was concerned that printing a guarantee on a cheque would effectively turn it into an additional currency.\nDeutsche Bank was a driving force behind the euro cheque clearing system; in particular member of the Management Board Eckart van Hooven, who was ultimately responsible for the success of the euro cheque card. The euro cheque card did not have any effect on the bank’s printed cheques, though. From 1968 the bank’s clients were issued with a personal cheque card, the reverse of which had a guarantee amount printed on it, first for 200 German marks and from 1972 for 300 and later 400, which they presented when cashing in the cheque. With your average cheque book containing 20 cheques, this basically meant that the bank was offering a high four-digit non-secured loan to its clients – something that took the bank-client relationship to a new level in terms of “trust”.\nEckart van Hooven (1925 to 2010) with the last euro cheque in 2001. Back in the 1970s, the Management Board member became known as the “Pope of the euro cheque”\nEckart van Hooven was also committed to quickly making cheque payments standard across the whole of Europe. And he was successful: it wasn’t long before the euro cheque card came into use beyond Germany’s borders. The preparations for launching the euro cheque began back in May 1968 after a conference attended by bank representatives from 15 countries. Their aim was to take their countries’ hitherto isolated national payment systems and unify them. Long discussions ensued and they ultimately agreed on a combination of the cheque and a cheque card.\nThree years later, the euro cheque and the euro cheque card had a standard design across Europe. The new product with the characteristic “ec” symbol quickly became an essential form of payment. In the 1990s, people were using printed paper cheques less and less. In 2001, they were abolished. The euro cheque or “ec” card was then given a new meaning: “ec” now stood for “electronic cash” – a more apt term for the euro cheque idea in the new millennium. In 2007, the ec card was renamed “giro card” and the ec logo was replaced.",
    "number_of_ratings": 2,
    "rating": 3.5,
    "likes": 0
}