{
    "url": "https://www.db.com/news/detail/20211121-christian-sewing-message-to-staff-on-new-chairman-and-chief-risk-officer?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 21, 2021",
    "tags": [
        "Company"
    ],
    "title": "Christian Sewing: Message to staff on new Chairman and Chief Risk Officer",
    "body": "Dear Colleagues,\nToday our Supervisory Board has made two important decisions on personnel that I would like to share with you.\nFirstly, regarding the new Chair of our Supervisory Board, the Nomination Committee under Mayree Clark decided to put forward Alex Wynaendts. The Supervisory Board followed this recommendation and intends to propose to shareholders at the Annual General Meeting on 19 May 2022 that Alex be elected to the Supervisory Board. Following this, the members of the Supervisory Board intend to elect him as Chairman.\nI look forward to working with Alex. He is a true European and an expert on the international financial scene. From 2008 to 2020, he was Chief Executive Officer of Aegon, a leading European life insurer and asset manager. He began his career at ABN AMRO, where he worked for 13 years in private banking and investment banking in both Amsterdam and London. He has been a member of Citigroup's board and serves on the boards of Uber and Air France-KLM. Alex has experience in the fields that always made Deutsche Bank stand out: strong expertise in retail, corporate and capital markets business as well as in asset management – and a global network.\nAlex’s arrival will mark the end of an era. Paul Achleitner had made an early decision not to run for the Supervisory Board again after 10 years in office. There will be many more opportunities to thank him. But one thing I want to say right now. He was and is the kind of Chairman of the Supervisory Board that one can only wish for as CEO: an excellent counsellor, a strong coach, a true confidant. His leadership has played a major role in enabling the successful transformation of our bank.\nI am also very grateful for the way in which Mayree Clark and the Nomination Committee have handled this process in a structured and professional manner.\nThis also applies to the second change, which also marks the end of an era. As he announced earlier this year, Stuart Lewis will leave our bank at the next Annual General Meeting after more than 25 years at Deutsche Bank – a decade of which on the Management Board. The Supervisory Board has now selected Olivier Vigneron as his successor. He is currently Chief Risk Officer at the French bank Natixis and previously spent 12 years at J.P. Morgan, most recently as Chief Risk Officer for Europe, the Middle East and Africa (EMEA) as well as risk executive for market risk worldwide. Not only does he have extensive experience and expertise, but he also knows Deutsche Bank, having worked in our structured credit business from 2002 to 2005.\nStuart is one of the world's most highly respected risk managers in our industry. He hands over a risk department that safely and expertly guided us this last decade through market turbulences and the pandemic. Olivier can build on a solid risk culture and the outstanding team, which is one of the leading players in the industry, as our bank’s Risk Manager of the Year 2020 award has shown. Our risk management has a great tradition and has always been at the heart of our bank - and will remain so under Olivier’s management.\nI am pleased that the Supervisory Board has now addressed the open questions in the Bank’s leadership team. This clarity gives us further impetus on the path towards achieving our goals and becoming sustainably profitable.\nBest wishes,\nChristian Sewing",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 7
}