{
    "url": "https://www.db.com/news/detail/20211118-never-again-be-silent-a-holocaust-survivor-shares-his-story?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 18, 2021",
    "tags": [
        "History"
    ],
    "title": "A Holocaust survivor shares his story",
    "body": "“My name is Abe Foxman, I was born in the wrong time at the wrong place for a Jewish kid,” said Foxman, describing his childhood in Nazi occupied Poland in 1940. \nAbraham Foxman, former National Director of the Anti-Defamation League (ADL), spoke about his childhood Holocaust survival story during a recent discussion with Joe Salama, Deutsche Bank’s Global Head of Anti-Financial Crime (AFC) and Adina Burian, Co-Chair of the Board of the American Society for Yad Vashem (ASYV).\nDuring that time, Foxman’s parents made the heart-wrenching choice of giving him up to his Polish Catholic nanny who baptised and raised him as a Catholic during the war years. “I managed by the intercession of one special person’s kindness, courage, compassion, decency and likely several miracles to survive,” said Foxman. Thankfully he and his parents survived the war, and he was reunited with them four years later after the fall of the Nazi regime.\nSadly, 14 members of his family did not survive.\nTo this day, Foxman has many unanswered questions such as, “Why did the Holocaust happen to the Jewish people? Why did over 1.5 million Jewish children perish? Why was the world silent?” – and, “Why me? Why me and not them?” – questions that have only served to strengthen his resolve and commitment to ensuring a better future for all.\nPresented by Deutsche Bank’s NextGen Network, the generationally themed Employee Resource Group (ERG) in the Americas, this special event was a collaboration with ASYV and focused on history, the Holocaust and the importance of sharing knowledge and experience across generations to keeping the past alive so that it is never repeated.",
    "number_of_ratings": 4,
    "rating": 3.8,
    "likes": 7
}