{
    "url": "https://www.db.com/news/detail/20211110-our-global-mental-health-campaign-makes-sure-123-000-children-and-young-people-are-notalone?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 17, 2021",
    "tags": [
        "Corporate Citizenship",
        "Education"
    ],
    "title": "Our global mental health campaign makes sure 123,000 children and young people are #NotAlone",
    "body": "Launched in June 2021 our global #NotAlone campaign has been a huge success. It has provided over one million euros for strategic projects that help 41 youth mental health charities in more than 30 countries to provide advice, counselling and access to support networks and leisure activities for more than 123,000 children and young people.\n\n#NotAlone addressed a pressing societal issue: Disruptions to education and training caused by the Covid-19 pandemic have had profound impacts on young people’s learning, social development and self-confidence, resulting in increased isolation, anxiety and depression. Empowering the next generation to reach their full potential is one of the core commitments of Deutsche Bank’s corporate social responsibility strategy and it’s Born to Be youth engagement programme.\n\n\n\nAnd as lockdown has been hard on everyone, the #NotAlone steps challenge had the added benefit of encouraging our employees to look after their own health and wellbeing, too. Almost 13,000 of our employees took part, collecting more than 1.6 billion steps, earning extra funding for our charitable partners as specific targets were met and sending an important message to young people: “You are not alone.”\n\n“Our #NotAlone campaign has brought together our people, all over the world, to help get the next generation through this. Thank you to every employee and our charity partners for their commitment. Together we can make a #PositiveImpact for young people and support their health and a healthy society”, says Lareena Hilton, Global Head of Brand Communications & Corporate Social Responsibility at Deutsche Bank.\n\nWatch the film to learn more about the positive impact of our #NotAlone campaign!\n\nPlay\nVideo\n\n\nPlease find below an overview of our #NotAlone partner charities:\n\nTo find out more about Deutsche Bank’s corporate social responsibility programmes, please visit our CSR homepage.",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 43
}