{
    "url": "https://www.db.com/news/detail/20230825-raising-renminbi-panda-or-dim-sum?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "August 25, 2023",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Raising renminbi - panda or dim sum?",
    "body": "Named after China’s national symbol, panda bonds are debt instruments that offer global companies, governments and international institutions the opportunity to raise funds in China, while also benefitting from cheaper funding costs as a result of China’s low interest rates. The bonds also offer issuers a way to fund business in the world’s second-largest economy and are a key part of Chinese authorities’ push to internationalise the renminbi (RMB) currency.\nIssuance of panda bonds in the first half of 2023 reached a record high of 72 billion renminbi (10 billion US dollars), an increase of more than 33 percent over the same period last year and Deutsche Bank has become a leading arranger as more and more foreign companies look to issue them in China’s onshore market.\nThis year, Deutsche Bank issued its own panda bond, raising 1 billion renminbi (around 143million US dollars*) and enabling the bank to directly tap into China’s onshore bond market and to access a new investor base at attractive funding levels.\nDeutsche Bank’s Head of China Onshore Debt Capital Markets, Samuel Fischer, and Head of China Offshore Debt Capital Markets, Ben Wang, discuss the panda bond market and its offshore counterpart, the dim sum bond market. \nWhat is driving the surge in the panda bond market, especially from the issuer’s perspective?\nSamuel Fischer: There are three main drivers for the robust growth of panda bonds. \nFirstly, the divergence in China’s monetary policies from other major economies offers issuers access to lower funding costs in renminbi, especially in the second quarter when issuance surged amid a drop in China domestic bond yields. China continues to keep its interest rates low.\nSecondly, at the end of last year, the People's Bank of China and the State Administration of Foreign Exchange issued new funding rules to further help the financing of foreign companies through panda bonds, allowing the issuers either to keep funds raised in China or repatriate them overseas. \nLastly, some issuers postponed their debt issuance plans in the fourth quarter of 2022 to this year, as the market rebounds. The release of pent-up demand is another strong driver for the panda bond market.\nHow can Deutsche Bank clients benefit?\nSamuel Fischer: The cost of renminbi funding continues to remain low. \nOur clients who already have large footprints in China need renminbi liabilities to allocate to their renminbi assets in China and to further develop their domestic business. \nSamuel Fischer\nPanda bond issuers can also do FX swaps after raising capital through the domestic bond market and exchange renminbi into other currencies for overseas business development or repayment of foreign currency liabilities. The gap in interest rates can help them make cost savings of around 20 to 100 basis points. \nHow about dim sum bonds? Have you seen any shifts in offshore renminbi investment? \nBen Wang:  There have been quite a few positive changes in the offshore renminbi bond market this year. We have seen an increasingly diverse level of issuers and investors in dim sum bonds this year. Chinese financial institutions and southbound funds within China used to be the dominant players but sovereign and non-financial institution corporate issuers are gaining ground – especially Hong Kong based conglomerates. And investments are increasingly coming from the Middle East, Africa, and Europe. \nBesides, the issuances have expanded to include those with longer dated tranches up to 10 years, which have seen strong investor demand.    \nLeveraging Deutsche Bank’s connectivity and cooperation between the offshore and onshore markets, we have completed several landmark deals for issuers, helping them to benefit from the different advantages the two markets offer.\nBen Wang\nCan you give some examples of how Deutsche Bank supports clients?\nBen Wang:  First, we help clients capitalise on the cost advantage of renminbi financing and repackage parts of the debts through the issuance of panda bonds and dim sum bonds, along with interest rate and FX swap solutions. Take the panda bond issuance of NWS Holdings for example: the company had previously relied on the offshore capital market as its main source of financing; through its first panda bond in the China Interbank Bond Market this year, NWS Holdings has significantly lowered the overall cost of refinancing offshore debts.\nAnd this is not the only example. In fact, the total issuance volume of offshore renminbi bond issuance (including dim sum bonds and free trade zone bonds) this year has also increased significantly over the same period last year. In the first half of this year, the issuance volume of renminbi-denominated bonds has exceeded 21.3 billion renminbi (2.9 billion US dollars) – that’s about 8.6 times the volume in the same period last year.\nSecondly, we continue to help clients navigate the offshore bond markets and tap into the global institutional investor base despite a challenging market backdrop, helping companies with large foreign operations and hard currency financing needs to issue foreign currency bonds. Take, for example, the recent 200 million US dollar exchange offer and concurrent new bond issuance of Health & Happiness that Deutsche Bank led. It reopened the Greater China high-yield market after an absence from the issuer class since the first quarter of this year. Despite a higher interest rate than the company’s onshore renminbi financing, the issuance has successfully attracted wide institutional investor support globally, including new investors from banks and family offices in the Middle East, further expanding the company’s global funding channels. \nHow does this help the internalisation of the renminbi?\nSamuel Fischer: The subsequent demands for renminbi bond refinancing will be further boosted as more and more global companies choose to issue renminbi-denominated bonds. A wider use of renminbi as a financing currency will boost overall adoption and internationalisation of the renminbi.\nWhat are your thoughts on the outlook for the panda and dim sum bond markets?\nSamuel Fischer: Looking back at the history of panda bonds over the past decade, the market reached a peak in issuance back in 2016, raising nearly 130 billion renminbi (23.3 billion US dollars) for the full year. In 2023, the types of issuers are becoming more diversified and the market more sustainable. Regardless of relative trajectories in policy rates, I am confident that the momentum will remain strong throughout this year as the market is well-established with solid growth drivers.\nBen Wang: I am optimistic that there will be more institutions taking part in the dim sum bond market, along with a well-diversified selection of bond tenures as the renminbi expands its global uses. There have been some sector-specific concerns of late, but on the other hand, a wider use of renminbi trade settlements, increasing holdings of renminbi by foreign investors as well as a larger base of market makers are all strong positive drivers of change.\n*Note:  Various US dollars figures in this article are converted based on time of the transactions.",
    "number_of_ratings": 6,
    "rating": 5.0,
    "likes": 15
}