{
    "url": "https://www.db.com/news/detail/20210129-deutsche-bank-arranges-thailand-s-first-onshore-hedge-under-new-nrqc-rules?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "January 29, 2021",
    "tags": [
        "Capital markets",
        "Private products"
    ],
    "title": "Deutsche Bank arranges Thailand’s first onshore hedge under new NRQC rules",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) Thailand this week arranged the market’s first onshore hedge for a foreign corporate under the Bank of Thailand’s (BOT) new Non-Resident Qualified Company rules.\nDeutsche Bank acted fast and arranged the market’s first transaction for a corporate client just three weeks after the BOT published new rules for Non-Resident Qualified Companies (NRQC) on January 5, 2021.\nThe new rules allow non-resident companies to access the onshore Thai Baht (THB) liquidity, without providing underlying documents for each transaction.\nDeutsche Bank Head of Global Markets, Thailand, Teerada Tuppun said: “We are pleased to be the first bank in Thailand to arrange the market’s first non-resident onshore THB hedge. The solution provides our corporate clients access to more affordable and flexible THB hedging under the new NRQC rules.\nForeign corporates can save on hedging costs by accessing the onshore foreign exchange curve, because the onshore rates are generally cheaper than offshore hedging rates.\n“We expect the new NRQC rules to attract many more non-resident companies to hedge onshore, creating an entirely new market for our THB onshore franchise,” Tuppun added.\nWith Thai Baht appreciating 10% from its peak in 2020, the cross currency rates and hedging costs became more volatile for foreign companies having THB exposure, at a time when companies are tightly managing costs for the Covid economic recovery.\nThe NRQC Scheme allows corporates with trade and direct investment in Thailand to access onshore THB liquidity with a greater flexibility, easily switching their hedge from the offshore curve to onshore curve, or vice versa without making any changes to their current hedge workflow.\nQualified non-Thai companies can register for NRQC status through Deutsche Bank AG, Bangkok Branch.\nFor further information please contact:\nDeutsche Bank AG Media Relations                                           \nSarah Stabler\nEmail: sarah.stabler@db.com\nPhone: +65 9116 9970\nAbout Deutsche Bank\nDeutsche Bank provides retail and private banking, corporate and transaction banking, lending, asset and wealth management products and services as well as focused investment banking to private individuals, small and medium-sized companies, corporations, governments and institutional investors. Deutsche Bank is the leading bank in Germany with strong European roots and a global network.\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement. Such factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission. Such factors are described in detail in our SEC Form 20-F of 20 March 2020 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}