{
    "url": "https://www.db.com/news/detail/20210128-charity-challenge-plusmysteps-racks-up-1-3-billion-steps?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 28, 2021",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "Charity challenge: PlusMySteps racks up 1.3 billion steps",
    "body": "Launched in summer 2020, the PlusMySteps Challenge took our bank by storm. Designed to encourage Deutsche Bank employees to boost physical and mental wellbeing while supporting the bank’s local charities and communities that are struggling to cope with the impact of the Covid-19 pandemic, those who took part walked a whopping 1.3 billion steps! Converted into cash, this means our employees’ efforts helped raise 220,000 euros for more than 20 charities – an incredible achievement by 8,085 employees in 15 different countries.\nWhile Germany took the most steps (over 584 million), India joined in with the most colleagues (2,969) and Vietnam’s participants kept up with the challenge for the longest time of 49 days.\n“Giving has never been so easy and healthy”, says Alexander von zur Mühlen, CEO APAC, where the challenge kicked off. In the heat of summer, in the middle of typhoon season, 5,548 participants in 12 markets walked 21 times around the globe. “It was beyond my imagination that I could average 78,000 steps daily. We don’t fully understand our limits until we attempt to stretch beyond our limitations”, says Cristen Kuwe from Singapore.\nIn the UK, colleagues joined together to form teams, with Rada Juric saying the challenge was “a fantastic way to feel connected with colleagues while we work from home, it also helped me make the most of the summer days.” Along the way, the teams managed to raise 7,400 pounds for the local Charity of the Year, Hospice UK.\nIn Germany, over 2,300 employees raised 20,000 euros for the charity Lebenshilfe e.V. that has been helping people with disabilities and promoting integration in Germany since 1960. “The employees of Deutsche Bank have set an example for tolerance, inclusion and an equal partnership between people with and without disabilities. We thank you very much”, says Jeanne Nicklas-Faust, CEO of Lebenshilfe e.V..\n“Despite the challenges the pandemic brought and with most employees working from home, we still came together for the community through volunteering and giving in 2020”, says Lareena Hilton, Global Head of Brand Communications and Corporate Social Responsibility at Deutsche Bank, “Your every step meant much needed funds for our communities. Thank to all colleagues who have taken part with such great enthusiasm, making a #PositiveImpact in a year like no other. We will be back in 2021 with a global PlusMySteps Challenge and hope many colleagues will be part of it again!”\nPlus You – Deutsche Bank’s volunteering and giving community\nOur Plus You programme provides the opportunity for employees to get involved and give to causes close to their hearts. In 2019, 25 percent of our staff were engaged in volunteer projects and invested some 220,000 hours of their time in social projects.",
    "number_of_ratings": 4,
    "rating": 2.0,
    "likes": 15
}