{
    "url": "https://www.db.com/news/detail/20210126-memorial-service-for-the-victims-of-the-holocaust-five-against-forgetting?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 26, 2021",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Memorial service for the victims of the Holocaust",
    "body": "The five companies Daimler, Deutsche Bahn, Deutsche Bank, Volkswagen and Borussia Dortmund today issued a joint declaration against antisemitism and racism at a virtual memorial service for the victims of the Holocaust. The declaration is based on the universally valid formulation of the International Holocaust Remembrance Alliance (IHRA). The commemoration was organised by the Friends of Yad Vashem.\nWith the declaration, the five companies want to send a strong signal for freedom, democracy, diversity and peaceful coexistence. The President of the Central Council of Jews in Germany, Dr. Josef Schuster, explained how important this signal is for Jewish life in the country: \"Antisemitism can only be fought if it is defined and recognised. That is why the definition of antisemitism is all the more important. We would like to see it applied at all levels, including government agencies.\"\nOn behalf of Deutsche Bank, Supervisory Board Chairman Paul Achleitner attended the commemoration. In conversation with moderator Shelly Kupferberg, he emphasised how important it is to create a corporate culture that values diversity and is characterised by a climate of openness: \"As Deutsche Bank, we therefore also see it as our task to stand up for diversity and tolerance, participation and democracy with our employees, every day anew.\"\nLike Ola Källenius (Daimler), Richard Lutz (Deutsche Bahn), Gunnar Kilian (Volkswagen) and Hans-Joachim Watzke (Borussia Dortmund), Achleitner also emphasised the great responsibility of companies, especially in a crisis such as the current one, not to forget history and its horrors in order not to give hatred, harassment and extremism a breeding ground in the present.\nYou can watch a replay of the commemoration here (available only in German):\nWir benötigen Ihre Zustimmung, um den YouTube Video-Service zu laden!\nWir verwenden einen Service eines Drittanbieters, um Videoinhalte einzubetten. Dieser Service kann Daten zu Ihren Aktivitäten sammeln. Bitte lesen Sie die Details durch und stimmen Sie der Nutzung des Service zu, um dieses Video anzusehen.\nMehr Informationen\nAkzeptieren",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 7
}