{
    "url": "https://www.db.com/news/detail/20210126-how-applicable-are-the-eu-sustainability-requirements-already-for-banks-and-the-like?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 26, 2021",
    "tags": [
        "Sustainability"
    ],
    "title": "How applicable are the EU sustainability requirements already for banks and the like?",
    "body": "How workable are the European Union sustainability directives (EU Taxonomy) already for financial services providers and their products? This is the question addressed by the report unveiled today by the United Nations Environment Programme Finance Initiative (UNEP FI) and the European Banking Federation (EBF). It is a first test report on what is already working, where there are still problems and what recommendations can be derived from it – with the objective of developing a common approach on how the EU Taxonomy can be implemented at financial service providers.\nDeutsche Bank is a major supporter of the project and is also one of 26 banks that tested the EU Taxonomy on their products, transactions and client relationships between March and August.\nBut why are we so heavily involved in this project? Because we expect a unified, common approach among financial services providers to grow and professionalise the market for sustainable transactions and products, which would benefit Deutsche Bank with its ambitious targets for sustainable finance and ESG assets under management. According to our targets, the volume of sustainable financing is to increase to over 200 billion euros in total by the end of 2025; in December 2020, we issued annual growth targets for this and announced that, starting this year, we would link management compensation to them.\nAnd which guidelines or rules are we currently following to achieve our sustainability targets? Since last July, Deutsche Bank has been guided by its Sustainable Finance Framework, which is based on the EU Taxonomy, in determining which criteria are used to classify bond and equity transactions, investment products, and financing as sustainable. This framework provides the basis for the bank to achieve its sustainability targets according to traceable criteria. Although this makes the bank one of the “first banks in Europe to operate a taxonomy linked on a best effort basis to the EU Taxonomy”, full harmonisation with the EU Taxonomy is currently not possible for financial services providers for several reasons. For example, in some cases there is still not enough data available for the complex assessments required to determine whether a project meets the EU requirements.",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 2
}