{
    "url": "https://www.db.com/news/detail/20210126-united-against-antisemitism-and-racism-br-five-german-companies-send-a-strong-signal-ahead-of-international-holocaust-br-remembrance-day?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "January 26, 2021",
    "tags": [
        "Corporate Citizenship",
        "Diversity"
    ],
    "title": "United against antisemitism and racism",
    "body": "Borussia Dortmund, Daimler, Deutsche Bahn, Deutsche Bank and Volkswagen together with the Freundeskreis Yad Vashem e.V. announced a joint declaration against antisemitism and racism during an online commemoration event.\nBorussia Dortmund, Daimler, Deutsche Bahn, Deutsche Bank and Volkswagen, in cooperation with Freundeskreis Yad Vashem e.V., have announced their decision to face up to their historical responsibility by sending a strong signal for freedom, democracy, diversity and peaceful coexistence during a joint online commemoration event.\nOne day before International Holocaust Remembrance Day, the participating companies published a joint declaration against antisemitism and racism together with Freundeskreis Yad Vashem e.V. The declaration is based on the IHRA (International Holocaust Remembrance Alliance) working definition of antisemitism. Participants are united in the hope that during the German presidency of the IHRA until the end of March 2021, other companies and organizations will follow suit.\nIn consideration of the current COVID-19 situation, the commemoration on January 26 will take place as a digital event. Live contributions are expected from the President of the Central Council of Jews in Germany, Dr Josef Schuster, high-ranking representatives of the companies, as well as the current Chair of IHRA, Ambassador Michaela Küchler. Nearly 200 guests from across civil society and government, including employees of the participating companies, have been invited.\nTaking a stand together against antisemitism and racism:\nWe are committed to taking a stand against antisemitism and against forgetting. We will promote a culture of remembrance of the crimes against humanity committed by Germans against Jews and other persecuted groups during National Socialism. Therefore, we have adopted the IHRA's common working definition of antisemitism.\nWe will raise our voice against antisemitism and racism. Our employees at all levels of our organisations are encouraged to stand up resolutely for tolerance and openness, and to limit any opportunity for right-wing extremist and misanthropic ideas to develop.\nWe will foster integration. This begins with the non-discriminatory recruitment of positions and includes opportunities for the integration of foreign employees. In our training, we teach respect for one another and the added value of diversity. Through our broad commitment, we promote the social and economic development of Germany.\nWe will play an active role in shaping a society based on equal opportunity and strengthen social cohesion with a range of initiatives to prevent those with antisemitic and racist views from gaining a foothold.\nWe bear responsibility:\nWe five companies came together through a donation initiative for the international Holocaust memorial Yad Vashem in April 2019. We look with great concern at the increase in antisemitism and racism. The murders in Hanau, the attack on the synagogue in Halle or the assassination of German politician Walter Lübcke are just a few examples of this fatal development.\nAs advocates of an open society, we companies must and want to speak out clearly. After all, a basic democratic order and its inherent values are among the fundamental principles of our society, in which people can live in peace and freedom. The values of an enlightened society include tolerance and respect for human dignity.\nHans-Joachim Watzke, Borussia Dortmund: \"Together we are standing up against the increasing brutalization in our society, against right-wing populism and right-wing extremism, antisemitism and racism. We will not tolerate this on the soccer pitch or in our society. Only if we learn together from our past can we shape our present and future positively. To this end, we will continue to make our contribution.\"\nRichard Lutz, Deutsche Bahn: \"As Deutsche Bahn, we bring people together, overcome distances and make a contribution to European integration. We are acutely aware of our historical responsibility and are resolutely committed to a society and a future without hate and extremism. With this joint declaration we express our solidarity with those confronted with antisemitism and we clearly commit to a Germany that is open to the world, tolerant and diverse, free of antisemitism and racism.\"\nOla Källenius, Daimler: \"Antisemitism and racism have no place in our society. It is our responsibility and duty, as individuals and as a company, to take a clear stand against hatred and incitement. We at Daimler oppose those who want to divide our open, tolerant society and who discriminate against people on the basis of their faith, gender, skin color, origin or sexual orientation. We remain absolutely and resolutely committed to diversity.”\nPaul Achleitner, Deutsche Bank: \"Crises often awaken the best in people, but sometimes also the worst. It is up to us to keep history and its lessons alive. As Deutsche Bank, we therefore see it as our duty to stand up for diversity and tolerance, participation and democracy with our employees every day anew.\"\nGunnar Kilian, Volkswagen: \"A global outlook internally and externally is the raw material without which we companies cannot be successful. Diversity in our workforce and in our environment enriches us each and every day. Racism, exclusion, hatred and incitement must not be allowed to poison our behavior and our corporate culture. Volkswagen has a long-standing educational programme for its trainees which takes place at Auschwitz. 76 years after the liberation of Auschwitz, we must not allow antisemitism, populist hatred and right-wing extremist ideology a voice either in our society or in the world.\"\nKai Diekmann, Freundeskreis Yad Vashem e.V.: \"Corporate commitment in the fight against antisemitism and extremism is more important than ever before. That is why we are particularly pleased that BVB, Daimler, Deutsche Bahn, Deutsche Bank and Volkswagen have adopted the IHRA's definition of antisemitism and are taking a visible joint stance in the fight against antisemitism and all forms of discrimination. This is an important and clear sign both for Germany and the whole world.\"\nA short film with statements by employees of the five companies will be available from January 26 at midday on the website of Freundeskreis Yad Vashem e.V. (www.yad-vashem.de). The commemoration event will be recorded and available shortly afterwards for viewing also on www.yad-vashem.de.",
    "number_of_ratings": 4,
    "rating": 1.0,
    "likes": 130
}