{
    "url": "https://www.db.com/news/detail/20210125-new-report-from-deutsche-bank-research-carbon-pricing-and-the-green-transition?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 25, 2021",
    "tags": [
        "Sustainability"
    ],
    "title": "New report from Deutsche Bank Research – “Carbon pricing and the green transition”",
    "body": "James Brand, Utilities EU Analyst, Deutsche Bank Research, has been covering utilities at Deutsche Bank for 16 years, with lead analyst coverage on around half of the pan-European sector. In a new report “Carbon Pricing and the green transition” Brand takes a look at what the 2020s have in store in terms of industrial decarbonisation, emissions trading and renewable energy. Here is a brief look at just a few of the topics the report explores:\nWhy will carbon trading and greener power come to the fore this year?\nWe are approaching a crunch point. A flurry of key policy reviews are due in the first half of the year and we expect decisions on the framework for industrial decarbonisation. Indeed, while decarbonisation of the power sector continues apace, the EU and UK’s tough emission reduction targets will require broader cuts. For utilities, this means carbon pricing could be key.\n\nHow is EU and UK policy on greener power evolving?\nWith more ambitious 2030 targets, national objectives may have changed from insulating industry to also driving industrial decarbonisation. Designing an incentive regime which funds this while maintaining the international competitiveness of European industry is likely to prove a key political focus of 2021. Strengthened emission trading programmes with higher carbon prices should aid this process. As such, the review of the EU Emissions Trading Scheme (ETS) and the launch of a UK ETS could be the most important single cross-sector events of the year.\n\nWill political incentives allow carbon trading to play a bigger role?\nEmissions trading does not necessarily need to play a central role. Indeed, it has often been something of a sideshow in driving key aspects of power sector greening. However, we believe that the political incentives may be shifting, with advantages to allowing a mix of higher carbon prices and free allocations to fund industrial emission cuts. We believe that the ETS review may lead to higher carbon prices, although we may also see changing views around the long-term outlook for power prices.\n\nCould higher carbon prices help offset the impact of falling carbon intensity?\nSentiment has become bearish towards power prices in the past year. Some investors we have spoken to are concerned that falling carbon intensity could lead to progressive downward pressure on power prices. Meanwhile, increasing renewable penetration is seen as another risk to power prices. However, if carbon prices do rise following the ETS review, this may offset some impact from falling carbon intensity in the 2020s and 2030s, with scope for a further jump in carbon prices to lift near-term generation margins.\n\nHow do renewable and hydrogen economics figure in the picture?\nWe believe the safest path to value creation for a renewable project is to secure a government power purchase agreement, or PPA. However, some renewable projects look attractive on a merchant basis, particularly if carbon prices rise. For hydrogen, high carbon prices seem key if policymakers want to use a market mechanism to equalise the cost to natural gas. Our analysis suggests 150 euros per tonne might be needed.\n\nHow do you view the near-term outlook for integrated utilities?\nIt remains unclear how interventionist the EU and UK approaches will be but we believe the ETS review will lead to higher carbon prices. And, while carbon prices have started to rise in anticipation of the upcoming reforms, we believe there is still upside potential to these. We also see scope for easing concern around the impact from ongoing renewable additions, if a positive outcome from the ETS review is secured.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}