{
    "url": "https://www.db.com/news/detail/20210125-emergency-aid-to-somalia-deutsche-bank-helps-raise-around-65-000-euros?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "January 25, 2021",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Emergency aid to Somalia: Deutsche Bank helps raise around 65,000 euros",
    "body": "Massive locust swarms have been causing crop failures and food insecurity in Somalia since 2019. In July 2020, Deutsche Bank, Deutsche Bank Stiftung and Deutsche Bank Afrika Stiftung joined forces to mount a fundraising campaign to support the German Red Cross (DRK) with relief initiatives in Somalia. Around 65,000 euros have been raised thanks to donations from Deutsche Bank Stiftung, Deutsche Bank Afrika Stiftung, Deutsche Bank, its employees and a number of other donors.\nThe German Red Cross is using the donations for cash aid, which will enable people in the affected region to meet their basic food needs with dignity and self-reliance, above all. In Somalia, a family of six needs 75 euros a month for food. “2020 was an intense year for the German Red Cross and the Somali Red Crescent. No less than three relief projects – in light of the locust plague, the outbreak of Covid-19 and regional floods – were launched in addition to regular project work in the country”, explains Alexandra Vlantos, Head of Africa Unit at the German Red Cross. ”We would like to thank Deutsche Bank, its foundations and all donors for their support.”\nThe locust swarms are the largest in Somalia in 25 years. The country declared a national emergency back in February 2020. In December, the United Nations Food and Agriculture Organization (FAO) warned of a second wave of the locust plague across the entire region. If crops fail again, food prices are at risk of rising further, feed for the herds will be scarce and it threatens to trigger increased political conflict.\nThe German Red Cross has been involved with the Somali Red Crescent in Somalia, one of the poorest countries in the world, for 27 years.\n“Deutsche Bank, its foundations, employees, and clients also have a long tradition of supporting people impacted by natural disasters around the world – through direct aid, fundraising, and long-term reconstruction measures“, says Lareena Hilton, Global Head of Brand Communications and Corporate Social Responsibility at Deutsche Bank. “Thanks a lot to all donors who made a positive impact to support people and families affected by the locust plague.“\nAbout Deutsche Bank\nDeutsche Bank provides retail and private banking, corporate and transaction banking, lending, asset and wealth management products and services as well as focused investment banking to private individuals, small and medium-sized companies, corporations, governments and institutional investors. Deutsche Bank is the leading bank in Germany with strong European roots and a global network.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 8
}