{
    "url": "https://www.db.com/news/detail/20210124-bonds-bonanza-in-asia-pacific?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "Singapore, January 24, 2021",
    "tags": [
        "Asia-Pacific",
        "Capital markets"
    ],
    "title": "Bonds bonanza in Asia Pacific",
    "body": "The New Year saw unprecedented activity in Asian debt capital markets with record levels of Asian currency bond issuance from regional governments and companies, as they tried to leverage low interest rates to help raise funds for recovery as well as growth to new markets. This included the Republic of Indonesia’s 3 billion US dollar/ 1 billion euro 4-tranche sovereign issuance.\n The combination of investors keen to put money to work, coupled with clients looking to extend debt maturities and capture the first available funding window, led to the landmark volume of issuance according to Deutsche Bank’s APAC head of Capital Markets, Haitham Ghattas.\n“What’s driving the volume is that rates are creating a very opportunistic market for issuers locking in very good long-term funding,” Deutsche Bank's APAC Head of debt syndicate & North Asia Debt\nAs issuers look to refinance their existing debt at longer maturities, Tsui sees a strong demand from investors who have a strong appetite for longer-dated debt. Reuters reported that Asia’s corporate credits were a popular trade recommendation for 2021 from, as they were paying better than comparably risky debt in Europe and the United States. \nA combination of factors including the vaccine rollout, fiscal stimulus and the US election outcome paved the way for institutional investors to reallocate capital to Asia, and tap the differential between the region’s strengthening currencies and the US dollar’s structural weakening. “Added to that, Asia bond yields are relatively attractive against a lacklustre rates outlook and tight credit spreads in the US,” said Vishal Goenka, Deutsche Bank’s ICG APAC head of credit sales.\nDeutsche Bank’s APAC Capital Markets team successfully raised over USD 12bn for clients across the region in the first week of January, including leading 14 separate high yield offerings. ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}