{
    "url": "https://www.db.com/news/detail/20210114-gerald-podobnik-how-europe-can-become-climate-neutral?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 14, 2021",
    "tags": [
        "Sustainability"
    ],
    "title": "Gerald Podobnik: How Europe can become climate neutral",
    "body": "The European Commission is due to launch its Renewed Sustainable Finance Strategy in March. This will see the Commission introduce specific proposals for new regulation and also incentivise public-private initiatives. The new strategy will shape EU policy in this area until 2024. In the interview Gerald Podobnik, Chief Financial Officer of the Corporate Bank, talks about the European Union's Green Deal and the contribution that Deutsche Bank can make to its success.\nThe European Commission unveiled its Green Deal in December 2019. What do you think of it?\nFirst, I was delighted that the Commission devoted so much attention to this important topic. It’s very high on the list of priorities. The objectives of the Deal are very ambitious, but necessary. Becoming the first climate-neutral continent by 2050 is not a simple project that can be implemented as a matter of course. Climate developments make it very clear to us that we have to act. It's in our hands to ensure that generations after ours can also live on this blue planet.\nSo what needs to be done for Europe to become climate neutral?\nThe coronavirus pandemic must not be allowed to divert attention away from the Green Deal permanently. It is clear that for now the European Commission has to ensure that the pandemic relief programmes are effective and that the economy gets kick-started again. But the Green Deal also has to be implemented, and at a faster rate in my opinion. The coronavirus relief programmes should support the Green Deal and not undermine it.\nThe EU’s emissions targets are clear and companies know what they have to do: reduce every type of emission. But that then triggers the following questions: within which framework must this take place and what are the timescales? In addition, every sector has to be looked at and assessed individually.\nAnd as if that wasn’t difficult enough already: over the next few years other objectives will be added, such as biodiversity or social standards.\nWe also have to ensure that companies have sufficient capital to effect all these changes. This also means that if banks no longer do business with certain sectors or companies then they will find it more difficult to change. That is not good for our economy. One good example is our involvement in the financing of raw materials, an activity that some banks are currently exiting.\nMany of the products are important for a sustainable future, the time period required to build capacity is long, however, and the transformation has to be financed. One good example is the use of fossil fuels. Renewable energies are the future, but they are not easily available all around the world. It is better to finance a modern gas-fired power station to replace a coal-fired plant for a transitional period than to leave the old situation unchanged.\nThat sounds like a lot of work for companies.\nDevising the framework for cutting emissions – with all its nuances – will be highly complex and heavy on detail. And there’ll be some bumps on the road. But the outcome is the most important thing. The firms involved have to know what they need to do to hit the target. In my opinion we need programmes that support the restructuring of the economy by incentivising more sustainable practices.\nFirms have to make long-term investments to reduce emissions and become more sustainable. To do this they need the right foundations. And beyond sustainability this also serves renewal: innovations create new “green” jobs and a more resilient economy. I am convinced of this.\nBanking regulators are sceptical about this: they say these incentives to promote sustainability are not absolutely necessary and could generate a green bubble. What form should these incentives take in your opinion?\nWe are very aware that there are reservations about incentives. Our recommendation to the Commission is that it specify targeted incentives for projects for which there are already relevant definitions and promotion factors. Here are three examples:\n1: Green real estate loans and commercial real estate projects that boost their energy efficiency.\n2: Investments in infrastructure that generate gains in sustainability should be covered by the infrastructure factor of the Capital Requirements Regulation,\nand 3: Individual, climate-risk based reductions in capital requirements – that is if a climate risk stress test establishes that a bank’s internal risk management allocates an above-average weighting to sustainability risks then it can also receive a discount on its capital requirements.\nWe discuss all these topics with those in the political and economic arenas, for example at a joint event with the State Government of Hesse.\nCould you please explain your first example in greater detail?\nGreater uniformity is required before incentives for “green mortgages” can be specified. At the moment EU states have different criteria according to which a building is issued with an energy certificate. The system used in the UK could serve as a model. There the government provides a central database of energy certificate information. This makes it easier to compare the energy efficiency and thus the sustainability of the entire building stock.\nFor Europe to become climate neutral this will require residential and commercial properties to become more energy efficient, and incentivising the corresponding financing will help towards achieving this objective. In Germany, for example, two-thirds of residential properties were built before 1980. This means there is great potential to promote energy efficiency with the right product for the borrower. The solution is thus clear: favourable conditions for mortgage financing and a specific loan for renovations.\nThe side-effect of such a loan that is subsidised or guaranteed by the EU is that it would reduce risk for banks, making it an attractive product in their portfolios. Whether as an individual or a company: everyone can make their contribution.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 12
}