{
    "url": "https://www.db.com/news/detail/20150330-deutsche-bank-and-the-berliner-philharmoniker-extend-partnership-until-2020?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 30, 2015",
    "tags": [
        "Company",
        "Corporate Citizenship",
        "Culture"
    ],
    "title": "Deutsche Bank and the Berliner Philharmoniker extend partnership until 2020",
    "body": "Deutsche Bank and the Berliner Philharmoniker have extended their cooperation agreement for another five years and will continue their partnership until 2020.\nJürgen Fitschen, Co-Chief Executive Officer of the Management Board of Deutsche Bank: “We are proud to be a partner of the Berliner Philharmoniker for more than a quarter of a century now and thrilled to continue actively supporting this first-rate orchestra in the years ahead. The exclusive and long-standing bond shared by the orchestra and the bank is unique anywhere in the world. The combination of discipline, skill and innovative strength make the Berliner Philharmoniker an ideal partner for Deutsche Bank.”\nMartin Hoffmann, General Manager of the Berliner Philharmoniker Foundation: “The Berliner Philharmoniker are eagerly looking forward to another five years of partnership with Deutsche Bank. Together, we have already achieved so much, including our education programme, the establishment of the Digital Concert Hall and the latest addition, “Vocal Heroes” - the long-term choir programme in various districts in Berlin. Thanks to the generous support of Deutsche Bank, we will be able to continue along this path.”\nSir Simon Rattle, Chief Conductor of the Berliner Philharmoniker and Artistic Director of the Philharmonie Berlin: “Music is not a luxury, but a basic human need. Thanks to Deutsche Bank, we have been able for many years not only to make this claim, but also to help make it a reality. Without the bank’s support, our education programme would not have been possible. We owe our thanks to Deutsche Bank for another five years of support for our ideas!”\nThe extension of the partnership was announced last Friday at the Easter festival at the Festspielhaus Baden-Baden, which was held for the third time. Deutsche Bank has been lending its support to the Berliner Philharmoniker since 1989. Together, the two partners have initiated and implemented a number of visionary projects.\nOne truly unique project in the world of classical music that was made possible by the bank began in 2009 and aims to make music more accessible across national and social boundaries: the Digital Concert Hall. It allows music lovers around the world to view the concerts of the Berliner Philharmoniker at any time over the internet in superb image and sound quality. Since its launch, more than 550,000 users have registered in the Digital Concert Hall.\nThe ability of music to transcend boundaries is also demonstrated by the Berliner Philharmoniker’s education programme, which has introduced more than 37,000 children and young people to classical music since 2002. Whether through dance, by singing or playing an instrument, every child is given the opportunity to go on his or her own journey of musical discovery.\nSince autumn 2013, the “Vocal Heroes” choir project has formed the focus of the education programme. Venues in three districts in Berlin have been created for the purpose of bringing people together to sing and make music. The project is especially designed for children who have not had any exposure to classical music.\nAs a reliable private patron, Deutsche Bank will accompany and support the Berliner Philharmoniker in the years ahead as they go on tour through Germany and abroad, and at the opening concert in Berlin of every new season.\nPictured from left to right: Martin Hoffmann, General Manager of the Berliner Philharmoniker Foundation, Sir Simon Rattle, Chief Conductor of the Berliner Philharmoniker and Artistic Director of the Philharmonie Berlin, and Jürgen Fitschen, Co-CEO and Co-Chairman of the Management Board of Deutsche Bank, at the symbolic partnership extension at this year's Easter Festival in Baden-Baden.\n  For further information please contact:\nDeutsche Bank AG\nMedia Relations\nDr. Klaus Winker\nTel.: +49 69 910-32249\nEmail: klaus.winker@db.com \n\nStiftung Berliner Philharmoniker\nElisabeth Hilsdorf\nTel.: +49 30 254 88 290\nEmail: e.hilsdorf@berliner-philharmoniker.de",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}