{
    "url": "https://www.db.com/news/detail/20150325-deutsche-bank-honors-2015-artist-of-the-year-koki-tanaka-with-first-major-solo-exhibition?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 25, 2015",
    "tags": [
        "Art",
        "Company",
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank honors 2015 \"Artist of the Year\" Koki Tanaka with first major solo exhibition",
    "body": "‟A Vulnerable Narrator,” on view from March 26 until May 25, 2015, will offer a comprehensive overview of Koki Tanaka's work, in which he references the history of ‟art activism” and views his work as a gentle yet sustainable approach to this movement. With video installations, photographs, and drawings the exhibition connects projects, documents, and ideas from almost a decade of artistic activity.\nAfter Wangechi Mutu (2010), Yto Barrada (2011), Roman Ondák (2012), Imran Qureshi (2013), and Victor Man (2014), Koki Tanaka (b.1975 / Tochigi, Japan) is now Deutsche Bank's sixth ‟Artist of the Year.” The award is given on the recommendation of the Deutsche Bank Global Art Advisory Council which consists of the renowned curators Okwui Enwezor, Hou Hanru, Udo Kittelmann, and Victoria Noorthoorn. The award goes to contemporary artists who has created an artistically, as well as socially relevant, oeuvre, one integrating the media of paper and photography – the two main areas of focus of the Deutsche Bank Collection.\nThe exhibition ‟A Vulnerable Narrator” will be shown at MACRO – Museo d'arte contemporanea Roma, as well as in Los Angeles. It is accompanied by an extensive catalogue, and an exclusive edition created by the artist.\nFor further information, please contact:\nDeutsche Bank AG\nPress & Media Relations\nKlaus Winker\nPhone: +49 69 910 32249\nE-mail: klaus.winker@db.com\n\nDeutsche Bank KunstHalle\nSara Bernshausen\nPhone: +49 30 2020 9314\nE-mail: sara.bernshausen@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}