{
    "url": "https://www.db.com/news/detail/20150320-corporate-responsibility-report-2014?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 20, 2015",
    "tags": [
        "Company",
        "Corporate Citizenship",
        "Sustainability"
    ],
    "title": "Corporate Responsibility – Report 2014",
    "body": "Deutsche Bank strengthened its control processes further during the reporting year. Key control functions were bundled and centralized and 700 employees were hired to support the “First line of defense” as part of the “Three Lines of Defense” program. In the risk management system, the bank also takes environmental and social risks into account, which may arise from transactions or client relations. The number of transactions assessed using the bank’s Environmental and Social Risk Framework grew from 70 during the 2011 financial year to 1,250 in the reporting year.\nDeutsche Bank has taken further steps in terms of its client orientation and aligned its business to that effect. This also includes helping clients to overcome challenges posed by climate change. In the reporting year, Deutsche Bank was lead manager for various issues of green bonds and allocated more than € 978 m to projects in the renewable energy sector. At the end of 2014, Deutsche Asset & Wealth Management managed assets worth €5.4 billion incorporating ESG criteria and themes.\nThe bank's employees play an important part in implementing the new corporate culture. Deutsche Bank has therefore integrated their values and beliefs into all employee processes. Since 2014, compliance with the values and beliefs has made up 50% of the individual performance evaluation.\nAround 17,000 employees at the bank volunteered in various ways in 2014 once again. They give up more than 190,000 hours in devoting their time, knowledge and experience to charitable institutions and organizations.\nDeutsche Bank also exercises its corporate responsibility beyond its core business. More than 5.8 million people benefit from the different initiatives as part of its commitment to society. “Born to Be”, the bank's education program, reached over 1 million young people. Around 1.6 million people benefited from the bank's social impact programs. They range from microfinance to impact investments, promote entrepreneurship, improve people's local environment and help people in emergency situations.",
    "number_of_ratings": 2,
    "rating": 1.0,
    "likes": 1
}