{
    "url": "https://www.db.com/news/detail/20150320-deutsche-bank-publishes-annual-report-2014?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 20, 2015",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank publishes Annual Report 2014",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) today published its 2014 Annual Report. This Report contains the Bank’s audited Consolidated Financial Statements for the 2014 financial year and consists of two sections: the Annual Review and the Financial Report, which contains the 2014 Compensation Report. In addition, the Bank published its 2014 Corporate Responsibility Report and Human Resources Report.\nJürgen Fitschen and Anshu Jain, Co-Chief Executive Officers, said: “In 2014, our profits improved despite challenging conditions. For the first time ever, all four of our core businesses delivered more than EUR 1 billion each in pre-tax profits. We further strengthened our capital base during the year. We have reduced total assets by nearly a quarter since June 2012, when the new management team took office, and continued to invest in systems, controls and governance. We reaffirmed our irreversible commitment to cultural change.”\nThey added: “Deutsche Bank today is a stronger, safer, better-balanced and more responsible institution than when we began this journey. We are aware the road ahead is challenging; we are now working diligently on the next phase of our strategy and look forward to sharing this with our stakeholders in the second quarter this year.”\nFinancial Report\nIn 2014, income before income taxes increased from EUR 1.5 billion to EUR 3.1 billion as did net income from EUR 0.7 billion to EUR 1.7 billon. The Bank’s CRR/CRD 4 pro forma fully loaded Common Equity Tier 1 ratio at the end of 2014 was 11.7%, up from 9.7% at the end of 2013. The proposal for a cash dividend of EUR 0.75 per share remains unchanged from 2013.\nFinal and audited results at a glance:\n in EUR million  FY 2012  FY 2013  FY 2014  2014 vs. 2013 in %\n Net revenues  33,736  31,915  31,949  0%\n Total noninterest expenses  31,201  28,394  27,699  (2)%\n Income before income taxes  814  1,456  3,116  114%\n Income tax  498  775  1,425  84%\n Net income  316  681  1,691  148%\nThe Financial Report additionally presents an outlook for the global economy, the banking industry and Deutsche Bank. In 2015, Deutsche Bank anticipates further challenges in the macro-economic, market and regulatory environment. The Bank remains focused on responding to opportunities to strengthen client relationships through digital technology and innovation, while working more closely and intensively together to deliver “one bank” to clients.\nCompensation\nTotal compensation increased slightly to EUR 10.0 billion in 2014 (2013: EUR 9.9 billion). Variable compensation decreased to EUR 2.7 billion (2013: 3.2 billion), while fixed compensation rose to EUR 7.3 billion (2013: 6.7 billion). This development reflects adjustments in pay mix to comply with CRD 4 regulation, and the hiring of professionals to strengthen the Bank’s control environment and ensure compliance with new regulation.\nManagement Board compensation was reduced by nearly 10% to EUR 35.3 million (2013: EUR 38.5 million). Compensation for the Co-Chief Executive Officers, Jürgen Fitschen and Anshu Jain, was reduced by 11% to EUR 6.66 million each (2013: EUR 7.47 million each). The Compensation Report outlines the alignment of senior level compensation with the long term interests of stakeholders; for the Bank’s Material Risk Takers, more than 85% of 2014 variable compensation on average was deferred and is subject to performance conditions and forfeiture provisions.\nHuman Resources\nAs of December 31, 2014, Deutsche Bank employed 98,138 staff from 145 nationalities. During the year, 25% of all Senior Leadership Cadre appointments and two out of three Group Executive Committee appointments were women, reflecting the Bank’s commitment to gender diversity. The Human Resources Report describes the Bank’s investments in training and development during 2014. The Bank invested in young talent, hiring 832 new apprentices in Germany, an increase of 27%, year-on-year. The Report further outlines how adherence to Deutsche Bank’s values and beliefs continues to play a key role in decisions on recruitment, performance assessment, promotion and compensation.\nCorporate Responsibility\nDeutsche Bank’s Corporate Responsibility report outlines a number of key achievements in 2014. The Bank made substantial progress in implementing its ‘Three Lines of Defence’ program aimed at reinforcing the internal control environment and safeguarding against non-financial risk.\nThe Bank continued to expand its scrutiny of potential transactions for environmental and social risk; the number of transactions assessed rose to 1,250, up by more than 70% compared to 2013 and an 18-fold increase over 2011. Deutsche Bank acted as lead manager for a number of ‘Green Bonds’ and provided nearly EUR 1 billion of financing for renewable energy projects during 2014.\nThe Bank’s citizenship activities included social projects which benefited approximately 1.6 million people during 2014. A further 1.2 million people benefited from the Bank’s education initiatives including the ‘Born to Be’ program, which seeks to improve education and employment prospects for young people. During 2014, Deutsche Bank employees devoted 190,000 hours to corporate volunteering initiatives in their communities, frequently in partnership with charities and other public sector bodies.\nAll reports can be downloaded from: www.db.com/14\nThe Annual Report on Form 20-F, which will be submitted to the U.S. Securities and Exchange Commission (SEC) over the course of today, will also be made available following submission (in English only) at investor-relations.db.com/reports-and-events/sec-filings-for-financial-results\nAn updated 4Q2014 Financial Data Supplement is available at www.db.com/ir",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}