{
    "url": "https://www.db.com/news/detail/20150310-deutsche-bank-report-solar-grid-parity-in-a-low-oil-price-era?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 10, 2015",
    "tags": [
        "Sustainability"
    ],
    "title": "Deutsche Bank report: Solar grid parity in a low oil price era",
    "body": "Unsubsidized rooftop solar electricity costs between $0.08-$0.13/kWh, 30-40% below retail price of electricity in many markets globally. In markets heavily dependent on coal for electricity generation, the ratio of coal based wholesale electricity to solar electricity cost was 7:1 four years ago. This ratio is now less than 2:1 and could likely approach 1:1 over the next 12-18 months.\nElectricity Prices are Increasing, Despite Nat Gas Price Swings\nPeak to trough, average monthly natural gas prices have decreased ~86% over the past 10 years. Yet, during this time period, average electricity prices have increased by ~20% in the US. The main driver for rising electricity bill is that T&D investments which represent 50% of bill have continued to ramp and have accelerated recently. In 2010, T&D capex levels of for US Utilities ~$27B were ~300% higher than 1981 levels. We expect electricity prices worldwide to double over the next 10-15 years making the case for solar grid parity even stronger.\nSolar System Costs Could Continue to Decline\nThe economics of solar have improved significantly due to the reduction in solar panel costs, financing costs and balance of system costs. Overall solar system costs have declined at ~15% CAGR (compound annual growth rate) over the past 8 years and we expect another 40% cost reduction over the next 4-5 years. YieldCos have been a big driver in reducing the cost of capital and we expect emergence of international yieldcos to act as a significant catalyst in lowering the cost of solar power in emerging markets such as India.\nHow to Make Hay While the Sun Shines?\nThe solar sector has been generally under owned by institutional investors and we expect greater institutional ownership to drive positive momentum for the sector over the next 12-18 months. We expect a number of new business models focused on the downstream part of the value chain to emerge and expect innovative private companies to drive cost improvement/solar adoption. We believe companies involved in financing/downstream part of the value chain stand to generate the most significant shareholder value in the near term.",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 0
}