{
    "url": "https://www.db.com/news/detail/20150304-gt-nexus-selects-deutsche-bank-for-global-cash-management?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 4, 2015",
    "tags": [
        "Company",
        "Corporate products",
        "Investment Banking"
    ],
    "title": "GT Nexus selects Deutsche Bank for global cash management",
    "body": "Deutsche Bank today announced its appointment as a global cash management bank for GT Nexus, the world’s largest cloud-based business network and execution platform for global trade and supply chain management.\nDeutsche Bank’s international cash management platform now offers GT Nexus the ability to process payment flows in more than eight currencies by taking advantage of the Bank’s branches in the US, UK and Hong Kong. The solution also includes an innovative Payable on Behalf Of (POBO) structure in which GT Nexus can leverage the Bank’s payment architecture to drawdown on their network members’ accounts held at third party banks. This arrangement fully automates the supply chain transaction process for buyers, driving cash management efficiencies for GT Nexus’ platform members while providing payment confidence, security and visibility to suppliers.\n“Our network spans nearly every industry vertical from all major markets around the world,” said Sean Feeney, CEO of GT Nexus. “We selected Deutsche Bank for their innovative approach and their ability to facilitate global payments quickly, efficiently and accurately for our customers.”\n“Deutsche Bank’s cash management capabilities are perfectly suited to meet the complex needs of global technology companies like GT Nexus,” said Martin Runow, Head of Cash Management for Corporates, Americas at Deutsche Bank. “GT Nexus and its members will enjoy more efficient and transparent cross-border payment flows as a result of this innovative solution.”\nDeutsche Bank is pleased to offer award winning cash management capabilities for corporates as well as financial supply chain expertise. The Bank was recently ranked as a top three international cash management provider for corporates in Euromoney’s 2014 Cash Management Survey and the Number One Financial Supply Chain Provider by Treasury Management International.\n\nFor further information, please contact:\nDeutsche Bank AG\nPress & Media Relations\nAri Cohen\nPhone: +1 212 250 2438\nE-Mail: ari.cohen@db.com\nAbout Deutsche Bank\nDeutsche Bank is a leading client-centric global universal bank serving 28 million clients worldwide.\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals.\nDeutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nAbout GT Nexus\nGT Nexus operates the world’s largest cloud-based business network and execution platform for global trade and supply chain management. Over 25,000 businesses across industry verticals, including adidas Group, Caterpillar, Citi, Columbia Sportswear, DHL, Electrolux, Levi Strauss & Co., Nestlé, Pfizer, and Sears share GT Nexus as their standard, multi-enterprise collaboration platform.\nThis enables all network participants to operate against a core, real-time and always on set of information across multiple supply chain functions, allowing them to optimize the flow of goods, funds and trade information, from the point of order through final payment. For more information please visit www.gtnexus.com.\nDisclaimer:\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank.\nForward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events. By their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 20 March 2014 under the heading “Risk Factors”.\nCopies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}