{
    "url": "https://www.db.com/news/detail/20150304-eefig-report-energy-efficiency-is-the-first-fuel-for-the-eu-economy?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 4, 2015",
    "tags": [
        "Sustainability"
    ],
    "title": "Energy Efficiency is the first fuel for the EU Economy",
    "body": "In 2050, 75-90% of today’s buildings will still be in use but 75% of current buildings were built with no or minimal focus on energy efficiency. As buildings account for 40% of Europe’s energy consumption, increasing the renovation rate of buildings is critical. As well, only half of the estimated EUR 60 -100 billion of annual investment required to achieve Europe's 2020 energy efficiency targets in buildings is being met.\nThe dramatic fall in the oil price, and its likely impact in lower European gas prices, highlights the need for Europe to have buildings, industry and SMEs whose competitiveness and running costs are better insulated from the uncertainties and volatility created by commodity price shocks. Combined with the need for Europe to transition to a competitive low carbon economy, these factors make increasing the level of energy efficiency investment of strategic importance to Europe. \nAt the same time, Europe must make the transition to a competitive low-carbon economy. An increase in energy efficiency investments is therefore an important strategic goal for Europe.\nInternational landmark study on how to scale-up investment levels\nThe European Commission and UNEP Finance Initiative (UNEP FI) co-convened a group of finance and other experts to recommend ways to scale-up investment levels. Deutsche Bank was a core member of the Energy Efficiency Financial Institutions Group (EEFIG), which recently published its final report “Energy Efficiency – the first fuel for the EU Economy: How to drive new finance for energy efficiency investments”.\nThe EEFIG report identifies the critical success factors, policies, market instruments and financing solutions to increase energy efficiency investments in Europe in the buildings, industry and SME sectors. The international landmark study is the result of 16 months of work of more than 120 active participants representing finance, policy makers, the buildings sector, industry, SMEs and energy efficiency market participants.\nA five-fold increase in private energy efficiency investments in European buildings is required\nThe EEFIG report estimates that a five-fold increase in private energy efficiency investments in European buildings is required by 2030. Whilst there is no single solution, EEFIG identifies a framework of cross-cutting measures and requirements for different building and industry sub-segments. EEFIG identifies the need to engage multiple stakeholder groups, scale-up the use of several financial instruments within a clear and enforced “carrot and stick” legislative framework and identifies 19 recommended market and policy actions in four strategic areas of market, economic, financial and institutional.\nInvesting into energy efficiency measures is fundamentally important for Europe\nEuropean Commission Vice President, Maroš Šefčovič, welcomed the launch of the report with the following words: \"Investing into energy efficiency measures in buildings, industry and in SMEs is fundamentally important for Europe. I will strive to ensure that energy efficiency investment financing is looked at in our forthcoming policies and that this Report will be used as inspiration for our further work.” The EEFIG report had a direct influence on the new European Energy Union strategy.\nCaio Koch-Weser, Vice Chairman of Deutsche Bank, said in reference to EEFIG’s work: “Our experience and research shows that energy efficiency finance and investment opportunities can be profitable and contribute to improving energy security, economic growth and reduce our footprint. Scaling up investment into Europe’s buildings and industry requires much greater cooperation between policy makers, companies and the financial sector. There is also great potential to help deepen the real estate investment industry’s already strong focus on energy efficiency by using robust information, incentives and targets to drive investment.”\nFelipe Calderón, Former President of Mexico and Chair of the Global Commission on the Economy and Climate commented: “This report’s conclusion that scaling up energy efficiency is strategically and economically important for the European Union matches both my experience in government and the conclusion of the New Climate Economy initiative. Energy efficiency is already the biggest source of “new” energy supply, but large untapped potential remains in Europe. Implementing the report’s recommendations can support economic growth and help tackle climate change at the same time.”\nDeutsche Bank’s financial expertise to assist clients in reducing energy use\nThere are many ways in which Deutsche Bank is active in energy efficiency and deploys our financial expertise to assist clients in reducing energy use:\nThe Bank has made significant efforts to reduce our own energy use, such as the green refurbishment of the Frankfurt Towers and installing energy efficient services, lighting and heating systems in many of our buildings and using green leases in more of the buildings we occupy. These efforts contribute to the Bank’s carbon neutrality and cost reduction goals.\nThis expertise was used to help win the fund mandate for the European Energy Efficiency Fund, which invests in projects to improve the energy efficiency of public sector buildings.\nDeutsche AWM real estate has an increasing focus on energy efficiency and will publish an annual report on progress in March, alongside Deutsche Bank’s Annual Report and Corporate Responsibility report\nDeutsche AWM real estate has an energy efficient property investment team focused on retrofits of physical buildings.\nThe Sal Oppenheim managed Green For Growth Fund focuses on investments in Southeast Europe and other neighboring countries such as Turkey and Ukraine.\nThe Corporate Banking & Securities (CB&S) division has structured an energy efficiency bond in California and is a leading player in the growing green bond market.\nThe Private and Business Clients (PBC) division provides loans to businesses and individuals to support energy efficiency and renewable energy investment.\nSeveral Deutsche Bank research reports were also cited in the EEFIG report:\nPDF\nUS building retrofit market sizing and financing models\nIntegrating Energy Efficiency into Mortgage Financing: Promising Efforts in the New York City Multifamily Building Sector\nBanks for increased energy efficiency investments\nThe Energy Efficiency Financial Institutions Group (EEFIG) was established as a permanent working group with the European Commission and the United Nations Environment Programme Finance Initiative (UNEP FI). The aim of the group is to use their experience to increase the scale of energy efficiency investments across the EU.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}