{
    "url": "https://www.db.com/news/detail/20241126-germans-interest-in-the-topic-of-inheritance-continues-to-decline?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, November 26, 2024",
    "tags": [
        "Germany"
    ],
    "title": "Germans' interest in the topic of inheritance continues to decline",
    "body": "People are less willing to deal with the subject of what happens with their assets after they die. At the same time, people are bequeathing higher amounts and the structure of their assets is often more complex. These are the key findings of a new, representative study on the topic of inheritance that Deutsche Bank has produced in cooperation with the renowned German opinion and market research institute, the Allensbach Institute.\nAccording to the study, 64 percent of German citizens are reluctant to deal with the topic of inheritance; in the last survey in 2018, it was 60 percent. Although 41 percent of people today would like more openness on the topic, actual experiences do not reflect this. Only 32 percent of heirs state that they had openly discussed the estate with all parties involved beforehand; in 2018, this figure was 35 percent.\nRaffael Gasser, Head of Wealth Management & Private Banking Germany at Deutsche Bank, says: \"Inheriting and bequeathing remains a challenging topic for many people. Our study shows that inherited assets are becoming increasingly important, especially at times like these – also for financial security and retirement planning. If the estate is not settled, this can place a considerable emotional and financial burden on the surviving dependents. Our experience shows that those who discuss estate succession with family and experts at an early stage and arrange it professionally avoid misunderstandings and conflicts – for the benefit of both the testator and the heirs.\"\nHere are 12 of the main findings of the study at a glance:\n(1) Only one person in three has a will, and testators are getting older\nOnly 35 percent of potential testators in Germany have written a will (2018: 39 percent). Among those under 50, it is only 11 percent (2018: 15 percent), which shows that young families are often unprepared. For those over 65, it is 50 percent (2018: 58 percent).\nThe average age at which people in Germany write a will is 58, two years older than in 2018 and three years older than in 2012, when it was 55 years old.\n(2) A stroke of fate is usually the reason to start discussing inheritance\nFor 39 percent of Germans, the serious illness of a relative or friend is the most likely reason for them to broach the subject of inheritance; for 28 percent, death in their immediate family, social or professional circle usually triggers the conversation.\nFamily celebrations are rarely used as an opportunity to talk about inheritance. In fact, only 17 percent of respondents said they thought such occasions were appropriate. So the topic is likely to be taboo over the upcoming holiday season, too.\n(3) Younger people are rarely fully prepared for the end of their lives\nIn addition to making a last will and testament, it is also important to have a living will and a healthcare power of attorney. This means that the estate is in order and preparations are in place in the event of sudden strokes of fate and severe illness.\nOnly 14 percent of those under 50 have a living will, and 12 percent have a healthcare power of attorney. Only 2 percent of this age group have all three documents: a will, a living will and a healthcare power of attorney.\n(4) Nine percent of Germans have no legal heirs\nIf there is no valid will, the statutory order of inheritance applies. For people who have no family members as natural heirs, the assets fall to the state unless otherwise stipulated.\nAs many as 9 percent of testators state that they have no natural heirs. Of these, around one in three say they would like to bequeath something to foundations, churches or other non-profit organisations.\n(5) Inheritances are growing – as are the expectations of heirs\nIn 2023, the tax offices in Germany assessed inheritances and gifts worth 121.5 billion euros – a record amount according to the Federal Statistical Office and almost 20 percent more than in the previous year.\nThe value of all asset transfers was significantly higher, though, as the tax statistics do not include inheritances and gifts that fall within the tax allowances.\n34 percent of future heirs in Germany today expect an inheritance of 250,000 euros or more.\n(6) The structure of inherited assets is changing\nAlthough 73 percent of heirs inherited money, its share is decreasing (2018: 75 percent). Currently, 66 percent of future testators state their intention to leave money to their heirs.\nThe share of real estate, securities and gold is growing on the other hand, with owner-occupied real estate being inherited particularly frequently (44 percent, 2018: 33 percent). More than half (54 percent) of heirs inherited one or more properties; in 2018, it was 40 percent.\nSecurities (14 percent; 2018: 12 percent) and gold (8 percent; 2018: 4 percent) were also increasingly passed on.\n(7) Spouses are no longer automatically sole heirs\nIn general, people are tending to move away from joint wills. People are less frequently choosing the so-called \"Berlin Testament\" model – one where spouses appoint each other as sole heirs. 42 percent now appoint their partner as sole heir; in 2018, it was 59 percent.\nAlthough 52 percent (2018: 65 percent) of testators still chose a joint solution, 45 percent are today making a will that only concerns their own estate; in 2018, it was 34 percent.\nFewer testators are also informing their heirs where they keep their will (40 percent; 2018: 53 percent).\n(8) Blended families are having a growing impact on the topic of inheritance\n14 percent of all potential testators in Germany now live in a blended or stepfamily, where one or both partners have children from previous relationships. However, only one in five of these testators has made special arrangements for their family constellation.\n(9) Inheritance is increasingly being used for asset building and retirement planning\nEvery second German citizen who has already inherited uses the inheritance primarily for their own asset building and retirement planning. Since 2015, this use has increased from 35 percent to 48 percent.\n60 percent of future heirs state that they want to use an inheritance for asset building and retirement planning (2018: 52 percent, 2015: 47 percent). However, almost every German (94 percent) is convinced that one should not rely solely on inheritances for one's retirement provision.\nPeople who have previously received an inheritance state their intention to use the funds to fulfill special wishes or dreams (22 percent), support relatives (15 percent), or repay loans (13 percent).\n(10) People are more likely to seek professional advice rather than ask friends or family\nThe majority of Germans find inheritance law complicated (73 percent). Only one in two testators (47 percent) has a precise idea of how the statutory order of inheritance is regulated. Accordingly, an increasing proportion of them are seeking professional advice from financial and legal experts (41 percent; 2018: 32 percent).\n88 percent of those who write a will seek external advice; in 2018, it was 84 percent and in 2012, it was 72 percent. Notaries (55 percent; 2018: 53 percent) and lawyers (17 percent; 2018: 15 percent) are in particularly high demand. Friends and relatives, on the other hand, are consulted less often (9 percent; 2018: 17 percent). Only one in ten people talk to their own partner (12 percent, 2018: 23 percent). 7 percent ask their bank for advice (2018: 9 percent).\nExpert knowledge was also in demand among people who had previously received an inheritance. For 88 percent of them, the conversation paid off (2018: 74 percent). Tax issues (56 percent) and tax-saving investment opportunities (52 percent) were the main focus.\n(11) Digital legacy often remains unconsidered and must be regulated separately\nWhile traditional assets are a standard part of an estate, digital legacies are often overlooked.\nTwo-thirds of Germans (69 percent) have yet to give any thought to what should happen to their emails, social media accounts and cloud data. Only 4 percent have written explicit instructions for their digital estate.\n47 percent are in favour of heirs having automatic access to their digital estate. This is, however, currently not the case under the current case law of the Federal Court of Justice (BGH 2018). Anyone who wants their heirs to have access to their digital estate must therefore take action.\n(12) East Germans are still less likely to expect inheritances\nEven 35 years after the fall of the Berlin Wall, there are still differences between East and West Germany when it comes to inheritances. In East Germany, only about one in six citizens (16 percent) expects an inheritance, while in West Germany it is one in four (North Germany 24 percent, West/Southwest and South Germany 25 percent each).\nNot only is it less common in East Germany to receive an inheritance, but the estate is also worth less: only 41 percent of testators estimate their later estate to be worth at least 250,000 euros. This compares to 55 percent in the western regions of Germany.\n  About the study\nOn behalf of Deutsche Bank and over the period from August 29 to September 13, 2024, the Allensbach Institute surveyed a representative cross-section of the population – a total of 1,086 German citizens aged 16 and over. The study examines the topic of inheriting and bequeathing from the perspective of previous and future heirs as well as future testators. It continues the findings of older surveys from 2012, 2015, and 2018 while also adding questions on new trends that are emerging.",
    "number_of_ratings": 13,
    "rating": 4.8,
    "likes": 14
}