{
    "url": "https://www.db.com/news/detail/20241125-deutsche-bank-named-asia-pacific-s-manda-house-of-the-year-by-financeasia?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 25, 2024",
    "tags": [
        "Asia-Pacific",
        "Investment Banking"
    ],
    "title": "Deutsche Bank named Asia Pacific’s M&A House of the Year by FinanceAsia",
    "body": "FinanceAsia has named Deutsche Bank the best Mergers and Acquisitions (M&A) house in Asia Pacific for 2024, acknowledging its exceptional advisory services and its role in facilitating some of the region's largest M&A transactions.\nThe win reflects the bank’s leadership and innovation across diverse sectors and markets, which has helped achieve the best outcomes for clients as they navigate an increasingly complex market environment.  \nIt also follows a period of sustained and strategic investment in the Origination & Advisory business in Asia Pacific, particularly during a pivotal time in the market, has enabled Deutsche Bank to capitalize on market share as activity rebounds.\nDeutsche Bank has consistently ranked among the top three in the region’s M&A league tables throughout 2024. To date this year, Deutsche Bank has announced or closed over 30 deals across Asia Pacific. \nMayooran Elalingam, APAC’s Head of Investment Banking Coverage & Advisory, said: “This award reflects the dedication and focus of the teams across the region and collaboration with the wider franchise. While the award focuses on 2024 specifically, it is also a testament to the hard work across a number of years to build our M&A offering into the market leading position it is in today.”\nIn addition to the coveted house award, FinanceAsia also acknowledged Deutsche Bank's significant contributions to specific deals across both M&A and Debt Capital Markets:\nBest Private Equity Deal APAC: Blackstone’s A$24 billion acquisition of AirTrunk\nBest Property Deal APAC: Blackstone’s A$24 billion acquisition of AirTrunk\nBest Infrastructure Deal APAC: Blackstone’s A$24 billion acquisition of AirTrunk\nBest Private Equity Deal ANZ: Blackstone’s A$24 billion acquisition of AirTrunk\nBest M&A Deal (North Asia): Renesas Electronics’ US$5.9 billion 100% acquisition of Altium\nBest Private Equity Deal (North Asia -Korea): Blackstone’s US$1.4 billion sale of Geoyoung to MBK Partners\nMost innovative deal in North Asia (Korea): SK Bioscience’s acquisition of 60% in IDT Group\nBest M&A deal (Hong Kong SAR)*: HKT’s US$870 million sale of 40% in its passive network assets to China Merchants Capital\nBest M&A deal (Onshore China): Wanda’s US$8.3 billion sale of 60% in Zhuhai Wanda to PAG consortium\nBest M&A deal (Singapore): Temasek and Tower Capital’s S$808 million sale of Eu Yan Sang to Rohto Pharma and Mitsui\nBest M&A Deal (Southeast Asia): Ramsay Healthcare and Sime Darby’s US$1.2 billion sale of Ramsay Sime Darby Healthcare JV\nBest Islamic Finance Deal (Southeast Asia): Republic of the Philippines US$1bn Debut Sukuk offering\n *highly commended ",
    "number_of_ratings": 4,
    "rating": 5.0,
    "likes": 9
}