{
    "url": "https://www.db.com/news/detail/20241122-european-digital-payments-app-wero-now-available-for-postbank-customers?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 22, 2024",
    "tags": [
        "Germany",
        "Digital banking & services",
        "Private products"
    ],
    "title": "European digital payments app Wero now available for Postbank customers",
    "body": "Postbank customers can use the app from November 25\nApp initially supports account-to-account payments\nDeutsche Bank to follow in the coming year\nPostbank customers will be able to link the Wero app to their account from next Monday, November 25. This allows account-to-account payments within Europe where the sender and recipient have an account with a participating bank.\nThe European Payment Initiative announced the launch of the Wero stand-alone app in Germany. There are plans to gradually expand Wero's offering to include payments at small retailers using the Wero wallet, online payments on merchant websites, as well as managing recurring payments associated with subscriptions. Point-of-sale payments at major retailers and other value-added services such as Buy Now-Pay Later, merchant loyalty programme integration, and shared spending are also planned. \n  \"Wero is more than just another payment app. It is a step towards a single European payment landscape and an important step towards European sovereignty. We are pleased to be able to offer our customers this innovative solution that simplifies payments even across national borders. Wero thus fits into our strategy of digitizing simple banking services and products, for our private customers as well as for our corporate customers active in retail,\" says Dominik Hennen, Head of Personal Banking Germany at Deutsche Bank. \nPostbank customers can link the Wero app to their account. Payments made via Wero are then simply debited from the Postbank account. The app will be available to Deutsche Bank clients in the coming year. Integration into the banking apps of Postbank and Deutsche Bank is planned at a later date.",
    "number_of_ratings": 16,
    "rating": 4.3,
    "likes": 18
}