{
    "url": "https://www.db.com/news/detail/20241112-europe-s-resilient-appetite-for-esg-investing?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 12, 2024",
    "tags": [
        "Research",
        "Sustainability",
        "Wealth"
    ],
    "title": "Europe’s resilient appetite for ESG investing",
    "body": "Wealthy European investors are leaning more towards social and governance factors when applying an Environmental, Social and Governance (ESG) lens to investing, according to the latest ESG survey published today by Deutsche Bank’s Chief Investment Office (CIO).\nIn its fourth year, the 2024 CIO ESG survey found that nearly one fifth - mostly European respondents - said they invest sustainably for “a fairer society”. The majority (51%) surveyed also expected to increase their allocation to sustainable investments in the next five years.\nDeutsche Bank’s Chief Investment Officer ESG and Global Head of the CIO, Markus Müller said: “ESG investment remains appealing and has had a complex few years. Periods of acceptance and then rapid growth have been followed by deeper questioning of both ESG investment’s implementation and, in some cases, challenges to ESG itself. This has been despite the continued growth in the real economy implementation of sustainable technology and major related policy initiatives.”\nThe survey assessed wealthy client attitudes toward ESG investing, as well as views on the sustainable transition.\n“These results show that ESG remains appealing and reminds us that environmental considerations will be accompanied by social and governance objectives too. There is some uncertainty about what ESG really means for portfolios in terms of performance, risk and investment vehicles, but these results show investors are already investing in the sustainable transition,” Müller added.\nBelow is a summary of the top findings:\nESG as a measure of sustainability \n1. Investors can have multiple ESG goals. When asked “What is the most important sustainability goal in your portfolio?”, 47% of respondents said they didn’t have just one specific objective. Of the other options given, the most popular single goal was “fairer society” (19%).\n2. ESG does not imply 100% portfolio commitment. The most common response (28% of respondents) was that ESG could be considered as an additional factor to financial indicators; this contrasts with only 7% who would like to align their whole portfolio to sustainability considerations.\n3. Don’t forget the “S” and “G” in ESG. The environment got the highest proportion (42%) of “most” important responses. But this share was slightly down on last year and the proportion of respondents identifying social and governance issues as the “most” important rose to 27% and 31% respectively.\n4. Sustainable investments’ portfolio share could increase. When asked whether respondents agreed with the following statement: \"I expect to increase the share of sustainable investments in my portfolio over the next five years\", 51% said they strongly or slightly agreed; less than 20% strongly or slightly disagreed.\nESG in portfolios\n5. Portfolio return concerns remain. A few years of mixed performance for ESG investing continues to take its toll on portfolio performance expectations. The proportion of respondents strongly or slightly agreeing that “considering ESG will improve the return of a portfolio” was 32% in 2024, close to the 31% recorded in the 2023 survey but well below the 41% for 2022.\n6. Risk management abilities are also contentious. The proportion strongly or slightly agreeing that ESG could help manage risk was 41% this year, up markedly on the 2023 level (37%) although still lower than in 2022 (44%) or 2021 (51%).\n7. A perceived need for investment knowledge and skills. This year, just 3% of respondents identified themselves as advanced ESG investors, with a further 15% having a good knowledge of ESG. These results are virtually unchanged from last year.\n8. Investment vehicle choice influenced by location. Across all investors, single stocks and ETFs are the preferred vehicles for achieving ESG investment goals; other vehicles such as bonds and structured products appear less popular.\n9. Awareness of investment vehicles could improve. While 45% of clients agreed that there are adequate investment vehicles to support their ESG preferences, 39% selected “I don’t know”, perhaps reflecting uncertainty about exactly what forms of ESG investment vehicles exist.\nInvesting for the sustainable transition\n10. Performance expectations are affected by time horizon. In terms of short-term performance expectations, AI and digitalization were by far the preferred sectors, while energy and other less discussed topics lagged far behind. However, when it comes to medium-to long-term expectations, some broad sustainability topics are moving up the list of topics expected to deliver the highest investment performance. For example, in the long term, investors' expectations are shifting: the Blue Economy is leading the field.\n11. Return drivers also switch on longer time frames. Over the short term, macroeconomic factors (e.g. inflation) were selected by the most respondents as driving ESG investment returns, followed by changes in consumer demand (e.g. for more sustainable products). But, as the time horizon increases, the drivers reverse, with nature-climate related risks more frequently picked.\n12. Both start-ups and established firms to drive transition. One important conundrum for investors is whether the move to a more sustainable economy will be driven by disruptive start-ups or successfully transitioning established companies. Opinions are evenly divided.\nAbout the survey\nThe fourth annual CIO ESG survey was conducted in leading European markets between April and June this year. The survey recorded 1,312 responses from Deutsche Bank Private Bank and wealth management clients. Clients in our home market, Germany, contributed the largest number of responses (570), followed by Belgium (324), Italy (242) and Spain (145). As part the EU project, not surprisingly, clients in these countries show a high degree of engagement in ESG and sustainable topics. Some 77% of respondents identified as male. The majority of respondents (70%) were aged 56 or older; only 5% were 40 or younger.\nEurope in focus\nTaking a detailed look at the four countries with the highest number of respondents, the picture reveals differences when it comes to sustainability goals, knowledge, interests and beliefs.\nItaly’s respondents show strong interest in the “social” component of ESG, with 32% seeing it as the most important component, compared to the 27% average. Similarly, Spanish investors display strong interest in the social side of ESG investing, where 35% say it is the most important factor. Spain’s respondents are also positive on ESG’s ability to improve portfolio returns; 40% compared to the survey average of 30%.\nGerman investors are the most sceptical about ESG’s ability to improve portfolio returns with only 20% believing in its potential compared to the 32% average. In contrast, Belgium stands out with a strong sustainability focus, with nearly two thirds (62%) expecting to increase their sustainable investments.\nClick here for the full CIO ESG Survey 2024 Special Report.",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 3
}