{
    "url": "https://www.db.com/news/detail/20150730-deutsche-bank-reports-second-quarter-2015-net-income-of-eur-818-million?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 30, 2015",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank reports second quarter 2015 net income of EUR 818 million",
    "body": "Group results \nNet income of EUR 818 million in 2Q2015 compared with EUR 238 million in 2Q2014\nAnnualized post-tax return on average tangible shareholders’ equity of 5.7% compared with 2.1% in prior year quarter\nIncome before income taxes (IBIT) of EUR 1.2 billion, up 34% from 2Q2014\nNet revenues of EUR 9.2 billion, up 17% year-on-year, reflecting growth in all businesses and favorable foreign exchange movements\nNoninterest expenses of EUR 7.8 billion, up 17% from 2Q2014\nLitigation charges of EUR 1.2 billion compared with EUR 470 million in 2Q2014. Litigation reserves held on balance sheet of EUR 3.8 billion at quarter end\nCapital and leverage\nCommon Equity Tier 1 (CET1) ratio* of 11.4% at quarter end, up 30 bps from 1Q2015\nCET1 capital* of EUR 47.4 billion, down EUR 0.5 billion from 1Q2015\nRisk-weighted assets (RWA)* of EUR 415.8 billion, down 4% from 1Q2015\nLeverage ratio* of 3.6%, up approximately 20 bps from 1Q2015\nLeverage exposure* of EUR 1,461 billion, down 6% from 1Q2015\nTangible Book Value per share of EUR 39.42 decreased 4% compared to 1Q2015 as shareholders’ equity\ndecreased due to negative Other Comprehensive Income, payment of dividend and AT1 coupon\n*Fully-loaded Capital Requirements Regulation (CRR) / Capital Requirements Directive 4 (CRD4) basis\n\nDeutsche Bank (XETRA: DBKGn.DE / NYSE: DB) today reported second quarter results. Group net revenues rose 17% from the prior year, to EUR 9.2 billion with noninterest expenses 17% higher at EUR 7.8 billion. Income before income taxes was EUR 1.2 billion in 2Q2015, compared with EUR 917 million in 2Q2014.\nThe second quarter highlights the strengths of and challenges facing Deutsche Bank.\nSolid revenue growth underscores the fundamental strengths of our businesses and the commitment of our people. However, our challenges are also evident in the unacceptably high level of our costs, our continuing burden of heavy litigation charges, a balance sheet that must be more efficient, and the poor overall returns to our shareholders.\nJohn Cryan, Co-Chief Executive Officer\nHe continued: “We must address these challenges. This is not a question of strategy; Strategy 2020 is built around the strengths of Deutsche Bank and we commit to it. But for our strategy to succeed, we must become more efficient. We must be disciplined in how, where and with whom we do business. We must critically review any countries, business lines, products, and relationships that are unattractive.”\nHe added: “We must shrink our balance sheet, focusing on our many low-return assets. We must reduce organizational complexity, which inhibits effective decision making, blurs accountability and embeds wasteful cost. Only by doing this can we produce the attractive returns our shareholders deserve.”\nHe concluded: “Our financial performance does not reflect our tremendous potential. Deutsche Bank is a first rate institution built around long-standing and deep client relationships, strong product lines, skilled and committed staff, an invaluable brand and an exceptional position in our home market. We are dedicated to ensuring that our financial performance reflects those inherent strengths.”\nGroup Results [Table]\nNoninterest expenses [Table]\nGroup net revenues in 2Q2015 were EUR 9.2 billion, an increase of EUR 1.3 billion, or 17%. Approximately EUR 570 million of the revenue growth was attributable to favorable foreign exchange movements.\nBusiness revenue growth compared to 2Q2014 was principally driven by the 23% (EUR 804 million) growth in CB&S and 25% (EUR 282 million) growth in Deutsche AWM.\nIn NCOU, revenues of EUR 201 million were EUR 253 million higher than 2Q2014 which included a loss from the restructuring of our holding of Maher Terminals debt.\nProvision for credit losses was EUR 151 million in 2Q2015, a decrease of EUR 98 million, or 39%, compared with 2Q2014.\nCosts\nThe credit environment remained benign with no significant single name credit provisions in the quarter, along with provision releases in part related to ongoing non-performing loan sales.\nNoninterest expenses were EUR 7.8 billion in 2Q2015, up EUR 1.1 billion, or 17%, compared with 2Q2014. Foreign exchange movements accounted for approximately EUR 530 million of the quarterly increase. Litigation-related costs were EUR 1.2 billion, an increase of EUR 757 million compared with 2Q2014.\nNoninterest expenses were also affected by increased expenses for staff compensation and benefits, driven in part by hiring to improve regulatory compliance and for business growth, and market-driven compensation adjustments. These were partly offset by OpEx savings, the sale of The Cosmopolitan of Las Vegas in 2014, and lower cost-to-achieve expenditure.\nGroup income before income taxes was EUR 1.2 billion in 2Q2015 versus EUR 917 million in 2Q2014 reflecting revenue growth and lower provision for credit losses. This was partly offset by higher noninterest expenses. Net income for 2Q2015 was EUR 818 million, compared with EUR 238 million in the prior year. Income tax expense in 2Q2015 was EUR 410 million versus EUR 679 million in 2Q2014. The effective tax rate in 2Q2015 was 33%.\nCapital and leverage [Table]\nThe bank’s fully loaded CRR/CRD4 Common Equity Tier 1 (CET1) capital ratio was 11.4% at quarter end, 30 bps higher compared with the ratio at 31 March 2015. Fully loaded CRR/CRD4 CET1 capital as of 30 June 2015 was EUR 47.4 billion, down EUR 0.5 billion from the first quarter, however unchanged on a foreign exchange-neutral basis.\nFully loaded CRR/CRD4 risk-weighted assets (RWA) decreased by EUR 15.6 billion to EUR 415.8 billion at the end of 2Q2015, compared with the prior quarter, including EUR 10 billion lower market risk RWA and a foreign exchange driven reduction of EUR 5 billion, offsetting the corresponding foreign exchange effect on CET1 capital.\nThe CRR/CRD4 leverage ratio on a fully loaded basis was 3.6% as of 30 June 2015.\nLeverage exposure was EUR 1,461 billion at quarter end, a decrease of EUR 88 billion from 31 March 2015, mainly from a reduction of derivatives exposure and foreign exchange movements.\nTotal assets were EUR 1,694 billion as of quarter end, a decrease of EUR 261 billion, or 13%, versus 31 March 2015. The reduction is primarily due to a reduction of derivatives balances.\nSegment results\nCorporate Banking & Securities (CB&S) [Table]\nCB&S net revenues of EUR 4.3 billion increased by EUR 804 million, or 23%, from 2Q2014, driven by increased market volatility and favorable foreign exchange rate movements. Net revenues included a EUR 213 million net gain from Credit Valuation Adjustment (CVA) relating to RWA mitigation hedging, Debt Valuation Adjustment (DVA) and Funding Valuation Adjustment (FVA) compared to a loss of EUR 111 million in 2Q2014.\nDebt Sales & Trading net revenues of EUR 2.1 billion were up EUR 286 million, or 16%, versus 2Q2014. Debt Sales & Trading net revenues included valuation adjustments for CVA and FVA totaling a gain of EUR 99 million. This compares to a loss of EUR 41 million in 2Q2014.\nForeign Exchange revenues were significantly higher, driven by increased market volatility. Revenues in Distressed Products were also significantly higher reflecting strong performance in Europe and North America. Flow Credit revenues were significantly lower than 2Q2014 driven by difficult market conditions and widening spreads. Revenues in Global Liquidity Management were significantly lower, driven by subdued performance in Europe.\nRMBS revenues were significantly lower and Emerging Markets revenues were lower compared to 2Q2014, reflecting challenging market conditions. Equity Sales & Trading net revenues of EUR 1.0 billion increased by EUR 274 million, or 39%, compared to 2Q2014.\nOthers\nPrime Finance revenues were significantly higher than 2Q2014 driven by increased client balances. Revenues in Equity Derivatives increased significantly compared to 2Q2014 primarily due to favorable market conditions in Asia.\nOrigination and Advisory net revenues of EUR 853 million increased by EUR 42 million, or 5%, compared to 2Q2014. Revenues in Advisory were higher than 2Q2014 reflecting an increased fee pool. Debt Origination revenues were higher driven by increased revenues in North America.\nCB&S provision for credit losses was EUR 57 million, versus EUR 44 million in 2Q2014, reflecting increased provisions taken in the Leveraged Finance portfolio, partially offset by lower provisions in the Shipping portfolio. CB&S noninterest expenses of EUR 3.0 billion increased by EUR 398 million, or 15%, compared to 2Q2014. The increase was driven by adverse foreign exchange rate movements, bank levies, and costs relating to meeting regulatory requirements.\nCB&S income before income taxes of EUR 1.2 billion increased by EUR 372 million compared to 2Q2014.\nPrivate & Business Clients (PBC) [Table]\nPBC net revenues of EUR 2.4 billion increased by EUR 6 million, or 0.2%, compared to 2Q2014. Revenues from Credit products and Investment & Insurance products increased in the quarter reflecting improved loan volumes and higher transaction volumes. That growth was partly offset by lower Deposit product revenues driven by the continued low interest rate environment in Europe.\nRevenues in Postal and supplementary Postbank Services also declined due to a new contract with Deutsche Post DHL, effective since 1 January 2015. Other product revenues increased reflecting an improved performance of the HuaXia equity investment, partly offset by lower Postbank non-operating activities.\nPBC provision for credit losses of EUR 100 million declined by EUR 45 million or 31% from 2Q2014 reflecting the benefits of selective portfolio sales as well as the quality of the loan book and the ongoing benign economic environment in Germany. PBC noninterest expenses of EUR 1.8 billion decreased by EUR 53 million, or 3%, compared to 2Q2014.\nThat decrease was driven by a EUR 56 million reduction in cost-to-achieve expenses on the back of the Strategy 2020 discussions and the absence of loan processing fees booked in 2Q2014. PBC continued to realize savings from efficiency measures, which were partly offset by higher regulatory-related expenses and spending in technology. PBC income before income taxes of EUR 483 million increased by EUR 104 million, or 27%, compared to 2Q2014.\nGlobal Transaction Banking (GTB) [Table]\nGTB net revenues of EUR 1.1 billion increased by EUR 115 million, or 11%, from 2Q2014, supported by favorable foreign exchange movements and volume growth.\nRevenues in Trade Finance grew despite continued low margins. In Securities Services, revenues increased mainly in the Americas. In Cash Management, the business continued to suffer from the ongoing low interest rate environment.\nGTB provision for credit losses was positive at EUR 12 million in 2Q2015 showing a decrease of EUR 59 million compared to 2Q2014 due to a high level of releases and recoveries as well as low provision levels.\nGTB noninterest expenses of EUR 874 million increased by EUR 113 million, or 15%, compared to 2Q2014. The increase was primarily driven by foreign exchange movements, a higher litigation-related charge, as well as higher expenses to comply with regulatory requirements. GTB income before income taxes of EUR 283 million increased by EUR 62 million, or 28%, compared to 2Q2014.\nDeutsche Asset & Wealth Management (Deutsche AWM) [Table]\nDeutsche AWM net revenues of EUR 1.4 billion increased by EUR 282 million, or 25%, compared to 2Q2014, supported by favorable foreign exchange movements. This growth was broad based across product categories, with Management Fees, Performance and Transaction Fees, Net Interest Income and Other Product revenues increasing versus the prior year period.\nDeutsche AWM provision for credit losses was EUR 1 million in 2Q2015, demonstrating the continued high quality of the Deutsche AWM loan book. Deutsche AWM noninterest expenses of EUR 1.0 billion were up EUR 57 million, or 6%, compared to 2Q2014.\nThe increase was driven by foreign exchange movements, higher revenue-driven and business volume related costs as well as higher litigation costs. Furthermore, increased compensation costs mainly due to regulatory and strategic hirings contributed to the increase. This was partly offset by lower cost-to-achieve related to OpEx and lower policyholder benefits and claims.\nDeutsche AWM income before income taxes of EUR 422 million in 2Q2015 increased by EUR 218 million, or 107%, compared to 2Q2014.\nNon-Core Operations Unit (NCOU) [Table]\nNCOU net revenues of EUR 201 million increased by EUR 253 million compared to 2Q2014, predominantly due to the EUR 314 million loss related to the debt financing of Maher Terminals that was recorded in 2Q2014.\nIn addition, portfolio revenues have declined from asset sales, which were partially offset by valuation adjustments and mark-to-market impacts on NCOU’s portfolio. NCOU’s de-risking activity generated revenue gains of EUR 71 million compared to net gains of EUR 52 million in 2Q2014. NCOU provision for credit losses of EUR 5 million in 2Q2015 was EUR 14 million, or 72%, lower compared to the prior year quarter.\nNCOU noninterest expenses of EUR 1.1 billion increased by EUR 586 million, or 113%, compared to 2Q2014, predominantly due to higher litigation-related charges. Noninterest expenses excluding litigation-related charges were 27% lower than 2Q2014, driven by asset sales including The Cosmopolitan of Las Vegas.\nNCOU loss before income taxes of EUR 909 million increased by EUR 319 million compared to 2Q2014, primarily driven by litigation-related charges.\nConsolidation & Adjustments (C&A) [Table]\nC&A loss before income taxes was EUR 250 million in 2Q2015, compared to a loss of EUR 124 million in 2Q2014.\nThis reflected a loss of EUR 156 million for valuation and timing differences from different accounting methods used for management reporting and IFRS compared to negative EUR 12 million in 2Q2014.\nIn addition, FVA was a negative EUR 109 million in 2Q2015, in contrast to a negative EUR 26 million in 2Q2014. Lastly, 2Q2015 reflects a loss of EUR 92 million resulting from the purchase of additional Postbank shares as part of the publicly announced squeeze out process.\nThese impacts were partially offset by a positive impact of EUR 139 million in bank levy compared to a negative EUR 3 million in 2Q2014, as a portion of the bank levy charge incurred in 1Q2015 was allocated to the corporate divisions in the quarter.\nMore information\nThe complete Interim Report as of 30 June 2015 is available at http://www.db.com/2Q2015, the Financial Data Supplement for 2Q2015 at http://www.deutsche-bank.com/ir/financial-supplements \nForward-looking statements\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 20 March 2015 under the heading “Risk Factors.” Copies of this document are readily available upon request or can be downloaded from www.deutsche-bank.com/ir. \nIFRS\nThis release contains non-IFRS financial measures. For a reconciliation to directly comparable figures reported under IFRS, to the extent such reconciliation is not provided in this release, refer to the 2Q2015 Financial Data Supplement, which is available at www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}