{
    "url": "https://www.db.com/news/detail/20150730-message-from-john-cryan-to-employees?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 30, 2015",
    "tags": [
        "Company",
        "Management & Leadership",
        "Strategy"
    ],
    "title": "Second-quarter 2015 financial results",
    "body": "Dear Colleagues,\nThis morning we published our second-quarter 2015 financial results. These illustrate the strengths and tremendous potential of Deutsche Bank, but also the tough challenges we face.\nThe power of our core businesses is evident in our revenues, which were up 17% year-on-year to EUR 9.2 billion. Corporate Banking & Securities performed strongly while also deleveraging; Deutsche Asset & Wealth Management sustained the momentum of the past few years. Private & Business Clients and Global Transaction Banking also delivered year-on-year revenue growth despite the impact of low interest rates.\nHowever, too much of these revenues were used up by rising costs. Noninterest expenses rose 17% year-on-year to EUR 7.8 billion, driven above all by litigation charges which more than doubled year-on-year to EUR 1.2 billion. These cost increases more than offset savings from the OpEx programme and from the disposal and deconsolidation of non-core activities. Costs at this level are quite simply unacceptable. They are wasteful of our hard-earned revenues and we all need to work to bring them down.\nNet income for the quarter was EUR 818 million, substantially higher than in the second quarter last year, but nowhere near good enough. Our cost-income ratio of 85% and annual return on tangible equity of 5.7% are both well below where we aim to be and should be.\nThese results also illustrate how vital it is for us to execute Strategy 2020. Accordingly, the Management Board will be making a number of important changes over the course of the remainder of the year. Change can be disruptive, but the status quo is not an option. However, our goal will always be to make Deutsche Bank more successful.\nWe plan to invest in people, in systems, and in resources in our core businesses. In CB&S, we aim to invest while also reducing our reliance on long-term balance sheet usage – a luxury we can no longer afford. By managing our balance sheet more actively, we can free up capacity for growth.\nOur financial performance does not reflect our tremendous potential. Deutsche Bank is a first-rate institution built around long-standing and deep client relationships, strong product lines, skilled and committed staff, an invaluable brand and an exceptional position in our home market. I am dedicated to ensuring that our future financial performance reflects those inherent strengths. With your help, I know that we can unleash the full potential of our Deutsche Bank.\nWith best wishes to you all,\nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}