{
    "url": "https://www.db.com/news/detail/20150713-deutsche-bank-launches-servicing-solution-for-hybrid-funds?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 13, 2015",
    "tags": [
        "Asset Management",
        "Company",
        "Corporate products"
    ],
    "title": "Deutsche Bank launches servicing solution for hybrid funds",
    "body": "Deutsche Bank’s Global Transaction Banking (GTB) division has launched an integrated solution for the processing of hybrid funds. The new offering combines Deutsche Bank’s loan administration and fund administration platforms to provide a seamless service for these increasingly popular fund structure. The solution is scalable allowing it to handle large volumes of static as well as transactional data to flow seamlessly between the platforms.\nTim Fitzgerald, Head of Alternative Fund Services in GTB’s Institutional Cash and Securities Services (ICSS) unit at Deutsche Bank said: “As investors, especially institutional investors, continue to increase their appetite for alternative investment funds, hybrid or illiquid asset funds represent a major operational challenge for fund managers. By making the systems speak to each other without resorting to manual intervention, we have created efficiencies in our service model for hybrid funds which translates into actual benefits for our clients such as operational efficiency, risk reduction and enhanced transparency reporting.”\nHybrid funds typically share characteristics of private equity funds such as a closed-end structures and fee and waterfall calculations. They have the flexibility to invest in multiple asset classes and financial instruments similar to hedge funds. However, hybrid funds present a challenge for fund administrators, particularly as they invest in illiquid asset classes such as structured credit or private debt. These complex structures require an advanced operating model to manage and administer the funds efficiently.\nInvestment managers therefore expect a highly integrated, scalable solution which supports loan administration investment portfolio accounting for illiquid asset classes, complex fund structure accounting and closed-end partnership accounting. In addition, they are demanding transparency reporting including multi-layer look-through performance reporting from investor to underlying securities. Deutsche Bank’s end-to-end service delivers a comprehensive suite of reports at investor, fund and portfolio level with full visibility of the underlying investment and its performance. Fund managers can access their report via the Bank’s online platform “Autobahn” and the respective App.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}