{
    "url": "https://www.db.com/news/detail/20150709-deutsche-asset-und-wealth-management-supports-green-climate-fund?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 9, 2015",
    "tags": [
        "Sustainability"
    ],
    "title": "Supporting the Green Climate Fund",
    "body": "The group is highly committed to the Green Climate Fund’s (GCF) goal to promote and finance a paradigm shift towards a low-emission economy and climate resilient development pathways.\nDeutsche Bank's potential to support the GCF in reaching its objectives builds on a successful track record of managing innovative public-private investment vehicles for climate change mitigation and adaptation, including in emerging economies and developing countries, such as the Green for Growth Fund, the European Energy Efficiency Fund or the Africa Agriculture and Trade Investment Fund.\nDeutsche Bank has also co-led several green bond issues and is active in renewable energy finance globally.\nThe Green Climate Fund was established by 194 governments within the United Nations Framework Convention on Climate Change (UFCCC)’s Conference of the Parties under the financial mechanism of the Convention to serve as the central global investment vehicle to combat the effects of climate change.\nIt has the mandate to bring together public and private funds to implement international climate financing for adaptation and mitigation practices related to greenhouse gas emissions in developing countries. Total pledges made to the Green Climate Fund to date account for about USD 10 billion equivalent.\n\"We are honored that the GCF Board selected our bank and Asset Management division as its inaugural commercial institution to accredit. We look forward to contributing to GCF's objectives. We are determined to have the right capabilities in structuring innovative public-private climate finance solutions,\" said Michele Faissola, Head of Asset Management.",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 2
}