{
    "url": "https://www.db.com/news/detail/20150701-message-from-john-cryan-to-employees?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 1, 2015",
    "tags": [
        "Company",
        "Management & Leadership",
        "Strategy"
    ],
    "title": "Message from John Cryan to employees",
    "body": "Dear colleagues,\nToday marks my first day as Co-Chief Executive Officer of Deutsche Bank. I am honoured to lead this institution and to call myself your colleague and a “Deutsche Banker”. I very much look forward to the task ahead and to playing my role in helping to lead the bank to success. And I hope to be able to meet as many of you in person as possible in the coming months.\nChallenges\nIn my two years on the Supervisory Board, I have come to recognise that we possess many deep client relationships, skilled and committed employees, a strong brand, cultural diversity, and clear leadership in our home market with strength in many others.\nAt the same time, you will know that our bank faces several tough challenges today. I feel it is only right to be direct and honest with you about these matters if we are to solve them.\nFirst, our reputation has been damaged by instances of serious misconduct. Consequent heavy fines have strained our capital resources and will likely continue to do so for some time to come. Our relationships with our regulators need to be reset. Our recent efforts to impose the highest standards of behaviour across the bank have had the unwanted effect of rendering our decision-making slow and cumbersome. We have become inward-looking and bureaucratic. Our confidence to engage with the outside world has been dented.\nJürgen and I are committed to resolving these matters as expeditiously as possible and to ensuring that we act on the lessons of what went wrong. No one can promise that we will never again make a mistake, but I can tell you that we will decisively identify problems, apply fixes and hold accountable those who misbehave.\nSecond, our current financial performance does not reflect our tremendous potential. We have allowed ourselves to become too inefficient. Our cost base is swollen by poor and ineffective processes, antiquated and inadequate technology, too many tasks being completed using manual labour, and, too frequently, unsuccessful investments in our infrastructure. Too much of our hard-earned revenues are used up this way.\nThird, we are too diversified and too complex for our own good. We must simplify our business model, break down internal barriers and instil a culture of co-operation. This is at the heart of Strategy 2020. We will narrow the scope of our activities. We do not have to be all things to all people. Where we encounter marginal business opportunities or businesses with poor prospects or business lines that are not controlled to the standards we demand, we will exit them, even if this means closing them down.\nFourth, we must re-engineer our internal processes. We must standardise our systems and procedures, decommission legacy software, standardise and enhance our data, and improve our reporting. We absolutely must wean ourselves off the proliferation of committees. Of course committees can sometimes play a useful role, but they cannot be used as a substitute for personal accountability.\nA colleague recently told me that it took nine months to interview and hire someone; this can no longer happen. We need to empower our managers and encourage them to make decisions. And we need to manage our teams so that we make decisions after careful consideration, ensuring that they are in the best interests of the bank, and taking care that they are properly documented and implemented.\nWhen we devolve more of our decision-making to our business divisions, infrastructure functions and regions, this must come with a commensurate devolution of accountability and responsibility. We will not, however, compromise on standards of behaviour, which are to be the highest achievable at all times. Incentives will be set to ensure that, although we will remain results orientated, the “how” is more important than the “how much”.\nStrategy\nOne fundamental certainty that we now possess is agreement on the six broad decisions taken as part of Strategy 2020. Those decisions were taken by the Management Board and unanimously supported by the Supervisory Board. We remain committed to them.\nAs a new Co-CEO marking my first day in the role, I believe it right to take the summer and early autumn to decide how to best execute those decisions. We will therefore update the market with further details by the end of October.\nThe way forward\nThis may sound like a rather sombre introduction, but I am optimistic. With the right tools to measure, manage and control our performance and behaviour, we can unleash the full potential of the organisation. We have an unrivalled position in Germany, Europe’s largest economy, and we can and should play a greater role there. We also have first-rate international businesses in transaction banking which will be the continued focus of investment.\nLikewise, we will continue to invest in our retail and business banking, asset and wealth management and investment banking businesses. No longer, however, can our securities and derivatives trading businesses be so heavily reliant on long-term balance sheet usage. We cannot afford that luxury. Furthermore, reducing this reliance should not place us at a competitive disadvantage as the market has anyway already moved in that direction. We can free up capacity for growth by managing existing positions more actively, and not just those in our Non-Core Operations Unit.\nWe have already announced a corporate transaction relating to Deutsche Postbank and we will execute it as expeditiously and effectively as possible. Although sad to see them go, we will be warmly wishing those of our colleagues who will be departing the bank the very best of luck for a prosperous and successful independent future.\nOne of my personal objectives is to improve internal communication. To start with, I want what the Management Board has to say to be said directly to you. I would also want our communication to be two way. It is important to receive your feedback as to what you think we are doing well and what you think we need to improve. Without a comprehensive appreciation of relevant facts and views, management cannot make consistently good decisions.\nIn closing, I want to thank all of you for the loyalty, dedication and commitment you have shown the bank through the recent difficult times. I also want to thank Anshu for his enormous contribution to Deutsche Bank over almost two decades. To many of you, he was not only a leader, but a founder of your business.\nI am not going to tell you that all will be sweetness and light in the coming months. There will be ups and downs.\nWhat I can tell you, though, is that Jürgen and I, together with the rest of the Management Board, will work tirelessly and unstintingly to return Deutsche Bank to where it should be: at the heart of German society and its economy, and a leading global bank in the provision of financial services to institutional and corporate clients.\nTo execute our strategy successfully, we all need to work together. I hope we can all count on your support.\nWith best wishes to you all,\nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}