{
    "url": "https://www.db.com/news/detail/20160630-the-euro-zone-s-brexit-risk-handelsblatt-interview-with-david-folkerts-landau?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 30, 2016",
    "tags": [
        "Company",
        "Research"
    ],
    "title": "The euro zone's Brexit risk",
    "body": "The referendum has plunged the markets into chaos and created a great deal of uncertainty because no one knows exactly when the British government will invoke Article 50 and start exit negotiations. How much damage will this uncertainty cause?\nThe reason for the uncertainty isn’t just the fact that we don’t know when the exit talks will begin. There are a whole series of other factors that add to the uncertainty – especially the fact that most of the observers in the financial markets expected a completely different outcome. Added to that is that we don’t know how the European Union is going to react in the exit talks.\nAll that combined explains the turbulence. People considering investing at the moment in Great Britain to expand their company or buy a house will wait. That’s why we will soon see an impact on the economy.\nIs a recession in the third quarter conceivable?\nNo, but it could be the case at the beginning of the coming year. Even then, however, it is only likely to last a short while since the British economy is by and large in good shape.\nMany economists have already lowered their growth forecasts for Britain. What makes you so optimistic that it won’t be all that bad?\nThe large drop of the pound will make exports cheaper by 10 percent or more. Export trade should profit from that. If Britain remains a globally orientated, liberal and innovative economy, a Brexit won’t put a huge damper on the British economy in the long run.\nHow much depends on the agreement London and Brussels reach for after a Brexit.\nI assume that the European Union and Britain will continue to maintain very close relations – given how much they need each other. I am confident that the talks led by German Chancellor Angela Merkel will be fruitful and amicable. After all, those are grown-up people sitting around the table.\nBut it’s already clear that immigration will be a sticking point. If Britain wants to continue to be part of the single market, the bloc will insist on a certain freedom of movement. By the same token, the agreement will have to reduce migration to Britain so that London can accept it. That’s because the referendum was actually a vote on the issue of immigration.\nBecause many British think that immigration is hurting the country but experts say the opposite?\nYes, the bottom line is that Britain benefits from immigration. But the benefits are being very unevenly distributed. London is a beneficiary of immigration; things look different in rural regions.\nSo the Brexit referendum is the result of the economic inequality in the country?\nThat’s a good question. And I would say, yes, because we simply haven’t yet found a way to spread around the positive effects of globalization and the technological revolution in such a way that everybody benefits. That is a major failing of politics. A very significant cause of social discontent is the growing concentration of income and wealth – and that was made considerably worse by an expansive monetary policy that drove up stocks and property prices. This imbalance must urgently be addressed.\nHow could that be done?\nIt’s not all that easy. The first step would be everybody comprehending the problem. It only superficially has to do with immigration. That serves as a symbol for a globalization that too many people don’t benefit from. Not enough attention has been paid to that for a long time, especially by liberal economists, and that also includes me. We have to have a rethink of this issue.\nYou expect Britain to survive a Brexit relatively unscathed. Does that also apply to the euro zone?\nThe euro zone is in a precarious situation. Although the economy is growing, the growth is very fragile. The last thing the euro zone needs is another uncertainty through the shock of a Brexit. The euro zone is now already dependent on being drip-fed by a central bank whose tools are virtually exhausted. For that reason, the euro zone could suffer more greatly from Brexit than Britain.\nSo what we now need very quickly is an economic development program?\nThat would only help for a short while and not solve the basic problem. The euro zone’s problems lie much deeper and are very complex. The European Union needs sustainable growth, if only to cope with the high government debt. It doesn’t need even more cheap money for that; it needs reforms, for example, to make the labor market more flexible in Italy and in France.\nBut first of all it will have to be about damage control in the matter of Brexit.\nThat would be very important for Europe, since there is a whole series of new trouble spots that can already be seen looming ahead. How will the referendum in Italy on constitutional reform turn out? What will happen in the elections in France and Germany next year?\nShould the European Union make the exit as difficult as possible for Britain to set an example?\nThat would be petty-minded. Naturally, it isn’t in the E.U.’s interest to treat Britain better than a member state after its departure. The British will probably have to accept certain restrictions in the single market. I plead for constructive negotiations that send a positive message – to the markets, the rest of the union and the world. Now it will be seen whether Europe has the nobleness to solve the differences in an exemplary manner.\nWhat if, in turn, the Dutch, the Spanish or the Italians announce a referendum and leave the European Union?\nI don’t think that will happen. Ultimately, it’s a matter of making Europe economically successful again – then many people will also have a positive view of the European Union again. Europe is a tremendous political and economic achievement that the member states can benefit from enormously. We should work at making the bloc attractive again – instead of thinking about how to excommunicate those who have their doubts about it.\n  © Copyright Handelsblatt GmbH. All rights reserved.\nThe interview was conducted by Katharina Slodczyk.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}