{
    "url": "https://www.db.com/news/detail/20160620-deutsche-bank-and-arabesque-partners-launch-new-family-of-environmental-social-and-governance-esg-investment-products?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "June 20, 2016",
    "tags": [
        "Capital markets",
        "Corporate products",
        "Investment Banking",
        "Sustainability"
    ],
    "title": "Deutsche Bank and Arabesque Partners Launch New Family of Environmental, Social and Governance (ESG) Investment Products",
    "body": "Deutsche Bank and Arabesque Partners today announced the launch of a new family of investment products that apply a proven quantitative stock selection mechanism to environmental, social and governance (ESG) investing.\nThe products will track the returns of the Arabesque Prime and Systematic indices which are designed and operated by Arabesque.\nThese indices mimic in a systematic transparent manner the trading strategies employed by Arabesque for their ESG-funds.\nArabesque is the world’s first specialist ESG Quant asset management firm. The name “Arabesque” describes geometric art built with mathematical equations. The firm’s investment technology processes over 100 billion data points to select an investment universe of global stocks that deliver superior returns, integrating ESG data with quantitative investment strategies. Based in Frankfurt and London, Arabesque’s mission is to make sustainable investing attractive and available to all investors.\nThe firm screens thousands of stocks to identify around 1000 companies which comply with its corporate responsibility guidelines and demonstrate strong environmental, social and governance performance.\nIt then applies a range of other non-ESG filters to these companies to identify which companies score highly on other criteria such as financial stability, earnings momentum and market sentiment.\nDeutsche Bank is partnering with Arabesque as it is the leading specialist firm that fits the bank’s requirements: strong ESG-framework, quantitative focus, and a flexible offering.\nSean Flanagan, Head of Equities & Hybrids Structuring Europe at Deutsche Bank, said: “The aim of the partnership is to allow investors to invest in a sustainable way without having to sacrifice return performance. There is a widespread assumption that sustainability comes at a cost, which is a reduced rate of return. But Arabesque’s combination of environmental, social, and governance selection criteria and performance has challenged that assumption.”\n“Deutsche Bank has seen a strong increase in demand for ESG based products over recent years. We see the cooperation with Arabesque as a crucial step to develop our ESG-footprint and continue building our ESG platform. The topic will keep growing in relevance and Deutsche Bank wants to play an active role in this development.”\nOmar Selim, Chief Executive Officer at Arabesque Partners, said: “The integration of non-financial information into the investment process is fast becoming a global trend and today, people care more than ever before about precisely how financial return is generated. This trend is gathering momentum: 5,336 companies published a sustainability report in 2014, up from 294 in 2004 ¹. Investors can now clearly see that ESG and financial performance go hand in hand.”\nAndreas Feiner, Head of ESG Research and Advisory at Arabesque Partners stated: “ESG-based investing is one of the most significant trends in financial markets for decades. Over time, it will not be a question of whether investors will integrate ESG information in their portfolio selection but moreover when, how and with whom.”\n¹ GRI – sustainability goals and targets disclosure database\n\nFor further information please contact:\nDeutsche Bank AG\nPress & Media Relations\nDr. Axel Lüdeke\nPhone: +49 (69) 910 41750\nE-mail: axel.luedeke@db.com\nCharlie Olivier\nPhone: +44 (0) 20 754 57866\nE-mail: charlie.olivier@db.com\n\nArabesque Partners\nPress & Media Relations\nCiaran McCale\nPhone: +44 (0) 7917 700 770\nE-mail: ciaran@pha-media.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}