{
    "url": "https://www.db.com/news/detail/20160615-startsocial-winners-recognized-in-the-federal-chancellery-berlin?language_id=1",
    "language": "DE",
    "article_type": "Event",
    "publish_date": "June 15, 2016",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "startsocial winners recognized in the Federal Chancellery",
    "body": "The award ceremony in the Federal Chancellery on June 15, 2016 was the highlight of this year´s startsocial competition. Seven prizewinners received special recognition among the 25 finalists, who attended the event. Along with their coaches and representatives of the supporting partners in the Federal Chancellery.\n\n© startsocial / Thomas Effinger\nThe guests of the startsocial award ceremony with German Chancellor Dr. Angela Merkel in the Federal Chancellery, Berlin on June 15, 2016.\nHEIMATSUCHER e.V. received this year´s special prize of the Chancellor. The initiative makes history tangible to students by inviting Holocaust survivors to talk about their experience. Christian Sewing, member of Deutsche Bank´s Management Board highlighted the importance of social equality when he introduced Inklusion muss laut sein (Inclusion Has to Be Loud), a project that steps in for the rights of disabled people and promotes accessibility of cultural events.\nDeutsche Bank has been a main partner of startsocial since 2012. More than 250 Deutschbankers have already supported the competition as jurors or coaches. Under the Made for Good umbrella, Deutsche Bank´s enterprise programme for social good, the Bank also partners with many other initiatives that were startsocial finalists. Among them are Start with a Friend (national prizewinner) and Beyond your plate (finalist) who support the Bank in implementing its 1,000 Deutschbankers as integration coaches pledge.\nKoblenz learns, Mobile Savior and World Journey Through the Living Room were recognized as Landmarks in the Land of Ideas and last year´s champion CLIMB has recently received a non-repayable grant of 25,000 Euros in the first pitch of the newly set up impact fund in the Social Impact Lab Frankfurt.\nCongratulations to all winners and finalists!\nDeaf people enjoying concerts. Blind people who like to go to the movies. Wheelchair users attending festivals. All this should be commonplace in Germany.\nChristian Sewing, member of Deutsche Bank´s Management Board",
    "number_of_ratings": 8,
    "rating": 3.9,
    "likes": 1
}