{
    "url": "https://www.db.com/news/detail/20160609-deutsche-bank-s-chief-economist-is-asking-the-ecb-to-change-course?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 9, 2016",
    "tags": [
        "Company",
        "Corporate Citizenship",
        "Investment Banking",
        "Research"
    ],
    "title": "Deutsche Bank's Chief Economist is asking the ECB to change course",
    "body": "The ECB recently held its key rates at record lows and expanded its bond purchases. This week, the central bank started to buy corporate debt for the first time. According to Deutsche Bank’s economists, this extremely expansive monetary policy has hardly improved the economic situation in Europe so far. Instead, negative side effects have started to prevail: \"The ECB's policy causes misallocations in the real economy. Savers lose, while stock and apartment owners rejoice,\" Folkerts-Landau said.\nIn light of this, Deutsche Bank’s Chief Economist is asking the ECB to change course. The expected increase in headline inflation to above one per cent in the first quarter of 2017 should provide the opportunity to signal a change. Though it is difficult for a central bank to turn things around abruptly, said Folkerts-Landau. Higher deposit rates for funds deposited with the ECB, however, could be a first step towards normalisation. Currently, the central bank charges such deposits with a negative interest rate of 0.4 percent.\nIf the course of the central bank and European governments does not change, Folkerts-Landau does not necessarily expect Europe to crash into a new economic crisis. However, he fears that low growth rates, high unemployment and burdens for savers could increase political risks. Anti-European parties are already on the rise in many countries. This forecast was gloomy, admitted Folkerts-Landau: \"If I ever wished to be wrong, then it is in this case.\"\n  Contact\nSebastian Jost\nSebastian.Jost@db.com\nRalf Drescher\nRalf.Drescher@db.com\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}