{
    "url": "https://www.db.com/news/detail/20150727-deutsche-bank-signs-international-syndicated-loan-facility-with-africell-holdings-limited?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "July 27, 2015",
    "tags": [
        "Africa",
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Deutsche Bank signs international syndicated loan facility with Africell Holdings Limited",
    "body": "Deutsche Bank announced today that it has signed an international syndicated loan facility with Africell Holdings Limited (“Africell”) for USD 150,000,000 to finance the development and expansion of Africell Group in the Democratic Republic of Congo and Uganda.\nDeutsche Bank was appointed the Initial Mandated Lead Arranger, Bookrunner and Facility Agent to arrange the financing. The facility was signed on the 16th July 2015 and successfully closed primary syndication with an oversubscribed order book. The final size of the facility was maintained at USD 150,000,000. This transaction reflects Deutsche Bank’s strong distribution platform in challenging market conditions.\n“Africell is at the forefront of the mobile expansion in Africa and aims to become one of the leading telecom players in the continent”, said Ziad Dalloul, Africell’s Chairman and CEO. “Our partnership with Deutsche Bank and the syndicate members is another milestone in Africell’s endeavor to expand its reach and to further its social and development role in the markets it operates.”\nPeter Wharton-Hood, Chief Country Officer of Deutsche Bank South Africa commented: ‘We are delighted to sign this facility with Africell and to act as the Initial Mandated Lead Arranger of their inaugural international financing. Africell is a fast-growing company which is committed to providing high quality services to its customers in a socially responsible and impactful manner. This transaction demonstrates Deutsche Bank’s commitment to working with our clients as they grow their presence on the African continent.‘",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 7
}