{
    "url": "https://www.db.com/news/detail/20150722-caio-koch-weser-presents-new-climate-economy-report-findings-in-israel?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 22, 2015",
    "tags": [
        "Sustainability"
    ],
    "title": "Caio Koch-Weser presents New Climate Economy report findings in Israel",
    "body": "The governments of Israel and Germany recently held a conference on sustainable development and innovation to celebrate the 50th anniversary of diplomatic relations between the two countries. Vice Chairman Caio Koch-Weser was invited to address the conference in his capacity as a member of the Global Commission on the Economy and Climate.\nPlay\nVideo\nAt the conference, German Federal Environment Minister Barbara Hendricks underlined the economic opportunities that go hand in hand with climate action, particularly in an innovative country like Israel. She noted that Germany has reduced its greenhouse gas emissions by 27 percent since 1990, while in the same period the German economy grew by 39 percent.\nCaio Koch-Weser, Vice Chairman Deutsche Bank: \"This shows that economic growth can be decoupled from emissions. In fact, in the 21st century, climate action is a prerequisite for competitive and forward-looking economic activity – and hence for sustainable prosperity.\"\nIn his speech, Caio Koch-Weser addressed this topic as well and reviewed the findings of the New Climate Economy report “Better Growth, Better Climate” published in 2014: Over the next 15 years, USD 90 trillion will be invested globally in energy systems, cities and land use sectors. The nature of these investments will affect the strength of economic growth and society’s ability to avoid dangerous climate change.\nVice Chairman Caio Koch-Weser: “Sustainability and innovation are essential ingredients for future prosperity and the well being of society”.\nEconomic growth and reducing carbon emissions go hand in hand\nKoch-Weser’s remarks also focused on the emerging trends which are showing that economic growth and reducing carbon emissions can be achieved together:\nFirst, the rapid growth and technological progress of clean energy technologies such as solar PV is increasingly cost competitive with fossil fuels, as Deutsche Bank research has confirmed.\nSecond, countries like Mexico, Indonesia and India are reforming their fossil fuel subsidy systems and more countries and jurisdictions are adopting carbon pricing policies.\nThird, there is growing interest in infrastructure investment and finance to address the tremendous deficit in infrastructure spending and to create investment opportunities.\nFourth, China’s efforts to structurally transform their economy towards an ‘ecological civilization’ has profound implications for the rest of the world and as an example to other developing countries.\nFifth, companies are increasingly integrating sustainability into their business and investment strategies and this has helped the global market for low-carbon and environmental goods and services to reach USD 5.5 trillion in 2012.\nFinally, central banks, financial regulators and financial institutions are increasingly examining the risks and opportunities of the low carbon economic transition. For instance, some regulators are starting to examine potential fossil fuel asset stranding risk, are encouraging disclosure of sustainability data and requiring environmental risk assessment of transactions and growing numbers of investors are examining sustainability risks and responsible investment opportunities.\nThe G20 request to the Financial Stability Board to examine climate change is particularly notable.\nKey recommendations from the New Climate Economy report 2015\nThe New Climate Economy initiative recently published another New Climate Economy report called “Seizing the Global Opportunity” on these trends and suggested key international actions to accelerate the low-carbon transformation and to achieve a credible inter-governmental agreement on climate change at the Paris Summit in December.\nThe recommendations would bring significant economic benefits and help achieve 59-96% of the needed emission reductions by 2030.",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 2
}