{
    "url": "https://www.db.com/news/detail/20190228-deutsche-bank-publishes-2019-srep-requirements?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "February 28, 2019",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank publishes 2019 SREP requirements",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) has been informed by the European Central Bank (ECB) of its decision regarding prudential capital requirements to be maintained from 1 March 2019 onwards, following the 2018 Supervisory Review and Evaluation Process (SREP). The ECB’s decision requires Deutsche Bank, on a consolidated basis, to maintain a Common Equity Tier 1 (CET 1) capital ratio of at least 11.82%.\nThis CET 1 capital requirement comprises: the minimum Pillar 1 requirement of 4.50%; the unchanged Pillar 2 requirement of 2.75%; the capital conservation buffer of 2.50%; the countercyclical buffer of 0.07% as at year end 2018; and the requirement arising from Deutsche Bank’s designation as a Global Systemically Important Bank or G-SIB of 2.00%.\nThe CET 1 capital ratio requirement of 11.82% for 2019 is above Deutsche Bank’s 2018 SREP requirement of 10.69%. The increase is entirely attributable to the final step of the four-year phase-in of the capital conservation buffer (62.5 basis points per year) and the G-SIB buffer (50 basis points per year) which became fully effective on 1 January 2019.\nThis requirement sets the level below which Deutsche Bank would be required to calculate a Maximum Distributable Amount (MDA). The MDA is used to determine restrictions on distributions in the form of dividends on CET 1 capital, new variable remuneration and coupon payments to holders of Additional Tier 1 instruments.\nOther capital definitions\nThe ECB has also set new minimum requirements for other capital definitions. Corresponding 2019 requirements are set for Deutsche Bank’s Tier 1 capital ratio (13.32%) and Total capital ratio (15.32%). All requirements are articulated on a phase-in basis. In comparison, Deutsche Bank’s last reported consolidated capital ratios on a phase-in basis were 13.55% CET 1 capital ratio, 15.72% Tier 1 capital ratio and 17.49% Total capital ratio, all preliminary as of 31 December 2018.\nFor further information please contact:\nDeutsche Bank AG   \nMedia Relations\n\nChristian Streckert\nPhone: +49 69 910 38079\nEmail: christian.streckert@db.com    Investor Relations\n\n+49 800 910 8000 (Frankfurt)\n+44 20 7541 4100 (London)\ndb.ir@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}