{
    "url": "https://www.db.com/news/detail/20190219-deutsche-bank-expects-bond-inclusion-to-boost-investment-into-china?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 19, 2019",
    "tags": [
        "Capital markets",
        "Investment Banking"
    ],
    "title": "Deutsche Bank expects bond inclusion to boost investment into China",
    "body": "Deutsche Bank China strategist Linan Liu forecasts up to USD 850 billion of inflows into the China bond market over the next five years and a deepening of financial integration between China and the global financial market\nFollowing the landmark decision to include Chinese government bonds and policy bank bonds denominated in renminbi in the Bloomberg-Barclays Global Composite Index from April 2019, as reported by Bloomberg, Deutsche Bank China strategist Linan Liu sees good opportunities for global investors to invest in China's RMB 86 trillion market.\nLiu expects steady investment flows into the China bond market of USD 120 billion over the next 20 months, including an estimated USD 48 billion before the end of 2019. “We forecast USD 750-850 billion of bond inflows over the next five years,” adds Liu.\nOver the past decade, RMB bonds have evolved into an emerging global asset class, supported by domestic financial liberalisation.\n“China's RMB bond index inclusion, along with A-share index inclusion, is a step towards deepening the financial integration between China and the global financial market.”\nLiu suggests that the success of China's financial reforms rests on how open China's financial sector is. “we believe the financial sector opening up is the most critical reform in that, by introducing global competition, it: drives domestic financial market development, drives domestic financial institutions' global competitiveness, encourages robustness in China's domestic financial system, and ultimately improves the efficiency of China's financial system, which supports the country's economic sustainability and RMB internationalisation.”",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 0
}