{
    "url": "https://www.db.com/news/detail/20190211-deutsche-bank-contributes-to-building-major-infrastructure-across-ghana?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "February 11, 2019",
    "tags": [
        "Africa",
        "Research"
    ],
    "title": "Deutsche Bank contributes to building major infrastructure across Ghana",
    "body": "Alongside the 3rd German African Business Summit 2019, which opens today in Accra, Ghana, Deutsche Bank is proud to announce the closing of three major transactions with the Ministry of Finance (“MOF”).\nSince 2012, Deutsche Bank has arranged over 1.3 billion euros of financing related to infrastructure development in Ghana and each of the three transactions announced today will continue to support this critical development here.\nSimon Sayer, Deutsche Bank’s Global Head of Structure Trade & Export Finance (“STEF”) said: “We have a proud history in supporting infrastructure development across the African continent. Today, utilizing our market leading structuring and arranging capabilities, we have once again shown our ability to provide unique, cost effective solutions for our key clients.”\nHe added, “We are excited about the positive impact these transactions will have to help support economic growth and development here.”\nTransaction Details\nThe first transaction, a 92 million euro financing package, relates to a contract between Contracta Construction UK Limited and the Ministry of Local Government and Rural Development in Ghana for the construction of a new phase of the Kumasi Market development, for which Deutsche Bank was the sole mandated lead arranger and sole bank lender.\nThe second, a 25 million euro financing package, relates to a contract between Ellipse Projects SAS France (UK) Limited and the Ministry of Health for the completion and equipping of the Bekwai District Hospital. Deutsche Bank was mandated by the MOF as sole lead arranger, agent and lender.\nThe third transaction, of which Deutsche Bank acted as sole structuring bank and as sole lender on the financing package, relates to a social infrastructure development. Dubbed the “the 4 hospitals project”, the combined 45 million euro financing agreement is dedicated to the financing of a supply contract between Contracta Costruzioni Italia Srl and Ghana’s Ministry of Health for the modernization and equipping of selected existing health facilities in Ghana including the Tetteh Quarshie Memorial Hospital, Kibi District Hospital, Aburi Hospital and Atibie Hospital.\nThe transaction follows the Italian Export Credit Agency “SACE” financing arranged in 2017 relating to the construction of the University of Environmental and Social Development in the Somaya region of Ghana. It confirms how social infrastructure is high on the agenda of the government of Ghana in the context of Ghana’s Millennium Development Goals.\nDeutsche Bank in Africa\nSince opening a representative office in Cairo in 1959, Deutsche Bank has strongly contributed to financing the development of infrastructure across the African continent. The bank uses its expertise in structuring and arranging financing to help countries access the traditional global capital markets and other alternative pools of liquidity.\nDeutsche Bank’s targeted approach in Africa has supported clients to build profitable and sustainable businesses that contribute to positive developmental outcomes in Africa. The bank is committed to supporting sustainable infrastructure projects that can have a positive impact on the region.\nSince 2012, Deutsche Bank has a strong record in Africa supporting sovereign, quasi-sovereign and corporates borrowers in their growth enhancing plans. From Debt Capital Markets to Emerging Market financing and Structured Export Finance, the bank covers a wide range of product, with dedicated expertise helping develop bespoke and unique financing structures.\nFor further information, please contact:\nDeutsche Bank AG\nMedia Relations\nStuart Haslam\nPhone: +971 (0) 4 4283 860\nMobile: +971 (0) 56 1993 599\nE-Mail: stuart.haslam@db.com\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nDisclaimers and disclosures\nDeutsche Bank AG, Dubai (DIFC) Branch is a branch of Deutsche Bank AG located and registered in the Dubai International Financial Centre (DIFC) in the Emirate of Dubai, United Arab Emirates, with registered no. 00062. Principal place of business in the DIFC: Dubai International Financial Centre, Gate Village, Building 5, PO Box 504902, Dubai, United Arab Emirates. Deutsche Bank AG, Dubai (DIFC) Branch is regulated by the Dubai Financial Services Authority (“DFSA”) and is authorized to provide Financial Services to Professional Clients only, as defined by the DFSA.\nForward-looking statements\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 16 March 2018 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}