{
    "url": "https://www.db.com/news/detail/20190207-deutsche-bank-transforms-global-collateral-management-with-cloudmargin-platform?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "LONDON, February 7, 2019",
    "tags": [
        "Corporate products",
        "Digitalisation",
        "Private products",
        "Research"
    ],
    "title": "Deutsche Bank transforms global collateral management with CloudMargin platform",
    "body": "CloudMargin, the award-winning creator of the world’s first and only collateral and margin management solution native to the cloud, and Deutsche Bank, Germany’s leading bank, announced today that, as part of its global transformation programme, the bank is working with CloudMargin to integrate the CloudMargin platform into its Collateral infrastructure. In addition to cost savings, the move is expected to improve the client experience by creating a networked solution for Deutsche Bank’s collateral management, resulting in additional transparency, reduced operational risk and simpler processes.\nJoseph Macdonald, Global Head of Collateral Optimisation Trading for Deutsche Bank, said: “Moving our collateral and margin management on to an online platform means that we and our clients will enjoy a reduction in risk and resource-draining emails and calls. This is believed to be the first time a Tier 1 bank will use a public cloud-based service for a critical piece of infrastructure, such as managing margin calls with its own counterparties. For our clients, this will make for an intuitive online user experience on the platform. The movement of our collateral management programme to CloudMargin is also in line with a number of the bank’s goals: enhancing our client service, being technology-led and improving efficiency. The cloud platform will give us a cost-effective means of servicing our clients, regardless of their size.”\nThe transition to CloudMargin’s cloud-based platform means that Deutsche Bank and its clients will benefit from access to the same information about the obligations and required actions for their cleared and non-cleared over-the-counter (OTC) transactions. This transparency will significantly reduce manual intervention and eliminate discrepancies that would otherwise take time and resources to resolve. CloudMargin clients are automatically connected to an online hub with a community of upstream and downstream partners who add further efficiencies and straight-through processing opportunities.\nCloudMargin CEO Steve Husk said: “We’re delighted to team up with Deutsche Bank on this initiative to manage not only its global collateral needs but those of its clients of all sizes trading a broad range of instruments. Deutsche Bank interacts with virtually every other major bank as a counterparty, and its clients range from the world’s largest institutions to smaller buy-side market participants. Our solution enables the sell-side institution to provide the same high-quality service, efficiencies and transparency to everyone while achieving significant internal cost savings and operational improvements to these systemically important processes.”\nCloudMargin has committed to delivering a number of system enhancements to facilitate the implementation of the solution within Deutsche Bank in time for the planned launch of Phase 1. As is the case with other improvements the company makes, CloudMargin clients will all benefit from the enhancements at no extra cost.\nHusk said that with Deutsche Bank on the platform, CloudMargin can easily onboard anyone doing business with the firm.\nContacts:\nFor CloudMargin:\nEllen G. Resnick\nCrystal Clear Communications\n+1 773-929-9292; +1 312-399-9295 (mobile)\neresnick@crystalclearPR.com\nFor Deutsche Bank:\nJo Court\n+44 207 545 5459; +44 (0) 7879 272651 (mobile)\njoanne.court@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}