{
    "url": "https://www.db.com/news/detail/20190207-deutsche-bank-staff-member-honoured-for-role-in-building-angola-s-infrastructure?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 7, 2019",
    "tags": [
        "Awards",
        "Company",
        "Research"
    ],
    "title": "Deutsche Bank staff member honoured for role in building Angola's infrastructure",
    "body": "Ignacio Ramiro, Head of Structured Trade & Export Finance (STEF) in Spain, has been awarded the Cross of the Order of Civil Merit (Cruz de la Orden del Mérito Civil), granted by the King of Spain following the proposal of the Minister of Foreign Affairs.\nThe recognition highlights the positive impact Ignacio’s work on behalf of Deutsche Bank has had in supporting Spanish companies abroad with structured financing solutions, particularly companies that have carried out infrastructure projects in Angola.\nIgnacio Ramiro (l.) receives the award from Manuel Hernández Ruigómez (r.), Spanish Ambassador to Angola\n  Since the end of Angola’s civil war in 2002 Ignacio and the STEF team have been involved in more than 150 projects financing infrastructure for the country, from hospitals, roads, bridges and ports to water treatment plants and telecommunications. Working closely with various teams across the bank, Angola’s Ministry of Finance and other banks, STEF has helped build essential infrastructure worth 3 billion US dollars.\n“This award is the recognition by the state to the work, effort and commitment of Ignacio Ramiro on behalf of Deutsche Bank in Angola,” said Spanish ambassador Manuel Hernández Ruigómez during the act of delivery.\nIgnacio Ramiro said that “we are proud of our role in providing financing solutions that help Spanish companies to be present abroad – and of the positive impact we can see on the ground. This recognition is for all our team and all the colleagues involved across Deutsche Bank, from Loan Operations to Legal, and from Finance to the different coverage groups in the retail and investment bank, to name but a few.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 46
}