{
    "url": "https://www.db.com/news/detail/20190204-deutsche-bank-research-launches-g10-housing-monitor?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 4, 2019",
    "tags": [
        "Research"
    ],
    "title": "Deutsche Bank Research launches G10 Housing Monitor",
    "body": "Deutsche Bank Research FX Strategist Michael Hsueh recently launched the G10 Housing Monitor, a quarterly report designed to provide clients with a collection of residential property market data.\nThe report covers the G10 countries and China, featuring data across four common indicators including prices (average sale prices and benchmark indices where available) and sales volume as indicators of demand, and residential investment and mortgage credit as indicators of momentum in underlying financial liquidity.\n“Besides being an important sector in its own right, the residential property market is a relevant driver for monetary policy and, by extension, foreign exchange markets,” said Hsueh. “For policymakers, housing drives growth expectations through changes in residential investment and construction activity, and potentially through wealth effects on household consumption. Housing has already been a persistent headwind for Canada, and may now be emerging as a concern for China and the US.”\nWhile key findings show early signs of slowing in the US and China, Hsueh emphasized that possible moderating factors to temper the severity of weakness include improved credit quality, tight supply and low foreclosure rates in the US, prior slowing in sales growth and loan growth since 2017 in China and possible Chinese policy loosening in March. A marked slowdown underway in Australia, Sweden and Canada has followed tighter macroprudential measures detailed in the report’s appendix. Australia, for example, has been affected by stamp duty surcharges for foreign purchasers and Canada by stricter mortgage stress tests, compounding the issue of fundamental overvaluation assessed by our team in 2017.\nThe G10 Housing Monitor tells its story through detailed charts and heatmaps that follow market indicators from 2005 to 2018. The heatmaps, for example, use colors ranging from red (hot) and blue (cold) to show values from highest to lowest over the timeline.\n\nContact media.requests@list.db.com for more information.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}