{
    "url": "https://www.db.com/news/detail/20190201-a-message-on-deutsche-bank-s-full-year-results-2018?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 1, 2019",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "A message on Deutsche Bank's full-year results 2018",
    "body": "Christian Sewing, Deutsche Bank CEO, sent out the following message to the bank’s employees on February 1, 2019.\n  Dear Colleagues,\n2018 was a very eventful year. But it was also a productive one.\nLet’s start with the most important news: we increased our pre-tax profit year-on-year and generated our first net profit since 2014. Net income of 341 million euros is nowhere near where we want it to be, but the positive result is a sign that we're on the right track.\nThis was achieved despite a high tax rate of about 75 percent which is due to specific tax items. Without these items our net profit would have been more than 700 million euros.\nWe managed all this despite a far-reaching restructuring programme and a difficult market environment. That’s first and foremost your success.\nOur rigorous discipline and execution capabilities last year were the main reasons for the profit.\nPeople doubted our ability to reduce costs but we proved everyone wrong, beating our target of 23 billion euros. Cost reduction initially weighed on revenues. But we also surprised people in this regard because we succeeded in cutting costs by a greater amount than the fall in revenues – for the first time in quite a while.\nIt is obvious that hard decisions had to be made on this journey. We reduced our workforce by around 6,000 last year. Job losses on this scale hurt; my Management Board colleagues and I are well aware of this. But these decisions were and remain necessary to set Deutsche Bank back on the path to sustainable profitability.\nSo we are in a strong position to start a new phase for Deutsche Bank. 2018 was all about stability, costs and control mechanisms. 2019 will be about retaining our rigorous discipline while boosting revenues: our goal is controlled growth. That is the only way we’ll achieve the 4 percent post-tax return on tangible equity target we set ourselves for the year.\nThe strength of our balance sheet, which has rarely been as robust as it is now, will be helpful. At 13.6 percent our Common Equity Tier 1 (CET1) capital ratio is well above our target of 13 percent. In the fourth quarter, this figure dropped partially because we, as promised, allocated more capital to the business divisions and that led to an increase in our risk-weighted assets. However, doing so will generate additional revenues over time.\nOur generous liquidity reserves of 259 billion euros are also an opportunity.\nWe can increase our revenues merely by taking a different approach to managing our balance sheet and liquidity. We have already started to reduce excess liquidity, for example by buying back our own bonds. And we have started to invest more liquidity in very safe short-term securities. These generate improved returns versus the losses which occur when we park cash at the European Central Bank.\nAnd what’s even more important: there is much more room for growth in our businesses. While Group revenues were lower in the fourth quarter due to market conditions, revenues in Global Transaction Banking and our Private & Commercial Bank actually grew. That is something to build on.\nSo where do we plan on growing this year? Here are a few examples:\nWe expect the positive trend in Global Transaction Banking to continue in 2019. We have a global network that few others can compete with. With our strengths in Cash Management, FX, Credit and Trade Finance, we are the bank of choice for group treasurers and CFOs in the Mittelstand. We need to make much better use of this combination by serving our clients more comprehensively and offering convincing solutions.\nWe remain one of the leading banks for equity and debt origination worldwide. We demonstrated this right from the start of the new year. For instance, we were a bookrunner on a 15.5 billion dollar bond issue for Anheuser-Busch Inbev. Year to date we were a lead bookrunner in seven of the 10 largest bond transactions. While we pulled out of peripheral areas in 2018, we are committed to growing certain areas of our Corporate Finance business in 2019.\nIn our Private & Commercial Bank we are particularly proud that we are seeing renewed growth in the business with Mittelstand clients. Here we gained about 3,000 net new clients last year. Adjusted for disposals, PCB increased overall loan volume in 2018 by 10 billion euros. We intend to continue this trend and also grow consumer lending in 2019.\nWe continue to invest in innovative products. Within the first four weeks following the launch of Apple Pay in Germany, we hit our user target for the whole year.\nWe have high hopes for the new alliances that DWS has forged with insurers Nippon Life and Generali, as well as with the French asset manager Tikehau Capital. In addition, we see great opportunities for sustainable investments (ESG), which are increasingly in demand from our clients.\nThis is by no means an exhaustive list. There are still many areas where we have scope for growth. At the beginning of this year we set up a “Growth Catalyst Council”, which is composed of the entire Management Board and nine senior managers representing key business areas. Please flag any growth ideas to these colleagues.\nWe need your initiative – and your untiring commitment. Day after day, whether you are talking to clients, providing infrastructure support or working in one of the bank’s control functions, our success depends on each and every one of you. Another decisive factor will be how well we work together – as one bank. What I wrote to you in April last year still applies: we will only win as a team. This attitude has made Deutsche Bank strong in the past, and it will make us strong in the future.\nBut we will only enjoy lasting success if we don't compromise on our values, beliefs and rules. Time and again, the headlines concerning events that occurred many years ago demonstrate how important our reputation is.\nI’d like to emphasise one point here: We comprehensively and successfully resolved or made significant progress in resolving our legacy portfolio of litigation and regulatory enforcement matters over the last couple of years and we will also pursue this strategy which includes full cooperation with authorities when it comes to Danske Bank, cum/ex or the Panama Papers. It goes without saying that we will follow up on all indications of possible misconduct. However, the fact is that we currently do not have any such indications of wrongdoing on our part concerning these three matters.\nWe have a lot on our agenda and it needs all of us to be fully dedicated. The majority of observers doubt that we will achieve our 4 percent return on tangible equity target this year. We are sticking to this goal, despite a challenging market environment. After all, most factors are in our hands: lower costs, better balance sheet management, growth in the more stable businesses – here it is up to us to make progress every day and implement our plans.\nOf course, in 2019 we will all have to go the extra mile once again. But the destination is worth it. We are working for a great institution with a unique heritage and outstanding colleagues. We have a strong balance sheet. We have a good market position in our core businesses. And above all we have stable, longstanding client relationships and a global network we can build on. That’s why we work for Deutsche Bank.\nI’m counting on you.\nBest wishes,\nChristian Sewing",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}