{
    "url": "https://www.db.com/news/detail/20160930-media-reports-on-deutsche-bank-a-message-to-employees-from-john-cryan?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 30, 2016",
    "tags": [
        "Company"
    ],
    "title": "Media reports on Deutsche Bank: a message to employees from John Cryan",
    "body": "Dear Colleagues,\nYou will have seen speculation in the media that a few of our hedge fund clients have reduced some activities with us. That is causing unjustified concerns. We should consider this in the context of the bigger picture: Deutsche Bank overall has more than 20 million clients.\nI understand if you feel concerned by the extensive coverage on this issue. Our bank has become subject to speculation. Ongoing rumours are causing significant swings in our stock price.\nIt is our task now to prevent distorted perception from further interrupting our daily business. Trust is the foundation of banking. Some forces in the markets are currently trying to damage this trust.\nDeutsche Bank has strong fundamentals. Let me mention some of the most important facts at this point:\nWe fulfil all current capital requirements and our restructuring is well on track. We completed the disposal of the British insurer Abbey Life this week and the sale of our stake in the Chinese Hua Xia Bank will be finalised soon. This will further improve our capital ratio.\nWe have significantly decreased our market and credit risk in recent years. At no point in the last two decades has the balance sheet of Deutsche Bank been as stable as it is today.\nDespite low interest rates and a difficult environment we posted a pre-tax profit of about 1 billion euros in the first half of 2016. Before extraordinary items like restructuring costs, we earned about 1.7 billion euros. This demonstrates the operating strength of Deutsche Bank.\nIn a situation like this, the most important factor is our liquidity reserves. Currently they still amount to more than 215 billion euros. This is an extremely comfortable buffer. This is clear proof of how conservatively we have planned. This is acknowledged by numerous banking analysts.\nThere is therefore no basis for this speculation. Nor can uncertainty about the outcome of our litigation cases in the US explain this pressure on our stock price, if we take the settlements of our peers as a benchmark.\nYou have all done a tremendous job over the past few days. You are the ones who are in constant contact with our clients and making it clear how Deutsche Bank is really doing. You are Deutsche Bank – that is impressively clear. All of us in the Management Board highly appreciate it.\nYou will hear back from me soon. Please keep working as you have been doing so far. We are and we remain a strong Deutsche Bank.\n\nYours sincerely,\nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}