{
    "url": "https://www.db.com/news/detail/20160929-deutsche-bank-opens-digital-factory-in-frankfurt?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 29, 2016",
    "tags": [
        "Company",
        "Digitalisation",
        "Entrepreneurship",
        "Research"
    ],
    "title": "Deutsche Bank opens Digital Factory in Frankfurt",
    "body": "Deutsche Bank now has its own centre for developing digital banking products: the Digital Factory in Frankfurt. Around 400 software developers, IT specialists and financial experts from 14 nations are working together to develop digital products using state-of-the-art methods. FinTechs have been on board from the outset, with 50 additional workstations available to tech startups from the finance sector.\nDeutsche Bank will continue to invest in the Digital Factory, increasing headcount to 800 by 2018. To ensure the bank's leading position in the competition for ideas and new technologies, it has teamed up with the US-based Massachusetts Institute of Technology (MIT), one of the world's top universities. This collaboration was announced by Deutsche Bank at the Digital Factory's official opening ceremony.\nIn his speech, Christian Sewing, member of the Management Board of Deutsche Bank and Head of its Private, Wealth & Commercial Clients Corporate Division (PW&CC), highlighted the importance of investment in research and development for the banking industry.\n\"Today's opening of the Digital Factory is a further milestone on Deutsche Bank's journey to become a technology company. We don't want to be driven by digitalisation; we want to be in the driver's seat. The number of successful players in the banking industry will fall. Only the fastest among them will gain market share,\" said Sewing. The bank's branches will continue to play a key role in digital innovations.\nSewing added: \"Specialists will join discussions via video link, advisors will discuss client finances with them on their iPads and robo advisors will analyse the capital markets: These are just a few of the digital innovations we aim to use to tangibly increase the quality of our advisory services and raise client satisfaction in the branches.\"\nDeutsche Bank expects the Digital Factory to be a driver in innovation, digitalisation and re-engineering the bank. “The Deutsche Bank Labs discover and evaluate new ideas. At the Digital Factory we translate these ideas into real products and services for our clients. This demonstrates our commitment to invest and digitalise the bank”, says Kim Hammonds, member of the Management Board of Deutsche Bank and Group Chief Operating Officer.\n\"The Digital Factory is the nucleus where we are designing and executing in an agile setting. The focus of our technologists and engineers is on speed and implementation, which means short development cycles. This agile approach is essential in today’s dynamic and fast changing world.\" And to be competitive means attracting the best talent:\n\"The Digital Factory is a place which fosters creativity with all necessary tools at hand to see quick results. That is why talented specialists decide to join us,\" added Hammonds.\n\nSeveral projects in the Digital Factory have already spawned new digital products and services, including the Deutsche Bank Mobile app, the Digital Factory's first project. \"The digitalisation of the private and commercial clients business is on track,\" said Markus Pertlwieser, Chief Digital Officer in Deutsche Bank's Private, Wealth and Commercial Clients division. \"The collaboration with FinTechs is bearing fruit and we are working successfully on additional innovations,\" Pertlwieser went on to say.\nFuture roadmap\nDuring the remainder of 2016 and at the beginning of 2017 customers can expect a whole series of new digital products and services for online banking, mobile devices, and for use in branches:\nThe MultiBanking Finance Manager will provide Deutsche Bank clients with a comprehensive overview of their accounts, cards, securities accounts and loans at virtually all German banks – via tablet, smartphone, laptop or desktop PC\nThe Deutsche Bank Digital Safe (eSafe) will also be launched this year. Clients will be able to use it to store their documents and passwords securely\nAnd soon after the Deutsche Bank Mobile app is launched for Android in November, clients will have access to a mobile payment system. This will allow them to make convenient payments via smartphone while they are on the move, for example\nFrom November 2016 new clients will be able to open an account electronically in just a few minutes and will receive real-time approval for a credit card and an overdraft\nFrom next spring, retail clients will be able to choose between different term deposit offers from other banks in a Deutsche Bank digital marketplace\nBesides products for retail clients, the development of forward-looking technologies also plays an important role for Deutsche Bank. Work is currently underway on specific applications for artificial intelligence, speech recognition and Blockchain technology.\n\nThe presentation is available in the download section.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}