{
    "url": "https://www.db.com/news/detail/20160922-track-and-field-athlete-lisa-mayer-is-made-sport-scholar-of-the-year-2016?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 22, 2016",
    "tags": [
        "Company",
        "Corporate Citizenship",
        "Sports"
    ],
    "title": "Track-and-Field Athlete Lisa Mayer is made \"Sport Scholar of the Year\" 2016",
    "body": "Deutsche Sporthilfe and Deutsche Bank are honouring the student of German, who came fourth at the Olympic Games in the 4x100 metre relay, for her special achievements as an elite athlete student / Deutsche Bank is doubling the winner's scholarship to EUR 800 a month.\nLisa Mayer, who is studying German and came fourth at the Olympic Games in Rio in the 4x100 metre relay, has been made \"Sport Scholar of the Year\" 2016. She was chosen from amongst five finalists in an online vote initiated by Deutsche Bank and Deutsche Sporthilfe and in which thousands of Olympic Games enthusiasts participated.\nLisa Mayer received this award on Thursday, 22 September 2016 from by Deutsche Bank and Deutsche Sporthilfe in Frankfurt. The 20-year-old succeeds Sophia Saller, who received the award last year as the 2014 Junior World Triathlon Champion and maths student at Oxford.\nIn front of approximately 100 guests invited to the prize-giving ceremony, Christian Sewing, of the Management Board of Deutsche Bank, said: \"The five finalists represent the 400 Sporthilfe athletes who receive the Deutsche Bank Sports Scholarship. With the award \"Sport Scholar of the Year\", we want to draw attention to the outstanding achievements of these young athletes. They all juggle studying and top-class sport on a daily basis and achieve brilliant things.\"\nMichael Ilgner, the Chairman of the Management Board of Deutsche Sporthilfe, said: \"This year's award-winner is an outstanding example of how elite athlete students master the heavy double burden of sport and studying. Lisa Mayer has managed to reconcile both in an exemplary manner. The Deutsche Bank Sports Scholarship helps enormously here. We are very grateful to Deutsche Bank that it supports elite athlete students together with us in this particular way.\"\nThis accolade has been awarded since 2013\nDeutsche Bank has been awarding the title of \"Sport Scholar of the Year\" to elite athlete students since 2013. The bank is doubling the winner's current scholarship to EUR 800 a month. The other four finalists will receive additional funding of EUR 200 a month for the same period of time.\nAny of the scholars sponsored by Sporthilfe could apply, citing their accomplishments achieved May 2015 and April 2016. Before the online vote, a jury made up of sports, political, business and media experts chose five athletes out of the 120 applicants.\nLisa Mayer, Carina Bär (Olympic champion in Rio in the quadruple scull and second at the World Championship in 2015), Anna-Lena Forster (Monoskier and World Cup Champion in alpine skiing), Maximilian Hartung (two-time bronze medallist at the 2015 sabre fencing World Championship) and Maximilian Reinelt (silver medallist at the Rio Olympics and the 2015 World Championship with Germany's rowing eight). Portraits of the five athletes can be found at www.sportstipendiat.de.\nPrevious recipients of this award are triathlete and maths student Sophia Saller (2015), long-jumper and politics student Malaika Mihambo (2014) and Olympic hockey champion and medical student Martin Häner (2013).\nDeutsche Bank is the biggest private sponsor.\nDeutsche Bank has been supporting Sporthilfe for around 40 years in many diverse ways. It has been a partner of Sporthilfe since 2001 and has been one of the five \"National Sponsors\" since 2008\". In 2015, the partnership was extended to 2018. This makes Deutsche Bank the biggest private sponsor in the history of Deutsche Sporthilfe.\nIn 2012, it created the Deutsche Bank Sports Scholarship. As a result, the funding provided by Sporthilfe to elite athlete students could initially be doubled to EUR 300 per month. In 2015, the sum was raised to EUR 400 per month. Currently up to 400 Sporthilfe-funded athletes from across 30 sports are benefitting from this programme, which begins in the third semester and extends beyond the standard period of study thanks to a time bonus.\nSince April 2016, Deutsche Bank's international sports commitments have been pooled in the separate division of Art, Culture and Sport (ACS). This new division, led by Thorsten Strauß, pools the Bank's existing know-how and develops it further, in order to offer a bespoke programme not only to customers and employees, but also to the wider public.\n\nFor further information please contact:\nDeutsche Sporthilfe\nJörg Hahn\nPhone: 069/ 67803500\nE-mail: joerg.hahn@sporthilfe.de\nDeutsche Bank\nKlaus Winker\nPhone: 069 / 910 32249\nE-mail: klaus.winker@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}