{
    "url": "https://www.db.com/news/detail/20160919-deutsche-bank-gathers-tech-elite-in-las-vegas?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 19, 2016",
    "tags": [
        "Company",
        "Digitalisation",
        "Research"
    ],
    "title": "Deutsche Bank gathers tech elite in Las Vegas",
    "body": "Deutsche Bank’s focus on technology is two-fold. While the bank itself is focused on taking the traditional banking model and transforming to more of a technology company, our investment banking and research teams are covering the industry and helping clients spot the next big trend.\nJohn Cryan, who welcomed the largest gathering of leading and emerging tech business leaders at this year’s Deutsche Bank Technology Conference, emphasized the bank's desire to reinvent itself and stated “technology is critical to the success of Deutsche Bank.” He highlighted that “one of the critical teams in the US is the technology team, one in which we continue to invest and plan to make more hires.” His message mirrored the bank’s previously announced plans to invest up to EUR 1bn in digital technology to enhance the client experience, harness the power of data and strengthen efficiency and controls.\nThe two-day conference in Las Vegas is one of the largest technology investor forums in the US for companies to discuss technological developments, forward-thinking product trends and business operation updates. Nearly 200 leading public and private companies, over 450 investment professionals and 250 investment firms attended this year. Attendees represented a total of USD 2.4tn in market capitalization.\n“The quality of companies and investors we were able to attract this year is unmatched,” said Mark Keene, Co-Head of Global Technology, Media and Telecom Investment Banking. “Given the pace of deal activity, we need to be at the forefront of innovative ideas. Events like this help us understand what's top of mind at the tech world's leading companies so we can best advise them.”\nWith emerging leaders and notable experts present at the conference, panel discussion topics ranged from augmented and virtual reality technologies, cloud applications, emerging tech in mobile payments, e-Commerce, finternet, online marketplaces and the next generation of security. As in years past, the breadth of participating business leaders and emerging thought leaders further established this event as the premiere industry leading conference.\nAndrea DiMarco, Venture Capital Coverage, US TMT, said: “Our conference continues to be a staple industry event that brings public and private sector investors together with technology leaders across multiple sectors.”\nDeutsche Bank’s technology banking franchise continues to perform well, having led several prominent deals in 2016 include Acacia’s USD 135mn IPO, Softbank's USD 6.6bn mandatory exchangeable on its strategic stake in Alibaba, Apple's USD 12bn bond offering in February, and the bank most recently advised HPE on its acquisition of SGI.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}