{
    "url": "https://www.db.com/news/detail/20220208-deutsche-bank-publishes-2022-srep-requirements?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, February 8, 2022",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank publishes 2022 SREP requirements",
    "body": "Deutsche Bank AG (XETRA: DBKGn.DE / NYSE: DB) has been informed by the European Central Bank (ECB) of its decision regarding prudential capital requirements to be maintained from 1 March 2022 onwards, following the 2021 Supervisory Review and Evaluation Process (SREP). The ECB’s decision requires Deutsche Bank, on a consolidated basis, to maintain an unchanged Pillar 2 requirement (P2R) of 2.50% of which at least 1.41% must be covered by Common Equity Tier 1 (CET 1) capital, and 1.875% by Tier 1 capital.  \nThe ECB’s decision requires Deutsche Bank, on a consolidated basis, to maintain a Common Equity Tier 1 (CET 1) capital ratio of at least 10.43%. This CET 1 capital requirement comprises: the minimum Pillar 1 requirement of 4.50%; the Pillar 2 requirement of 1.41%; the capital conservation buffer of 2.50%; the countercyclical buffer of 0.03% as at year end 2021; and the requirement arising from the maximum of the buffers from Deutsche Bank’s designation as a Global Systemically Important Institution (G-SII) or as an Other Systemically Important Institution (O-SII) of 2.00%.  \nThis requirement sets the level below which Deutsche Bank would be required to calculate a Maximum Distributable Amount (MDA). The MDA is used to determine restrictions on distributions in the form of dividends on CET 1 capital, new variable remuneration and coupon payments to holders of Additional Tier 1 instruments.  \nThe ECB has also set new minimum requirements for other capital definitions. Corresponding 2022 requirements are set for Deutsche Bank’s Tier 1 capital ratio (12.40%) and Total capital ratio (15.03%). In comparison, Deutsche Bank’s last reported consolidated capital ratios on a phase-in basis were 13.23% CET 1 capital ratio, 15.75% Tier 1 capital ratio and 17.84% Total capital ratio, all preliminary as of 31 December 2021.",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 1
}