{
    "url": "https://www.db.com/news/detail/20200731-deutsche-bank-creates-criteria-for-classifying-esg-financing?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 31, 2020",
    "tags": [
        "Sustainability"
    ],
    "title": "Deutsche Bank creates criteria for classifying ESG financing",
    "body": "Deutsche Bank defines comprehensive rules for which financing offers and products can be classified as sustainable\nNew taxonomy creates the basis for the bank to achieve its ambitious sustainability targets in accordance with credible criteria.\nThe bank’s criteria are aligned to the Green Bond Principles and the Social Bond Principles of the International Capital Market Association (ICMA) as well as towards the EU Taxonomy.\nSecond party opinion from Institutional Shareholder Services ESG rates the concept as credible and ambitious\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) will with immediate effect conduct its sustainable finance and sustainable financial product activities in accordance with its Sustainable Finance Framework, published today, which is aligned on a best effort basis to the EU Taxonomy. The Framework creates the basis for the bank to achieve its ambitious sustainability targets in accordance with credible criteria. According to the targets published by the bank in May it plans to increase its volume of sustainable financing and portfolio of ESG (environmental, social, governance) investments under management to over 200 billion euros in total by the end of 2025.\nThe new Sustainable Finance Framework defines a global process and creates Group-wide rules for the criteria which the bank may use in future to classify fixed-income and securities transactions, capital market products and financing offers as sustainable. The Framework stipulates sector-specific thresholds and eligibility criteria, as well as the environmental and social criteria that apply to the due diligence process for sustainable finance.\nFor instance, a financing project may only be classified as sustainable if its proceeds are used solely for a project that fulfils the environmental or social eligibility criteria of the in-house taxonomy and it is then approved by the bank’s Environmental and Social Due Diligence process.\nThe following diagram shows what we can classify as sustainable financing, and why:\nPositive second party opinion from Institutional Shareholder Services ESG\nThe independent consultancy ISS ESG confirmed in a second party opinion that Deutsche Bank’s Framework is consistent with “best market practices” and that its content is aligned with the bank’s existing sustainability criteria. Furthermore, ISS ESG concluded that the standards applied by the Framework to define transactions as sustainable are ambitious and credible. Deutsche Bank “is among the first international banks to explicitly refer to the EU Taxonomy in its group-level sustainability policy”.\nDeutsche Bank CEO Christian Sewing underlined the importance of in-house criteria and processed, saying: “This Sustainable Finance Framework is one precondition for enabling us to become a trailblazer in this area in the financial sector. It helps us provide our clients with the clarity they need and the guidance they require regarding ESG financing and ESG financial products – including their own transformation to a sustainable business model.”\nFramework based on ICMA Principles and EU Taxonomy\nThe new framework is based on the Green Bond Principles and the Social Bond Principles of the International Capital Market Association (ICMA) and follows the latest guidance in the EU Taxonomy developed by the European Union’s Technical Expert Group on Sustainable Finance. Alignment to the EU Taxonomy is currently difficult for financial service providers for several reasons. For example, there is still too little data available in some cases to carry out the complex evaluations required concerning whether a project meets EU standards.\nDeutsche Bank has said that it will continue to work together with other global banks as part of the joint Finance Initiative of the United Nations Environmental Programme's and the European Banking Federation to develop a common approach for implementing the EU Taxonomy.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 7
}