{
    "url": "https://www.db.com/news/detail/20200729-2q2020-results-message-from-ceo-christian-sewing-to-the-staff?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 29, 2020",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "2Q2020 results: Message from CEO Christian Sewing to the staff",
    "body": "Dear Colleagues,\nWhen we announced the transformation of our bank in July 2019, we were expecting the most intensive phase of restructuring to last six quarters, which would take us up to the end of 2020. With four quarters now behind us and more than 75 percent of expected transformation-related costs absorbed, the fruits of all our labour are already starting to show. Our decision to focus Deutsche Bank on its strengths is beginning to pay off.\nWe were profitable not only in the second quarter but also in the first half of 2020 – despite recognising the costs of our restructuring and being in the deepest recession in post-war history. We are continually improving our business performance both on the revenue and the cost side. Adjusted pre-tax profit for our Core Bank has risen by 11 percent to 935 million euros.\nIt is especially pleasing that we were able to grow Core Bank revenues (excluding specific revenue items) by 8 percent year on year to 6.3 billion euros. This means that we are ahead of our internal projections and on track to meet our 2022 revenue plan.\nWhat makes us so confident about this? It’s the positive momentum we're seeing in all four businesses that we decided to invest in.\nOur Corporate Bank grew revenues in the second quarter by 3 percent year on year. We grew loans and transaction volumes, settling 1.6 billion payment transactions for our corporate clients in the first half of the year. That’s 9 percent more than a year ago.\nWe’ve been doing everything we can to support our clients throughout this crisis: in Germany, we played a more active part in the government-backed KfW loan programmes than any other bank, with committed loans of 1.8 billion euros, a pipeline volume of more than 5 billion euros and the arrangement of syndicated loans of 8.5 billion euros.\nIn our Investment Bank, we managed to grow revenues by 52 percent excluding specific items. This was driven by our Fixed Income & Currencies (FIC) business which recorded its second-best quarter since 2015, increasing revenues excluding Financing and specific items by more than 75 percent.\nFinancing revenues recovered strongly from the challenging market conditions in the first quarter of 2020. Our Origination & Advisory business recorded revenue growth of 73 percent in the quarter, on the back of record debt and equity issuances; in the first half of 2020 our market share was considerably higher than in the second half of last year, mainly driven by our debt capital markets business.\nWe are satisfied with the development of our Private Bank in a challenging environment. We made further progress in transforming the Private Bank during the quarter: we completed the legal entity merger of DB PFK AG into Deutsche Bank AG and combined our Wealth Management business and Private & Commercial Business International into one unit, the International Private Bank.\nThese measures are important steps in reaching our revenue plans and cost reduction targets. Our second-quarter revenues obviously suffered from the impact of the coronavirus pandemic and even lower interest rate levels.\nDespite the challenging environment there were positive trends: we granted net new client loans of 3 billion euros in the second quarter and attracted net inflows from investment products of more than 5 billion euros.\nIn our Asset Management business, revenues dropped in the second quarter – primarily due to the absence of biennial performance fees relating to an infrastructure fund recorded in the prior year quarter. On the other hand, our teams at DWS managed to grow business volumes.\nHaving seen low-level outflows in the first quarter, Asset Management recorded net inflows in the second quarter of 9 billion euros. Assets under management increased from 700 billion euros to 745 billion euros.\nAt the same time, the planned asset reduction in our Capital Release Unit and the transformation of our infrastructure functions are running on track. The intended partnership with Google Cloud should be a special step forward. On the one hand, the partnership is about achieving greater efficiency; on the other, it’s about using cutting-edge data analysis methods and artificial intelligence to tap new business areas for our clients and thus new revenue streams.\nWe also see potential for growth in sustainable finance products, which are becoming increasingly important for many of our clients across all our businesses. In the second quarter we set ourselves ambitious targets and issued our first green bond. Now we are working hard to embed sustainability criteria across the bank's entire value chain. With our new Fossil Fuels Policy we have defined which projects we will finance in the oil, gas and coal sector, reflecting climate protection considerations.\nIn light of the many strategic initiatives under way, staying on track on costs is no mean feat. But here, too, we’re fully in line with our plan. We can now look back on the tenth consecutive quarter in which we have successfully reduced our adjusted costs (excluding transformation charges and bank levies) year on year. In total we have realised half of the 6 billion euros in cost savings we are planning by 2022. This progress makes us very confident that we will achieve our cost targets, both for 2020 and for the coming years.\nOur operating strength – with revenues rising and costs dropping significantly – has helped us largely offset the economic impact of the pandemic. And although our credit loss provisions have increased, our balance sheet is even more robust. Our Common Equity Tier 1 (CET1) capital ratio has risen from 12.8 to 13.3 percent, one of the highest among our peers.\nThis means we continue to have the flexibility to capture business opportunities and to support our clients during these times of economic uncertainty – with solid advice and the necessary financial means.\nThat we are moving in the right direction is also demonstrated by this year’s People Survey results. We have seen the highest commitment score since 2012, and an all-time high for enablement. And there are further positive developments: according to the survey, you also support our strategy more and you are happier with your managers.\nThis is an enormous source of motivation for us on the Management Board and the Group Management Committee. We know that your more positive view of our bank and the work we are all doing together is one of the most important factors for our success.\nThe first four quarters of our transformation saw us set a new course and stick to it in an exemplary fashion – even when faced with unique challenges for our professional and personal lives. The whole of the second quarter of 2020 took place in the shadow of the coronavirus pandemic, and we are grateful for the determined way you responded – and keep adapting – to this unprecedented situation. Thank you for your diligence and commitment.\nI wish those of you who are taking a well-deserved vacation a restful and enjoyable break. And for those returning from time off, I wish you a smooth and successful start. And to all of you, I look forward to working together to build on our successful first half of the year.\nBest wishes,\nChristian Sewing",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}