{
    "url": "https://www.db.com/news/detail/20200727-airwallex-adds-deutsche-bank-for-cross-border-collection-and-api-enabled-fx-services?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 27, 2020",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "Airwallex adds Deutsche Bank for cross-border collection & API-enabled FX services",
    "body": "Deutsche Bank today announced that it will enable global fintech unicorn Airwallex to provide virtual account collections and API-enabled foreign exchange services in Japan and Hong Kong respectively.\nAlready live in Japan, the solution will further allow Airwallex to seamlessly process and convert cross-border payments made to its merchants based in Greater China by using virtual accounts and API technology. Through these services, merchants using Airwallex will benefit from not needing to open bank accounts in the markets where their customers are based, thereby simplifying the entire payment process.\nFounded in 2015 and headquartered in Hong Kong, Airwallex is a technology company that is transforming the way businesses move and manage money across borders through a financial infrastructure designed to help its customers grow in their own markets and in all corners of the globe. Its existing customers span across industries such as digital, e-commerce, transportation, education and travel.\nChintan Shah, APAC Head of Corporate Cash Management at Deutsche Bank, said: “We are delighted to partner with Airwallex to further build the company’s international business of digital payment collections. With our leading-edge corporate payment solutions, expertise in working with fintech and e-commerce companies worldwide, Deutsche Bank is well placed to be the cash management bank of choice for this industry as we help to support the growing digital economy.”\nJack Zhang, CEO and Co-Founder of Airwallex, said: “As more online merchants around the world, including Greater China and Japan, look to expand their client base beyond their home market, this digital payment collection service will be a game changer for them. We intend to work with as many partners like Deutsche Bank to extend this service in more markets and realize our mission to empower businesses to grow beyond borders and scale the digital economy.”\nDisclaimer:\nThis press release has been approved and/or communicated by Deutsche Bank AG or by its subsidiaries and/or affiliates (“DB”).\nDeutsche Bank AG is authorized under German Banking Law (competent authority: BaFin - Federal Financial Supervisory Authority) and by the Prudential Regulation Authority and subject to limited regulation by the Financial Conduct Authority and Prudential Regulation Authority.\nDetails about the extent of our authorization and regulation by the Prudential Regulation Authority, and regulation by the Financial Conduct Authority are available from us on request.\nSecurities and investment banking activities in the United States are performed by Deutsche Bank Securities Inc., member NYSE, NASD and SIPC, and its broker-dealer affiliates. Lending and other commercial banking activities in the United States are performed by Deutsche Bank AG, and its banking affiliates.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}