{
    "url": "https://www.db.com/news/detail/20200724-deutsche-bank-to-invest-in-financing-platform-traxpay?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 24, 2020",
    "tags": [
        "Corporate products",
        "Digitalisation",
        "Private products",
        "Research"
    ],
    "title": "Deutsche Bank to invest in financing platform Traxpay",
    "body": "Deutsche Bank AG has announced its investment in the Frankfurt-based fintech Traxpay GmbH, with both parties signing the agreements in Frankfurt this Friday. By investing in Traxpay, Deutsche Bank is using the fintech’s platform technology to expand its supply chain finance offering. Traxpay offers its corporate clients dynamic discounting and reverse factoring solutions to enable them to manage their cash flows flexibly. Traxpay strives for a leading role in Europe and having Deutsche Bank join as an investor is one step towards achieving this goal. Other banks are being encouraged to join as investors and cooperating partners to further expand the platform. Traxpay will maintain its existing cooperations with other banks.\nMarket for supply chain finance is growing\n“The current crisis acts like a catalyst to the market. Numerous companies are reviewing their strategic relations with their suppliers and are identifying substantial potential in terms of financing,” says Daniel Schmand, Global Head Trade Finance and Lending at Deutsche Bank. “Recent developments we’ve seen as a result of COVID-19 show how important liquidity is for our clients. With Traxpay we have an experienced partner with a good track record. We can work with them to offer our clients further solutions in this area,” Schmand says, adding: “Our answer to the question ‘fintech or bank’ is: ‘fintech AND bank’”.\nMultibanking approach also applies to investor circle\nFor Traxpay, having Deutsche Bank on board as an investor is a strategic step: “With Deutsche Bank, we have gained a strategic investor with a leading role in supply chain financing across the globe,” says Traxpay founder and CEO Markus Rupprecht. Traxpay also wants other banks to become shareholders. Many companies are looking for a reliable platform. “Using a single platform means greater transparency and more efficiency for our clients, suppliers and our financing partners,” Rupprecht explains.\nBuyers and sellers who use the dynamic discounting solution that Traxpay offers benefit from flexible payment terms for goods and services, which means buyers get a discount depending on when they decide to pay. Retailers and suppliers can use the Traxpay platform to decide whether they want to settle a payable earlier and receive a discount in their individual case or whether they would like a bank to offer them interim financing. Traxpay already processes volumes of more than one billion euros every year.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}