{
    "url": "https://www.db.com/news/detail/20200720-deutsche-bank-s-corporate-bank-onboards-its-first-digital-employee-for-client-facing-role?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 20, 2020",
    "tags": [
        "Digitalisation",
        "Entrepreneurship",
        "Research"
    ],
    "title": "Deutsche Bank's Corporate Bank onboards its first digital employee for client-facing role",
    "body": "Deutsche Bank today announced the onboarding of a new digital employee, named Blue Bot ‘Yi’ within its Corporate Bank division in China. Undertaking a client-facing role, the new employee bot is responsible for handling financial reports including real-time customized transaction reports and cash pooling reports, and for processing direct client enquiries, which has already been successfully done for two of Deutsche Bank’s clients in China.\nNamed after its creator Zhu Yi, Head of China Innovation and Fintech Products – Corporate Bank, Blue Bot ‘Yi’ is the Corporate Bank’s first digital employee with a client-facing role. It has been allocated an employee number and has a dedicated working email address. Developed within Deutsche Bank’s Blue Water Fintech Space in Shanghai, Blue Bot ‘Yi’ performs its duties based on robotic process automation (RPA) combined with semantic recognition and AI technology to automatically complete the collection and distribution of customized information.\nThe first digital worker is still receiving new training to be further enhanced after being integrated with Deutsche Bank’s API and other artificial intelligence capabilities. Its scope of work and capabilities have gone far beyond the basic concept of RPA. This digital breakthrough will help to achieve higher efficiency while reducing costs.\nAlvin Ho, Head of Corporate Cash Management for China at Deutsche Bank, said: “We aim to empower our clients’ Treasury teams to handle increasing amount of documents and data while eliminating human-related errors, reducing repetitive tasks and significantly minimizing turnaround time. All these will be made possible via the deployment of Blue Bot ‘Yi’.”\nDirk Lubig, China Head of Global Transaction Banking at Deutsche Bank, said: “The Blue Water Fintech Space in China is our incubator to further optimize the automation of cash management services for our clients – it is the digital foundation for Deutsche Bank’s Corporate Bank. Blue Bot ‘Yi’’s performance is encouraging, based on the very positive feedback we received from our clients and this is only the first step. We want to expand our digital and AI driven solutions and service offerings in China, one of the world’s leading countries for innovation.”\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nThis press release has been approved and/or communicated by Deutsche Bank AG or by its subsidiaries and/or affiliates (“DB”). Deutsche Bank AG is authorized under German Banking Law (competent authority: BaFin - Federal Financial Supervisory Authority) and by the Prudential Regulation Authority and subject to limited regulation by the Financial Conduct Authority and Prudential Regulation Authority.\nDetails about the extent of our authorization and regulation by the Prudential Regulation Authority, and regulation by the Financial Conduct Authority are available from us on request. Securities and investment banking activities in the United States are performed by Deutsche Bank Securities Inc., member NYSE, NASD and SIPC, and its broker-dealer affiliates. Lending and other commercial banking activities in the United States are performed by Deutsche Bank AG, and its banking affiliates.\nCopyright 2020 © Deutsche Bank AG",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}