{
    "url": "https://www.db.com/news/detail/20200525-wealth-management-s-new-strategic-asset-allocation-saa-makes-portfolios-more-robust?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 25, 2020",
    "tags": [
        "Corporate products",
        "Private products",
        "Wealth"
    ],
    "title": "Wealth Management's new SAA makes portfolios more robust",
    "body": "To achieve portfolio efficiency, Strategic Asset Allocation (SAA) traditionally relies on forecasting the returns and volatility expected from each asset class in the portfolio and how the price of each asset class is expected to move in relation to the others. This helps determine which combinations of asset classes have the highest potential for a given level of risk.\nStrategic asset allocation therefore means dealing with probabilities and dependencies which are to some degree uncertain. And the danger is that portfolio managers oversimplify a complex situation, ignoring valuable information and hampering their ability to identify risky investment choices on assumptions about the future market behavior.\nIf these assumptions prove to be wrong, portfolio performance can become fragile. Therefore, next to efficiency, portfolio optimisation also needs to address portfolio robustness.\nOur SAA does that. By factoring in the level of uncertainty that can be applied to each long-term asset class forecast, it aims to make the risk-adjusted portfolio return less vulnerable to wrong assumptions, hence making the portfolio more robust.\nThis may require giving up some small potential theoretical performance gains, but Wealth Management thinks this is a price worth paying for a portfolio that should show greater long-term resilience to unexpected economic and financial market challenges.\nRead the CIO Special and learn\nthe key features used to increase robustness\nhow robustness is different from risk management\nthe price of robustness",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}