{
    "url": "https://www.db.com/news/detail/20200520-christian-sewing-we-re-ideally-positioned-for-sustainability-as-a-bank?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 20, 2020",
    "tags": [
        "Company",
        "Strategy",
        "Sustainability"
    ],
    "title": "Christian Sewing: We're ideally positioned for sustainability as a bank",
    "body": "The coronavirus pandemic has diverted public attention away from the fight against climate change. Has the topic become less important?\nNo, on the contrary. Coronavirus is making us aware of certain things for the first time. We’re all suddenly realising what it feels like when the air is cleaner and how valuable it is when nature is more intact. Moreover, the fear of major disasters has increased as a result of the coronavirus pandemic. This will also be reflected in policymaking. So climate change is an issue that will grow rather than diminish in importance.\nWhat does this mean for banks?\nSpecifically this means that simply observing from sidelines isn’t an option; we have to promote the topic ourselves. On the one hand because political thinking with regards to sustainability is increasingly reflected in how we are regulated as banks. And on the other hand, however, mainly because we understand that we as a bank have a responsibility and the opportunity to take action. We play a crucial role: we can and must help power companies, airlines and carmakers to do business more sustainably.\nHow?\nWe are the gateway to the capital market. We have the wherewithal to finance sustainable investments and to raise the necessary investment capital. This year alone we have placed environmental and social bonds for our clients with a volume of roughly 3.5 billion euros.\nFor the first time, Deutsche Bank has issued specific targets. Is this primarily a signal to the outside world or is it directed in-house?\nTo me, the signal to our staff is much more important. This target is the product of an interplay between the businesses. All their representatives on the Sustainability Council were asked to submit growth plans and to demonstrate the contributions they can make. We then validated the plans with market data and our market share.\nWe have a good base as we have been trending upwards in sustainable finance and investments for two years already. We are therefore very confident that we can achieve this ambitious target. And so now we have a yardstick against which we can measure ourselves and the transparency to see how we’re doing in the individual businesses quarter by quarter.\nThen why is the bank only reporting once a year instead of every quarter?\nBecause we only want to promise what we can reliably deliver. I want to see for myself first exactly how quickly we obtain the figures at the end of the quarter, what the data quality is and where we need to improve the process. Ideally we would have an automated process in place: from the granting of sustainable loans and issuing of sustainable bonds right through to sales and marketing, including financial reporting. But we still have some way to go in that respect.\nHow does your target compare to those of your peers?\nWe're very good by comparison. It’s not just about how high the target is, but also about the timescale in which we aim to achieve it. We have no reason to be shy about either the absolute figure or the timescale.\nOne single figure does not make a strategy. How are you incorporating sustainability into your business strategy?\nWhen we talk about sustainability, then we think in four categories. Firstly, for us as a bank it’s about sustainable finance, that is the sustainable financing solutions and financial investments we provide to our clients. Secondly, we also have to say what don’t intend to do – our in-house guidelines and policies.\nThen we have specific targets for our own business operations. And fourthly, thought leadership, that is we look at how we can shape discourse with our actions. We have made progress on every count. The target of 200 billion euros only applies to the sustainable finance sector – just like issuing our own first green bond.\nWhen will that be issued?\nAs soon as market conditions are right and we have a project that needs refinancing. The important thing is for us to be ready and to have had our framework reviewed by external experts. And that is the case now.\nWhat about Deutsche Bank’s in-house policies? You have been criticised for continuing to do business with power companies from the coal sector and with the oil and gas industry.\nWhat annoys me about this criticism is that it’s only ever black or white; along the lines of: it’s an oil company so doing business with it shouldn’t be allowed. That’s a bit like saying no-one’s allowed to fill their cars up anymore because it’s bad for the environment. What we need is a transformation that not only makes sense but is also realistic.\nWe want to help companies cut their CO₂ emissions as quickly as possible. That’s the real challenge and we sense this whenever we speak to our clients who come to us for advice.\nBut there must be some lines of business that the bank should already have stopped doing?\nYes, there are. And that’s why we have guidelines – like the one that stipulates we no longer finance new coal-powered facilities. We still need to be clearer here, though, and give ourselves a transparent framework in which to operate. We are therefore working on an oil and gas policy that will set out exactly how we reduce our involvement in this industry.\nWe did the same with our financing of coal-powered facilities and gave successfully reduced our involvement since 2016, comfortably exceeding our goal of 20 percent. We plan to adopt the new oil and gas policy by the end of July.\nFor you as CEO, what is the aim of this sustainability drive? Is it more about showing that the bank is aware of its responsibility tin this context or do you see it as a business model that brings revenues and profit?\nIt’s both. Of course, we consider it our duty that Deutsche Bank is a responsible corporate citizen. But we also see it as a tremendous opportunity for the bank to grow.\nAnd we have the best possible foundation in place: our business divisions – primarily our Investment Bank and our Corporate Bank – can generate the kind of assets that our institutional and private clients want to invest in. And as a global financier we have an advantage over all other European banks.\nSo there’s no danger of this sustainability drive costing shareholders because turnover and profit could drop?\nI don’t think so. Of course, part of our approach is to say “no” if necessary. But that’s no different to what we do every day when we’re assessing our risks in other areas of the bank. We don’t want to enter into any kind of business that means a high risk for our clients, the environment or society – and that’s why we have guidelines and policies which we continue to refine. I do think, though, that there’s a more important factor: the transition to a low-carbon economy offers great opportunities to those who embark on it.\nAfter all, climate-friendly business is increasingly important to clients and investors – and it’s something our colleagues are noticing in their meetings with clients every day. I’m fairly convinced that in just a few years sustainability ratings will be just as important as traditional credit ratings from agencies like Fitch, Moody’s and S&P.\nClients and investors will closely monitor whether Deutsche Bank’s own operations are climate friendly. How much progress has the bank made on this count?\nWe’ve come a very long way, although I have to admit that it’s easier for us than many traditional industrial companies when it comes to our carbon footprint. Our operations have, in fact, been climate-neutral since 2012*; we have reduced our CO₂ emissions by 60 percent since 2011 and almost 80 percent of our electricity comes from renewables.\nWe use certificates to offset the rest. But we can do more, which is why we’ve set specific targets for our own business operations. One of these is that by 2025 we intend to power our operations exclusively using electricity from renewable energy sources. We’re working on making changes to our company car fleet that will benefit the environment and we aim to reduce our business travel by air.\nAnd when we look at our branches and offices, there’s still plenty we can do to help the environment: for example how much paper we use. This is where we’re counting on our employees worldwide, on their ideas and on their involvement.\nWill the Management Board be setting the rules here?\nThe Management Board doesn’t want to have to continually issue decrees on what climate-friendly operations look like; we prefer to rely on everyone joining in. One example here is that we got rid of disposable coffee cups and plastic containers at all our locations in Germany last year. That was a fantastic initiative!\nOver the past decade, the financial industry’s reputation has been severely dented. In the fight against climate change why on earth should policymakers and society trust banks?\nIt can’t be achieved without banks. Our balance sheets give us a unique lever, which we can deploy to support the transition towards a more climate-friendly and more social world. We want to fulfil this responsibility. But we won’t manage it on our own: not as Deutsche Bank and not as an industry. We need standards so that competition is governed by uniform and reliable conditions.\nAnd we’ll only manage it if lawmakers, regulators and also private companies all work closely together. Here, too, we as a bank want to be part of the solution. That’s why we maintain an ongoing dialogue with politicians, business representatives, trade associations and non-government organisations.",
    "number_of_ratings": 7,
    "rating": 1.9,
    "likes": 4
}