{
    "url": "https://www.db.com/news/detail/20200514-deutsche-bank-and-iciec-help-cote-d-ivoire-build-critical-health-infrastructure?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 14, 2020",
    "tags": [
        "Corporate products",
        "Sustainability"
    ],
    "title": "Deutsche Bank and ICIEC help Côte d'Ivoire build critical health infrastructure",
    "body": "Deutsche Bank has been mandated by the Ministry of Economy and Finance of the Republic of Côte d'Ivoire to finance the construction and equipment of two new regional hospitals as well as five new medical units in five hospitals in the country, together with the Islamic Corporation for the Insurance of Investment and Export Credit (ICIEC).\nAgainst a backdrop of the most severe health crisis in recent history, the project is an important milestone which will support the Republic’s current efforts to contain the COVID-19 pandemic. The project is also part of the government’s National Development Plan for 2016-2020, which the International Monetary Fund (IMF) and the World Health Organization (WHO) both support.\nThe two new hospitals, one located in Adzope (105km north of Abidjan, photo above) and the other in Aboisso (120km east of Abidjan), will collectively have a capacity of around 400 beds and will significantly improve the availability of healthcare services in each region using state of the art equipment.\nIn addition, the project will finance five new medical units in five hospitals across the country. They include a radiotherapy center in Abengourou, an emergency unit each in Daoukro and Seguela, a traumatology center in Toumodi, and a surgery and emergency unit in Bouna.\nWith a total financing value of 142 million euros, the project is already underway, with two new regional hospitals expected to be completed in October 2020.\nConstruction work is being carried out by Agentis International, a Moroccan-based company which specialises in health infrastructure with an existing successful track record in Côte d’Ivoire. The company is using local labourers, therefore also creating jobs.\n“Deutsche Bank is deeply committed to supporting sustainable development projects in Africa”, said Claire Coustar, Deutsche Bank’s Head of Emerging Markets Structuring and the Institutional Client Group for Central and Eastern Europe, Middle East & Africa. “We are proud to partner with the ICIEC, enabling the Ivorian population to access a better healthcare system and helping Côte d'Ivoire achieve its National Development Plan targets.\n\"Furthermore, as the coronavirus crisis continues to be felt all around the world, the transaction is testament to how much our clients appreciate our advice and financial solutions in difficult times and acts as an example of how Deutsche Bank can help both clients and communities increase critical health infrastructure for years to come.”\nIn response to the ongoing pandemic, ICIEC has increased the availability of credit and political risk insurance to sustain imports of strategic commodities, investment protection, and to minimize volatility – and backing strategic projects with strong developmental impacts. CEO of ICIEC Oussama Kaissi states, “The unprecedented health impact of the pandemic is a human tragedy. Of course, these are compounded by the deep economic effects just beginning to be felt as a result of heightened uncertainty, risk, and the rapid deterioration in business confidence and activities.\n\"In these times, cooperation is more important than ever and ICIEC is very pleased to be partnering with Deutsche Bank for the first time on a project in Africa. ICIEC remains focused on facilitating critical investments and trade transactions, supporting the well-being and livelihoods of Member Country citizens”.\nFor further information, please contact:\nDeutsche Bank AG\nMedia Relations\nMohanad Nahas\nPhone: +971 (0) 4 3611 754\nEmail: mohanad.nahas@db.com\nTim Oliver Ambrosius\nPhone: +49 69 910 42648\nEmail: tim-oliver.ambrosius@db.com\nICIEC\nCommunication Contact:\nRania Binhimd\nPhone: +966 (12) 6467578\nE-Mail: Rbinhimd@isdb.org\nAbout Deutsche Bank in Africa\nSince opening a representative office in Cairo in 1959, Deutsche Bank has strongly contributed to financing the development of infrastructure across the African continent. The bank uses its expertise in structuring and arranging financing to help countries access the traditional global capital markets and other alternative pools of liquidity.\nDeutsche Bank has well over 200 staff providing banking services to our clients on the African continent. We have teams situated in our branch in Johannesburg, South Africa and representative offices in Lagos, Nigeria and Cairo, Egypt. In addition there are a number of coverage bankers and product specialists based in our regional hub for the Middle East & Africa, Dubai and other global hubs including Frankfurt, London and Geneva (amongst others), that provide banking services to clients and individuals domiciled on the continent.\nLast year, in recognition of its key role in supporting the African economy, Deutsche Bank has been named as “Best Foreign Investment Bank in Africa” and “Best Foreign Investment Bank in Angola” by EMEA Finance African Banking Awards 2019.\nDeutsche Bank AG, Dubai (DIFC) Branch is a branch of Deutsche Bank AG located and registered in the Dubai International Financial Centre (DIFC) in the Emirate of Dubai, United Arab Emirates, with registered no. 00062. Principal place of business in the DIFC: Dubai International Financial Centre, Gate Village, Building 5, PO Box 504902, Dubai, United Arab Emirates. Deutsche Bank AG, Dubai (DIFC) Branch is regulated by the Dubai Financial Services Authority (“DFSA”) and is authorized to provide Financial Services to Professional Clients only, as defined by the DFSA.\nAbout ICIEC\nThe Islamic Corporation for the Insurance of Investment and Export Credit (ICIEC) is a member of the Islamic Development Bank (IsDB) Group. ICIEC was established to strengthen the economic relations between member countries of the OIC on the basis of Islamic Shariah. ICIEC’s vision is to be recognized as the preferred enabler of trade and investment for sustainable economic development in Member Countries. Its mission is to facilitate trade and investment between member countries and the world through Shariah-compliant risk mitigation tools.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}