{
    "url": "https://www.db.com/news/detail/20150220-deutsche-bank-invests-eur-1-billion-in-green-bond-portfolio?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "February 20, 2015",
    "tags": [
        "Company",
        "Sustainability"
    ],
    "title": "Deutsche Bank invests EUR 1 billion in Green Bond Portfolio",
    "body": "Deutsche Bank today announced its intention to invest EUR 1 billion into a portfolio of high quality liquid assets in the form of Green Bonds. These will be held as part of the Bank’s Liquidity Reserve investments. Deutsche Bank has already made EUR 200 million in eligible Green Bond investments and plans for this portfolio to reach EUR 1 billion.\nGreen Bonds are fixed income instruments which finance environmentally sustainable projects while offering competitive returns. By establishing this portfolio, Deutsche Bank aims to support the development of the Green Bond segment. Deutsche Bank is one of the founding members of the Green Bond Principles which establish voluntary guidelines for transparency and disclosure for the benefit of both issuers and investors.\nGrowth in the portfolio will be focused on new primary market investments in eligible sovereign, supranational and agency issued bonds.\nLaunching the initiative, Alexander von zur Mühlen, Group Treasurer of Deutsche Bank, said: “The Green Bond market has matured during 2014 and the size and number of offerings has substantially increased making green securities viable and prudent liquidity buffer investments. Deutsche Bank builds on the work of the Bank’s successful Green Bond origination franchise in highlighting this opportunity to fund sustainable energy initiatives whilst achieving attractive returns.”\nMarking the portfolio launch, Deutsche Bank will invest in the new 10-year green bond issue by the World Bank. Doris Herrera-Pol, Director and Global Head of Capital Markets at the World Bank, said: “We are pleased that Deutsche Bank’s Treasury has chosen World Bank Green Bonds as one of the first investments for its newly established green bond portfolio. Deutsche Bank’s decision to set up a dedicated portfolio shows the growing appeal of green bonds. It supports the expansion of the green bond market as it continues to mobilize private sector funds for climate finance.”\nEila Kreivi, Director and Head of Capital Markets Department at the European Investment Bank (EIB), commented: “The EIB welcomes Deutsche Bank’s initiative, which underlines the recent strong progress and potential of the Green Bond segment. It is valuable that such a prominent investor is providing added leadership and committing in size.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}