{
    "url": "https://www.db.com/news/detail/20191029-3q2019-results-christian-sewing-s-message-to-staff?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 29, 2019",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "3Q2019 results: Christian Sewing's message to staff",
    "body": "Dear Colleagues,\nIt’s only 16 weeks ago that we embarked on the biggest reorganisation of our bank in two decades. And it was clear that those first few months would be a challenge for all of us. We had – and we have – no time to lose. We have to prove that we are implementing our ambitious plans. Today, we can give you a first idea of how things are going. And I’m pleased to be able to say that we’ve had a very good start.\nThis is most clear when we compare our performance with the targets we set ourselves in early July. On all metrics – balance sheet reduction, cost reductions and franchise stability – we have made as much or even more progress than we planned. And I am particularly pleased that our Core Bank has operated profitably despite even lower interest rates and the unsettling times that accompany such a radical transformation. Once again our bank has demonstrated its strength. We can all be proud of this. On behalf of the entire Management Board let me thank you for your commitment and your dedication.\nWhat have we specifically achieved with our transformation so far? All four core businesses now have their leadership teams and structures in place. Our Capital Release Unit hit the ground running: in the third quarter we reduced risk weighted assets by about 9 billion euros to 56 billion euros, well on our way to our year-end target. We reached an agreement with BNP Paribas on the transition of our Prime Finance and Electronic Equities platform – this is a good solution for our clients, our staff and our bank. And on the IT front, Bernd Leukert wasted no time in joining Frank Kuhnke to present our new strategy which will deploy technology in a more targeted, agile and coordinated way to help drive innovation and bring our costs down.\nAs expected, the transformation of our bank comes with some upfront charges. The net loss of 832 million euros for the third quarter was driven in large part by the Capital Release Unit (CRU) and tax-related valuation adjustments. We are executing all these changes using our own resources and have held our Common Equity Tier 1 ratio stable in the quarter at 13.4 percent, as our risk reduction through the CRU freed up sufficient capital to fund our transformation-related costs. Conservative management of our capital and balance sheet continues to be a key priority.\nThe Core Bank, which represents our future vision for Deutsche Bank and includes every division except the CRU, posted a pre-tax profit of 353 million euros. Excluding specific items and transformation charges, the pre-tax profit would have been nearly 700 million euros.\nThe business we did with our clients in the Core Bank in the quarter makes us confident we are on the right path:\nWe increased our loan volume in the third quarter by 12 billion euros, with the Private Bank Germany recording the sixth consecutive quarter of growth in client loans.\nOur assets under management in our Private Bank and in Asset Management have also increased markedly to 1.24 trillion euros, thanks in part to net inflows totalling 5 billion euros.\nIn our Private Bank and at our asset manager DWS, revenues – excluding one-off items – were broadly stable, despite an extremely challenging environment.\nOur newly created Corporate Bank was especially successful and posted a 6 percent increase in revenues.\nRevenues in our Financing and Flow Credit businesses in the Investment Bank demonstrated year-on-year growth in the third quarter.\nIn our Origination & Advisory business we even increased revenues by approximately 20 percent year-on-year. We grew market share in Advisory and Debt Origination, and since announcing our new strategy we have completed, priced or won over 50 Equity Capital Markets mandates – more than 50 good reasons why our origination business can still be successful even without our own equities trading unit.\nOur business divisions are working more closely together, which is an important part of our strategy. In FX we have seen great success stories thanks to the close cooperation between the Corporate Bank and the Investment Bank. And our Wealth Management business is also growing thanks to its excellent partnership with the Investment Bank, for example with regard to family offices.\nIn the Rates business and in Emerging Markets Debt revenues dropped but we are confident they will soon stabilise. We are investing in these businesses, for example in electronic trading, and our momentum has been very encouraging recently.\nThese successes deserve all the more recognition because we achieved them in the middle of a far-reaching transformation and with strict cost discipline. Excluding transformation charges, adjusted costs decreased by 4 percent year-on-year. This means we are on track to meet our 21.5 billion euro target for the full year. Our run rate costs are down by 1.8 billion euros on an annualised basis since the first quarter of 2018. This gives you an idea of just how much we have achieved here.\nOf course, these quarterly results are just an interim assessment, but they are encouraging. In spite of the difficult geopolitical and macroeconomic climate we have consolidated our position in a number of key businesses. Now more than ever, our clients need financial advice and support – and who better to provide it than Deutsche Bank?\nThis makes me optimistic about the journey ahead – I hope you are too. Let’s continue to work hard at restructuring and building our bank, and most importantly, continue to work hard for our clients. We have just seen how worthwhile that is.\n\nKind regards,\nChristian Sewing",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}