{
    "url": "https://www.db.com/news/detail/20191022-global-social-entrepreneurship-deutsche-bank-partners-in-poll-to-compile-ranking?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 22, 2019",
    "tags": [
        "Corporate Citizenship",
        "Entrepreneurship",
        "Research",
        "Sustainability"
    ],
    "title": "Global social entrepreneurship poll",
    "body": "Canada is the best country to be a social entrepreneur according to the results of a global perception poll conducted by the Thomson Reuters Foundation in partnership with Deutsche Bank’s Corporate Social Responsibility (CSR) Made for Good programme.\nThe partnership’s first poll of the world’s 45 biggest economies was carried out three years ago. Since then there have been significant changes in the rankings, including Australia jumping 24 places from 26th to second and the United States falling from the top spot to 32nd place.\nThe opinion poll surveyed six key areas: government support, attracting skilled staff, public understanding, ability for social entrepreneurs to make a living, whether the sector was gaining momentum, and access to investment.\nAlmost 900 experts were polled to establish trends, opportunities and challenges related to this fast-growing business-for-purpose sector. The results offer an insight not only into how social entrepreneurship is currently viewed within certain countries – but how this has changed over the past three years.\nOf those asked, most believed social entrepreneurship was gaining momentum around the world. However, more than half said the public still did not understand what they did.\n“From building schools using plastic waste, to training women in rural villages in solar engineering, social enterprise is a rapidly growing sector. By using innovation to address critical social and environmental issues, social enterprise is increasingly relied upon to reduce inequality and help the world’s most disadvantaged people,” says Antonio Zappulla, CEO of the Thomson Reuters Foundation.\n“However, this survey has revealed some surprising changes in how the sector is viewed in different nations,” he continued. “Perception of social enterprise is crucial. It affects everything from access to finance, to the quality of employees. We hope that greater understanding of social enterprise will provide the sector with vital information to generate future growth.”\nThe bank’s global Made for Good social enterprise programme draws on its commercial experience to help ventures of every size and mission succeed, by providing assistance when businesses need it the most and equipping them to be sustainable in the long run through investment readiness, networks and access to funding. The poll findings will help advise each region how Made for Good can best meet the needs of local social entrepreneurs.\nLareena Hilton, Global Head of Brand Communications and CSR for Deutsche Bank says: “Social entrepreneurs around the world are shaking up traditional marketplaces and introducing innovative solutions to meet the growing needs of communities. Deutsche Bank is proud to support this research and be part of a growing momentum that appreciates this exciting sector, as well as supporting its development around the world.”\n“Through our global CSR Made for Good programme we know how vulnerable social entrepreneurs can be, not only at early stage but also throughout their growth, and the importance of accelerators and incubators for success.\" she added. “Repeating this poll has shone a light on the countries that have nurtured and strengthened the sector since 2016, as well as revealing those where work is needed to improve the understanding of social entrepreneurs and the obstacles to become investment ready.“\nFor more information and to see the full rankings visit poll2019.trust.org\nWatch the video",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}