{
    "url": "https://www.db.com/news/detail/20191018-anti-nuclear-weapons-stance-deutsche-bank-s-policy-receives-seal-of-approval?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 18, 2019",
    "tags": [
        "Corporate Citizenship",
        "Strategy"
    ],
    "title": "Anti-nuclear weapons stance: Deutsche Bank's policy receives seal of approval",
    "body": "Deutsche Bank’s partnership and dialogue with the Nobel Prize-winning International Campaign Against Nuclear Weapons (ICAN) has resulted in a place in the “Runners Up” category of the global “Beyond The Bomb” report, co-authored by ICAN and published this week.\nIn the report, the authors present their findings about the financial institutions that have policies preventing investments in nuclear weapon producers. Deutsche Bank made it into the report for the first time this year and the authors “commend Deutsche Bank for having in place a public policy on nuclear weapons”.\nAbout our policy:\nDeutsche Bank has clear policies in place to help ensure we conduct business responsibly and protect the bank from reputational risk. Deutsche Bank continually reviews its policy covering defence-related business sectors and in particular so-called controversial weapons. In 2018 Deutsche Bank first published its Controversial Weapons Policy, which it then reviewed and expanded through constructive dialogue with ICAN.\nControversial weapons cause undue suffering and have a disproportionate humanitarian impact on civilian populations. These include: cluster munitions (CluMu); anti-personnel mines (APM); chemical, biological, radiological, nuclear weapons (CBRN); and controversial conventional weapons (CCW).\nSpecifically, the bank’s Controversial Weapons Policy clarifies the types of business in which the bank will not engage.\nPDF\nTo read the full report, click here",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}