{
    "url": "https://www.db.com/news/detail/20220729-impact-of-us-federal-reserve-s-quantitative-tightening-on-asia-pacific?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 29, 2022",
    "tags": [
        "Asia-Pacific",
        "Capital markets"
    ],
    "title": "Impact of US Federal Reserve’s quantitative tightening on Asia Pacific",
    "body": "Deutsche Bank’s Asia Macro Strategist Mallika Sachdeva discusses the impact of the Fed’s quantitative tightening on capital flows into Asia Pacific in this “150 Seconds in APAC”.\nYou can also read the full transcript of the video here: \nCapital flows into emerging markets are back in greater focus as Fed tightening accelerates.\nQuantitative tightening has historically created volatility for EM and led to reversals of capital flows. Will the same thing happen this time?\nQ: How will Fed tightening affect capital flows this time?\nCapital flows to EM in the last few years have been much more heavily concentrated in China. China has seen over three hundred billion of offshore capital flow in since April 2020.\nThis is close to ten times the amount of capital that has gone into all other major EM asset markets combined. A lot of the capital going to China has been linked to China’s growing weight in global indices, and this should be sticky. But we have started to see some foreign flows exit from Chinese fixed income this year as US rates rise above Chinese rates. \nWe have also seen large equity outflows from India and Taiwan on a combination of rich valuations, heavy historical owernership and concerns about a global slowdown.\nQ: Are there any bright spots?\nOne region which has enjoyed inflows this year is ASEAN equities. Despite the drawdown in global stocks, countries like Indonesia, Malaysia and Thailand, have all seen net inflows into their stock markets. \nInvestors are likely more positive on their recovery stories, as economies reopen and private consumption recovers. \nWe are particularly constructive on the potential for flows into Indonesian equities and are also watching flows into Chinese equities as cities exit lockdowns and some stimulus is announced.\nQ: How about foreign exchange flows? \nWhen it comes to emerging markets, most people only think about foreign capital coming into and out of our markets. But in Asia, domestic capital has also become very powerful.\nIn countries like Korea, Thailand, Taiwan and Malaysia, domestic investors like pension funds and even local retail investors are investing more in overseas assets than ever before.\nIn many cases, this is now a bigger driver of regional currencies than foreign capital.",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 2
}