{
    "url": "https://www.db.com/news/detail/20220728-the-asian-banker-awards-best-international-trade-finance-bank-in-asia-pacific-and-more?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 28, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "The Asian Banker awards: Best International Trade Finance Bank in Asia Pacific and more",
    "body": "The Asian Banker has named Deutsche Bank the ‘Best International Trade Finance Bank in Asia Pacific’ for the fifth year running. This latest marquee award, along with the bank’s Best Treasury & Cash Management Bank in Asia Pacific win from The Asset earlier this month, underscores Deutsche Bank’s market-leading Trade Finance and Institutional Cash Management (ICM) capabilities in the region.\nThe Asian Banker also named Atul Jain, Global Co-Head of Trade Finance & Lending, ‘Transaction Finance Person of the Year’. This award recognises individuals who have demonstrated inspirational leadership, made a strong impact in the industry, and contributed significantly to the transformation of their organisation.\nDescribing Jain as the ‘undisputed winner’, the publication commented: “From supporting suppliers and distributors of your anchor global clients in ecosystem financing to having a future-ready vision of supporting customers’ clean energy journey and focus on sustainability in project financing, you have successfully demonstrated a strong vision, verve and fortitude to steer the bank’s trade finance business during highly uncertain times.”\nTop for transaction finance\nThe Asian Banker also recognised the bank's leadership in international correspondent banking and payments. Deutsche Bank won ‘Best Global (Euro and USD) Clearing Bank in Asia Pacific’, and ‘Best Global (Euro) Clearing Bank in Asia Pacific’.\nThese awards come hot on the heels of 52 awards from The Asset including Best Cash Management Bank in Asia Pacific.\nThe Asian Banker Transaction Finance Awards recognises leadership in cash management, trade finance, supply chain finance and payments amongst financial institutions in Asia Pacific, the Middle East and Africa.\nThe Asian Banker Awards 2022 – Deutsche Bank wins:\nBank Awards\nBest International Trade Finance Bank in Asia Pacific (winner for five consecutive years)\nBest Global (Euro and USD) Clearing Bank in Asia Pacific (winner since 2015)\nBest Global (Euro) Clearing Bank in Asia Pacific (winner since 2018)\nClient Solution Awards - Best Financial Supply Chain Solution – Hitachi Energy, India\nIndustry Achievement Awards - Transaction Finance Person of the Year – Atul Jain",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 4
}