{
    "url": "https://www.db.com/news/detail/20220727-a-message-from-christian-sewing-on-q2-results-2022?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 27, 2022",
    "tags": [
        "Financial Results",
        "Strategy"
    ],
    "title": "A message from Christian Sewing on Q2 results 2022",
    "body": "Dear Colleagues,\nThe past few months have been marked by contrasting developments and emotions. On the one hand, the ongoing war in Ukraine and the terrible suffering of the people there continues to be a source of profound concern. Added to this are growing worries about energy supplies, gas shortages in particular, rising inflation rates and the threat of recession in many regions.\nOn the other hand, our bank’s business has performed strongly against the backdrop of this challenging environment in the second quarter. Driven by a 7 percent year-on-year increase in net revenues to 6.6 billion euros, profit before tax was 1.5 billion euros. Compared to last year, this is an increase of one third, and it’s the best second-quarter result in 11 years. At 1.2 billion euros, net profit was 46 percent higher than a year ago.\nWe can all be proud of this result. It is testament to how much we have achieved together. Despite a difficult environment, we are much stronger in terms of revenues today than we thought possible when we announced our transformation back in 2019. Our advice is highly sought after, and we are once again deepening the relationships we have with our clients. A glance at the volume of loans we have granted is the best proof of this. Across all core business areas, we delivered strong growth in client lending. Overall, our loan book grew to 493 billion euros in the second quarter, up 11 percent year on year.\nI am very aware that we are only able to generate additional business with our clients because you are always ready to go the extra mile. This is impressive, and I would like to thank you all sincerely on behalf of the Management Board. Your dedication and commitment are crucial if we are to successfully navigate this period of unique volatility and multiple crises. Another essential factor is our capital base and liquidity position, both of which we have substantially improved in recent years and which today remain very solid.\nWe are, however, not immune to the macroeconomic environment, which is why we are preparing for the likely event of an economic downturn. We increased our provisions for credit losses in the second quarter, up from 75 million euros in the prior year period to 233 million euros.\nFurthermore, inflationary pressures in many parts of the world are also having an impact on our bank, which explains why adjusted costs (ex-transformation charges and bank levies) rose slightly year on year to 4.7 billion euros – although if we exclude the impact of foreign exchange movements, they were down two percent. Part of the cost increase is due to factors beyond our control. As a result, we believe that a cost/income ratio of 70 percent is not feasible in the current macro environment, at least not if we want to continue investing in our business, technology and controls as planned. Our current view is that cutting back on these long-term investments would be the wrong response to unexpected events. It would mean squandering future revenue opportunities and savings potential, which would damage our long-term growth strategy. Our commitment to our Global Hausbank positioning is strong and we are focused on making the necessary investments.\nWe therefore now anticipate achieving a cost/income ratio somewhere in the mid- to low-70s percent for the year. To get there, we need to maintain our strict discipline when it comes to the costs we can control. This is also necessary to achieve our target of a return on tangible equity of 8 percent this year. We still believe we are on track here, although this goal will be more difficult to achieve in the current environment. I am convinced, though, that we can do it if we all continue to work with the kind of dedication that we have showed so far during our transformation.\nThis includes this second quarter. We managed to build seamlessly on the positive trend at the beginning of the year and have increased revenues in all four business divisions thanks to a mix of higher business volumes and market share gains:\nThe Corporate Bank is a particularly pleasing success story. It increased its revenues by 26 percent compared to the same quarter of the previous year. This was the third consecutive quarter of double-digit growth rates and the best since the Corporate Bank was launched in 2019. It has benefited from the normalising interest rate environment and, at the same time, we conducted significantly more business with our clients in all areas of the Corporate Bank, which was reflected in higher loan volumes and deposits. We are seeing multiple examples of where our growth initiatives of recent years are increasingly bearing fruit. This is the achievement of the team around Stefan Hoops, who led the Corporate Bank since its beginnings in mid-2019 until June of this year and whom I would like to thank once again.\nThe Investment Bank proved that even in a difficult market it has the resilience to deliver a strong performance thanks to its diversified business mix. Revenue growth of one third in our Fixed Income and Currencies business meant the Investment Bank as a whole was able to increase its revenues by 11 percent year on year despite a significant decline in Origination & Advisory. Here, the figures were a reflection of the market slump in equity and debt issuance. In addition, like other banks, we had to record some markdowns on leveraged finance commitments also as a result of the challenging market environment. On the other hand, Advisory revenues were up notably; we bucked the trend and gained market share.\nThe Private Bank, like the Corporate Bank, is also on a significant growth path. Compared to 2021, revenues rose by 7 percent. Excluding the foregone revenues related to last year’s ruling of the German Federal Court of Justice (BGH) on pricing agreements as well as positive effects in connection with Sal. Oppenheim workout activities, revenues were up 4 percent with contributions from both the Private Bank Germany and the International Private Bank. I am particularly pleased that we recorded 11 billion euros in net new business volumes, driven by inflows into our assets under management as well as new client loans.\nDespite a significant decline in asset values in the year to date, Asset Management increased its revenues by 5 percent year on year thanks to considerably higher fee income. Net inflows from previous quarters translated into an increase in management fees. In the second quarter, net outflows from DWS products were at 25 billion euros. These outflows were almost entirely attributable to low-margin cash products which become unattractive as interest rates rise. Outside of these money market products, inflows and outflows virtually offset each other. \nOur bank stands on four very strong pillars. While the Investment Bank once again managed to grow pre-tax profit slightly, the Corporate Bank and Private Bank were particularly successful. In combination with Asset Management, our stable businesses contributed more than half of the Core Bank’s profit before tax in the first six months. A year ago, this figure was only around 30 percent. We are thus getting closer and closer to our goal of being a well-balanced bank.\nIn Sustainable Finance, volumes were lower this quarter. This was due to several factors: our clients were less active in the bond markets, which we also felt in ESG issuance. In addition, developments on the capital markets impacted the values of sustainable asset portfolios. However, sustainable financing and investments volumes still increased by 14 billion euros ex DWS in the quarter. Cumulatively, we now have enabled a total of 191 billion euros since the beginning of 2020, which takes us close to our year-end target of 200 billion euros.\nThe months ahead will continue to be challenging. There is reason to believe that things will become even more difficult economically. In Ukraine, regrettably, there is no sign of an end to Russia's aggression, and uncertainty and volatility will remain with us for quite some time to come. However, Deutsche Bank is prepared for what is to come. We are stable, we are profitable, we have our risks under control. What is important now is that we continue to work hard and stay focused on our goals for this year and the years to come. Above all, however, it is about helping our clients manage their risks and meeting their needs in these difficult times, as the Global Hausbank at their side, with a strong team that is part of the solution even in this crisis. \nBest wishes,\nChristian Sewing",
    "number_of_ratings": 17,
    "rating": 4.2,
    "likes": 18
}