{
    "url": "https://www.db.com/news/detail/20220722-deutsche-bank-and-home-credit-close-esg-linked-loan-focusing-on-financial-inclusion-and-literacy?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 22, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank and Home Credit close ESG-linked loan focusing on financial inclusion and literacy",
    "body": "Deutsche Bank and PT Home Credit Indonesia (“Home Credit”), a global consumer finance company today announced they have closed a IDR156 billion (US$10.4 million) ESG-linked loan facility that focuses on performance targets linked to ESG principles.\nThis is Home Credit’s first ESG-linked loan in Indonesia, as it seeks to deliver sustainable financial services and inclusive growth in Southeast Asia’s largest economy and the world’s fourth most populous nation.\nThe performance targets linked to the loan focus primarily on financial inclusion and literacy. Home Credit will aim to increase first-time as well as female customers, in line with the government’s plan to meet its 90% digital financial inclusion target by year 2024.\nHome Credit will also tap on digital technologies to deliver consumer financing, while ensuring strict customer data privacy.\nVolker Giebitz, Director for Home Credit Indonesia, said, “We understand the importance of operating in a responsible and sustainable way. ESG principles are embedded across our business as we serve our 5.5 million customers across Indonesia. We also apply those ESG principles to our innovative funding strategies. Through this loan collaboration with Deutsche Bank, we are further deepening our commitment to ESG and innovative funding at the same time.\n“This funding will open broader opportunities for the Indonesian population, especially those who does not have access to formal financial services. Aside from providing affordable and transparent services that meet customer needs, we will additionally provide educational initiatives in several cities to increase financial literacy in Indonesia, alongside government efforts.”\nSamir Dhamankar, Director, Head of Global Transaction Banking & Securities Services, Deutsche Bank said, “We are delighted to partner with Home Credit again on this significant transaction, first in the Philippines and now in Indonesia. This transaction allows Home Credit to strengthen its consumer lending footprint in Asia, while furthering its commitment in pursuing a sustainable and financially inclusive agenda to better the welfare of communities and the economy. It also underscores the strength of our global transaction banking platform in one of Deutsche Bank’s fastest-growing markets, particularly in serving multinational corporates in the region.” \nThe ESG-linked loan complies with the Sustainability-Linked Loan Principles of the Asia Pacific Loan Market Association that support environmentally and socially sustainable economic activity, and performance targets will be independently verified by a third-party advisor.",
    "number_of_ratings": 5,
    "rating": 4.8,
    "likes": 5
}