{
    "url": "https://www.db.com/news/detail/20220720-deutsche-bank-bolsters-sustainability-activities-joerg-eigendorf-appointed-new-chief-sustainability-officer?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, July 20, 2022",
    "tags": [
        "Boards and Committees",
        "Sustainability"
    ],
    "title": "Deutsche Bank bolsters sustainability activities – Jörg Eigendorf appointed new Chief Sustainability Officer",
    "body": "Deutsche Bank is strengthening its sustainability efforts. As Chief Sustainability Officer, Jörg Eigendorf will continue to expand the bank’s sustainability area with a view to further developing the strategy and implementing it with more intensity. As Global Head of Communications & CSR with responsibility for Sustainability, Eigendorf has played a major part in shaping the bank’s environmental, social and governance (ESG) strategy over a number of years. He will continue to report to CEO Christian Sewing.\n“Sustainability is a critical success factor for our bank and a central element in our Global Hausbank strategy”, says CEO Christian Sewing. “We want to take advantage of the opportunities that are available to us in this area. At the same time, it is about continuously enhancing our controls and processes. Jörg Eigendorf has been a leading figure for some years now in driving our bank’s sustainability strategy. He is well suited to coordinate and steer this next stage across the entire bank.”\nIn order to be able to focus all his efforts on the bank’s sustainability strategy, Eigendorf is handing over leadership of Communications & CSR to Anke Hallmann and Sebastian Jost. So far, Hallmann was Deputy Head of Communications & CSR, Jost was Head of Group Communications. “Together with Jörg, both Anke and Sebastian have helped realign our bank’s communications over the past six years and are therefore ideally positioned to continue the successful work,” says Sewing.\nAt the same time, Deutsche Bank plans to coordinate its dialogue with stakeholder groups more closely. For this reason, the bank’s Political Affairs department will – together with Communications & CSR – become part of a larger area of responsibility: Corporate Affairs & Strategy. Heading up the new area will be Ben Alka, who will also continue in his role as Chief of Staff to Christian Sewing.\n“As a Global Hausbank, we need an orderly dialogue and engagement with our stakeholders that is closely aligned to our strategy,” Sewing said, adding: “Ben Alka has been successfully coordinating our relations to our stakeholders for some years now and will expressly build on this in his new role.”\nAll the above changes will become effective on September 1, 2022.",
    "number_of_ratings": 9,
    "rating": 4.1,
    "likes": 46
}