{
    "url": "https://www.db.com/news/detail/20220715-central-bank-digital-currencies-transforming-asia-s-financial-landscape?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 15, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Central Bank Digital Currencies transforming Asia’s financial landscape",
    "body": "Deutsche Bank’s Boon-Hiong Chan looks at how digital assets, including central bank digital currencies, are driving change in Asia’s financial landscape. Watch our latest “150 Seconds in APAC” with Deutsche Bank’s Boon-Hiong Chan to learn more.\nYou can also read the full transcript of the video here: \nQ: How are Asian governments adopting Central Bank Digital Currencies?\nIn Asia, in markets where Deutsche Bank is operating, we can assume that central banks are all assessing and investigating Central Bank Digital Currencies or CBDCs. While retail CBDC is a predominant focus, there’s also nexus with wholesale CBDC and cross-border usage.\nFor example, in China, China’s e-CNY has already introduced new possibilities like Dual Offline aspects, whereby a tokenised payment can occur with finality without a bank account and without internet connection. \nWhen retail CBDC is used to subscribe, let’s say into a fund, it changes into a wholesale CBDC in the hands of the asset manager, and this is where policy will also be evolving.\nFor cross-border in Asia, there is a big Bank for International Settlements (BIS) led Project Dunbar and Project mBridge, each with a different model and follows global regulatory objectives to enhance payments and cross-border access.\nOver time, CBDCs can introduce programmable payments and programmable money. And these changes can actually impact access, can impact further banking activities as a result.\nQ: How is tokenisation of financial assets changing APAC markets?\nThe second digital asset ecosystem is the tokenised financial assets one like digital bonds and digital equities. The change here is not really about technology per say, but the changes are around the operating models. This is because it comes  with  built-in delivery infrastructure and automation from smart contracts that consolidate roles, and reduce intermediaries.\nIn Asia Pacific, Thailand has leveraged this to issue live digital savings bonds using a direct issuer-to-investor model. Likewise in the Philippines. In Singapore, there was a similar tokenised fund Proof-of-Concept.\nThe significant change here is around distribution and operating models.\nThere are a lot of exciting possibilities happening in Asia, and in Deutsche Bank, we are exploring many of these developments. Deutsche Bank is 150 years in Asia and we continue to actively future proof ourself to meet changes in our industry, and for our clients.\nBoon-Hiong Chan",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 2
}