{
    "url": "https://www.db.com/news/detail/20220714-deutsche-bank-wins-best-bank-in-germany-and-best-investment-bank-in-germany-in-euromoney-awards-2022?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt, July 14, 2022",
    "tags": [
        "Awards"
    ],
    "title": "Deutsche Bank wins Best Bank in Germany and Best Investment Bank in Germany in Euromoney Awards 2022",
    "body": "Deutsche Bank has been named Best Bank in Germany and Best Investment Bank in Germany in this year’s Euromoney Awards for Excellence.\nThese awards are a confirmation of Deutsche Bank’s position as Germany’s leading bank and largest provider of investment banking. It also demonstrates the bank’s progress with its new strategy, increasing revenues, remaining disciplined on costs and supporting its clients as they undergo their own transitions.\nKarl von Rohr, Deutsche Bank’s CEO for Germany, said: “Deutsche Bank is the clear industry leader in Germany in a number of key market segments. We are very proud to have won these prestigious awards and will continue our focus on delivering for our clients.”\nThe No. 1 position for the Investment Bank in Germany is also supported by key industry metrics (FY 2021, Dealogic):\nAll Products: #1 in FY2021 in terms of fees and market share for all investment banking products in Germany\nMergers & Acquisitions: #1 for announced deals, with the bank having advised on 32 German-related transactions with a total volume of over €100bn.\nEquity Issues: #1 Bookrunner in German IPOs, lead advisory on the five largest IPOs in 2021 and #1 in capital markets spin-offs over the last decade\nLoans: Participation – mostly lead – in each of the top 10 loan financings in Germany\nBond issues: Clear #1 in bonds, investment grade bonds and ESG instruments in the DACH region\nSub-investment grade financing / leveraged finance: #1 in the DACH region in a very active market\nJulian Schoof, Head of Investment Bank Coverage DACH at Deutsche Bank, said: “I am delighted to see the recognition for Deutsche Bank’s success in Germany, both for the overall bank and our investment bank. We would like to thank our investment banking teams across the bank for the great partnership and dedication, as well our clients for their trust in Deutsche Bank. What a great journey together!”\nDavid Feldmann, Head of Markets DACH said: \"Excellent news on Deutsche Bank being named Euromoney’s Best Investment Bank in Germany. Though it has been a period of uncertainty for many of our clients, we have been able to drive innovation in the financial market in the past year. On behalf of my great team, I’d like to thank all our clients in Germany for their trust and partnership. We are committed to remaining a leader in Germany and look forward to our future journey together.\"",
    "number_of_ratings": 8,
    "rating": 4.0,
    "likes": 12
}