{
    "url": "https://www.db.com/news/detail/20220713-deutsche-bank-entwickelt-eigene-bnpl-bezahlloesung-fuer-e-commerce-und-digitale-marktplaetze?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt, July 13, 2022",
    "tags": [
        "Corporate products"
    ],
    "title": "Deutsche Bank develops its own buy now, pay later solution for e-commerce and digital marketplaces",
    "body": "Higher customer loyalty between merchants and shoppers thanks to white-label solution at checkoutLiquidity advantage for merchants:\nDeutsche Bank pays merchants as soon as goods are dispatched\nFintech Credi2 is technology partner\nDeutsche Bank is developing its own BNPL (buy now, pay later) solution for invoice and instalment purchases in a collaboration with Vienna-based fintech Credi2. The white-label – own brand – solution for online merchants and e-commerce marketplaces in Germany can be flexibly integrated into the payment process. Pilot projects are scheduled to start this year.\n\"Together with Credi2, we want to create a real alternative to existing BNPL offerings,\" says Kilian Thalhammer, Head of Merchant Solutions at Deutsche Bank. \"Unlike most BNPL offerings, merchants retain full control over transactions with their new and existing customers through the white label approach,\" says Thalhammer. A special merchant portal enables them to digitally track both returns and partial payments of the transactions. In addition, merchants and marketplaces benefit from a liquidity advantage, as the bank pays out the purchase price to the merchant's account immediately upon confirmation of order shipment. Deutsche Bank assesses the risk of non-payment and fraud in real time and includes the receivables arising from the respective sales contract in its own risk portfolio.\n\"With Deutsche Bank and Credi2, a major international bank and fintech are working together successfully. Through our white-label solution, banks, merchants and marketplaces can offer our modern and flexible payment solution under their own brand – this ensures customer loyalty and increases sales,\" said Christian Waldheim, co-CEO at Credi2.\nInvoice purchasing, which has dominated in Germany for decades, has firmly established itself among the top 3 payment methods in terms of the number of transactions in e-commerce, alongside wallet payments and direct debits (source: FIS Worldpay Report 2021). Juniper Research projects annual global BNPL transaction volume growth of more than 30 percent through 2026. \"The trend is clearly pointing in the direction that invoice and instalment buying is here to stay,\" Thalhammer said.",
    "number_of_ratings": 12,
    "rating": 3.9,
    "likes": 20
}