{
    "url": "https://www.db.com/news/detail/20220712-deutsche-bank-wins-52-transaction-banking-awards-including-best-cash-management-bank-in-apac?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 12, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank wins 52 transaction banking awards including Best Cash Management Bank in APAC",
    "body": "Building on a long history of success in The Asset Triple A Awards, Deutsche Bank won Best Treasury & Cash Management Bank in Asia Pacific – taking home a rich haul of 52 accolades for Cash Management and Trade Finance excellence this year. Deutsche Bank also won two prestigious regional marquee awards from The Asset last week: Best in Treasury & Working Capital in APAC for multinationals (MNCs) and Best in Treasury & Working Capital in APAC for New Economy clients.\nThis year’s strong performance with The Asset also saw Deutsche Bank take home the coveted Best Transaction Bank in India, Best Transaction Bank in China awards, and win Cash Management Banker of the Year for Chintan Shah.\nThis year’s award wins reflect Deutsche Bank’s strength and capabilities in Asia Pacific. Specifically its ability to build long-term client relationships and its proven track record of providing client solutions and advisory on complex deals across India, China and ASEAN, spanning the bank’s Cash Management and Trade Finance businesses.\nThe wins are testament to Deutsche Bank being the global Hausbank for our clients and to our 150 year history in Asia Pacific.\nThe Asset Awards is one of the most credible and rigorously researched awards programmes for Treasury and Trade in the region, involving client feedback shared through the publication’s Annual Treasury Review Survey, in-depth client interviews and awards pitches.\nThe Asset Treasury & Trade awards 2021: Deutsche Bank wins:\nRegional Awards\nBest Treasury & Cash Management Bank in APAC \nBest in Treasury & Working Capital in APAC – MNCs\nBest in Treasury & Working Capital in APAC – New Economy\nBank Awards\nBest Service Provider – Transaction Bank (India)\nBest Service Provider – Transaction Bank (China)\nBest Service Provider – Liquidity Management (Indonesia)\nBest in Treasury and Working Capital – MNCs (Philippines)          \nBest in Treasury & Cash Management – Overall (South Asia)\nBest in Treasury and Working Capital – MNCs/LLCs (India)\nBest Service Provider – Cash Management (India)\nBest Service Provider – Liquidity Management (India)\nBest Service Provider – E-Solutions Partner (India)\nBest Service Provider – Fintech Partner (China)\nBest in Treasury and Cash Management – Overall (North Asia)\nBest in Treasury and Working Capital – MNCs (China)\nBest Service Provider – Risk Management (China)\nBest Service Provider – Structured Trade Finance (China)\nBest Service Provider – E-solutions (South Korea)\nBest Service Provider – Liquidity Management (South Korea)\nClient Solution Awards\nBest New Economy Solution / Best Hedging and Risk Solution: FX – XTransfer Limited (APAC)\nBest New Economy Solution / Best Payments and Collections Solution – LianLian Global (APAC)\nBest New Economy Solution / Best Payments and Collections Solution – Flywire (India)\nBest ESG Solution / Best Liquidity and Investments Solution – APAC Maxeon Solar Technologies Limited (APAC)\nBest ESG Solution / Best Liquidity and Investments Solution – Trina Solar (China)\nBest ESG Solution / Best Structured Trade Finance Solution – Beijing & Shenzhen Jingneng Financial Leasing (China)\nBest ESG Solution / Best Structured Trade Finance Solution – Jinko Solar Co., Ltd (China)\nBest ESG Solution / Best Structured Trade Finance Solution – Shriram Transport Finance Company Limited (India)\nBest Structured Trade Finance Solution – Tianjin Rail Transit Group Financial Leasing (China)\nBest Supply Chain Finance Solution – Aditya Birla Fashion & Retail Ltd (India)\nBest Supply Chain Finance Solution – Hitachi Energy India Ltd (India)\nBest Hedging and Risk Solution: FX – Intuitive Surgical, Inc. (APAC)\nBest Hedging and Risk Solution: FX – Merck KGaA (China)\nBest Payments and Collections Solution – Disney Entertainment India Limited (India)\nBest Payments and Collections Solution – Bosch Limited (India)\nBest Payments and Collections Solution – GlaxoSmithKline Pharmaceuticals Limited (India)\nBest Payments and Collections Solution – Merck India (India)\nBest Payments and Collections Solution – Merck TBK (Indonesia)\nBest Payments and Collections Solution – ADP Philippines (Philippines)\nBest Payments and Collections Solution – Goethe-Institut Bangkok (Thailand)\nBest Liquidity and Investments Solution – Schott Asia IT Sdn Bhd (Malyasia)\nBest Liquidity and Investments Solution – Continental Holding China Co. Ltd (China)\nBest Liquidity and Investments Solution – Givaudan SA (China)\nBest Liquidity and Investments Solution – Sinochem International Corporation (China)\nBest Liquidity and Investments Solution – China Railway Construction Corporation Limited (CRCC) (Hong Kong)\nIndustry Achievement Awards\nCash Management Banker of the Year APAC – Chintan Shah\nCash Management Executive of the Year China – Erin Huang\nClient Leadership Awards       \nTreasurer of the Year, Hong Kong – Ernest Mui, Knorr Bremse\nTreasurer of the Year, China – Ann Zhu, DSM (China) Ltd\nTreasury Team of the Year, India – Arno Classen, Merck India\nTreasury Team of the Year, Hong Kong – Han Peng, China Railway Construction Corporation Limited\nTreasury Team of the Year, China – Sophia Huang, Atlas Copco\nTreasury Team of the Year, China – May Zhong, Trina Solar",
    "number_of_ratings": 7,
    "rating": 3.1,
    "likes": 6
}