{
    "url": "https://www.db.com/news/detail/20250121-deutsche-bank-partners-with-yonyou-to-support-chinese-enterprises-going-global?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "January 21, 2025",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank partners with Yonyou to support Chinese enterprises going global",
    "body": "Deutsche Bank (China) Co., Ltd. (“Deutsche Bank China”) and Yonyou Network Technology Co., Ltd. (“Yonyou”) signed a strategic memorandum of understanding (MOU) today in Beijing. The partnership aims to establish a new global financial services model with Global Treasury Management (GTM) at its core, driving innovation in digital financial services and supporting the globalization strategies of Chinese enterprises. The signing ceremony was attended by Leo Yin, President of Deutsche Bank China and Huang Chenhong, President of Yonyou.\nUnder the MOU, the two parties will focus on GTM by connecting Yongyou’s treasury management system with Deutsche Bank’s financial system to enable seamless data access and instruction transmission. This collaboration will help enterprises optimize financial resources, reduce cost and enhance risk control. The partnership aims to deliver efficient domestic and cross-border payment solutions. Leveraging Deutsche Bank’s international network and platform, the partnership will streamline financial management processes and enhance the global cash operations of Chinese enterprises expanding overseas.\nIn addition to GTM, Deutsche Bank and Yonyou will develop innovative financial solutions tailored to diverse corporate client needs, foster financial technology advancement, and empower cross-border finance. This partnership aims to expand the market ecosystem, combining Deutsche Bank’s global network and expertise with Yonyou’s extensive client base to create mutual benefits for the two parties.\nLeo Yin, President of Deutsche Bank China, commented, “We are excited about the prospects of this strategic cooperation. By combining our strengths, both parties will leverage their expertise to drive innovation and deliver comprehensive international financial services to Chinese enterprises. Supporting Chinese companies’ global growth ambitions is one of Deutsche Bank’s core missions, and we are eager to contribute to this important journey.”\nHuang Chenhong, President of Yonyou, stated, “Yonyou is committed to empowering enterprises with digital and intelligent transformation. Our strategic partnership with Deutsche Bank will integrate enterprise service resources to establish a robust global financial services model, providing clients with superior and seamless solutions that combine enterprise management and financial services to clients. We look forward to collaborating closely with Deutsche bank to support Chinese companies in gaining a competitive edge in their global expansion.”\nThis partnership enhances our clients’ access to Deutsche Bank’s comprehensive global solutions while enhancing our product and service offerings in China. As we advance toward end-to-end digitalization, Yonyou will play a pivotal role in bridging the ‘last mile’.\nJunkai Chong, Head of Cash Management Product for Greater China\nAs a global bank with deep roots in Europe, Deutsche Bank leverages its extensive network, market presence, and financial expertise to provide comprehensive financial solutions and services to Chinese enterprises pursuing overseas expansion.\nYonyou, a leading provider of enterprise software and intelligent services in China, delivers cutting edge digital solutions through its Business Innovation Platform (Yonyou BIP), supporting the Chinese enterprises in their global endeavours.\nThis partnership marks a new chapter in the integration of digital intelligence and financial services, injecting fresh momentum into the enhancement of global competitiveness of Chinese enterprises.\nDeutsche Bank AG                                       \nMedia Relations                                           \nKate Fields\nPhone: +852 2203 5094\nEmail: kate.fields@db.com ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}