{
    "url": "https://www.db.com/news/detail/20150625-the-women-global-leaders-programme-the-story-of-a-successful-partnership-between-insead-and-deutsche-bank?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 25, 2015",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "The Women Global Leaders programme: the story of a successful partnership between INSEAD and Deutsche Bank",
    "body": "When Eileen Taylor had been made Global Head of Diversity of Deutsche Bank in 2009 she pursued mainly one goal: to break the proverbial glass ceiling in order to increase the number of women in senior roles within the organisation.\nTherefore Taylor and her team developed ATLAS (Accomplished Top Leaders Advancement Strategy), a highly successful programme for the most senior women at Deutsche Bank. But Taylor knew that in order to have a lasting effect, they had to focus not only on the top management, they had to begin with women at the upper-middle-management level – and across the entire, global organisation.\nTaylor’s work and research led her to Herminia Ibarra, who is professor at INSEAD, one of the world's leading business schools. Together they developed a one-week programme, which was based on Ibarra’s research and pedagogical experience in leadership development. The programme focuses on leading change, negotiation, influencing and networking. It also includes 360-degree-feedback, using techniques pioneered at INSEAD.\nThe secret of the success\n\nThe numbers speak for themselves: every second participant has been promoted within two years of attending the programme. Since 2009, the number of women at manager director level or above in Deutsche Bank has increased by 50% – a large proportion of whom are alumnae. For the alumnae of Women Global Leaders at INSEAD, the attrition rate is 50% lower than what it is for executives at this level across the company. And there are usually twice as many nominations as there are places.\nThe secret of its success lies in the involvement of senior managers and ATLAS women. Meanwhile there is a global network that has built up around the programme, which is way more than just keeping in touch. Every three years, there is an alumnae conference. And every programme includes a talk on strategy from a very senior global executive. So the Women Global Leaders Programme is not only about training, it is about interacting with the Group Executive Committee – and moving a step upward.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}