{
    "url": "https://www.db.com/news/detail/20150622-deutsche-bank-offers-access-to-the-european-central-bank-s-new-settlement-system?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 22, 2015",
    "tags": [
        "Company",
        "Corporate products",
        "Private products"
    ],
    "title": "Deutsche Bank offers access to the European Central Bank's new settlement system",
    "body": "TARGET2-Securities (T2S), the European Central Bank's new platform for the cross-border settlement of securities transactions, went live on June 22, 2015. The system removes existing national barriers, simplifies and accelerates the cross-border settlement of securities transactions and reduces transaction costs.\nDeutsche Bank will offer its clients in the financial industry direct access to the T2S platform as well as indirect access via existing national intermediaries (central securities depositories – CSDs). In both cases, clients will benefit from the efficient settlement of securities transactions, optimised liquidity and collateral management.\nWerner Steinmueller, member of the Group Executive Committee and Head of Global Transaction Banking (GTB) at Deutsche Bank said: “Following SEPA and the harmonisation of European payment processes, the European Central Bank has reached a further milestone in the integration of European markets with the launch of TARGET2-Securities. T2S helps to make the European financial market infrastructure more efficient and secure.”\nSatvinder Singh, Head of Institutional Cash and Securities Services for GTB at Deutsche Bank, added: “As number one Euro clearer in the world, connecting our liquidity pool to the T2S platform highlights our commitment to supporting the proper functioning of European markets. The smooth transfer of assets within T2S improves the flow of liquidity and the use of collateral, thus easing pressure in terms of capital requirements. We aim to leverage these advantages in the best interest of our clients.”\nThe new, pan-European T2S platform replaces partially outdated national systems used to settle securities transactions. 23 national CSDs from 21 national markets in Europe have opted for T2S and will now migrate successively to the new system. Greece, Romania, Malta and Switzerland started today, followed by the migration of Italy, foreseen for 31 August 2015.\nOnce this first wave of migration is complete, Deutsche Bank will also have connected to the platform. Subsequent waves will take place on March 28, 2016 (Belgium, France, the Netherlands, Portugal), September 12, 2016 (Germany, Hungary, Luxembourg, Austria, Denmark) and February 6, 2017 (Slovakia, Estonia, Finland, Spain, Slovenia, Latvia and Lithuania). As they migrate, Deutsche Bank will be in a position to serve these markets via TARGET2-Securities.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}