{
    "url": "https://www.db.com/news/detail/20150607-deutsche-bank-appoints-john-cryan-to-succeed-juergen-fitschen-and-anshu-jain?language_id=1",
    "language": "EN",
    "article_type": "Ad-hoc Release",
    "publish_date": "June 7, 2015",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Deutsche Bank appoints John Cryan to succeed Jürgen Fitschen and Anshu Jain",
    "body": "The Supervisory Board of Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) decided at an extraordinary meeting today to appoint John Cryan (54) to the position of Co-Chief Executive Officer, effective July 1, 2015. Mr. Cryan has been a member of Deutsche Bank’s Supervisory Board since 2013, and has served as Chairman of the Audit Committee and a member of the Risk Committee. Upon becoming Co-CEO, he will step down from the Supervisory Board.\nMr. Cryan was President for Europe at Temasek, the Singaporean investment company, from 2012 to 2014. Previously, he was Chief Financial Officer of UBS from 2008 to 2011 and worked in corporate finance and client advisory roles at UBS and SG Warburg since 1987. He is a graduate of the University of Cambridge.\nThe appointment of Mr. Cryan as Co-CEO follows the decision of Jürgen Fitschen (66) and Anshu Jain (52), Co-Chief Executive Officers, to step down early from their roles. Mr. Jain will step down on June 30, 2015, and the Supervisory Board has asked him to remain as a consultant with Deutsche Bank from July 1, 2015, to January 2016.\nThe Supervisory Board has asked Mr. Fitschen to remain in his current role until the conclusion of the Annual General Meeting on May 19, 2016, to help ensure a smooth transition. Their contracts were due to run through to March 31, 2017. Upon Mr. Fitschen’s departure on May 19, 2016, Mr. Cryan will become sole CEO.\n\nDeutsche Bank AG\nTaunusanlage 12\n60325 Frankfurt am Main\nGermany\nISIN: DE0005140008\nWKN: 514000\nListed: Regulated market in Berlin-Bremen, Duesseldorf, Frankfurt (Prime Standard), Hamburg, Hanover, Munich und Stuttgart; EUREX; NYSE\nThe International Securities Identification Numbers (ISINs) of further financial instruments issued by Deutsche Bank AG, and admitted to trading on a domestic organized market or for which such admission has been applied for, are listed in the attached PDFs.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}