{
    "url": "https://www.db.com/news/detail/20150601-the-low-carbon-business-case-a-contribution-by-paul-polman-and-caio-koch-weser?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 1, 2015",
    "tags": [
        "Sustainability"
    ],
    "title": "The Low-Carbon Business Case",
    "body": "The New Climate Economy report, to which we gladly contributed as members of the Global Commission on the Economy and Climate, demonstrates that climate protection and economic growth can go hand in hand, and can even be mutually reinforcing. In Europe, the United States, China and elsewhere, governments have announced first commitments and undertaken credible steps to reduce emissions.\nThe change in direction is reflected in five hundred climate laws worldwide, including the pricing of emissions: directly, for example via the EU emissions trading scheme, and indirectly, for example via new air pollution regulation in China. The transition is on its way, but will need to pick up speed. The question hence is not if we want this transition. The question is how to sensibly manage it further.\nThe context in which the European economy needs to assert itself is increasingly being shaped by interdependence. Global trade, international investments, integrated supply chains and sophisticated logistics as well as modern communication tools and digitisation highly impact upon the direction of economic development. At the same time, in spite of a current slow-down, emerging markets have been experiencing rapid growth. For example, China has become the largest clean-technology investor. By 2030, Asia will represent approximately 60 per cent of the global middle-class consumption, up from 23 per cent in 2009.\nThese developments call for a fundamental reorientation in Europe.\nFirstly, in the face of a necessary and dynamic low-carbon transition we need to ensure investments are carried out based on thorough climate and regulatory risk analysis and do not lock us into an unsustainable business-as-usual default. We need to take warnings concerning a carbon bubble seriously. Investors such the $900bn sovereign wealth fund Norges are already recognising that climate change will undermine their returns and that governments will eventually truly get serious about climate action.\nComprehensive risk measurement and disclosure provide the basis for fully informed investment decisions. All parts of the investment industry need to deepen efforts to incorporate climate and sustainability and a more sophisticated understanding of risk into decision-making, due diligence, institutional investor contracts with asset managers, investment research, and credit ratings. In fact this is an opportunity to help restore trust in the financial sector.\nMore action is needed to expand consideration of carbon asset risk in financial institutions.\nFinancial regulators should work with banks to establish common environmental due diligence standards and jointly examine how future climate scenarios could be incorporated into financial institutions’ many risk models. For instance, the World Resources Institute and the UNEP Finance Initiative are working to create the first carbon asset risk guidance for financial institutions.\nMoreover, expanding Environmental, Social and Corporate Governance (ESG) reporting is a vital mechanism to secure access to investors that increasingly need ESG information in their investment process. Integrated Reporting and ESG data disclosure is the raw material for longer-term decision-making.\nSecondly, the EU should represent a forerunner market in key product areas, where ambitious standards and rules for market access create robust incentives for first-movers. Innovation has a central role to play in Europe’s competitiveness and low-carbon future. There is a clear need for technological innovation support and effective market pull mechanisms. For example, between 50 and 63 per cent of required CO2 emission reduction in the cement sector in 2050 relies on deployment of innovative processes.\nInnovation requires clear incentives to walk the path from research to the marketplace and overcome the ‘valley of death’. The 3.7 billion Euro initiative between the EU and the “Bio-Based Industries Consortium” is one example. This public-private partnership aims to reduce Europe’s dependency from fossil energy sources via innovative technologies and modern bio refineries.\nInnovation policy will need to be geared to a circular approach. The aspiration to replace one-way products with goods that are ‘circular by design’ and create reverse logistics networks is a powerful spur to new ideas – and jobs. Companies like Renault, Philips and Vodafone have already introduced circular principles. Unilever was able to save 200 million Euros with the implementation of its “Zero-Waste-Programme”.\nIn countries like the UK where there is a mature recycling sector and a fast-expanding re-use and waste-to-energy sector the business case for going zero waste is increasingly strong.\nThe creation of networks (clustering) including the public and the private sector and civil society can contribute to more fruitful and dynamic economic activity. For example, the EU promotes innovation by bringing together leading players from higher education, research and business to cooperate within Knowledge and Innovation Communities. Clustering incentives should increasingly work towards integrating climate and competitiveness in line with an ambitious low-carbon industrial policy framework focused on innovation.\nThe history of industrial change has seen changes happen mostly faster than initial skeptics thought was possible. Globally, countries are looking to the G7 for direction beyond a business-as-usual default and best practice in how to accelerate the transformation of economies. The communication of a global target of zero emissions by 2050 is badly needed to provide further clarity on the direction of travel.\nThe article was published by The Guardian and other international newspapers such as the German Handelsblatt. Both authors are members of the Global Commission on the Economy and Climate. Caio Koch-Weser is Vice Chairman of Deutsche Bank and Chairman of the Board of the European Climate Foundation. Paul Polman is CEO of Unilever and Chairman of the World Business Council for Sustainable Development.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}