{
    "url": "https://www.db.com/news/detail/20180910-the-three-worlds-of-tmt-are-colliding-deutsche-bank-s-22nd-telecoms-media-and-technology-conference?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 10, 2018",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "The three worlds of TMT are colliding",
    "body": "After years of gradual convergence, the telecoms, media and technology industries are now “colliding”, Deutsche Bank’s Head of European TMT Research told leading investors and corporates this week.\nIntroducing Deutsche Bank’s 22nd annual TMT Conference in London on September 6-7, Robert Grindle, Deutsche Bank’s Head of European TMT Research, said: “Consumers are watching more of their media content and buying and selling over either the fixed or mobile internets - technology is enabling mobile services and devices unimaginable a decade ago.”\nConvergence refers to when businesses in one of the TMT sectors expands into the others such as Google, originally a technology company, providing videos, music and other content which would traditionally have been offered by media companies.\nEmerging technologies are further accelerating convergence, Grindle added, highlighting: “Cloud computing, artificial intelligence, the internet of things and virtual reality, which have only just started to make an impact on our work and home lives.”\nThe Conference attracted 326 representatives from TMT corporates and investors specialising in the sector, including Chief Executives or Chief Financial Officers from Telecom Italia, Telefonica, Gocompare.com, WPP and Atos.\nIn addition to keynote speakers and expert panel discussions, Deutsche Bank arranged private meetings between investors and corporates with numbers up 42 percent from last year’s event, reflecting investor interest in the digital future.\nZoja Paskaljevic, Partner at specialist TMT deal advisor Ciesco, said: “There are exciting times ahead. Television is changing from single screen to multi-screen and we see a lot of effort on addressable television (a method of delivering highly targeted advertising to individual households) which will bring a big shift when technology is here”.\nTristia Harrison, Chief Executive Officer, TalkTalk said, “We are at a really interesting pivot point in fibre to the premises (FTTP) in the UK today”.\nShe added “we currently have very low penetration but just in the last 12 months we have seen a huge change driven by two things – some very serious infrastructure investors coming to the UK and thinking this is a great opportunity and secondly we are seeing really good intent from Openreach, which owns and maintains the telephone wires, ducts, cabinets and exchanges that connect nearly all homes and businesses in the United Kingdom – so we are really excited at TalkTalk”.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}