{
    "url": "https://www.db.com/news/detail/20180903-deutsche-bank-celebrates-40-years-in-south-korea-and-thailand?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 3, 2018",
    "tags": [
        "Company",
        "History"
    ],
    "title": "Deutsche Bank celebrates 40 years in South Korea and Thailand",
    "body": "At the beginning of September 1978, Deutsche Bank’s representation in East Asia was expanded considerably with the opening of branches in the South Korean capital Seoul and Thailand’s capital Bangkok.\nHowever, the branches operated under the name of the European Asian Bank (Eurasbank), a joint venture seeking to develop new markets in the Far East whose main shareholders were Deutsche Bank and initially five (later six) European partner banks. The bank’s head office was in Hamburg. Ulrich Cartellieri represented the interests of Deutsche Bank on the Management Board of Eurasbank.\nIn 1977 Eurasbank looked into the possibility of opening a branch in South Korea. The bank submitted a formal application for a licence after the local Ministry of Finance approved the establishment of a branch in Seoul. The reasons for this step were the growing demand for financing for Korean industrial projects and the express wishes of German companies operating in the country. At this time, Germany’s foreign trade with South Korea was growing strongly.\nEurasbank opened a branch in Seoul on September 4, 1978, making it the first German bank to operate in Korea. Deutsche Bank Management Board member Hans-Otto Thierbach travelled from Frankfurt to attend the opening ceremony at the Hyatt Hotel.\nSeoul branch of the European Asian Bank, 51-1 Namchang-Dong Chung-Ku, early 1980s\nSeoul had quickly become an interesting location for banking. In 1967 just six foreign banks were active there, whereas ten years later the number had increased to 40. According to the Korean finance minister, many of them had the prospect of establishing a longer-term presence in Seoul.\nDevelopments in Thailand were similar, except that the first exploratory talks to open a branch dated back to 1960. However, the plans were rejected at the time and only revived in 1977. That year, Thailand’s finance minister recommended that approval be granted for a branch of Eurasbank in Bangkok. In return, Thai Farmers Bank was to establish a branch in Hamburg.\nEurasbank obtained a licence on July 3, 1978 and began operations in an office building in central Bangkok on September 8, 1978. As in South Korea, it was the first German bank to establish its own branch in the country.\nThe President of the Bank of Thailand (right) Snoh Unakul congratulates Spokesman of the Management Board of Deutsche Bank Wilfried Guth at the opening of the Bangkok branch. In the centre stands Ulrich Cartellieri, then member of the Management Board of European Asian Bank and member of the then Management Board of Deutsche Bank from 1981 to 1997.\nTo mark the opening on September 8, 1978, a reception was held in the Great Ballroom of The Oriental, the recipient of numerous awards for best hotel in the world, and attended by Spokesman of the then Management Board of Deutsche Bank Wilfried Guth, and Michael Böhm, Ulrich Cartellieri and Bernard Stentzel from the Management Board of Eurasbank.\nThe Bangkok branch of European Asian Bank, 28/1 Surasak Road in 1978, the year it opened\nIn 1986 Deutsche Bank increased its stake in Eurasbank from 60 to 70 percent and changed the bank’s name to Deutsche Bank (Asia). The merger of Deutsche Bank (Asia) with Deutsche Bank AG was completed in 1988.\nSince the opening of the first branches in South Korea and Thailand, Deutsche Bank has contributed significantly to the development of the capital markets in both countries.",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 1
}