{
    "url": "https://www.db.com/news/detail/20180903-new-school-term-fresh-opportunities?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 3, 2018",
    "tags": [
        "Corporate Citizenship",
        "Education"
    ],
    "title": "New school term = fresh opportunities",
    "body": "It’s that time of year again. The summer holidays are over and the start of a new school year brings not only opportunities but also challenges. It’s a time in young people’s lives when they can do with a helping hand from someone who can support them, motivate them and spur them on to fulfil their potential.\nAnd last year, 4,000 volunteers from Deutsche Bank did exactly that. Their engagement exemplifies the positive impact Deutsche Bank’s Born to Be projects have had on 3.9 million youngsters since 2014. Like the school year, many of these projects are now starting up again. Find out about some of them below.\nEngaging young people in the UK\nNow in its ninth year, Design Ventura is a competition to foster creative ideas and teach entrepreneurial thinking. Since its launch in 2010 more than 61,000 students between the ages of 13 and 16 have turned their ideas into products with the support of the London Design Museum and Deutsche Bank volunteers. Participants learn about product design, pricing, production and packaging and the winning team’s efforts are rewarded by the thrill of seeing its idea actually go on sale at the Design Museum!\nAnother project that relies on creative ideas is our Student to STEMette project. Launched to counter the decline in the number of girls choosing careers in Science, Technology, Engineering and Mathematics (STEM), our STEMettes get to take part in competitions, hackathons and the Science Festival.\nAnother element of the programme is mentoring: women in STEM occupations at Deutsche Bank volunteer as mentors, coaching and advising young women over a period of four months and showing them what career opportunities are available in the banking industry to those with a STEM background. There are plans to extend the programme to other countries.\nAnd then there’s our Pathways to Banking and Finance programme. Now entering its second year it will continue to show British students from disadvantaged backgrounds what they need to get into finance and banking. Participants get a glimpse of life as a student, learn about all the careers on offer in the financial industry and they even get the chance to do a short internship at Deutsche Bank in London.\nHelping young people reach their full potential – Initiatives in Germany\nOne newcomer project is FinanzTuber, a competition that combines school kids’ love of internet videos with the chance to make one of their own and show their friends what they know about money. Open to students in grades 6 to 8 from schools all over Germany, volunteers from Deutsche Bank are close at hand to explain financial concepts they might want to include in their videos.\nAt this age, children are already used to having a certain amount of money, be it pocket money, a snack or lunch allowance, or they might be saving for something really special, but the competition will teach them much more! Teachers and youth group leaders can register their students for the school term 2018/19.\nJust one year older and just as exciting is our Build your Future (Baut Eure Zukunft) programme that has been developed by Deutsche Bank, Deutsche Bank Foundation and Social Impact. Aimed especially at promoting teamwork, honing social skills and nurturing empathy towards others, young people from schools all over Germany (grade 8 to 10) put their heads together and use a digital toolbox and design thinking techniques to come up with solutions to problems such as bullying, anxiety about the future or poverty.\nThey can upload their ideas to a designated website and might even get the chance to go to Berlin to compete in the final. Supported by volunteers from Deutsche Bank, the students work on solutions that address global issues such as climate change, gender equality and the fight against poverty\nAlso in its second term is the bank’s new Introduction to Banking programme for Refugees. Especially for newcomers in Germany, the programme is kicking off again in October and will be showing 60 young migrants what jobs the financial sector offers.\nFor those still focused on school work rather than embarking on their chosen career, there is the Studienkompass programme supported by Deutsche Bank Foundation, Accenture Foundation and the Foundation of German Business (Stiftung der Deutschen Wirtschaft). Launched in 2007 it has been helping students from non-academic families who want to go to university. It’s aimed at young people in their last two years at school who benefit from the advice and guidance of our volunteers.\nIt currently supports about 1,300 young people throughout Germany on their transition from school to university. Everyone on the programme will receive the help they need to become whatever it was they were born to be - just like the other 5 million children and young people that Deutsche Bank and its foundation plan to support by 2020 with their Born to Be initiatives.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}