{
    "url": "https://www.db.com/news/detail/20181024-a-message-from-christian-sewing-on-third-quarter-results?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 24, 2018",
    "tags": [
        "Company",
        "Financial Results",
        "Management & Leadership"
    ],
    "title": "A message from Christian Sewing on third-quarter results",
    "body": "Dear Colleagues,\nIn the third quarter we continued to deliver on what we promised in April. We are well on track to achieve our first profitable year since 2014.\nIn particular, we made headway on our cost reductions. We are very confident that we will meet our 2018 targets. On the other hand we have not yet achieved a turnaround in terms of revenues. We must therefore sustain our efforts to grow revenues across our businesses.\nWhat we’ve achieved in the past six months has been remarkable:\n— There’s a new spirit of discipline in our bank which is also visible in our numbers. This is a prerequisite to improving our credit ratings and achieving a better share price in the future. And you can be sure that we are doing everything possible to prevent a cost increase in the fourth quarter which we have seen too often in the past.\n— Our solid results in the third quarter are primarily due to lower costs and lower provisions for credit losses. The front office adjustments in our Corporate & Investment Bank – now largely completed – also played a role, costing us some revenues. Now we are in the position to get back on the front foot.\n— Going forward, we can focus on growth as our balance sheet has rarely been stronger. With a CET 1 ratio of 14 percent and excess liquidity of 76 billion euros, we have created firm foundations for our client business.\nOur pre-tax profit of 506 million euros in the quarter is a milestone on the road back to sustainable profitability. For the first nine months the number is 1.6 billion euros – that’s your success.\nWe have to build on this momentum to meet the announced target of a 4 percent post-tax return on tangible equity next year.\nThe prospects are good. The past few months have proven how much corporates, institutional investors and private clients are willing to work with us and how good and stable our client relationships are. Here are just a few examples:\n— We’ve seen outstanding successes in our origination and advisory business, having had leading roles in six of the ten biggest transactions by fee volume in the third quarter. In Europe we’ve had global coordinator roles in four out of the five biggest IPOs in 2018, making us the market leader this year. And we have a robust pipeline of transactions in our books. These are great achievements by the different teams.\n— Despite lower revenues, our investment bank is well on track in important areas. In Leveraged Finance, our market share is higher than a year ago. In Fixed Income & Currencies (FIC), we have gained ground versus the previous quarter.\n— Our global transaction bank has bought a share in US startup Modo, whose technology will allow us to process payments via non-banking platforms like Alipay, Paypal, M-Pesa and WeChat going forward – a key growth area within the payment sector. In Trade Finance, we’ll be working with six other banks on a ‘Trade Information Network’ platform. The revenues in our GTB business are not yet where we want them to be. But we are strongly determined to expand GTB as one of our core revenue engines under the new leadership of Stefan Hoops.\n— We have grown loan volumes by 7 billion euros in the quarter in our core businesses. Of this amount, 3 billion euros is attributable to our Private & Commercial Bank. At the same time, we continue to make good progress with the merger of Deutsche Bank and Postbank in our home market. We will announce the new management structure of our head office and infrastructure organisation shortly.\n— Our asset manager DWS has consistently increased its pre-tax profit since the IPO. During the third quarter, DWS signed a partnership with Tikehau Capital, which specialises in alternative investments. The French asset manager took part in DWS’s IPO earlier this year. In addition, we will expand our cooperation with the Italian insurer Generali, positioning DWS as one of its preferred asset managers for the distribution of investment policies throughout Europe.\nAll of this shows that our clients count on us. Whether it’s the risk of a trade war or Brexit, elevated public debt in many countries around the world, or rising volatility in the markets – it’s precisely in times of uncertainty that we can prove ourselves as successful advisors and risk managers for our clients. We have unique expertise in many areas and we should turn this to our clients’ advantage.\nWe can take some pride in what we have achieved over the past few months. However, there’s no reason to let up. On the contrary: we need to end the year on a strong note.\nWe’ll stay disciplined on costs, and we’ll turn around revenues – without compromising on our controls or our values. What we’ve achieved so far this year makes me optimistic. Let’s stay the course.\nBest wishes,\nChristian",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}