{
    "url": "https://www.db.com/news/detail/20181010-two-days-on-esg-deutsche-bank-brings-investors-and-companies-together?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 10, 2018",
    "tags": [
        "Sustainability"
    ],
    "title": "Two days on ESG – Deutsche Bank brings investors and companies together",
    "body": "“Typically, when you ask 100 investors how to define, integrate and invest according to environmental, social and corporate governance criteria (ESG) you end up with just as many replies”, says CIB’s ESG strategist Jan Rabe. Plenty of reasons to organise Deutsche Bank’s first ESG conference in Frankfurt (9 - 10 October 2018).\nThe event gave investors access to an exclusive selection of companies in 1-on-1 and group meetings and fostered debate around the future of ESG-centric investing. In addition, four panels discussed current trends, such as how to integrate fundamental and quant-based ESG factors into both company research and investment processes.\nHenrike Pfannenberg, Sustainable Investments Coverage, who moderated two panels, said investors were “increasingly looking to incorporate environmental, social and corporate governance information into their investment decisions, with social responsibility being an important driver.” Another important factor, she said, is improving risk-return considerations based on ESG information. Chief Data Scientist Andy Moniz highlighted the role artificial intelligence is already playing when it comes to sustainable investing. He and his team just launched α-DIG, Deutsche Bank’s unique, interactive web tool designed to quantify non-financial information.\nAdmittedly, corporate management and investor relations teams around the globe are still struggling to develop a cohesive view on the topic of ESG. Thus, recent regulatory initiatives like the European Commission’s Sustainable Finance Action plan aim to reorient capital flows towards a more sustainable economy and foster transparency and long-termism, as Steffen Hörter, Member of the European Commission’s Technical Expert Group on Sustainable Finance, made clear in his keynote speech.\nPanelist Ingo Speich, Head of Sustainability and Engagement at Union Investment, stressed that for investors, sustainability had to be beneficial in terms of earnings. “If sustainability does not bring any excess returns, it must reduce risks and thus bring advantages to investors,” he said.\nYet for Benjamin Weller, Capital Solutions & Sustainable Financing, the trend is clear – and the future green: “Green financing will play a crucial role in transforming our carbon-intensive economy into a less carbon-intensive and climate-friendly one. The private sector is crucial to ensuring that sufficient capital is mobilised to make such a transition.”\nGerald Podobnik, Global Head of Capital Solutions & Sustainable Financing, added: “Deutsche Bank has everything in place. We, and the whole industry, are relying on the EU commission for clear rules for all market participants. Once these rules are in place, we will go out of the niche towards the masses.”\nIntegrating ESG is integral to delivering on Deutsche Bank’s purpose to create #PositiveImpact. The bank’s ESG products and services offering is growing across all business lines. The newly established Sustainability Council, which includes all business lines and major infrastructure functions, advises the Management Board on ESG topics and demonstrates Deutsche Bank’s commitment to sustainable economic development.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}