{
    "url": "https://www.db.com/news/detail/20181010-emmanuel-rosner-joins-deutsche-bank-to-lead-autos-and-auto-technology-research-team?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 10, 2018",
    "tags": [
        "Company"
    ],
    "title": "Emmanuel Rosner Joins Deutsche Bank to Lead Autos and Auto Technology Research Team",
    "body": "New York, October 10, 2018. Deutsche Bank today announced that Emmanuel Rosner has joined the Equity Research Team to lead coverage of the autos and auto technology sector. He is based in New York and reports to Steve Pollard, Global Head of Equity Research.\nWith nearly 14 years of experience covering the sector, Rosner joined Deutsche Bank from Guggenheim and previously worked at CLSA Americas where he served as a Managing Director and Senior Analyst for six years covering automakers, suppliers, and automotive technology. Before CLSA Americas, he held equity research roles with Barclays Capital (Lehman Brothers) and Morgan Stanley. He was recognized as the #1 autos earnings estimator by Starmine in 2018, and as “top 3” in 2016, 2015, and 2014.\n“Emmanuel brings a wide breadth of experience and will be a key contributor to our longstanding dominant Global Autos franchise, including Deutsche Bank’s Annual Flagship Conference,” Pollard said. “He will be instrumental in our coverage of this important sector, providing clients with independent and timely insights. We are excited to welcome him to the team.”\nFor further information please contact:\nDeutsche Bank AG\nPress & Media Relations\nMaryanne Caruso\nPhone: +1 (212) 250-2186\nmaryanne.caruso@db.com\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement. Such factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission. Such factors are described in detail in our SEC Form 20-F of 20 March 2015 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}