{
    "url": "https://www.db.com/news/detail/20190730-al-gore-to-address-millennial-clients-as-sustainability-takes-centre-stage?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 30, 2019",
    "tags": [
        "Corporate products",
        "Sustainability",
        "Wealth"
    ],
    "title": "Al Gore to address millennial clients as sustainability takes centre stage",
    "body": "Al Gore, the former US Vice President and Nobel Peace Prize-winning environmentalist, will be the headline speaker at this year’s Deutsche Bank Wealth Management Next Generation Innovation Summit in Silicon Valley as sustainability becomes a vital consideration for millennial investors.\nGore, who is also the co-founder and chairman of Generation Investment Management, will speak about issues including responsible investing and environmental challenges at the three-day flagship event in November, which introduces young clients to some of the world’s leading technology entrepreneurs, academics and venture capitalists.\n“We’re seeing a surge in interest from our millennial clients on every continent in ways to invest responsibly and for the long-term health of the planet,” said Salman Mahdi, Wealth Management Vice-Chairman, who oversees the NextGen programme.\n“Our summits are increasingly focused on fostering relationships between young people who understand the financial opportunities and the moral imperative of working together for a more sustainable future,” he added.\nThis year’s event, organised in partnership with Stanford University, will feature its first ever session with the World Economic Forum’s Centre for the Fourth Industrial Revolution. It is expected to include speakers from cutting edge companies including SoftBank, Silver Lake, Mubadala Ventures, Bloomberg Beta, Salesforce and Vista.\n“This event perfectly encapsulates where we see the future of Deutsche Bank Wealth Management: giving entrepreneurial millennial clients unique insights into key topics such as sustainability in one of the most innovative cities in the world.” said Fabrizio Campelli, Global Head of Deutsche Bank Wealth Management.\nThe summit is part of Wealth Management's two-decade old Next Generation programme, which counts around 500 alumni from its educational summits. Building multi-generational relationships with clients is a key part of the business's long-term growth strategy, as ultra-high net worth baby boomers are expected to pass down approximately 4 trillion dollars over the coming decade.\nGore was a co-recipient of the Nobel Peace Prize in 2007 in recognition of work such as his documentary “An Inconvenient Truth” to inform the public about man-made climate change. He is the founder and chairman of The Climate Reality Project, a nonprofit devoted to solving the climate crisis. His experience in Silicon Valley includes his roles as a senior partner at Kleiner Perkins Caufield & Byers and a member of Apple Inc.’s board of directors.\nWealth Management’s Chief Investment Office has singled out environmental, social and governance (ESG) investing as one of the long-term strategic themes that will have the biggest impact on the world and on clients’ portfolios. Justin Rockefeller, the great-great-grandson of the oil magnate John D. Rockefeller, urged NextGen clients to invest in line with their values at an event in New York in May, saying “profit and purpose are not mutually exclusive”.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}