{
    "url": "https://www.db.com/news/detail/20190724-a-message-from-christian-sewing-on-second-quarter-results-2019?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 24, 2019",
    "tags": [
        "Company",
        "Financial Results",
        "Management & Leadership"
    ],
    "title": "A message from Christian Sewing on second-quarter results 2019",
    "body": "Dear Colleagues,\nThe past few weeks have been extremely challenging for all of us. After we announced our new strategy on July 7, we had numerous questions to answer from our colleagues, our clients and our business partners. But we can say with confidence that we have passed the first hurdle: by and large our strategy is no longer being called into question, either by our investors or by the media or – most importantly – by our clients. And I have the impression that you too believe we are on the right track.\nNow it is up to us to prove that we can implement these plans. Having built the necessary foundations over the past 15 months, we were able to start executing from day one.\nOur new Capital Release Unit is already set up and we have started winding down assets that no longer fit into the strategy. We have exited our Cash Equities positions and initiated a shutdown of the related systems. We are also making good progress in cost reductions, which unfortunately includes parting with colleagues. Over the past two weeks over 900 employees have been given notice or informed their role will be eliminated. This is painful, but it was important for us to give clarity rather than to leave people in limbo. Where our restructuring creates the need for further reductions, we will do everything we can to be able to communicate our decisions as soon as possible.\nActing quickly also means that we absorb the financial consequences of the transformation as fast as possible. This has had a major impact on our financial results for the second quarter of 2019. We recorded a loss after income taxes of 3.1 billion euros. This loss is due to a number of impairments which we have explained in more detail in today’s results releases. Without these effects we would have made a profit, recording net income of 231 million euros.\nI would like to thank you for your enormous hard work which led to these results. We can be proud of our cost discipline. Excluding transformation charges and bank levies, we recorded our sixth consecutive quarter of year-on-year reductions in adjusted costs.\nHowever, this was not sufficient to offset a 6 percent decline in revenues in the second quarter. Even so, this reported result hides some better underlying trends. Revenues in our more stable businesses – the Private & Commercial Bank, Global Transaction Banking and DWS – increased by 1 percent in the first half year excluding specific items and contributed almost two thirds of Group revenues:\n— In the Private & Commercial Bank, revenues increased by 1 percent if adjusted for specific items and exited businesses – that is a real achievement in the current interest rate environment. And we reported loan growth as well as net inflows which should have a positive impact on our revenues in the quarters to come.\n— In Global Transaction Banking, revenues grew by 3 percent when adjusted for a business disposal in the first half of 2018. We recorded growth in important areas including Cash Management and Trade Finance. We are confident that we can comfortably maintain this pace of growth.\n— In Asset Management, too, revenues increased, by 1 percent compared with the first half of 2018. And DWS generated its second consecutive quarter of net inflows.\nBy contrast, in investment banking, we faced strong headwinds in the second quarter including challenging market conditions as revenues declined across the industry. Areas which are relatively more important for our bank compared to our peers have suffered in particular – including Europe as a region and segments like Leveraged Finance. And towards the end of the quarter we had to deal with increasing speculation about our future setup which affected our client business.\nWe now have the right setup to quickly regain lost ground. In our Fixed Income & Currencies business, which will remain a core part of our strategy, revenues dropped, but broadly in line with our peers. Rates produced a solid performance when reflecting the perimeter adjustments made in 2018. In Global Credit Trading, we increased our revenues thanks to continued robust results from our Commercial Real Estate and Asset Backed Securities businesses, supported by a solid quarter in Flow Credit. In addition, we increased market share in important areas including FX. And while revenues in Origination & Advisory decreased in the second quarter, I am particularly pleased to see that we have priced eight Equity Capital Markets (ECM) transactions since our strategy announcement. This also makes me confident that we will be able to stabilise revenues in investment banking.\nNow we can look ahead with more optimism. I am well aware that our restructuring efforts will continue to absorb some resources. But we will be successful if we follow one principle: we must put our clients at the centre of our thinking, both in the business divisions and infrastructure functions. It should always be our ambition to find a solution – of course in line with our policies and our values. What we do for our clients is the reason we exist.\nWe’re not just at the beginning of our transformation of Deutsche Bank – after two weeks, we’re already right in the middle of it. And I’m incredibly optimistic when I think about what I’ve seen at our bank in that short time. I can feel a real surge of energy: many people are keen to make a fresh start. It was the same thing I felt at the first meeting of our newly established Group Management Committee. People did not shy away from confronting the toughest issues we face, but first and foremost were united in coming up with solutions and working passionately to drive our bank forward.\nIt’s this spirit that I want to see all over our bank in the coming months. Thank you for your great encouragement in recent weeks. Thank you for supporting us and me personally on our journey together.\nBest wishes,\nChristian Sewing",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}