{
    "url": "https://www.db.com/news/detail/20190712-dagmar-valcarcel-nominated-to-join-deutsche-bank-s-supervisory-board?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "July 12, 2019",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Dagmar Valcárcel nominated to join Deutsche Bank's Supervisory Board",
    "body": "The Supervisory Board of Deutsche Bank has nominated Dagmar Valcárcel (53) to join it as a new member. She will succeed Stefan Simon (49), who has been appointed as Senior Group Director (Generalbevollmächtigter) of the bank effective August 1, 2019 and is intended to become a member of its Management Board. He has therefore resigned from his Supervisory Board mandate after three years, effective July 31, 2019. Valcárcel is also to become the Chairperson of the Integrity Committee, which was previously chaired by Simon.\nIn accordance with the procedure recommended by the German Corporate Governance Code, Valcárcel is to be appointed by the court as a member of the Supervisory Board and stand for election by the shareholders at the next Annual General Meeting. The relevant application was filed with the local court in Frankfurt today.\nPaul Achleitner, Chairman of the Supervisory Board of Deutsche Bank, said: “On behalf of the entire Supervisory Board, I am extremely delighted to again win a highly qualified attorney for our Supervisory Board. Thanks to her many years of international experience in a variety of areas in the financial industry, including at Barclays Bank Plc, a major bank with global operations, she brings key expertise to the Supervisory Board.”\nFor 24 years, Dagmar Valcárcel has held various positions in the financial industry, in Germany, the UK, Spain, Greece, Switzerland and Luxembourg. Until June 2019, she was the Non-Executive Chair of the Management Board of Andbank Asset Management Luxembourg, and she has been a member of the Supervisory Board of amedes Holding, based in Hamburg, since 2015. Previously, from 2010 until 2017, she held various leading roles in Barclays Bank, among others, as General Counsel for Western Europe and Head of Strategic Resolution for Insurance Operations. Valcárcel holds a PhD in Law from the University of Bonn and is admitted to the bar in Germany, the UK and Spain.\n  For further information please contact:\nDeutsche Bank AG\nMedia Relations   \nSebastian Krämer-Bach\nPhone: +49 69 910-43330\nEmail:sebastian.kraemer-bach@db.com\nChristine Peters\nTel. 069-910 62303\nE-Mail: christine.peters@db.com\nInvestor Relations\n+49 800 910-8000 (Frankfurt)\n+44 20 7541-4100 (London)\n+1 212 250-0604 (New York)\ndb.ir@db.com\n  About Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nForward-looking statements\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement. Such factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission. Such factors are described in detail in our SEC Form 20-F of 22 March 2019 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}