{
    "url": "https://www.db.com/news/detail/20190707-deutsche-bank-s-transformation-a-message-from-ceo-christian-sewing-to-the-staff?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 7, 2019",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Deutsche Bank's transformation – A message from CEO Christian Sewing to the staff",
    "body": "Dear Colleagues,\nAt the Annual General Meeting in May I said that we would speed-up the transformation of our bank significantly, that we would have to take faster and more radical action. Since then, many of you have asked me when we would announce concrete next steps.\nToday is that day: After further stabilising our bank last year, we are now entering the next phase – and that means nothing less than a fundamental transformation of our bank.\nFirst let me say this: I am very much aware that in rebuilding our bank, we are making deep cuts. I personally greatly regret the impact this will have on some of you. In the long-term interests of our bank, however, we have no choice other than to approach this transformation decisively. Only then can we build on our long-standing history and make Deutsche Bank a leading bank once again. A bank which we can be justifiably proud of.\nI will not go over all the details that we just published in our media release.\nI will stress though that what we have announced today is nothing less than a fundamental rebuilding of Deutsche Bank through which we are ushering in a new era for our bank. This is a rebuilding which, in a way, also takes us back to our roots. We are creating a bank that will be more profitable, leaner, more innovative and more resilient. It is about once again putting the needs of our clients at the centre of what we do – and finally delivering returns for our shareholders again.\nThe transformation will bring us closer to our core strength, our DNA. Almost 150 years ago, we were founded as a bank that serves German and European companies worldwide, that provides a global network and that paves the road to Europe for international companies and investors. This is exactly the role that the Corporate Bank which we are forming will play. Going forward, our Corporate Bank will also serve the corporate and commercial clients of Deutsche Bank and Postbank in our home market. This division is focused on midcap clients, family-owned companies and multinational corporates. It will hold deposits of more than 200 billion euros and process financial transactions with a value of one trillion euros every day.\nAlongside our Corporate Bank will be an Investment Bank that connects our corporate clients with capital markets worldwide. In this division, we will concentrate on those areas in which we have a longstanding expertise – credit, fixed income and currencies, as well as strategic advice. Going forward, our Investment Bank will be smaller – but all the more stable and competitive.\nThe strict separation between private and corporate clients also means we will have a much more focused private client business. In our home market, we are already a market leader in many businesses. It is our stated goal also to achieve that position in areas where we are not yet leading but have strong growth potential by offering innovative digital solutions and outstanding advice. The task is to find ways to combine these two propositions, because it is exactly in this combination that our strength lies. In order to achieve this, we need to manage our cost base more efficiently. That is why we will accelerate the integration of Deutsche Bank and Postbank.\nOur goal is clear: We want to achieve a post-tax Return on Tangible Equity (RoTE) of 8 percent by 2022. It is absolutely vital that we achieve this if we want to be competitive in the long term.\nWe are not too far away from this goal. The RoTE of DWS is already above 10 percent, the Corporate Bank is only slightly below, and we are well on track to reaching that goal in the Private Bank. In the Investment Bank, we are highly profitable and stable in many areas of the business and will improve significantly over the coming years.\nIn those areas where we are not currently competing to win, we are now taking decisive action. Indeed, we have no choice other than to concentrate our strengths and resources where we play to win and where we can make a true difference for our clients.\nThat means we will be fundamentally rebuilding our bank. In total, we will be transferring 74 billion euros of risk weighted assets into the Capital Release Unit (CRU) to be sold over the course of the coming years. The term “bad bank”, which is often used in the media, is in this case misleading. Given the high quality and in many cases short duration of the assets, we expect these to be wound down quickly. This will serve to free up significant amounts of capital. As a result, we intend to return 5 billion euros to shareholders from 2022.\nThe rebuilding will, however, only be successful if we fundamentally reshape our infrastructure – all of the cross-divisional functions supporting the businesses. Here, we also have to become more innovative and more efficient whilst simultaneously strengthening our controls.\nLet us start with innovation: We intend to invest 13 billion euros in technology by 2022. In addition, we will have a Management Board member responsible for technology, data and innovation. With Bernd Leukert, we will be joined by someone who was previously in charge of product development at SAP. In the age of cloud-computing and platform economies, he will ensure that we accelerate our progress still further. In doing so, we can build on the many innovations that our bank has developed over the past couple of years.\nThis, in turn, will give Frank Kuhnke the necessary freedom to concentrate on what he does better than anyone else. He will put the structure and processes of our infrastructure functions to the test and make them leaner and more efficient. For many years, our fixed costs have been way too high, as is demonstrated by our cost-income ratio. We intend to reduce adjusted costs by about 6 billion euros to 17 billion euros by 2022.\nOne thing is certain – we will not make any sacrifices when it comes to our control functions. On the contrary, we can and will further improve them. That is why we are bringing risk management together with the divisions for compliance and anti-financial crime. These areas which are of utmost importance to our integrity and to trust in our bank will therefore be combined in a single division led by Stuart Lewis.\nThat brings us to the people who will execute the transformation: our leadership team. One thing is certain: If we are serious about shaping a new Deutsche Bank, change will need to start right at the top. That is a matter of structure as much as of individual team members.\nLet me start with the leadership structure that we have also announced today. Going forward, our Management Board – next to our President Karl von Rohr and myself – will only represent the bank’s central functions and regions. This includes Christiana Riley, who will be responsible for our business in the Americas, and Stefan Simon, who will be responsible for Legal and Regulatory Affairs. It is intended that both, alongside Bernd Leukert, will become members of the Management Board as soon as regulatory approvals have been obtained.\nOn the other hand, we also have a few goodbyes. I would like to whole heartedly thank Sylvie Matherat, Garth Ritchie and Frank Strauß for their service to Deutsche Bank. Together, we have come a long way – especially over the course of the past year. I personally have greatly appreciated the spirit of cooperation with all three of them. However, I am convinced our new structure is an important step forward for our bank – because it will enable us to become more agile and flexible.\nWe are deliberately separating the business heads from the responsibilities of the Management Board which require a lot of time and attention. Instead, we want to enable those responsible for the business divisions to act as entrepreneurs within our bank – all the while being laser-focused on our clients and what we can offer them. My colleagues and I expect the highest degree of integrity and teamwork. They have to be role models – internally as well as externally. The colleagues that are now joining the newly formed Group Management Committee represent exactly those values.\nOur Corporate Bank will be led by Stefan Hoops, who will report to me.\nMark Fedorcik will be Head of the Investment Bank. Ram Nayak will head the Fixed Income and Currencies Business. Both will also report to me.\nThe Private Bank in Germany will be led by Manfred Knof, former CEO of Allianz Germany. Ashok Aram will lead the international retail business (including international commercial clients) and Fabrizio Campelli will lead the Wealth Management Business. All three will report to my deputy, Karl von Rohr.\nAsoka Wöhrmann will continue to lead our asset management business DWS and will also report to Karl von Rohr.\nThe newly formed Capital Release Unit will be led by Louise Kitchen and Ashley Wilson, both of whom will report to Frank Kuhnke.\n  The Group Management Committee will be supported by the so-called Senior Leadership Team, the extended management circle. The team will comprise 12 members, representing the relevant infrastructure functions.\nWe were determined to form a team that would represent trust, strength in innovation and an entrepreneurial mindset – and that would enable us to make a credible fresh start.\nLet me summarise again what we are doing:\nGoing forward, we will have four businesses that will be entirely focused on our clients.\nWe are focusing our Investment Bank, we will be less dependent on Sales & Trading and are shrinking our balance sheet.\nWe are creating a Corporate Bank which will be at the centre of our bank.\nWe aim to reduce our adjusted costs by over a quarter and to simultaneously invest 13 billion euros in technology by 2022.\nAnd we are not asking our shareholders to pay for this transformation but instead plan to return capital to them.\n  All of this will create a new, better Deutsche Bank.\nHowever, we also have to face the fact that this transformation will require uncomfortable decisions. This is especially true for the sizeable workforce reductions. I can assure you that my colleagues and I appreciate that this impacts people and affects their lives in a profound way. That is why we will do whatever it takes to implement these cuts as responsibly as possible – I consider it our duty to do so. The works councils and employee representatives will be consulted where applicable and statutory participation rights will be safeguarded.\nTaking this decision has not been easy. It has far-reaching consequences for our bank – the bank that I have been working at for almost thirty years now.\nBut I am determined, and so is my leadership team: This is about thinking radically and thinking differently. It is about a new culture. A culture that enables rather than prevents. A culture that always puts the bank and its clients first, before the interests of the individual. A culture where integrity and teamwork are core values. A culture that takes our responsibility for the economy and for society seriously. A culture that we are all proud of and where extraordinarily talented people want to work.\nThank you for your support.\nBest wishes,\nChristian Sewing\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}