{
    "url": "https://www.db.com/news/detail/20190707-deutsche-bank-announces-new-leadership-team?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "July 7, 2019",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Deutsche Bank announces new leadership team",
    "body": "As part of its radical transformation, the Supervisory Board of Deutsche Bank has changed the leadership structure of the bank starting August 1. It will give its leaders more flexibility, accelerate decision-making processes and encourage entrepreneurship within the bank.\nFrom August 1, Deutsche Bank will be managed by a governance structure that should ensure the greatest possible connectivity among the team and with the other management levels of the bank:\nThe Management Board will comprise central and regional functions. It will be responsible for the strategy of the bank. Christiana Riley, Bernd Leukert and Stefan Simon have been appointed new board members.\nA new Group Management Committee (GMC) will include the Management Board members as well as the heads of the operative business divisions. The GMC will connect the Management Board better with the heads of the businesses. The GMC should accelerate decision-making and increase the entrepreneurial spirit in the businesses.\nAlong with Garth Ritchie who will advise the bank until end of November, Management Board members Sylvie Matherat and Frank Strauß will leave the bank as of July 31.\n  The new composition of the Management Board\nThe Supervisory Board has appointed three Senior Group Directors who will join the Management Board once clearance from the regulatory authorities has been granted:\nChristiana Riley will take over responsibility for the Americas with immediate effect. Her appointment as member of the Management Board underlines the relevance of our footprint in the US market for Deutsche Bank and its clients. Riley, who was born in the US, joined the bank in Frankfurt in 2006 after working in investment banking and at McKinsey. Her roles at the bank have included working in the former strategy department (AfK). Since April 2015 she has been Chief Financial Officer for the Corporate & Investment Bank (CIB). She will report to Christian Sewing pending regulatory approval for her Management Board membership.\nBernd Leukert will join Deutsche Bank on September 1, 2019, responsible for technology, data and innovation. Leukert has been a member of the Management Board of SAP SE since 2014. He brings 25 years of experience in product development at the leading German software firm. His appointment reflects the strong commitment of Deutsche Bank to significantly improve its IT both to become more efficient and to drive innovation. Pending regulatory clearance, Leukert will report to Frank Kuhnke.\nStefan Simon will become Chief Administrative Officer (CAO) and take on responsibility for regulatory affairs and legal. He has been a member of Deutsche Bank’s Supervisory Board since August 2016 and has been Chairman of its Integrity Committee. Simon is a lawyer and tax consultant and a former partner at Flick Gocke Schaumburg. He has taught as an honorary professor at the University of Cologne since 2008 and is a renowned expert in governance, compliance and corporate law. With his appointment, Deutsche Bank is reaffirming its commitment to good corporate governance and a trusted relationship with the regulatory authorities. Until regulatory clearance, Simon will report to Karl von Rohr.\n  The responsibilities of the current board members will change as follows:\nChief Executive Officer Christian Sewing takes on responsibility for the Corporate Bank and the Investment Bank.\nPresident Karl von Rohr will take on responsibility for the Private Bank and Asset Management (DWS). Additionally, he will retain regional responsibility for Germany and continues to be responsible for Human Resources.\nChief Operating Officer Frank Kuhnke will gain responsibility for the Capital Release Unit and for the Europe, Middle East and Africa (EMEA) region.\nChief Risk Officer Stuart Lewis will assume additional responsibility for Compliance and the Anti-Financial Crime Unit. He will also gain responsibility for the UK and Ireland.\nJames von Moltke will continue in his role as Chief Financial Officer.\nWerner Steinmüller remains CEO of the Asia-Pacific region.\n  \"To meet the anticipated challenges we need a management team that can not only execute against a demanding plan but is also capable of responsibly seizing entrepreneurial opportunities. We are convinced that under the leadership of Christian Sewing this new team will succeed,” said Paul Achleitner, Chairman of the Supervisory Board.\nBesides the departure of Garth Ritchie which has already been communicated, two other board members will leave the bank as of July 31.\nSylvie Matherat has been Chief Regulatory Officer since 2015, responsible for relations with regulators. She joined from Banque de France in 2014. During her time at Deutsche Bank, she has significantly increased the scope and the quality of compliance and anti-financial crime controls. “Under Sylvie Matherat’s leadership the bank has significantly invested in technology and personnel and strengthened its control systems. She has not only systematically and technologically advanced the bank in the area of regulation, compliance and anti-financial crime but she has also significantly contributed to Deutsche Bank's new compliance and risk culture,\" said Chairman Paul Achleitner.\nFrank Strauß has been a member of the Management Board since 2017, responsible for the Private & Commercial Bank (PCB). He has shaped the Private and Business Clients business of Deutsche Bank for nearly three decades, and pushed forward digitalization and growth into new markets. During the course of his career he held a number of management positions at Deutsche Bank, including coordinating the European operations of the bank’s Private & Business Clients division. He was also responsible for developing the bank’s Asian operations in Mumbai and Beijing. Having headed Private & Business Clients Germany since 2006, he joined the Management Board of Postbank in 2011 and became Chairman one year later. ”For almost 30 years Frank Strauß has shown strong leadership and made an important contribution to successfully developing the Private and Corporate Banking of Deutsche Bank. We regret that he does not support the restructuring as planned. His departure is the logical consequence. We wish him every success in his future career,” said Chairman Paul Achleitner.\nThe new Group Management Committee\nThe new Group Management Committee (GMC) is designed to more closely link the Management Board to the divisions. It comprises Management Board members as well as leaders of the business divisions.\nWithin the GMC, Stefan Hoops will oversee the new Corporate Bank. Hoops has been at Deutsche Bank since 2003 and Head of the Global Transaction Bank (GTB) and Head of CIB Germany since October 2018. Before this he worked for the bank in New York. He will report to Christian Sewing.\nMark Fedorcik will be Head of the Investment Bank. Fedorcik joined Deutsche Bank through Bankers Trust in 1995 and has had many investment banking leadership roles during his career at Deutsche Bank, including as Head of GTB in the US.\nRam Nayak will lead fixed income and currency sales and trading in the Investment Bank. He joined Deutsche Bank in 2009 after working for Citibank, Merrill Lynch and Credit Suisse. His roles have included chairing CIB’s Capital and Risk Committee and serving as head of its fixed income trading business.\nFedorcik and Nayak will report to Christian Sewing.\nManfred Knof will join Deutsche Bank on August 1, 2019, as the Head of Private Banking Germany. Knof had a long career at the financial institution Allianz, including as CEO of Allianz in Germany from 2015 to 2017. He will report to President Karl von Rohr.\nAshok Aram has been Head of PCB International since October 2018 and CEO of EMEA since November 2015. Apart from a one-year break, Aram has worked for Deutsche Bank for over 20 years in a variety of international management roles at Deutsche Bank. He will report to Karl von Rohr, as well as to Frank Kuhnke in respect of his role in EMEA.\nFabrizio Campelli, who joined Deutsche Bank in 2004, has been the Global Head of Wealth Management since 2015. He was previously Head of Strategy & Organizational Development as well as Deputy Chief Operating Officer for Deutsche Bank Group. He will report to Karl von Rohr.\nLouise Kitchen will co-head the Capital Release Unit and represent it on the GMC. She has been at the bank since 2005, most recently as Head of Institutional & Treasury Coverage. She will report to Frank Kuhnke.\nAshley Wilson will co-head the Capital Release Unit. He is currently Head of Global Trading, Equities. He was previously Head of Global Prime Finance and joined Deutsche Bank in January 2014. Prior to joining Deutsche Bank, he held senior positions at Morgan Stanley, Bank of America Merrill Lynch and Barclays. He will report to Frank Kuhnke.\nAs Chairman of the Management Board of the DWS asset management unit, Asoka Wöhrmann will also be a member of the GMC. In his role as Senior Group Director of Deutsche Bank, he will report to Karl von Rohr.\nChristian Sewing, Chief Executive Officer, said:\n“We are proud to have assembled this team of great, experienced leaders for the deep transformation on which we are now embarking. I am convinced that together we can build a new entrepreneurial and innovative culture at our bank. I expect unwavering teamwork and integrity. Together we share one goal: to make Deutsche Bank an institution driven by the desire to make our clients happy and successful.”\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nLondon\nCharlie Olivier\nPhone: +44 207 54-57866\nEmail: charlie.olivier@db.com\nFrankfurt\nSebastian Krämer-Bach\nPhone: +49 69 910 43330\nEmail: sebastian.kraemer-bach@db.com\nInvestor Relations\n+49 800 910-8000 (Frankfurt)\n+44 20 7541-4100 (London)\n+1 212 250-0604 (New York)\ndb.ir@db.com\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement. Such factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission. Such factors are described in detail in our SEC Form 20-F of 22 March 2019 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 3,
    "rating": 2.3,
    "likes": 8
}