{
    "url": "https://www.db.com/news/detail/20190705-garth-ritchie-to-leave-deutsche-bank?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "July 5, 2019",
    "tags": [
        "Company"
    ],
    "title": "Garth Ritchie to leave Deutsche Bank",
    "body": "Garth Ritchie, President of Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) and Head of the Corporate & Investment Bank, is leaving the bank by mutual agreement.\nMr. Ritchie joined Deutsche Bank in 1996 as an associate in the bank’s Johannesburg office, and went on to hold senior management positions across the investment bank.\nHe became a member of the Global Markets Executive Committee in 2009 as Head of Equities and held a range of leadership positions across the division. In January 2016, he was appointed to the Management Board with responsibility for the bank’s Markets division. In 2017 he became Co-Head of the newly created Corporate & Investment Bank (CIB). One year later he became its sole Head and was appointed as President.\nPaul Achleitner, Chairman of Deutsche Bank’s Supervisory Board, said: “We thank Garth Ritchie for his dedication and the remarkable contribution he has made to the bank over his long career. He helped Deutsche Bank to weather an extremely challenging period and we wish him all the best for the future.”\nChief Executive Officer Christian Sewing added: “Garth Ritchie has been a life-long employee of Deutsche Bank: highly engaged and committed and loyal to the firm. I would like to thank him personally for his excellent cooperation and partnership through his career and over the past 15 months as my deputy.”\nGarth Ritchie said: “It is now almost twenty three years to the day since I first joined Deutsche Bank as an associate. The bank is a remarkable institution and it has been a privilege to work here. I look back on my career with pride.\n\"I took over the leadership of the investment bank at a very challenging time, and over the past three years we have made significant progress to improve and stabilise its financial metrics. I believe the bank is now ready for further transformation, and it is the right time for new leadership to take the division forward.”\nMr. Ritchie will be stepping down as Head of CIB and as a member of the Management Board on July 31. To ensure a smooth transition of time critical UK regulatory matters including Brexit-related issues he will continue to advise the bank until end of November 2019.\nMr. Sewing will assume responsibility for the Corporate & Investment Bank on the Management Board. Further announcements for the divisional leadership team will follow in due course.\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nLondon\nCharlie Olivier\nPhone: +44 207 54-57866\nEmail: charlie.olivier@db.com\nFrankfurt\nSebastian Krämer-Bach\nPhone: +49 69 910 43330\nEmail: sebastian.kraemer-bach@db.com\nInvestor Relations\n+49 800 910-8000 (Frankfurt)\n+44 20 7541-4100 (London)\n+1 212 250-0604 (New York)\ndb.ir@db.com\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement. Such factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission. Such factors are described in detail in our SEC Form 20-F of 22 March 2019 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 3,
    "rating": 2.3,
    "likes": 1
}