{
    "url": "https://www.db.com/news/detail/20190702-honouring-50-years-of-lgbtqi-pride?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 2, 2019",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "Honouring 50 years of LGBTQI+ Pride",
    "body": "In the early hours of the morning on June 28, 1969, police raided The Stonewall Inn on Christopher Street in Greenwich Village, New York City. The raid was no different to many others that had previously taken place but the multi-day uprising that ensued certainly was.\nThe Stonewall uprising is considered to be the most important event leading to the modern fight for LGBTQI+ (lesbian, gay, bisexual, transgender, queer and intersexual) rights and was the birth of Pride marches the world over. To celebrate LGBTQI+ self-acceptance and demanding legal rights and social inclusion, people join these annual marches using the rainbow colours associated with the movement.\nManagement Board member Stuart Lewis marches for Pride in New York\nDeutsche Bank’s Chief Risk Officer Stuart Lewis said: “Stonewall 50 and World Pride is an opportunity to celebrate the progress made and recognise the brave individuals who helped ignite a movement. In the past 50 years we have seen important progress, and we at Deutsche Bank have contributed to it. I’m delighted to join these celebrations to show my solidarity and to recognise that the work remains ongoing and urgent and we need all of our allies to be part of the change”. \nIn his role as global executive sponsor of dbPride, Stuart Lewis joined the first-ever dbPride Global Summit last week. The three-day summit in New York City brought together 25 leads of dbPride chapters from eleven countries (Australia, Brazil, Germany, Hong Kong, India, Italy, Japan, the Philippines, Singapore, the UK and the US) to celebrate, share best practice, continue the momentum on LGBTQI+ inclusion, and march together in NYC Pride on Sunday June 30.\nStuart took part as the first ever Management Board member to march in a Pride parade and was joined by 150,000 other marchers, including approximately 1,000 Deutsche Bank employees and 5 million people that lined the streets of the city.\nTo commemorate the 50th anniversary of the Stonewall uprising, Deutsche Bank commissioned artist Gabriel Garcia Roman to create a mobile art procession for the NYC Pride March to raise the visibility of transgender people of colour in partnership with the Leslie-Lohman Museum of Gay and Lesbian Art.\nDeutsche Bank employees are participating in worldwide Pride marches in Tokyo, Birmingham, Cologne, Frankfurt, Berlin, Stuttgart, Dublin, London, Manila and Milan.\n\nStarting the \"Berlin Pride Weeks\" the rainbow flags were hoisted by Deutsche Bank and DWS in front of the largest Berlin location in the Otto-Suhr-Allee. Also the Deutsche Bank headquarter in Frankfurt shows a flag.\nAbout Pride at Deutsche Bank\nDeutsche Bank has long been actively committed to the interests of the LGBTQI+ community. It is further committed to providing a working environment in which each individual can develop their full potential and feel comfortable and accepted.\nIn January 2019, Deutsche Bank was one of 15 founding members of the “Accelerating LGBTQI+ Inclusion Globally” workplace initiative. In March 2019, board member Karl von Rohr and a delegation of the “Open for Business” initiative engaged in discussions with the Vatican about LGBTQI+ rights. Deutsche Bank also removed the Dorchester Collection hotel group that is owned by the Sultanate of Brunei from its list of suppliers in support of LGBTQI+ rights after discriminating laws were introduced in Brunei.\n ",
    "number_of_ratings": 11,
    "rating": 2.8,
    "likes": 6
}