{
    "url": "https://www.db.com/news/detail/20201223-deutsche-bank-cements-strong-position-in-japan-s-solar-sector?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "December 23, 2020",
    "tags": [
        "Asia-Pacific",
        "Private products"
    ],
    "title": "Deutsche Bank cements strong position in Japan’s solar sector",
    "body": "Deutsche Bank’s Tokyo and London Branches announced today that they have acted as Sole Mandated Lead Arranger and Structuring Bank for a JPY 7.3 billion (USD70.6m) financing to Amp Energy (“Amp”) for the acquisition of an operating 20MW solar PV park in Japan.\nThe financing was structured as a bridge facility provided by Deutsche Bank that enabled Amp, a Canadian-based global energy transition platform, to close the acquisition of the plant and also to access term financing from leading institutional investors.\nThe transaction underscores the bank’s commitment to providing financing solutions to clients and to placing ESG at the heart of its business activities in the Asia Pacific region.\nThe solar PV park is located on the Japanese island of Kyushu. It benefits from a 20-year feed-in tariff under the Japanese renewable energy regime which aims to sponsor the development of renewable energy projects across the country.\nTamio Honma, Chief Country Officer for Japan at Deutsche Bank said: “Deutsche Bank is delighted to lead this transaction which plays to our strength as a leader in sustainable financing in Asia Pacific and our ability to mobilise our global platform to provide ground breaking and bespoke structures for clients like Amp.”\nMartin Stein, Executive Vice-President and Head of Amp Japan said: “Amp has been able to close this acquisition at record speed, supported by Deutsche Bank’s global team that delivered on both schedule and an innovative structure.”\nIn 2020, Deutsche Bank published quantifiable targets for the first time aimed at expanding its sustainable business activities covering the ESG space and aims to support the transformation towards a sustainable economy. The bank also tightened its Fossil Fuels Policy, pledging to end global business activities in coal mining by 2025 and has committed that by 2025 its total volume of sustainable financing and investments will exceed EUR 200bn, and that its operations will be powered entirely by renewable energy sources.\nDeutsche Bank is proud to be the top ranked Investment Bank for Financing (Loans & Structured Credit) in Asia Pacific, according to Coalition.\nFor further information please contact:\nDeutsche Bank Media Relations\nAtsuko Yoshitsugu\nEmail: atsuko.yoshitsugu@db.com\nPhone: +81 80-3506-1378\nMia Popplewell\nEmail: mia.popplewell@db.com\nPhone: +61 439528842\nAbout Deutsche Bank\nDeutsche Bank provides retail and private banking, corporate and transaction banking, lending, asset and wealth management products and services as well as focused investment banking to private individuals, small and medium-sized companies, corporations, governments and institutional investors. Deutsche Bank is the leading bank in Germany with strong European roots and a global network.\nDeutsche Bank Group in Japan offers a wide range of financial products and services to its Japanese and global clients through four main entities; Deutsche Securities Inc. Deutsche Bank AG, Tokyo Branch, Deutsche Trust Company Limited Japan, and Deutsche Asset Management (Japan) Limited. Our products and services meet the increasingly diverse and complex needs of its clients, by taking full advantage of its global network and depth of expertise. japan.db.com\nAbout Amp Energy\nAmp Energy is a global renewable energy infrastructure manager, developer and owner. Since 2009, the Company has successfully developed over 1.8 gigawatts of distributed and utility-scale renewable generation projects, hybrid generation plus storage projects, and stand-alone battery storage projects around the world. Amp Energy’s proprietary digital energy platform, Amp X, also provides a diverse portfolio of disruptive and interoperable solutions, including a state-of-the-art smart transformer, to address the energy transition by enabling the real-time autonomous management and optimized dispatch of all forms of distributed generation and loads across the grid.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}