{
    "url": "https://www.db.com/news/detail/20201218-deutsche-bank-increases-family-planning-benefits?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "December 18, 2020",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "Deutsche Bank Increases Family Planning Benefits",
    "body": "Today, Deutsche Bank announced major changes to its family planning benefits for employees, namely increasing its surrogacy benefit from $10,000 to a life-time maximum of $50,000 per employee. The increased surrogacy benefit is critical for some LGBTQI employees who currently may not be able to take advantage of other family planning benefits covered by Deutsche Bank’s health insurance plan, such as in vitro fertilization (IVF). By significantly increasing the surrogacy benefit, which Deutsche Bank has offered since 2016, employees who use a surrogate to grow their families will receive a benefit that is on par with the fertility benefit provided under Deutsche Bank’s health insurance plan.\nIn developing the surrogacy benefit expansion, Deutsche Bank collaborated with LGBTQI employees, including John Kimble, a former Vice President of Philanthropic Initiatives in Deutsche Bank’s Community Development Finance Group, and consulted with workplace rights experts, including Peter Romer-Friedman, a principal at Gupta Wessler PLLC and Mikael Rojas of Outten & Golden LLP.\nDeutsche Bank has achieved a top score of 100% on the Human Rights Campaign’s Corporate Equity Index annually since 2002. The Corporate Equity Index is a national benchmarking tool on corporate policies and practices pertinent to LGBTQI employees. Deutsche Bank was also pleased to support LGBTQI workers at the U.S. Supreme Court in the landmark case, Bostock v. Clayton County, which held in June 2020 that federal anti-discrimination law prohibits workplace discrimination based on sexual orientation and gender identity. Deutsche Bank joined other businesses in filing a “friend of the court” brief in support of LGTBQI workers.\nRobert Dibble, head of human resources, Americas, said: “Deutsche Bank is widely recognized in the LGBTQI community for our leadership and commitment to promoting a workplace that accepts and celebrates everyone, regardless of gender or sexual orientation. We are pleased to offer this enhanced benefit.”\nMr. Kimble, who brought this issue to the bank’s attention, said: “With this expanded surrogacy benefit, Deutsche Bank will lead the industry towards ensuring that all employees, including gay men, have access to robust family planning benefits like IVF. I hope that all employers will follow Deutsche Bank’s lead in adopting inclusive family planning benefits. All employees who seek to build a family deserve equal support in pursuing that dream.”\n ",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 12
}