{
    "url": "https://www.db.com/news/detail/20201216-tectonic-shifts-looking-beyond-covid-19?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "December 16, 2020",
    "tags": [
        "Corporate products",
        "Research",
        "Wealth"
    ],
    "title": "Tectonic shifts: looking beyond COVID-19",
    "body": "Vaccine roll-outs offer the hope of putting the coronavirus pandemic behind us during 2021, but we should not expect a simple return to life “pre-COVID”, according to a new report by Deutsche Bank’s International Private Bank.\nMultiple impacts – to individuals, businesses and governments – from the pandemic will not be fully reversed, according to the Chief Investment Office’s Annual Outlook for 2021, published today and entitled “Tectonic shifts: looking beyond COVID-19”.\nThey include increased concerns about inequality in terms of wealth and opportunity, a bigger role for the state in people’s lives – supported by new digital technologies – and a rethinking of how we use our infrastructure.\nMeanwhile, further pressure on fiscal and policy will add to worries about debt and future inflation. These impacts therefore fall under “4Ds” – divergence, demographics, digitalisation and debt.\n“As well as creating new problems, the pandemic has also accelerated or exacerbated many pre-existing economic and investment trends,” Christian Nolting, Chief Investment Officer, writes in the report. “An investment response needs to be not just tactical, but also strategic. “It makes sense to invest in key themes that will play an increasing role in long-term global development.”\nEnvironmental, social and governance (ESG) factors are likely to play an increasingly important role in any investment strategy. More key investment themes are described within our \"TEDS\" triangle – defined by the three issues of technology, demographics and sustainability.\nThe report also includes economic forecasts for 2021 and 2022, along with individual asset class outlook summaries and forecasts to end-2021.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 4
}