{
    "url": "https://www.db.com/news/detail/20201216-agility-across-all-areas-pioneers-pitch-for-prizes?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "December 16, 2020",
    "tags": [
        "Awards",
        "Company"
    ],
    "title": "Agility across all areas: pioneers pitch for prizes",
    "body": "Moving to business agility is an aspiration for the bank and a core element of its technology strategy. The hallmark of business agility is interdisciplinary teams – composed of business and technology - rapidly delivering solutions clients want, while increasing efficiency, and creating a great working environment.\nThe bank has launched the first ever Group Agility Awards, sponsored by Bernd Leukert and Michael Ilgner, to showcase the most outstanding examples of Agile@DB and celebrate the business impact these teams have made. This competition recently concluded with an intense day of pitching and a virtual award ceremony to celebrate the winners, joined by 1,400 colleagues.\nThe resonance throughout the organisation was beyond all expectations. Employees submitted an incredible 226 entries across four categories, and 15,000 votes were cast in employee crowd voting. It is a credit to the bank’s progress on the Agile journey that winning teams come from various corners of the bank and across the globe. And here they are:\nGreat Client User Value & People’s Choice Award – Team “One Bank, One Symphony” introduced the Symphony WeChat/WhatsApp CONNECT solution, so Deutsche Bank can securely and compliantly communicate with clients through messaging services such as What’sApp\nGreat Working Environment – Team “Americas Idea Box” introduced a virtual anonymous idea box that drives citizen innovation by enabling employees to submit, vote and volunteer on positive change ideas.\nHighly Adaptive and Efficient Ways of Working – this category goes jointly to:\nInternational Bank Lending Tribe, which underwent an Agile transformation while re-architecting their core lending system, enabling multi-million euro revenue growth\nTransformation Factory, which has shown us a paradigm shift in applying Agile within the Technology Infrastructure (TI) division and having realised multi-million euro benefits\nRapid Quality Delivery – Team “FX Risk Management System” for introducing a service-oriented architecture and quadrupling releases for RMS, the system servicing all FX trade processing.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 11
}