{
    "url": "https://www.db.com/news/detail/20201215-globalcapital-applauds-deutsche-bank-for-covid-response-and-leading-landmark-transactions-for-clients-in-asia?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "December 15, 2020",
    "tags": [
        "Awards",
        "Capital markets"
    ],
    "title": "GlobalCapital applauds Deutsche Bank for COVID response and leading landmark transactions for clients in Asia",
    "body": "“One bank stood out for its comprehensive response to the coronavirus crisis when faced with a test of resilience and when standard business continuity plans no longer applied,” said GlobalCapital Asia, naming Deutsche Bank the best bank in the region for handling the pandemic.\nThe publication continued: “For understanding the tone of market rapidity, offering innovative and much-needed solutions to its client base and for adjusting its focus in line with the changing conditions, Deutsche Bank deserves kudos for its COVID response.”\nThis is the second time the bank has been commended for rising to the challenge of COVID, having won ‘Crisis Response of the Year’ from AsiaRisk in September.\n“Winning another “Best COVID Response” award this year is testament to the resilience and agility of our people and platform, from front of house through to our back line. We are super proud of how well we’ve held up and supported clients this year,” said Michael Connolly, Deutsche Bank’s Chief Operating Officer for the Corporate Bank and Investment Bank in APAC.\nAward-winning adaptability and tailored transactions\nThe bank’s award-winning Autobahn app allowed clients to execute and settle trades safely, said the publication. This resulted in a 300% increase in client demand for electronic execution access to onshore markets across Asia. For clients facing a sudden shortage of funding, the bank also offered dollar liquidity support, cited GlobalCapital.\nWe tailored solutions to meet our clients’ needs. These included setting up a new legal entity for a client in India through a complex capital injection during lock down and processing an overseas payment that helped a client in Portugal and its China shareholder donate potentially life-saving medical equipment to Portuguese hospitals.\nIn capital markets, “Deutsche Bank was part of most, if not all, key themes this year, including the spike in liability management and ESG-focused transactions,” said GlobalCapital, citing the bank’s roles in helping Sriram Transport raise 500 million US dollars in India’s first public international social bond and helping Kaisa Group launch the first sustainable perpetual bond in China’s high yield market.\nAmit Khattar, Deutsche Bank’s Head of Investment Bank for APAC, said: “Particularly in a year like 2020, it is fantastic for the bank to be recognised for its role in helping clients execute landmark transactions in the region. Despite the many challenges, the teams have continued to step up and provide unique and innovative solutions to clients.”\nIn the equity market, GlobalCapital commended the bank for helping pharmaceutical company 3SBio simultaneously sell a euro convertible bond (CB) while repurchasing an old CB while mitigating a hit to their shares. Our loan team focused on executing more private transactions for existing clients, scooping wins in three out of four loan deal categories as a result.\nLeading in Loans\nThe bank won ‘Best High Yield Syndicated Loan’ for helping Trans Retail Indonesia on its 740 million US dollar loan and for helping execute Hexaware Technologies’ take-private by Baring Private Equity for 600 million US dollars with ‘Best Leveraged/Acquisition Finance’ and ‘Best Loan’.\nBest bonds\nDeutsche Bank also won for roles on three ground-breaking bonds: ‘Best SSA Bond’ for the Republic of Indonesia’s 4.3 billion US dollar Triple-tranche bond, ‘Best HY Corporate Bond’ for Vedanta Resource’s 1.4 billion US dollar bond, and ‘Best Project Finance Deal’ for Star Energy’s 790 million US dollar green bond. This deal also won ‘Megatrend Deal of the Year (ESG)’ and ‘Best of South Asia’ at this year’s FinanceAsia Awards.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 4
}