{
    "url": "https://www.db.com/news/detail/20201211-wie-das-pariser-klimaschutzabkommen-die-deutsche-bank-veraendert?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "December 11, 2020",
    "tags": [
        "Sustainability"
    ],
    "title": "How the Paris Climate Agreement has changed the bank",
    "body": "Paris, December 12, 2015: at that year’s UN climate conference, or COP21 as it is also known, 196 countries united to sign the Paris Climate Agreement (aka Paris Agreement) to fight climate change. The Paris Agreement was the first comprehensive and legally binding international treaty on climate change. After years of negotiations, climate protection finally became binding and all those who signed the Agreement became parties to it. One of the things that signatory countries committed to was to limit global warming to well below 2, preferably to 1.5 degrees Celsius compared to pre-industrial levels.\nHistoric feat\nMany chroniclers consider the Paris Agreement to be an historic feat of crucial value; some even herald it as the beginning of a new era in climate protection. After all, the earlier Kyoto Protocol had only asked industrial countries to commit to it and it was becoming clear that we were going to see carbon dioxide emissions rise in developing countries.\n\nHow did Deutsche Bank respond to the Paris Agreement? We joined the Paris Pledge for Action. The Paris Agreement was only for individual nations to sign, but the Paris Pledge for Action represented an opportunity for businesses, cities, civil society groups, investors, regions, trade unions and other signatories to promise to ensure to meet or exceed the goals set out in the Paris Agreement.\nWhat started out as a challenge …\nAnd what has Deutsche Bank achieved since joining the pledge? First, we recognised very early on – much earlier than the Paris Agreement – that sustainability is one of the greatest challenges of our time – and this includes climate protection. In fact, our involvement began back in 1992 – the year the bank became part of the United Nations Environmental Programme's Finance Initiative (UNEP FI).\nIn 2000, we were one of the first to sign up to the ten principles of the UN Global Compact. In 2007, and for the first time, we announced our goal to reduce our own carbon footprint. And five years later, in 2012, we achieved this goal: our own business operations were climate neutral – and have been ever since. We were, in fact, one of the first financial service providers to embark on this path.\n… is now a growth driver\nToday, five years after the Paris Agreement was signed, we are integrating environmental, social and governance (ESG) criteria even more deeply into our business operations and processes and we consider sustainability to be a growth driver in all four of our business areas.\nWe have released annual growth targets for sustainable business activities covering the ESG space and plan to link them to management compensation from 2021. The volume of sustainable financing and client investments is to reach more than 25 billion euros in the current year and to rise gradually to a total of more than 200 billion euros by 2025.\nWhat we aspire to achieve:\nWe aspire to contribute to an environmentally sound, socially inclusive and well-governed world. And four specific pillars will help us achieve this. Everything that we do in this context can be found in one of these pillars and ultimately, this goes towards achieving one of the United Nations 17 Sustainable Development Goals, which we support. The four pillars are:\nSustainable finance: for example with our target of 200 billion euros for sustainable financing and ESG investments by 2025 that we announced in May, and our Sustainable Finance Framework that we published at the end of July.\nPolicies and commitments: for example through our Fossil Fuels Policy. Also published at the end of July, this sets out how we are ending our global business activities in coal mining by 2025. In addition, we signed the German financial sector’s Climate Commitment. By doing so, we pledged to align our credit portfolios with the goals of the Paris Agreement.\nOur own footprint in the ESG space: for example by reaching our target of reducing our power consumption in our buildings in the coming year by 10 percent versus 2019. The bank plans to use 100 percent renewable sources of energy for electricity by 2025.\nThought leadership: for example through our membership of the Sustainable Finance Committee of the Federal Government and active involvement in consultations around the EU Sustainable Finance Action Plan.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 16
}