{
    "url": "https://www.db.com/news/detail/20201210-deutsche-bank-receives-china-domestic-fund-custody-license?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "December 10, 2020",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank receives China Domestic Fund Custody License",
    "body": "Deutsche Bank (China) Co., Ltd. (\"Deutsche Bank China\") today announced that it has received a domestic fund custody license from the China Securities Regulatory Commission (“CSRC”). Upon completing the relevant administrative process, Deutsche Bank China will be able to directly provide custody-related solutions to funds established in China. According to Asset Management Association of China (“AMAC”), assets under management in China have reached RMB 56.17 trillion in the third quarter of 2020. In addition, data from Wind shows that over 1,200 new mutual funds have been launched since this year, raising a record close to RMB 3 trillion.\nIn addition to the first wholly foreign owned mutual fund company approved by CSRC earlier this year, as of November, more than 30 wholly foreign-owned enterprises (WFOE) have successfully registered as private fund managers with AMAC, demonstrating the increasing attractiveness of China’s domestic market. Rose Zhu, Deutsche Bank China Chief Country Officer, said: “This license comes at a time when many of our global institutional clients are actively exploring and acting on the unfolding opportunity to tap into the exponential China market, which is still fast growing and opening up.\nAt the same time, the booming domestic fund industry is looking for global expertise to foster further development. This approval demonstrates Deutsche Bank’s role in helping to further open China’s financial market to the rest of the world. With the new license, we will extend our local services, and provide new opportunities to China’s fund management market by leveraging our global expertise.”\nAnand Rengarajan, Head of Securities Services – Asia Pacific at Deutsche Bank, said: “We are optimistic about the prospects of China’s fund management market, and hope to continue to sharpen our local securities services offering onshore. Deutsche Bank has a long-standing presence in the custody space, which is a core business of our Corporate Bank. We are proud to be able to leverage our expertise to help China’s fund managers with their local and overseas business and enhance products and services on the ground for our global clients.”\n“Deutsche Bank is widely recognized globally for its award-winning fund custodian services. Obtaining the China domestic fund custody license will allow us to further play to our strengths to provide world-class custodian services to China local funds,” added Tony Chao, Greater China Head of Securities Services and Head of North Asia Sales for Securities Services at Deutsche Bank.\nCustodian services\nToday, Deutsche Bank offers custodian services in more than 70 major markets globally, including 12 markets in the Asia Pacific region. Supported by a dedicated custody unit equipped with local expertise and global standards, Deutsche Bank China is a major foreign custodian bank for Qualified Foreign Institutional Investors (QFII), Renminbi Qualified Foreign Institutional Investors (RQFII), and Qualified Domestic Institutional Investors (QDII). Deutsche Bank is also one of the most active foreign settlement agents in the China Interbank Bond Market (CIBM).\nFor further information, please contact\nDeutsche Bank AG Media Relations:\nKarène Dufour\nPhone: +852 2203 7846\nE-mail: karene.dufour@db.com \nAbout Deutsche Bank China\nDeutsche Bank first established a presence in China in 1872 with the opening of its first overseas office in Shanghai. Headquartered in Beijing, Deutsche Bank China completed local incorporation in 2008, currently with branches in Beijing, Shanghai, Guangzhou, Tianjin, Chongqing and Qingdao. Deutsche Bank has a regional hub in Hong Kong SAR.\nThrough rapid organic growth and strategic investments, Deutsche Bank’s core global businesses are all active in China. These include corporate advisory and capital markets, transaction banking, as well as asset and wealth management.\nOn the asset management front, Deutsche Bank holds a 30% strategic investment in Harvest Funds Management - one of the country’s leading investment managers.\nIn July 2009, the joint venture between Deutsche Bank and Shanxi Securities – Zhong De Securities Co. Ltd. – received a securities business license from the China Securities Regulatory Commission (CSRC). Zhong De Securities is currently approved to underwrite and sponsor stocks and bonds (including A-shares, foreign investment shares, government bonds, and corporate bonds), as well as provide corporate advisory services in the domestic capital market.  Deutsche Bank holds a 33.3% ownership in the joint venture.\nFor more information about Deutsche Bank China: https://www.db.com/china \nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nThis press release has been approved and/or communicated by Deutsche Bank AG or by its subsidiaries and/or affiliates (“DB”). Deutsche Bank AG is authorized under German Banking Law (competent authority: BaFin - Federal Financial Supervisory Authority) and by the Prudential Regulation Authority and subject to limited regulation by the Financial Conduct Authority and Prudential Regulation Authority.\nDetails about the extent of our authorization and regulation by the Prudential Regulation Authority, and regulation by the Financial Conduct Authority are available from us on request. Securities and investment banking activities in the United States are performed by Deutsche Bank Securities Inc., member NYSE, NASD and SIPC, and its broker-dealer affiliates. Lending and other commercial banking activities in the United States are performed by Deutsche Bank AG, and its banking affiliates.\nCopyright © Deutsche Bank AG",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 1
}