{
    "url": "https://www.db.com/news/detail/20201209-deutsche-bank-remains-on-track-with-its-transformation-strategy?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "December 9, 2020",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank remains on track with its transformation strategy",
    "body": "Deutsche Bank (XETRA: DBKGn.DE/NYSE: DB) confirms its primary strategic and financial targets for 2020 and 2022, announced in July 2019 when it launched its “Compete to Win” strategy.\nAt an Investor Deep Dive in Frankfurt today, management will reinforce Deutsche Bank’s commitment to delivering a post-tax return on tangible equity (RoTE) of 8% in 2022 and to returning 5 billion euros of capital to shareholders from 2022. This follows progress on execution in all areas, and strong performance in the bank’s core business which has driven significant improvement in profitability in 2020 to date.\n“Since 2018 we have consistently delivered on or ahead of our targets,” said Christian Sewing, Chief Executive Officer of Deutsche Bank. “That remains our ambition. We will maintain our discipline on cost and risk management as we now enter the third phase of our transformation: sustainable revenue growth and profitability. In the first 9 months of 2020 we achieved year-on-year revenue growth of 8% in the Core Bank. This positive momentum has continued into the 4th quarter. We believe we’re on the right track to achieve our return on tangible equity target in 2022.”\nDeutsche Bank will provide updates on certain of its 2022 financial targets or plans:\nAdjusted costs: 2022 target lowered from 17.0 billion euros to 16.7 billion euros \nDeutsche Bank has identified additional cost-saving opportunities. These enable the bank to revise its 2022 target for adjusted costs¹ to 16.7 billion euros, versus an original target of 17.0 billion euros. The bank expects to meet its 2020 adjusted cost² target of 19.5 billion euros.\nRevenues: outlook broadly unchanged\nDeutsche Bank’s revenue plan for 2022 is broadly unchanged, as better-than-expected performance in its core businesses and other measures offset additional interest rate headwinds.\nLeverage ratio target updated principally reflecting growth opportunities\nDeutsche Bank has adjusted its fully-loaded 2022 leverage ratio target to ~4.5%, from ~5% previously. The updated guidance principally reflects targeted balance sheet growth to support higher revenues in the Corporate Bank and the Private Bank, and higher than anticipated leverage exposure in the Capital Release Unit in the economic interests of shareholders. The updated leverage ratio target remains comfortably above the bank’s regulatory requirement of 3.75% in 2023.\n2020 Financial milestones on track\nDeutsche Bank remains on track to deliver on its strategic and financial objectives for 2020:\nThe bank reaffirmed its 2020 target of 19.5 billion euros of adjusted costs²\nProvision for credit losses is expected to be close to the midpoint of the target range of between 35 and 45 basis points of loans, in line with guidance published in April 2020\nThe third quarter 2020 leverage ratio of 4.4% is tracking to the bank’s 2020 original goal of 4.5%\nDeutsche Bank’s Common Equity Tier 1 ratio, at 13.3% at the end of the third quarter of 2020, is comfortably above the original threshold of 12.5% during transformation\nRisk Weighted Assets in the Capital Release Unit were 39 billion euros at the end of the third quarter of 2020, versus a year-end target of 38 billion euros\nThe Investor Deep Dive will take place today, Wednesday, 9 December 2020, starting at 12:00 CET. A detailed agenda is available on the Investor Relations website. This event will be broadcast via internet: www.db.com/ir\n¹ Adjusted costs excluding transformation charges\n² Adjusted costs excluding transformation charges and expenses eligible for reimbursement related to Prime Finance",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 10
}