{
    "url": "https://www.db.com/news/detail/20240425-a-message-from-christian-sewing-on-q1-results-2024?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 25, 2024",
    "tags": [
        "Financial Results",
        "Strategy"
    ],
    "title": "A message from Christian Sewing on Q1 results 2024",
    "body": "Dear Colleagues,\nAlmost six years to the day, on April 26, 2018, I sent you a message about Deutsche Bank's quarterly figures for the first time as CEO. With declining revenues and rising costs, we posted very low profits for the start of the year. \"We have to take action,\" I wrote at the time, announcing the first strategic measures intended to herald the change of direction.\nA lot has happened since, both inside and outside the bank, and we've achieved a lot together. Despite numerous challenges, we have been able to successfully steer our new course for the vast majority of quarters over the past six years.\nThe past three months are no exception. We increased our profit once again; at 2.0 billion euros, pre-tax profit was 10 percent higher than in the first quarter of last year. Net profit also rose by a tenth to 1.5 billion euros.\nThese results represent another step forward. Above all, we stayed the course in a disciplined manner and delivered what we set out to do and promised the market: we slightly increased revenues to 7.8 billion euros, and reduced adjusted costs by 6 percent, reaching our 5 billion euro target for the quarter. As a result, our cost/income ratio fell significantly to 68 percent. A year ago, it was 71 percent. At the same time, we increased our post-tax return on tangible equity to 8.7 percent, up from 8.3 percent a year ago.\nAs in previous quarters, our results reflect the value of a well-diversified business model across different cycles. It is particularly encouraging that we increased commissions and fee income by 11 percent, more than offsetting the expected normalisation of the interest rate environment, which was felt in the Corporate Bank and Private Bank.\nThe Investment Bank achieved the highest revenue growth over the first three months of 2024, with an increase of 13 percent. Both Fixed Income & Currencies (FIC) and Advisory & Origination (O&A) grew significantly. However, there were also positive developments in all other business areas. As a result, we once again recorded higher deposits and strong net inflows into our investment products. In combination with rising markets, assets under management in the Private Bank rose to a record 606 billion euros, while in Asset Management they reached 941 billion euros, 101 billion euros higher than a year ago.\nThis is a strong foundation for future revenues, and it shows how much our clients trust us. But we must earn this trust every day. The environment in which our clients operate remains challenging: the economic outlook is unstable, and the geopolitical situation has become yet more uncertain, with the ongoing escalation of the Middle East conflict and the increased threat of terrorism, in addition to the continuing war in Ukraine.\nThis makes it even more important that we continue to do everything we can, every day and in every part of the world, to dedicate ourselves to the economic success and financial security of our clients. This is the most important prerequisite for achieving the ambitious goals we have set ourselves and for our mid-term goal: to become a European champion. At the same time, it will remain essential that we continue to implement our cost plans in the same disciplined manner as we did in the first quarter.\nIt is clear that we can only achieve all of this together. Without your dedication and commitment, we would not have made the great progress we have made over the past six years. And we will only be successful in the future if we act as one team.\n\"Deutsche Bank has all the resources it needs to thrive: great people around the world, deep and long-standing client relationships and financial strength.\" That's how I ended my email to you six years ago. It's impressive what you have built upon these foundations. On behalf of the entire Management Board, thank you very much. We are looking forward to continuing the journey with you.\nBest wishes,\nChristian",
    "number_of_ratings": 16,
    "rating": 4.7,
    "likes": 18
}