{
    "url": "https://www.db.com/news/detail/20170921-caline-aoun-deutsche-bank-s-artist-of-the-year-2018?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 21, 2017",
    "tags": [
        "Art",
        "Corporate Citizenship"
    ],
    "title": "Caline Aoun: Deutsche Bank's Artist of the Year 2018",
    "body": "Caline Aoun is Deutsche Bank’s Artist of the Year 2018. In autumn 2018 she will present her first large-scale institutional solo exhibition at the Bank’s then newly opened forum for art, culture and sports in Berlin’s Prinzessinnenpalais.\nBorn in Beirut in 1983, Aoun is part of a generation of young Lebanese artists who grew up abroad after civil war broke out in 1975 and completed their artistic training outside the country. She studied at Central Saint Martins School of Art and Design and the Royal Academy Schools in London before completing her doctorate in fine arts at the University of East London in 2012.\nAoun, who originally wanted to become a painter, decided shortly after completing her degree to give up painting and experiment instead with photography and digital printing techniques.\nNow living near Beirut, the artist combines strategies of minimalism and conceptual art with the question of how the evolution of digital technologies alters our perception of images and information.\nThe Artist of the Year award is given at the recommendation of the Deutsche Bank Global Art Advisory Council, composed of distinguished curators Okwui Enwezor, Hou Hanru, Udo Kittelmann and Victoria Noorthoorn. The award goes to a contemporary artist who has created an oeuvre that is artistically and socially relevant and integrates the media of paper and photography, the two main areas of focus of the Deutsche Bank Collection.\nI am impressed by Caline Aoun’s fascination with printing and her efforts to capture all the things that are fading away\nHou Hanru, Artistic Director of the MAXXI, Rome\n“I am impressed by Caline Aoun’s fascination with printing and her efforts to capture all the things that are fading away,” writes Hou Hanru, Artistic Director of the MAXXI, Rome, in a statement on the jury’s decision. “She transforms the attention for her intimate surroundings into a gaze at the globalising world. Her work reflects today’s world in a highly aesthetic and silent way”.\nAoun explores the oversaturation of images brought about by the digitisation of the globalised world. Her abstract works are based on experiments with ink-jet printers, which are actually designed to produce perfect pictures. However, in a subversive act Aoun “overfeeds” them with data and images that she has collected, thereby causing malfunctions.\nAoun locates the source material for her work in the realms of public life shaped by digital technology: logistics, architecture, advertising and urban planning. In one of her most recent projects, Fields of Space (2016), she makes use of objects at Beirut’s port such as stacked shipping containers, trading books, transport pallets and related data and information to reimagine how we envision and interact with the space and physical reality around us.\nCaline Aoun’s solo exhibitions include Fields of Space, Marfa', Beirut (2016), Concrete Layers, Greynoise, Dubai (2015), The Future of Smart Technology in your Hands, Noshowspace, London (2013), Scape, Sartorial Project Space, London (2009). Aoun’s work has featured in a number of group exhibitions, including I Spy with my Little Eye ..., Casa Árabe, Madrid and Mosaic Room, London (2015), Dust, Centre for Contemporary Art at Ujazdowski Castle, Warsaw (2015), Exposure 2012, Beirut Art Center, and will also be included in the upcoming Home Beirut. Sounding the Neighbors, which opens on November 15 at the MAXXI in Rome.\nFollowing Wangechi Mutu, Yto Barrada, Roman Ondák, Imran Qureshi, Victor Man, Koki Tanaka, Basim Magdy and Kemang Wa Lehulere, Caline Aoun is Deutsche Bank’s ninth Artist of the Year.\nFor further information, please contact:\nDeutsche Bank AG\nMedia contact\nKlaus Winker\nTel.: +49 (0)69 910-32249\nEmail: klaus.winker@db.com \nAbout Deutsche Bank, Art, Culture & Sports\nDeutsche Bank’s commitment to art is a component of its Art, Culture & Sports department. The unit pools together the bank’s sponsorship programmes, developing them in a conceptual way. Together with its divisions, Deutsche Bank aims to provide customers with new ways to access art, culture and sports. Its involvement in contemporary art means Deutsche Bank is setting standards worldwide, be it with the Deutsche Bank Collection, one of the world’s most important collections of contemporary artworks on paper and photography, international exhibitions and the Deutsche Bank KunstHalle in Berlin. The bank has been present at selected art fairs such as Frieze London and New York for many years.\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.",
    "number_of_ratings": 17,
    "rating": 1.0,
    "likes": 20
}