{
    "url": "https://www.db.com/news/detail/20170921-what-s-going-to-happen-after-germany-s-bundestag-election?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 21, 2017",
    "tags": [
        "Investment Banking",
        "Research"
    ],
    "title": "What's going to happen after Germany's Bundestag election?",
    "body": "The positions could not be more contradictory: if the EU had to step in to bail out a country again, the liberal Federal Democratic Party (FDP) would consider quitting a coalition. By contrast, the Green Party’s election manifesto criticises the present government for preventing euro bonds. Differences like these are visible in many areas, Deutsche Bank Research economists have found. In a\nPDF\nspecial study on the Bundestag elections, they have compared the election manifestos of the Social Democratic Party (SPD), Greens, Christian Democratic Union (CDU)/Christian Social Union (CSU) and the FDP to shed light on the policies that might be pursued by different coalitions.\nTheir analysis clearly shows that an alliance of the CDU/CSU, FDP and the Greens (a so-called “Jamaica coalition” because the colours symbolising the parties – black for the CDU/CSU, yellow for the FDP and green for the Green Party – are also the colours of the Jamaican flag), which is being touted as one alternative to the current grand coalition, would have many differences to overcome. Whether it is a question of a higher maximum tax rate or the stance on an unconditional basic income, several positions in the Green Party’s manifesto differ hugely from those of the FDP.\nThe SPD and CDU/CSU would also have a number of issues to address in a re-run of the grand coalition. The economists expect that numerous compromise decisions will once again be made for the benefit of the parties’ core voters, for instance, earlier retirement at 63 or additional pension benefits for mothers whose children were born before 1992, as happened in the previous parliamentary term. At the same time, they expect an alliance of the CDU/CSU and SPD to be more inclined to pursue a demand-oriented economic policy, but warn that a policy geared only towards short-term demand would negatively impact trend growth.\nThe fact that the trend growth rate is already falling is one of a number of key economic issues that have been overlooked during the election campaign, according to Deutsche Bank Research economists. They warn about overstating the favourable economic situation. In their opinion, potential growth, i.e. the long-term growth in gross domestic product when production capacity utilisation levels are normal, is likely to halve in the period 1996 to 2025. As they see it, one of the biggest challenges is that older employees are faced with adapting to digitalisation.\nThe bank’s economists also believe that politicians have not paid enough attention to the future of the younger generation. They point out that social expenditure has increased substantially as a result of avoidable “gifts” such as retirement at 63 and additional pension benefits for mothers of children born before 1992. They argue that many proposals are aimed at an unsustainable expansion of the welfare state. The strong upturn entices parties to continue increasing spending and cut taxes. Unrealistic promises they are making now would come back to haunt the parties later on and result in even more political disenchantment. The economists warn that the day of reckoning is coming.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}