{
    "url": "https://www.db.com/news/detail/20170915-deutsche-bank-makes-multiple-hires-across-credit-trading?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 15, 2017",
    "tags": [
        "Company",
        "Investment Banking"
    ],
    "title": "Deutsche Bank Makes Multiple Hires across Credit Trading",
    "body": "Deutsche Bank today announced that it has made a number of senior appointments across credit trading, including a new Global Head of Investment Grade Credit Trading, Paul Huchro, effective Monday, October 16. Paul also takes on the position of Head of High yield credit trading in the US and Europe.\nThe hires are part of an on-going global programme of steady investment in Deutsche Bank’s credit business.\nOver the last 18 months, Deutsche Bank has made 21 new hires in European investment grade bond sales, trading and research, expanding its team in response to client demand. In US, the bank has made 19 new hires in the same period.\nShawn Faurot, Deutsche Bank’s Head of North American Credit Trading, said: “As we continue to build momentum in our credit platform, we will always look to hire the industry’s top talent. We have an incredibly strong team and we intend to keep investing in this area, providing our clients with market-leading solutions across products and geographies.”\nGavin Colquhoun, Deutsche Bank’s Head of European Credit Trading, said “We expect to see client activity in credit increase as monetary stimulus is withdrawn. The hires we have made over the past 18 months reflect our commitment to being a leading flow credit house.”\nHuchro joins Deutsche Bank after a career spanning three decades at Goldman Sachs, where he led the US credit trading team. He was most recently a partner and Head of US Flow Credit Trading from 2010 to 2016. Prior to that, he ran the investment grade trading business from 1998 and the high yield trading team starting in 2008.\nThe Bank has also hired Tian Zeng to be a Director and senior credit index trader. Zeng was most recently Head of Credit Derivative Trading at Citadel Securities LLC where he led the construction of the firm’s credit index trading team.\nDeutsche Bank is a leading arranger of corporate bonds globally, ranking No 1 in EMEA for investment grade corporate bonds in 2017 (year to end Q3 2017) according to Dealogic.\nAdditional Americas contact:\nDeutsche Bank AG\nMedia Contact\nOlayinka Fadahunsi\nPhone: +1(212)250-8159\nE-mail: olayinka.fadahunsi@db.com\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}