{
    "url": "https://www.db.com/news/detail/20170907-donata-hopfen-to-become-ceo-of-verimi?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 7, 2017",
    "tags": [
        "Company",
        "Digitalisation",
        "Research"
    ],
    "title": "Donata Hopfen to become CEO of verimi",
    "body": "She will be responsible for the management and development of the first cross-industry registration, identification and data platform partnered by leading German and European companies.\nverimi will launch a digital “master key” (Single-Sign-On) at the turn of the year 2017/2018. This will simplify the login onto websites and make the usage of web services much more secure. The initiatives shareholders are: Allianz, Axel Springer, Bundesdruckerei, Daimler, Deutsche Bank with Postbank, Deutsche Lufthansa, Deutsche Telekom as well as Core and Here Technologies.\nDonata Hopfen has been Head of BILD Group’s Management Board since 2014. She is responsible for both the print and digital activities of brands BILD, BILD am SONNTAG and B.Z. From 2010 until 2014, in her role as BILD Digital GmbH’s Managing Director, she was responsible for the successful development of the Group’s digital activities, including the introduction of the digital payment system BILDplus.\nA studied economist, she started her career at the consulting firm Accenture prior to joining BILD.T-Online as Business Manager in 2003. From 2006 until 2009, she was Head of Business Development in Axel Springer’s Electronic Media Division, assuming responsibility as General Manager for BILDmobil in May 2009.\nDonata Hopfen is a non-executive member of the Board of Directors at Modern Times Group AB in Sweden and member of Postbank’s Digital Expert Board.\nChristian Sewing, Deputy CEO of Deutsche Bank, explained on behalf of verimi’s shareholders: “We are delighted that with Donata Hopfen we have won such a profiled expert for digital business models. As CEO, she stands for verimi’s will to become a true European platform provider.”\nDonata Hopfen: “I’m deeply convinced that on the background of global competition verimi along with the verimi shareholders’ clear commitment provides the unique opportunity to establish a standard for user-friendly digital business models in Germany and Europe. It is our ambition to play an active role in the digitization of core industries. To comply with this ambition by developing convincing European answers to digitization’s key questions is both my incentive and obligation.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}