{
    "url": "https://www.db.com/news/detail/20170906-john-cryan-at-the-22nd-handelsblatt-jahrestagung-banken-im-umbruch?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 6, 2017",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "John Cryan at the 22nd Handelsblatt Annual Meeting",
    "body": "Ladies and Gentlemen,\nIt’s a pleasure to be here again and to be able to join you in opening this “Banking in transition” conference.\nMr Steingart, I not only want to thank you for the invitation, I would also like to apologise for our unfortunate timing last year. I know you would prefer to have seen me on stage here a few weeks later. You all know how turbulent it was for us from the middle of September last year.\nSince we last saw each other a lot has happened at Deutsche Bank. We have concluded major legal cases, strengthened our capital base and executed a strategic rethink. Now we can look to the future and start to grow once again – but adopting a considered approach. And on the cost side we are displaying a discipline that no one would have thought we were capable of two years ago.\nBut today I don’t want to say that much about Deutsche Bank, I’d rather talk about more exciting topics that are also occupying my mind at the moment:\n— The unusual situation in the financial markets \n— The state of the German and European banking sectors\n— and the consequences of Brexit.\n I would like to present these topics to you in the form of a number of propositions.\nThe first one is:\nThe era of cheap money in Europe should come to an end – despite the strong euro\nIn the years following the financial crisis the regional dynamics of the global economy were reasonably clear: the US recovered quite quickly, while Europe lurched into a sovereign debt crisis and the economy on the continent stalled. It seemed to be only a matter of time before the euro would fall below parity with the dollar.\nThis picture has now changed fundamentally. Europe appears to be far more stable politically despite Brexit, despite the uncertainty emanating from the United States, at least politically. Moreover, the economic data now appears to be in Europe's favour.\nOne of the consequences is that the euro is now back up to one dollar twenty, and there are some indications that this trend will continue.\nHowever satisfying this may be for Europe’s self-confidence I am concerned about the strong euro – and not only because it makes exporting more difficult. Instead, the developments on the foreign exchange markets serve as an argument for the European Central Bank to keep interest rates in negative territory.\nThere is no disputing that cheap money has helped the financial markets, individual countries and, of course, us banks to emerge from the financial crisis. Loose monetary policy, however, is also causing ever greater upheavals. It is not only sovereign bond yields that are close to historically low levels – the same is true for high-risk bonds. Real estate prices in the G7 countries are at record levels and are set to continue climbing – the nosedive following the crisis in 2007 and 2008 is now barely discernible in the price chart.\nThe stock markets also appear to be heading in almost one direction only: the S&P 500 has risen a stunning 250 percent since the financial crisis, while the Dax has gained no less than 150 percent.\nAt the same time the price of volatility in the markets has seldom been so low. And more and more investors and traders are even betting on a further decline in volatility: the amounts invested in such specialised financial products doubled in the month of August.\nFor me, this means one thing above all: we are now seeing signs of bubbles in more and more parts of the capital market where we wouldn’t have expected them.\nSo I welcome the recent announcement by the Federal Reserve and now also from the ECB that they intend to gradually bring their loose monetary policy to an end.\nThe central banks must, however, plot a middle way that averts massive losses on the markets.\nAnd this leads me on to my second proposition:\nLow interest rates considerably distort competition.\nYes, sometimes I am a little jealous of my colleagues in the United States. The banks there have the most profitable market right on their doorstep. Whatever the business segment: US clients, be they individuals or businesses, are prepared to pay much higher margins. We also benefit from our presence in the US – but not on a scale that is remotely similar.\nFurthermore, US banks enjoy a competitive advantage due to the local interest rate environment. In the first half of 2017 alone the net interest income of US banks rose by eight percent – in Europe, by contrast, it fell by two percent. We at Deutsche Bank had access to over 285 billion euros of liquidity at the end of the second quarter, because we are now receiving huge cash inflows. This money, which actually constitutes the strength of a bank, is costing us penalty interest.\nThe result is that interest rate policy has been partly responsible for the decline in earnings at European banks. And this process is still not over, since more higher-yielding loans are expiring each day.\nOur sector was unable to offset this via cost discipline alone: operating expense has fallen just nine percent over the same period. Profits have thus fallen by 50 percent below the line.\n\nWhat has to happen? It would help us greatly if Europe were to bring negative rates to an end and a single European financial market were finally to be created. If this doesn’t happen, the export-focused European economy will probably be left without a globally competitive banking system of its own.\nWhich brings me on to my third proposition:\nEurope’s banking market requires further consolidation\nEurope has been accused of letting too many seriously ailing banks struggle on for too long following the financial and euro crises. This accusation is partly justified. Consolidation is still occurring agonisingly slowly, at the cross-border level in particular it is virtually non-existent.\nThere are, by contrast, major differences between individual countries. In Spain and France, for example, the number of banks is down some 45 percent compared with 2007. A number of taboos were broken in the process and there were even some mergers between savings banks and cooperative banks.\nUnfortunately there is one large European country where only very little has happened to date – and that is Germany. The number of banks here has fallen by only 16 percent since 2007. On this occasion I would like to make an exception by excluding us, Deutsche Bank, from the criticism: when we soon merge Postbank with Deutsche Bank’s Private & Commercial Bank, this will be the biggest merger of two banks in Europe since 2014.\nI am convinced that the consolidation trend needs to pick up steam, especially in Europe and especially in Germany. After all, banks are now driven by technology and in many segments it is purely a scale-driven business. This means that long term, only banks of a certain size will be able to survive, at least in the private and small-business clients segments.\n\nThis brings me straight to proposition number four:\nGermany must determine if it wants strong banks\nLadies and Gentlemen: one thing I learned very quickly when I came to this country is that skilled workers and engineers are very popular here – while the same could definitely not be said for bankers. Admittedly, we haven’t helped to increase the popularity of the banking sector over the past two decades.\nThis attitude is also reflected in the political arena. Certainly, there is the view that banks cannot be dispensed with entirely. However, the bigger and more international a bank becomes, the more sceptical its observers become. The preference is for smaller, local institutions.\nThe only thing is: by doing this, German banks will not be able to keep pace with their international peers. A fragmented market comprising over 1,700 institutions provides poor conditions for the emergence of several internationally competitive banks. Actually, the final hour has already arrived. The course is currently being set for the future of the European banking sector – if it has not already been set.\nHowever, it seems paradoxical that while Germany has been falling behind in the international banking market for years, a great opportunity to take over the role of the leading financial centre in the European Union is now opening up. The principal cause is the United Kingdom’s exit from the EU.\nThis brings us to the fifth proposition:\nGermany and Frankfurt must decide themselves how strongly they will benefit from Brexit\nFor months there have been discussions regarding which location is set to profit the most once London is no longer within the European Union. I cannot fully understand this debate because as I see it, the race had already been won before it even began.\nOf course, new financial industry jobs will be created in cities like Dublin, Amsterdam and Paris. However, in reality, none of these locations have the structures in place to assume a large portion of the business from London. There is only one European city which can fulfil these requirements and that city is Frankfurt.\nThis is where the relevant supervisory authorities, major law firms and consultancies are based, there are excellent data lines to the entire world and we have an international airport on our doorstep. These are all arguments in favour of a move to the banks of the Main when faced with relocating from the banks of the Thames. While we at Deutsche Bank make preparations to enable us to settle more transactions outside of London, Frankfurt is naturally the first port of call – and the same applies to many of our competitors.\nThe interesting question has therefore less to do with which European city international financial groups are going to establish major hubs in, and more to do with how much of the business will go to Frankfurt. This depends predominantly on Frankfurt itself: does the city want to take full advantage of the option that it now has? Does it want to become by far the most important financial metropolis in Continental Europe?\nThis leads me to the final proposition:\nInfrastructure is key\nIt is always an option for an international bank to retain only the absolute minimum and to carry out practically all tasks that are not connected to direct client contact in America or Asia. For this reason, it’s not about a choice between Dublin, Paris or Frankfurt – it’s about a choice between New York, Singapore or Frankfurt.\nWhat determines who gets what piece of the cake? Don’t worry – I’m not going to call for state settlement premiums or tax subsidies. Neither do I think that Germany needs to perform large-scale amendments to its legislation, regulatory environment or labour laws. With the almost silent restructuring of our Private & Commercial Bank over the past year and a half, we have shown what can be done in Germany when certain rules are respected.\nIn truth, it is its infrastructure that makes London unique in Europe. In this respect, this is where Germany needs to catch up if wants to take over a large share of the business performed in London.\nThis includes:\n— A dense network of service providers to support major banks, asset managers and insurance companies\n— More attractive, urban residential areas...\n— enough international schools...\n— ... and a dozen additional theatres and a few hundred restaurants are required.\nIn other words, Brexit could become a large stimulus package for Frankfurt's economy. All that is needed is the will of the city and the state of Hesse – and I believe that will is there.\nNone of this can be achieved within the space of a few months, but it doesn’t have to be either. The shifts in Europe's financial industry will not have been completed by the time the United Kingdom officially leaves the EU. However, the decision whether Frankfurt really wants to become the number one financial hub in the European Union must be made now.\nLadies and Gentlemen, as you can see, we still have a long way to go before our industry becomes as uneventful as I would like it to be.\n— The central banks are currently setting the course for a more normal interest rate environment.\n— Europe is laying the groundwork for a competitive banking structure – with or without German participation.\n— Germany and Frankfurt must decide how much they want to make of the opportunity that is Brexit.\nMr Steingart, if the City of Frankfurt becomes the major winner, you may need to find a larger venue for this conference in a few years’ time.\nBut first, I’m looking forward to our discussion here and now.\nThank you.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}