{
    "url": "https://www.db.com/news/detail/20180513-dbaccess-asia-conference-2018-opens-doors-to-investors-and-clients-in-singapore?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 13, 2018",
    "tags": [
        "Corporate products"
    ],
    "title": "dbAccess Asia Conference 2018 opens doors to investors and clients in Singapore",
    "body": "Deutsche Bank’s 9th annual flagship investor forum, dbAccess Asia Conference 2018, opens at Marina Bay Sands, Singapore on Monday, May 14. The conference will be attended by over 250 corporates representing both regional and global organisations, 1,500 individual investors representing more than 400 buyside institutions, senior corporate executives, influential industry experts and thought-leading academics.\nThe five-day event will explore current macro issues affecting economies, capital markets and companies around Asia Pacific and beyond, and will feature an exciting line-up of keynote speakers set to brief clients on macroeconomic trends, socio-political developments, technology trends as well as financial and regulatory outlooks.\nWe know that unlocking value in Asia requires a broad understanding of macro conditions, detailed company knowledge and cross-product awareness. That is why our experts in economics, equities, FX, derivatives and fixed income will be on hand to provide a 360-degree overview of country markets, industries, companies and capital structures.\nJames Boyle, Head of Equities, Asia Pacific\nThis year's keynote speakers include Gerhard Schroeder (Chancellor of Germany, 1998-2005), Dick Cheney (Vice President of the United States, 2001-2009), Ban Ki-moon (Secretary-General of the United Nations, 2007-2016), Juergen Schmidhuber (one of the world’s leading authorities on artificial intelligence), Edward Luce (Chief U.S. Commentator, Financial Times) and David Folkerts-Landau (Deutsche Bank’s Chief Economist and Global Head of Research).\nThis year, dbAccess Asia will also feature a Global Quant conference and a dedicated artificial intelligence experience corner where leading players in AI will demonstrate their products to delegates.\nDelegates will also have the chance to arrange private meetings with listed and privately-held companies from around Asia, complemented by select market-leading companies from around the world with significant Asian exposure, as well as join field trips and site visits. Throughout the week, Deutsche Bank will host more than 2,500 investor meetings with attending corporate management teams in Marina Bay Sands.\ndbAccess Asia is part of Deutsche Bank’s global series of major Corporate Access conferences and corporate days held under the dbAccess umbrella brand.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}