{
    "url": "https://www.db.com/news/detail/20180511-a-glass-half-full-opportunities-and-risks-from-higher-volatility?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 11, 2018",
    "tags": [
        "Capital markets",
        "Investment Banking"
    ],
    "title": "\"A glass half full: opportunities and risks from higher volatility\"",
    "body": "Strong economic data, particularly in the US, continued corporate earnings growth and inflation well under control all point to a cautiously optimistic \"glass half full\" investment outlook for the months to come, despite current market volatility, according to the latest quarterly outlook by Deutsche Bank Wealth Management’s Chief Investment Office.\nUnsettling recent developments include trade disputes and the slow move towards the end of post-financial crisis quantitative easing, the CIO wrote in updating its annual Ten Themes report. While these may cast a long shadow, they actually represent a shift back to a more typical market environment.\n“Varying perceptions of the current market environment are understandable,” says Christian Nolting, Chief Investment Officer for Deutsche Bank Wealth Management. “But from our perspective, this is very much a glass half full – not half empty.”\nHigher volatility is generating risks but also a range of opportunities, including in emerging market hard currency bonds and emerging Asia equities.\nThe US dollar should regain strength into the year-end due to growth and rising interest rates compared with other markets. Oil prices will likely be contained by a further rise in US production and an expectation of a stronger dollar.\nLonger term secular themes that are close to becoming portfolio \"staples\" for investors include infrastructure, cyber security, global aging, millennials, smart mobility and artificial intelligence.\nClick in the download area to see the\nPDF\nfull report for more on these themes – as well as why economic growth will surmount geopolitics and how central banks will manage the policy transition.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}