{
    "url": "https://www.db.com/news/detail/20180507-deutsche-bank-pilots-game-changing-payments-solution-with-iata?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 7, 2018",
    "tags": [
        "Corporate products",
        "Private products",
        "Research"
    ],
    "title": "Deutsche Bank pilots game-changing payments solution with IATA",
    "body": "Deutsche Bank has today announced a pilot project with the International Air Transport Association (IATA), the trade association for the world’s airlines, to test a disruptive new payment model.\nThrough the pilot, Deutsche Bank will look to reduce costs for processing payments between airline clients and airlines. Deutsche Bank will collect customer payments directly from consumer accounts in line with the newly revised EU Payments Services Directive, PSD2. Currently, payments are mainly processed via credit and debit transactions.\nThe new payments scheme will offer improved speed, security and transparency. Two-factor authentication will offer enhanced fraud protection for IATA and its member airlines. With direct payments being processed and received in near-real time, IATA’s member airlines will benefit from the acceleration of their funds. This will generate significant working capital and liquidity benefits – reducing Days Sales Outstanding and the cost of funding for these airlines.\nCombined, these benefits stand to reduce the estimated USD8 billion that IATA members currently incur from payment processing costs and fraudulent activity. For travellers this will result in more choice, a smoother and less complex payments process and ultimately more convenience when paying for airline travel.\n“The direct payment model promises significant cost savings and efficiency gains for our members,”\nsays Javier Orejas, Head of Banking EMEA and the Americas at IATA. “With airlines paying huge amounts for transaction fees and compliance – in addition to losses sustained due to fraud – this is a highly valuable innovation for the industry.”\nShahrokh Moinian, Global Head of Cash Products, Deutsche Bank, says, “This solution marks our strong commitment to innovation and our desire to transform regulatory initiatives into opportunities for our major clients involved in the B2C industries – starting with IATA.”\nDeutsche Bank AG\nMedia Contact\nFrank Hartmann\nPhone: +49 69 910 42744\nE-mail: frank.hartmann@db.com",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 1
}