{
    "url": "https://www.db.com/news/detail/20180504-deutsche-bank-integrates-esg-data-in-company-research-as-demand-for-responsible-investment-solutions-accelerates?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 4, 2018",
    "tags": [
        "Sustainability"
    ],
    "title": "Deutsche Bank integrates ESG data in company research as demand for responsible investment solutions accelerates",
    "body": "Deutsche Bank has developed a unique concept to integrate Environmental, Social and Governance (ESG) investment factors into its company research\nHelps investors ride the growing wave of responsible investing that Deutsche Bank Equity Research predicts will spread to cover all managed assets globally in the next 10 – 15 years\nOffers institutional investors a range of ESG approaches from single stock analysis on an initial 50 companies, to model portfolios that can be adapted to individual clients’ needs\n  Deutsche Bank’s differentiated approach to ESG\nDeutsche Bank has announced the launch of a unique concept to integrate Environmental, Social and Governance (ESG) investment factors into its company research. From today, research on all companies in the\nEuroStoxx50 index will include a dedicated section with detailed ESG information and guidance.\nCombining multiple factors and levering Deutsche Bank’s longstanding expertise in ESG research, each company will be assigned an ESG rating alongside the usual “buy”, “sell”, “hold” and target price information.\nThe ESG ratings comprise two elements: a measure for risk and one for opportunity talking points. The ratings are not absolute but relative to the other companies in the Eurostoxx50 index, or whichever index being assessed.\nIn addition to the ESG rating, Deutsche Bank provides an ‘Opportunity Ratio’ (0-100%), which puts the opportunity assessment into perspective to the overall ESG profile. A low ratio indicates that structural risks outweigh the opportunities. A high ratio suggests the opportunity-driven upside dominates.\nResponsible investing – from a niche to a global megatrend\nDeutsche Bank is launching its ESG product to support asset managers at a time of significant growth in demand for responsible investment mandates worldwide. Today, about 25 percent of global assets under management (AUM) are covered by asset managers’ commitment to invest responsibly. Deutsche Bank is convinced this will expand to all managed assets globally within the next 10-15 years.\nJan Rabe, Equity Strategist, Deutsche Bank Equity Research, said: “We believe socially responsible investing will take three more years to reach mainstream status (more than 50 percent of AUM) and 10 more years from then to reach greater than 95+ percent coverage.”\n“This is based on the assumption that a) socially responsible investment-ladled AUM grow at a regressive rate to approach global annual GDP trend growth of 3 percent in about 20 years – extrapolating their growth trend since the year 2000 – and b) total assets grow at the rate of global trend GDP as they have since the year 2000.”\nHow Deutsche Bank ESG research can help\nCollecting, analysing and implementing the vast amounts of ESG data available into portfolio models requires a substantial effort and so Deutsche Bank’s forward-looking ratings can save asset managers significant time and expense. This is because all relevant information of each company is available on one page and the data can be aggregated for each portfolio instantaneously.\nAs well as single stock ESG analysis including risk and opportunity factors, Deutsche Bank offers three model portfolios based on different risk appetites that can be adapted to individual clients’ needs.\nDeutsche Bank Equity Research has launched the initiative with a EuroStoxx50 case study that will be followed by a sector by sector roll-out of its concept to the European Stoxx600 index in the coming months.\n  About Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}