{
    "url": "https://www.db.com/news/detail/20180503-deutsche-bank-extends-frieze-partnership-to-los-angeles-strengthening-commitment-to-arts-in-the-us?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 3, 2018",
    "tags": [
        "Art",
        "Company",
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank extends Frieze partnership to Los Angeles, strengthening commitment to arts in the US",
    "body": "Deutsche Bank announced that it will extend its longstanding lead partnership with Frieze Art Fairs to the newly launched Frieze Los Angeles next year, strengthening a commitment to the arts in the US underlined by this week’s sponsorship of Frieze New York for a seventh year in a row\nThe bank’s Wealth Management division will be the Global Lead Partner of Frieze Los Angeles, taking place from February 14-17, 2019 at the Paramount Pictures Studios.\nFrieze New York, supported by Deutsche Bank Wealth Management as Global Lead Partner, takes place on Randall's Island Park from May 4-6, 2018. It includes a site-specific installation at the Deutsche Bank Wealth Management Lounge by Brazilian born artist Valeska Soares.\nFabrizio Campelli, Global Head of Deutsche Bank Wealth Management, said: “We are very proud to support Frieze and the positive impact we can make together by further expanding our partnership to the West Coast. We continue to invest across the US as a vital market for us where we can offer our clients not just the benefits of being part of a leading global bank but also truly unique experiences such as Frieze.”\nDeutsche Bank has supported Frieze London since its founding in 2003, and has been a partner of Frieze Masters London and Frieze New York since each of their launches in 2012.\nFostering creativity in societies around the world has been a focus of the bank’s art activities for more than 35 years. International contemporary art from the Deutsche Bank Collection is on display in the bank’s locations in more than 30 countries around the world. Representing more than 5,000 artists from over 40 countries, it is one of the world’s most important collections of contemporary artworks on paper and photography.\nThorsten Strauss, Global Head of Deutsche Bank Art, Culture & Sports, said: “The partnership with Frieze Los Angeles and Frieze New York reinforces our strong commitment to exciting contemporary art. Our aim is to provide clients, employees and the public with programmes and platforms to interact with and experience aspects of today's art, culture and sports.”\nThe constant development of the Deutsche Bank Collection helps support living artists and inspires engagement with diverse cultures. Exhibitions from the collection that travel internationally to major museums and arts institutions allow Deutsche Bank to make contemporary art accessible to a wider public.\nIn September 2018, Deutsche Bank will open its new forum for art, culture and sports in the “Princess Palace” (the Prinzessinnenpalais), located in the heart of Berlin. This space allows Deutsche Bank to establish a committed exhibition space where it can showcase its art, culture and sport activities under one roof, and enables international curators and artists the opportunity to present new contemporary art projects.\nDeutsche Bank’s “Artist of the Year” initiative, with nominees recommended by a panel of renowned curators, further underscores the bank’s commitment to fostering important international talents. Lebanese artist Caline Aoun has been selected for 2018/2019. A solo show by the Beirut-based artist with new and site-specific works will start at the MAXXI in Rome and will then be on view in a second version at Deutsche Bank’s new venue in Berlin.\nThe bank’s dedicated magazine, ArtMag (db-artmag.com), features interviews with artists and profiles the bank’s many art activities around the world including its engagements at Frieze.\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Contact\nAdrian Cox\nPhone: +44(20)754-17775\nE-mail: adrian.cox@db.com\nKlaus Winker\nPhone: +49 69 910 32249\nE-mail: klaus.winker@db.com\n\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nAbout Frieze\nFrieze is the world’s leading platform for modern and contemporary art for scholars, connoisseurs, collectors and the general public alike. Frieze comprises three magazines—frieze, Frieze Masters Magazine and Frieze Week— and four international art fairs—Frieze London, Frieze Masters, Frieze New York and Frieze Los Angeles. Additionally, Frieze organizes a program of special courses and lectures in London through Frieze Academy.\nFrieze was founded in 1991 by Matthew Slotover and Amanda Sharp, with the launch of frieze magazine, the leading international magazine of contemporary art and culture. In 2003, Sharp and Slotover launched Frieze London art fair, which takes place each October in The Regent’s Park, London. In 2012, they launched Frieze New York, which occurs each May in Randall’s Island Park, and Frieze Masters, which coincides with Frieze London in October and is dedicated to art from ancient to modern. In 2018, Frieze announced the launch of Frieze Los Angeles, which will open February 14–17, 2019 at Paramount Pictures Studios, Los Angeles.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}