{
    "url": "https://www.db.com/news/detail/20180502-global-wealth-management-dare-to-be-different?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 2, 2018",
    "tags": [
        "Company",
        "Corporate products",
        "Strategy",
        "Wealth"
    ],
    "title": "Global Wealth Management – Dare to be Different",
    "body": "The 2018 edition of the Deutsche Bank Oliver Wyman Wealth Management Report offers an overview of recent industry trends and an outlook on future developments. As industry pressures intensify, the report identifies several calls of action for wealth managers.\nWatch video\nWealth managers showed strong performance in 2017, but tail risks continued to grow. While interest income tailwinds from recent US dollar rate hikes provided some relief, fee pressure remains high, and costs must remain a top priority as profitability remains highly sensitive to top-line performance.\nWhile signs of a market correction are intensifying, efforts to diversify revenue streams over the past decade will not provide sufficient protection against revenue declines in the next market downturn.\nTo prepare for economic success beyond the next market downturn, the report suggests that wealth managers need to look towards more strategic changes which they have failed to do in recent years.\nWatch Kinner Lakhani, Head of European Financials Research, Deutsche Bank and Kai Upadek, Head of Wealth Management, Oliver Wyman, discuss the report in this video.\nThe report identifies three key priorities for Wealth Managers:\nFocus on key competencies\n\nDifferentiated value propositions and business models achieve up to double pre-tax margins, wealth managers need to sharpen their pencils by:\n\n— Standing out through a differentiated and well-articulated value proposition by focusing on key competencies, e.g. by re-focusing the delivery model, and / or streamlining the (in-house) product range\n\n— Preparing to face off disruptive competitors, e.g. brokers for investment services, by considering own aggregator / platform models or working closely with them as part of a broader wealth management ecosystem\nEmbrace data analytics to unlock revenue upside of up to 20 percent\n\nData analytics has not yet lived up to its potential and wealth managers need to overcome challenges to realise the full revenue opportunity. To do this, wealth managers need to:\n\n— Build the foundation for advanced analytics by enhancing data governance and quality controls;\n\n— Embrace third-party solutions; third-party data providers and aggregators are often way ahead of banks, e.g. combining hundreds of data sources to identify new leads / improve services to existing clients will become the new norm.\n\n— Embed data analytics into the organisational culture and day-to-day business processes\nTransform the workforce for ~40 percent of employee skill profiles\n\nWealth managers must participate in the war for talent, particularly for highly sought-after data scientists. To transform their workforce, wealth managers should:\n\n— Treat this issue as a top three CEO priority; firms running this effort out of the HR department will likely fail\n\n— Accelerate learning and training efforts to upgrade existing employees’ skillsets, particularly related to data analytics, and try to attract new and transforming talent pools, particularly data scientists\n\n— Seek external partnerships to tap into new talent pools beyond financial services to access the required skillsets\n\nMore information\n\nThe full report is available to clients of Deutsche Bank Research.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}