{
    "url": "https://www.db.com/news/detail/20180629-win-win-saving-air-bags-seat-belts-and-jobs?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 29, 2018",
    "tags": [
        "Investment Banking"
    ],
    "title": "Win-Win: Saving Air Bags, Seat Belts, and Jobs",
    "body": "Deutsche Bank’s Global Credit Trading (GCT) and Corporate Finance have successfully collaborated to finance the acquisition of Takata by Key Safety Systems. In doing so, the bank helped to avoid a liquidation of Takata’s assets, and thereby helped to secure the uninterrupted supply of a critical component of automobiles globally, while also securing the fate of tens of thousands of loyal Takata employees in Japan and throughout the world.\nTakata, a Japanese giant and the No. 2 global manufacturer of passive safety systems, supplied roughly 25% of the world’s automobile airbags and seat belts. But problems arose with the design of selected airbag models and under the weight of global recall liabilities, Takata fell into bankruptcy in 2017.\nOne year on and the world has a new powerhouse in automobile passive safety systems.\nWorking hand in hand with Takata’s suitor, Key Safety Systems who was owned by the leading Chinese auto parts producer Joyson Electronics, Deutsche Bank helped to smooth the highly complex acquisition process that involved arranging up to USD 1.2 billion of acquisition and revolving credit commitments, as well as numerous negotiations in Tokyo, Hong Kong, New York, and Ningbo, with the acquirer, acquirer’s shareholder, prospective minority equity partners, and each of the world’s largest auto companies.\nIn addition to the normal complexities of an M&A transaction, the process involved bankruptcy proceedings in multiple jurisdictions, including the US and Japan, as well as negotiating waivers and financial indemnities relating to historical product defects and prospective claims around the world. The final transaction structure included asset purchases, entity purchases, bankruptcy court purchases, revenue program novation, and channeling injunctions, among others.\nThe bank was also tasked with procuring a high-quality minority equity partner that could facilitate a complex global integration, as well as facilitate cultural harmony between Chinese-owned Joyson Electronics and Takata, a traditional Japanese company. Deutsche Bank successfully introduced Pacific Alliance Group as a minority equity investor into the newly combined company, Joyson Safety Systems.\nThis successful transaction is another excellent example of the positive impact Deutsche Bank has on businesses across the world. In future, global automobile companies and their millions of customers can continue to rely on the life-saving devices that Joyson Safety Systems’ tens of thousands of employees can continue to design and manufacture, all the time innovating and working towards making car transport safer for everyone.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}