{
    "url": "https://www.db.com/news/detail/20180628-db-usa-corporation-results-of-the-federal-reserve-s-2018-comprehensive-capital-analysis-and-review?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 28, 2018",
    "tags": [
        "Company"
    ],
    "title": "DB USA Corporation: Results of the Federal Reserve's 2018 Comprehensive Capital Analysis and Review",
    "body": "The Board of Governors of the Federal Reserve System (the Federal Reserve) this afternoon announced the results of the 2018 Comprehensive Capital Analysis and Review (CCAR) for DB USA Corporation (DBUSA). The Federal Reserve did not object to the DBUSA Capital Plan on a quantitative basis; it did object to the Capital Plan for qualitative reasons. This is the first year that DBUSA and the intermediate holding companies (IHCs) of foreign banks operating in the US have participated publicly in CCAR.\nDB USA Corporation has made significant investments to improve its capital planning capabilities as well as controls and infrastructure. DBUSA continues to make progress across a range of programs and will continue to build on these efforts and to engage constructively with regulators to meet both internal and regulatory expectations.\nOn a quantitative basis, the Federal Reserve projected that even in a severely adverse economic scenario, DBUSA’s Common Equity Tier 1 capital would comfortably exceed the regulatory minimum of 4.5% and would not fall below 12.2% at any time over the nine-quarter planning horizon. The Federal Reserve also projected that DBUSA’s Tier 1 Leverage Ratio would remain well above the regulatory minimum of 4% and would not fall below 5.7%. All other minimum regulatory capital ratios were also exceeded.\n\n1 The Federal Reserve’s Dodd-Frank Act Stress Tests (DFAST).\n2 Average nine-quarter minimum for all 35 DFAST-participating firms evaluated under a ‘severely adverse’ scenario in 2018.\n3 Calculated for ‘advanced approach’ firms.\nDBUSA is an IHC and had USD 133 billion in assets as of March 31, 2018. DBUSA represents approximately 7% of Deutsche Bank AG assets and 28% of the combined US operations of Deutsche Bank AG. DBUSA’s principal subsidiaries are Deutsche Bank Securities Inc., an SEC-registered broker dealer; Deutsche Bank Trust Company Americas, an FDIC-insured bank; and DB USA Core Corporation, a US service corporation.\nThe public disclosure of the Federal Reserve’s CCAR results for DBUSA and all other participating companies is available on the Federal Reserve website.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}