{
    "url": "https://www.db.com/news/detail/20180621-db-usa-corporation-results-of-the-federal-reserve-s-2018-dodd-frank-act-stress-tests?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 21, 2018",
    "tags": [
        "Company"
    ],
    "title": "DB USA Corporation",
    "body": "The Board of Governors of the Federal Reserve System (the Federal Reserve) this afternoon announced the 2018 results of the Dodd-Frank Act Stress Tests (DFAST) for DB USA Corporation (DBUSA).\nThe Federal Reserve projected that even in a severely adverse economic scenario, DBUSA’s Common Equity Tier 1 capital would comfortably exceed the regulatory minimum of 4.5% and would not fall below 12.2% at any time over the nine-quarter planning horizon. The Federal Reserve also projected that DBUSA’s Tier 1 Leverage Ratio would remain well above the regulatory minimum of 4% and would not fall below 5.7%. All other minimum regulatory capital ratios were also exceeded.\nDB USA Corporation Capital Ratios: Actual Versus Stressed\nCapital Ratios\nRequired \nMinimum\nActual ― 4Q17\n‘Severely Adverse’  \nNine-Quarter Minimum\nCommon Equity\nTier 1 Capital Ratio 4.5% 16.5% 12.2%\nTier 1 Capital Ratio 6.0% 25.9% 21.7%\nTotal Capital Ratio 8.0% 25.9% 22.0%\nTier 1 Leverage Ratio 4.0% 7.2% 5.7%\nSupplementary\nLeverage Ratio 3.0% 6.6% 5.2%\n\nDBUSA is an intermediate holding company (IHC) and has USD 133 billion in assets as of March 31, 2018. DBUSA represents approximately 7% of Deutsche Bank AG assets and 28% of the combined US operations of Deutsche Bank AG. DBUSA primarily consists of Deutsche Bank Securities Inc., an SEC-registered broker dealer; Deutsche Bank Trust Company Americas, an FDIC-insured bank; and DB USA Core Corporation, the US service function entity.\nThe public disclosure of the Federal Reserve’s DFAST results for DBUSA and all other participating companies is available on the Federal Reserve website.\nResults of the 2018 Comprehensive Capital Analysis and Review (CCAR) are expected to be announced by the Federal Reserve on June 28.\nAbout DB USA Corporation\nDB USA Corporation (DBUSA) is a US intermediate holding company (IHC) and is a wholly-owned subsidiary of Deutsche Bank representing one component of Deutsche Bank’s US operations.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 0
}