{
    "url": "https://www.db.com/news/detail/20180620-worldrefugeeday2018?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 20, 2018",
    "tags": [
        "Corporate Citizenship",
        "Education",
        "Employee engagement"
    ],
    "title": "#worldrefugeeday2018",
    "body": "Since summer 2015, around 4,000 Deutsche Bank employees in Germany have invested almost 7,000 days of their time to supporting over 430 refugee-related community projects\nMore than 750 staff are already serving as integration coaches for refugees\nA new “Banking Introductory Programme” is showing more than 90 refugees the career opportunities available in the financial industry\nOn World Refugee Day, held every year on June 20, the UN Refugee Agency raises awareness of the plight of refugees. Some 65 million people around the world are currently refugees. On average, every day around 28,300 people flee their homes because of conflict and persecution (source: UNHCR).\nIn light of the huge increase in the flow of refugees to Europe, and especially to Germany, in 2015 Deutsche Bank joined forces with non-profit organisations to expand its commitment to the integration of refugees and to target existing programmes to their needs.\nAs one of the 36 founding members of the “We together” initiative, we committed ourselves to engaging a total of 1,000 employees by the end of 2018 to serve as integration coaches for refugees. More than 750 employees had signed up to the initiative so far.\n“Deutsche Bank’s initiative 1,000 Deutschbankers as Integration Coaches is our way of supporting refugees in their efforts to learn German, seek employment and become part of German society. Our employees and our non-profit partner organisations are committed to this cause. This is our positive impact, helping to promote diversity and openness in society,” says Karl von Rohr, President and Chief Administrative Officer of Deutsche Bank.\nMultiple citizenship programmes\nIn response to the complexities of accessing the German labour market, the bank launched a “Banking Introductory Programme” and in April and May this year, invited 36 refugees from all over Germany to its head office in Frankfurt to provide them with a better understanding of the bank and the financial sector. The next round will take place with a further 60 participants in October. Those interested can apply here.\nAn increasing number of employees are also serving as advisors to social start-ups that provide targeted support for refugees under the umbrella of the Made for Good programme, for instance with the startsocial competition. Our Born to Be youth engagement programmes have also been extended to accommodate the specific needs of young refugees.\nFor example, since 2016 Deutsche Bank Stiftung has been involved as a sponsor with the “Kinder und Jugendliche Willkommen” (KIWI - “Welcome Children and Teenagers”) integration project set up by the CARE relief agency to help young refugees integrate at school and which has since been put into practice at over 290 schools throughout Germany. The project has already been taken up by 900 teaching staff and over 20,000 schoolchildren.\nEurope-wide focus\nWe support several refugee-related community projects beyond these initiatives in Germany, thus giving our staff the opportunity to get involved. The Deutsche Bank Middle East Foundation, for example, supports an aid project in Lebanon that provides a safe haven for some 910 families as well as water to almost 1,200 refugees who are currently living in tents.\nTogether with our partner “Breaking Barriers” in the UK, we help refugees to take the initial step towards employment with the help of training schemes, for instance, in the IT sector. With regional and nationwide programmes and activities, we collect donations to fund refugee-related projects.\nColleagues outside Germany – irrespective of where they are located around the world – can also become integration coaches through our partner “Volunteer Vision”, which offers a digital mentoring and language training services.\nIn the US, Deutsche Bank has long supported organizations that advance equity and opportunity for New York City’s many immigrants. Signature programs include serving as the founding corporate sponsor of the New Americans Welcome Centers of the YMCA of Greater New York, which enables immigrants to achieve self-sufficiency through job training and social services. Through the Unity & Opportunity Request for Proposal program last year, the bank supported New York City nonprofit organizations providing direct services, entrepreneurship opportunities and systems change efforts for low-income immigrant communities pursuing the American dream. \n“Mentoring is a lot of fun - I enjoy working and acquiring knowledge together with my mentee. It's not easy for everyone to find their place in society. Sometimes, it just takes a little help to get ahead in life. If I can be that helping hand, then I will have achieved my goal.”\nSeda Basar from Global Transaction Banking",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}