{
    "url": "https://www.db.com/news/detail/20180619-us-china-trade-battle-heats-up?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 19, 2018",
    "tags": [
        "Corporate products",
        "Investment Banking",
        "Research"
    ],
    "title": "US-China trade battle heats up",
    "body": "The trade war between the US and China is heating up, according to Deutsche Bank China Chief Economist Zhiwei Zhang.\n“While President Trump announced that his team is working on plans to impose 10 percent tariffs on 200 billion US dollars worth of Chinese exports to the US, the big question is whether China will retaliate beyond trade and target US business interests in China,” Zhang wrote in his latest research note.\nChina’s Ministry of Commerce has already issued a short statement which promised to retaliate with \"comprehensive quantitative and qualitative measures\" if the US imposes more tariffs.\nIf the trade war escalates to include the proposed 10 percent tariff, it would have a meaningful impact on both sides. Deutsche Bank expects the cumulative impact on China’s GDP growth would be 0.2 to 0.3 percentage points, including the impact of the 25 percent tariff (already announced on Friday) on the ﬁrst 50 billion dollars of Chinese exports. This impact is close to our earlier estimates, which assumed a 25 percent tariff on 100 billion US dollars of Chinese exports.\nThe products affected would likely include consumer goods like phones and shoes, which the US government so far has been carefully trying to avoid hitting.\nIn addition, Zhang believes trade tension risks are rising between the US and China, whereby China could threaten to officially target US multinational firms in China.\nDeutsche Bank’s China Macroeconomics team estimates that US firms sold 448 billion dollars of goods and services to China in 2017, 168 billion dollars through trade and 280 billion through local operations by US subsidiaries in China.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}