{
    "url": "https://www.db.com/news/detail/20180616-insights-from-dbaccess-global-consumer-conference-2018?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 16, 2018",
    "tags": [
        "Research"
    ],
    "title": "Insights from dbAccess Global Consumer Conference 2018",
    "body": "Deutsche Bank’s 15th Global Consumer Conference and the world’s single largest global consumer conferences took place in Paris this week with over 700 investors attending travelling from across Europe, North America, Asia and the Middle East and over 100 companies signed up to present and/ or host investor meetings; with a combined market capitalization of 3 trillion US dollars.\nHere’s what some of the presenters said when presenting their companies:\nJessica Alba, actress and founder of the Honest Company presented on day one and later added to her Instagram page: \"We had a great fireside discussing all the things @honest” which was liked over 28,000 times.\nEstee Lauder management's words at the conference confirmed China is an attractive place to be for a consumer company. The growing economy and the rising middle class will drive almost every sector up for many years.\nThe management believes that young generations in China have a good purchasing power and like to spend in make-up as they are heavily influenced by traditional influencers on social media. In general, the environment is healthy for the whole consumer goods space, with the Chinese government trying to stimulate consumption through several measures, which include lowering tariffs (outside of the trade tensions with the United States).\nEstee Lauder's management also highlighted how the digital channel is extremely important for the future development of the business. Not just because it's the fastest-growing channel and is supported by secular trends, but because it gives the company precious information about demand and sales trends that can help the management plan store expansion in growth areas like China, where online sales account for 25% of total sales compared with a 15% average for the business globally.\nColgate-Palmolive highlighted that 2017 had been a difficult year and that 2018 continued to be challenging, but that they were seeing improvements. Particularly in Latin America, their biggest market in terms of sales (25%) and operating profits (27%), with 660 million consumers in 42 countries driving organic sales growth.\nLaurent Freixe, Executive Vice President, Chief Executive Officer Zone Americas of Nestle highlighted that the change in the competitive landscape has never been as fast as it currently is with impact of science (e.g. less sugar content, enhancements of taste and 100% recyclable PET bottles) and technology; enjoying a 38% growth in Q1 2018 in ecommerce sales.\nTechnology is changing consumers' behaviours, their interactions through social media, influence in the way they think, and ultimately how they shop. This evolution impacts every aspect of our systems, creating the opportunity to partner in different ways with our customers and re-engineer our supply chain and our route to market. For our company with a great foundation and strong capabilities, all of these changes are also opportunities to drive not just growth, but profits and cash flow.\nKathy Waller, Executive Vice President, Chief Financial Officer and President, Coca-Cola\nEva Quiroga-Thiele, Consumer Staples Analyst, Deutsche Bank Research, summed up the conference by saying: “With companies representing approximately 3 trillion US dollars in market cap attending, Deutsche Bank’s Global Consumer Conference offers a fantastic opportunity for global investors to hear first-hand the current themes affecting the world’s largest consumer companies.\"\n\"This year, the impact of digital across multiple parts of the business model was a key talking point – from digital marketing, changing consumer preferences to the use of big data and artificial intelligence to improve decision-making and hence create efficiencies.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}