{
    "url": "https://www.db.com/news/detail/20180615-deutsche-bank-wealth-management-scoops-award-for-its-nextgen-client-networking-app?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 15, 2018",
    "tags": [
        "Awards",
        "Company",
        "Digitalisation",
        "Research"
    ],
    "title": "Deutsche Bank Wealth Management scoops award for its NextGen client networking app",
    "body": "Deutsche Bank Wealth Management has won a prestigious technology award for its NextGen app, launched late last year to offer millennial clients a broad range of opportunities for networking and sharing information.\nThe NextGen App was “Highly Commended” in the category for best global initiative in client-facing technology in the inaugural Wealth Tech awards from Professional Wealth Management (PWM), published by the Financial Times. The awards recognise the prominent role of technology in private banking and allow banks to showcase investments on behalf of their clients.\n  Finding new ways to interact with millennial clients\nThe app is available to the over 500 former participants, coming from over 20 countries, in Wealth Management’s Next Generation programme, a series of educational events to inspire and prepare the children of key clients for their future roles as leaders and entrepreneurs. Introduced in October 2017, it is an exclusive digital platform offering a secure environment to make personal connections, share information and access unique insights and other content.\nThe app was developed in partnership between the business and the bank's technology teams in the US and Bucharest. Usable on smartphones and tablets, it enables wealth managers and their clients to interact with each other in a completely new way.\n“The award is a big recognition for our efforts in creating our digital client experience and underpins how we are becoming increasingly competitive in digital innovation,” said Thomas Klemm, Head of Digital for Wealth Management. “We are proud to be able to offer improved capabilities every day, from the truly global app for our NextGen client community to mobile banking applications for our clients in Germany, Switzerland and Asia.”\nThe wealth management industry is being transformed by digital technology at the same time as it prepares for what has been dubbed the largest wealth transfer in history from baby boomers to millennials.\n“Working with our Next Generation clients enables us to share a fresh perspective on the future,\" said Salman Mahdi, Global Vice Chairman at Deutsche Bank Wealth Management. “Our NextGen app is another way to reinforce our strong bonds with an incredibly diverse and talented group of tomorrow's leaders and give them what they want as their relationship with their wealth managers evolves.\"",
    "number_of_ratings": 25,
    "rating": 2.0,
    "likes": 1
}