{
    "url": "https://www.db.com/news/detail/20180612-the-world-s-single-largest-global-consumer-conference-dbaccessgcc-opens-in-paris?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 12, 2018",
    "tags": [
        "Research"
    ],
    "title": "World's single largest global consumer conference #dbAccessGCC opens in Paris",
    "body": "Is the ‘chase for margin’ the right strategy? Are we at the end of an M&A super-cycle and is the 2018 ‘emerging markets staples story’ over before it even started?\nThis week, June 12-14, Deutsche Bank is hosting its 15th annual dbAccess Global Consumer Conference (#dbAccessGCC) and will addressing these and other questions. One of Deutsche Bank’s largest conferences, it is also the world’s single largest global consumer conference, making it the must-attend event for any investor looking at the global consumer staples, luxury and retail space.\nOver 700 investors have signed up for this year’s event from across Europe, North America, Asia and the Middle East and over 100 companies have signed up to present and/or host investor meetings; with a combined market capitalisation of 3 trillion dollars. There will be 46 fireside chats and presentations – a ‘Who Is Who’ of the global consumer industry.\nDay One starts with presentations from three of the UK’s key consumer companies, Reckitt Benckiser, British American Tobacco and Imperial Brands, with additional speakers from Colgate-Palmolive, Estée Lauder and Henkel.\nActress Jessica Alba (Fantastic Four, Into the Blue and Sin City) will be talking about The Honest Company, which she launched in 2012, inspired by the birth of her first child in 2008. The Honest Company supplies environmentally friendly products for babies (diapers), home care and personal care.\nOn day two presentations will include a large number of heavyweights in the world of beverages (including ABInbev, Coca-Cola, Heineken and Pernod), food (including Danone and Nestlé) and personal care (including L’Oréal), but also media (including Publicis CEO Arthur Sadoun and L’Oréal Digital Officer Lubomira Rochet).\nThursday, the last day of the conference, finishes on a strong note with presentations from Procter & Gamble and Unilever.\nEva Quiroga-Thiele, Consumer Staples Analyst, Deutsche Bank Research, says: “With many global consumer stocks sharply down since peaking in the middle of last year, it makes this year’s conference particularly topical as disruptive new digital communication tools, new distribution channels and new entrants create change in a rapidly-shifting environment.”\nFor more information please contact your Deutsche Bank representative or one of the key contacts listed below:\nConference & Events Team\nRosanna Spataro\nTel: +44 20 7545 1094\ndbaccess.consumerconference@db.com\nCorporate Access\nClaire Howling\nTel: +44 20 7547 3248\nclaire.howling@db.com\nCorporate Access Schedules\nBeverley Keeble\nTel: +44 20 7545 8179\ndbaccess.consumerschedules@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}