{
    "url": "https://www.db.com/news/detail/20180611-on-top-of-the-world-india-s-vikas-dimri-summits-mount-everest?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 11, 2018",
    "tags": [
        "Company"
    ],
    "title": "On top of the world: India's Vikas Dimri summits Mount Everest",
    "body": "At 6:18 am on May 18, Vikas Dimri from PCB India achieved what only a few throughout history have achieved: he reached the top of Mount Everest. Standing at 29,035 feet, Everest is the highest mountain in the world. “I was overwhelmed with emotion as I reached the top” he said. “I felt immense gratitude to all those who supported me, a great sense of relief to finally make it, and immeasurable pride as I held up the Indian flag and Deutsche Bank logo on top of the mountain.”\nDimri started trekking in 2009 as part of his fitness regime. During his treks in and around Nepal, he noticed the poor quality of children’s footwear – which led him to launch Happy Feet, with a target to donate 29,035 shoes (one pair for every foot he climbed on Everest) to underprivileged children.\nHe set his sights on Everest after making it to the Everest Base Camp in May 2014. Bad weather forced him to cut his first attempt short last year, just a few hundred meters from the summit. After a year of intense preparation, Dimri began his second attempt to climb to the summit on April 12, 2018, navigating treacherous crevasses and falling ice slabs along the way. The ascent was even more demanding as he had to climb back and forth with manageable amounts of supplies.\nBy May 17, over a month into the climb, he reached the low-oxygen ‘Death Zone’, where most of Everest’s fatalities occur. The last time he was there he walked into a blizzard, but this time the weather was favourable.\nAll the same, I was not sure that I would make the summit and be back safely. But I knew I would give it my best shot and weather-permitting, I’d be standing on top the world, the next morning.\nAfter a few hour’s rest, he made his final ascent, climbing through the night to reach the summit at daybreak – exactly one year to the day he had been forced to retreat.\nA visibly moved Dimri said “Having to turn back last year was gut-wrenching, but it taught me a lot about myself. This year, I was better prepared mentally, ready for anything. As the Sherpas say ‘the mountain isn’t going anywhere’. So I trained even harder and renewed my focus on the goal, and I finally made it.”",
    "number_of_ratings": 3,
    "rating": 5.0,
    "likes": 3
}