{
    "url": "https://www.db.com/news/detail/20161102-the-dark-sides-of-quantitative-easing?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 2, 2016",
    "tags": [
        "Investment Banking",
        "Research"
    ],
    "title": "The dark sides of Quantitative Easing",
    "body": "While European central bankers commend themselves for the scale and originality of monetary policy since 2012, this self-praise appears increasingly unwarranted.\nThe reality is that since Mario Draghi’s infamous “whatever it takes” speech in 2012, the eurozone has delivered barely any growth, the worst labour market performance among industrial countries, unsustainable debt levels, and inflation far below the central bank’s own target.\nWhile the positive case for European Central Bank intervention is weak at best, it seems that the negative repercussions are becoming overwhelming.\nWe outline the five darker sides to current monetary policy:\nParadox of ECB intervention\nThe first is a paradox of ECB intervention: that monetary policy stifled the very reform momentum it sought to create. Pre-2012, more than half the growth initiatives recommended by the OECD were being implemented across the eurozone. But last year just twenty per cent were. ECB intervention has curtailed the prospect of significant reforms in labour markets, legal systems, welfare systems, and tax systems across the continent.\nBond prices have lost their market-derived signalling function\nSecond, bond prices have lost their market-derived signalling function.\nIncreasing concentration of risk on the Eurosystem balance sheet\nPerhaps the darkest side of ECB monetary policy is the increasing concentration of risk on the Eurosystem balance sheet – expected to be EUR 2tn by March 2018. In the event of a debt restructuring of a eurozone member, the liabilities of the national central bank are likely to be borne by the taxpayers of the other eurozone member states, even if losses are spread over a long period. Fundamentally, however, the debt will have been socialised.\nECB intervention has not been a net positive for eurozone savers\nFourth, ECB intervention has not been a net positive for eurozone savers. While high and stable revaluation gains have buttressed total returns over recent years, this is clearly a one-time gain. Today, rising energy prices, the shortage of high coupons and ultimately mean-reversion are likely to take their toll.\nMisallocation of capital\nFinally, the misallocation of capital caused by ECB policy is preventing creative destruction and causing asset bubbles.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 1
}