{
    "url": "https://www.db.com/news/detail/20161228-live-in-cinemas-berliner-philharmoniker-new-year-s-eve-concert-2016?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 28, 2016",
    "tags": [
        "Corporate Citizenship",
        "Culture"
    ],
    "title": "Live in cinemas – Berliner Philharmoniker New Year's Eve Concert 2016",
    "body": "The 2016 classical music calendar will be brought to a close by what promises to be the highlight of the year, the Berliner Philharmoniker orchestra’s New Year’s Eve concert. Music lovers in the Berlin Philharmonie concert hall on 31 December will be joined by audiences at live screenings in numerous cinemas across Europe.\nStarting at 5 p.m. Berlin time, the performance by Chief Conductor Sir Simon Rattle, the highly acclaimed young pianist Daniil Trifonov and the Berliner Philharmoniker will be broadcast live to classical music devotees in exceptional audio and video quality at more than 240 cinemas in 15 European countries, including no less than 114 cinemas in Germany.\nAccess to the broadcast is provided by the “Digital Concert Hall”, an online video and music service funded by Deutsche Bank that shows around 40 live concerts by the Berliner Philharmoniker per season in high definition and surround sound.\nThis year’s programme comprises Dmitri Kabalevsky's “Colas Breugnon” operatic overture, Sergei Rachmaninov’s Piano Concerto No. 3 in D minor, orchestral works from William Walton’s “Façade” suites and Antonín Dvořák’s “Slavonic Dances”. The New Year’s Eve gala offers nearly two hours of uninterrupted musical pleasure. Tickets for the screenings can be purchased at cinemas and are widely available online.\nDeutsche Bank and the Berliner Philharmoniker have enjoyed a close and vibrant partnership for over 25 years. Nowhere else in the world are a commercial enterprise and an orchestra united by such an exclusive, time-honoured bond.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}