{
    "url": "https://www.db.com/news/detail/20161216-why-germany-s-economy-remains-a-beacon-of-stability?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 16, 2016",
    "tags": [
        "Investment Banking",
        "Research"
    ],
    "title": "Why Germany's economy remains a 'beacon of stability'",
    "body": "Europe is currently providing enough reasons to worry. The UK’s role is uncertain after Brexit, the chances of essential reform in Italy continue to recede following the failure of the constitutional referendum, while in France the fear of a shift to the right is growing. No wonder, then, that Europe’s economy cannot find any momentum. Six years after the sovereign debt crisis broke out, the continent continues to languish.\nIs this the case for the whole of Europe? Deutsche Bank economists believe not. One important exception is being overlooked.\nGermany is a “pillar of stability in an increasingly uncertain world”, writes Group Chief Economist David Folkerts-Landau and Chief German Economist Stefan Schneider in a study published on Wednesday. The country has an undisputed leadership role in Europe and is therefore “the only country that comes close to being on a par with America”.\nIn the study from the Standpunkt (“Standpoint”) series, Folkerts-Landau and Schneider identify the reasons for Germany’s decades-long stability – factors that other countries could probably replicate. “We can only learn from it,” is the rallying cry from the authors.\nIn addition to an economic policy focused on stability and “global companies with unique structures”, the authors identify less obvious reasons as strengths for Germany. These include “institutions grounded in German ‘ordoliberalism’”, a functioning legal system as well as good governance and administration.\nThe authors view the expensive welfare state and influence of trade unions as advantages. While other liberal economies regard these factors as destructive, the experts from Deutsche Bank Research believe this extensive network ensures social harmony and encourages acceptance of economic change among employees. The result has been that companies are more flexible.\nIn addition to this, there is an important psychological factor: patience. “Investigations and experiments have revealed that German society is very much characterised by... a readiness to forgo instant gratification,” says the study. Patience has led to high levels of educational success and fostered “low inflation rates and low levels of debt, or to sum it up in one word: stability.”\nThanks to its strengths, the authors believe that Germany will hold its ground internationally – even against countries that threaten to outpace it on future trends such as digitalisation. For example, the country that sets the benchmark for car-making may be lagging in terms of electromobility, but is moving into the fast lane for other, exciting developments: “The country is also the leader in patents for autonomous vehicles, another future innovation involving the digitalisation of transport and mobility.”\nHowever, Folkerts-Landau and Schneider warn that the country cannot afford to rest on its laurels. “The rate of reform has slowed dramatically in recent years. In the labour market and in pensions, some measures have been introduced that could prove problematic in future,” write the two economists. Furthermore, Germany would be particularly affected if the eurozone were to become further destabilised – or the mood shifted against globalisation throughout the world.\nPDF\nFind the full study here.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}