{
    "url": "https://www.db.com/news/detail/20161214-dbpride-2016-was-a-year-of-achievements-in-promoting-diversity-and-inclusion?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 14, 2016",
    "tags": [
        "Company",
        "Corporate Citizenship",
        "Diversity"
    ],
    "title": "dbPride: 2016 was a year of achievements in promoting diversity and inclusion",
    "body": "The mission of dbPride, one of Deutsche Bank’s employee resource groups, is simple: to foster an environment where all Deutsche Bank employees can bring their whole self to work every day. The bank seeks to achieve this by providing support for and awareness of LGBT (Lesbian, Gay, Bisexual and Transsexual) issues; nurturing Deutsche Bank’s inclusive and equal culture, and promoting Deutsche Bank as an inclusive and equal employer.\nDiversity is fundamental to Deutsche Bank’s DNA. Building diverse teams to generate better ideas and reach more balanced decisions is core to the bank’s values and beliefs. A year ago, Deutsche Bank celebrated Diversity Week against the tragic backdrop of the terrorist attacks in Paris. At that time, Chief Executive Officer John Cryan summed up the bank’s commitment: “Only by building teams of people with different backgrounds, education, skills and experiences can we create value across the bank. I want us to nurture inclusive environments where we welcome different ways of thinking about our challenges.”\nDeutsche Bank saw several achievements in 2016. In May, for example, employees around the world celebrated the International Day Against Homophobia, Transphobia and Biphobia (IDAHOT). The bank froze job expansion plans in North Carolina in April in response to state legislation which invalidated existing protection to the rights of LGBT citizens in some municipalities.\nAs the year draws to a close, Deutsche Bank has just been awarded a perfect score in the 2017 Corporate Equality Index by the Human Rights Campaign, America’s largest civil rights organisation working to promote LGBT equality. Last week, Deutsche Bank Australia’s Chief Economist, Adam Boyton, was recognised as one of Australia’s Outstanding LGBTI Leaders.\nIn London the number of LGBT Allies – staff willing to demonstrate visible support for their LGBT colleagues in the workplace – increased by 56%. Together with gender inclusivity network dbGO, the bank hosted a discussion evening about ‘bringing your whole self to work’ and in total, over 1,659 people attended dbPride & Ally events in 2016.\nIn October, four colleagues – Eileen Taylor, Masa Yanagisawa, Darren Beaumont and Jean-Luc Vey – were recognised in the Financial Times/OUTstanding Awards, either as Allies, LGBT Executives or LGBT Future Leaders.\nStuart Lewis, Chief Risk Officer and Executive Sponsor of dbPride in the UK and Ireland, said: “Diversity and inclusion are essential elements of the Deutsche Bank we want to be. Everyone at Deutsche Bank should be able to bring their whole self to work. We’re proud of the progress we made this year and ambitious for more progress in the year to come.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}