{
    "url": "https://www.db.com/news/detail/20161207-placing-social-value-at-the-heart-of-business?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 7, 2016",
    "tags": [
        "Company",
        "Corporate Citizenship",
        "Entrepreneurship",
        "Research"
    ],
    "title": "Placing social value at the heart of business",
    "body": "Companies who prioritise helping their local community, funding social enterprises and increasing the number of disabled people in their workforce are more likely to retain staff, have a strong brand image and be productive, a new report published today by the Centre for Social Justice (CSJ) has found.\nPart of long-running research by the CSJ on the causes of social breakdown and poverty in the UK, the report identifies barriers preventing businesses from increasing their social impact and proposes ways to overcome these. The report is sponsored by Deutsche Bank as part of its global enterprise programme, Made for Good.\nIn its study of a broad range of business practices, the CSJ finds that businesses adopting policies that lead to them being rated as socially responsible experience employee turnover that is almost a third lower.\nIt also notes that young people are more concerned about the social purpose of their employer company than older generations and that a company’s social purpose can also help increase productivity. One study cited by the CSJ finds that ‘the mission or purpose of my company’ is one of the 12 best predictors of employee engagement and performance.\nAndy Cook, CSJ Chief Executive, commented: “Businesses support society by their very existence. However, by taking small steps to take their contribution even further, they can make a huge difference to their employees’ lives and the wider community.\n\"By funding small businesses that otherwise would not be granted loans, by investing in apprenticeships, by helping those who struggle to find work such as those with disabilities or low skills, businesses can do great social good. The aim of this report by the CSJ is to showcase the incredible examples of business initiative so that ideas can be spread and shared as widely as possible.”\nExamples of good practice highlighted by the CSJ include Deutsche Bank’s involvement in supporting social enterprise in the UK. Demonstrating the bank’s commitment to driving positive change in society, the Made for Good programme helps pioneering social entrepreneurs build momentum and capacity.\nDeutsche Bank has also been a frontrunner in the social finance market and was the first financial institution to launch an impact investment fund in the UK, providing recommendations for businesses and policymakers.\nLareena Hilton, Global Head of Brand Communications & CSR said: “We are proud to support this important piece of thought leadership that shows how society benefits when business performance and social responsibility go hand in hand. This has long been our philosophy at Deutsche Bank and we are pleased to be one of the many examples of good practice highlighted in this report.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}