{
    "url": "https://www.db.com/news/detail/20161207-deutsche-x-trackers-us-platform-launches-high-yield-bond-etf-hylb?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "December 7, 2016",
    "tags": [
        "Asset Management",
        "Corporate products"
    ],
    "title": "Deutsche X-trackers US platform launches high yield bond ETF (HYLB)",
    "body": "Deutsche Asset Management (Deutsche AM) today announced the launch of Deutsche X-trackers USD High Yield Corporate Bond exchange-traded fund (ETF) (NYSE Arca: HYLB). The most cost efficient high-yield ETF in the US market¹ , HYLB will provide investors access to benchmark exposure to high yield bonds.\n“For investors seeking pure high-yield beta exposure as part of their diversification strategy in their overall asset allocation, they can now do so in a fast and cost-effective way through the Deutsche X-trackers USD High Yield Corporate Bond ETF,” said Fiona Bassett, Head of Passive Asset Management, Americas. “In the current low interest rate environment, high-yield bonds provide investors with a potential source of income. In addition, as the market is anticipating an interest-rate hike by the US Federal Reserve Board, the high-yield market tends to be less impacted by rate moves, shielding investors from potential volatility.”\nThe US platform also offers Deutsche X-trackers High Yield Corporate Bond-Interest Rate Hedged ETF (Bats: HYIH), which provides exposure to high-yield bonds while potentially reducing the interest rate risk in an investment portfolio. HYIH seeks to track the performance, before fees and expenses, of the Solactive High Yield Corporate Bond - Interest Rate Hedged Index, which aims to mitigate exposure of interest rate sensitivity across the yield curve in a rising rate environment.\nDeutsche Asset Management\nWith EUR 715 billion of assets under management (as of September 30, 2016), Deutsche Asset Management²  is one of the world’s leading investment management organizations. Deutsche Asset Management offers individuals and institutions traditional and alternative investments across all major asset classes.\nConsider the Fund’s investment objectives, risk factors, and charges and expenses before investing. This and other important information can be found in the Fund’s prospectus, which may be obtained by calling 1-855-DBX-ETFS (1-855-329-3837) or by viewing or downloading a prospectus at https://www.dws.com/en-us/. Please read it carefully before investing.\nHYLB RISKS:\nInvesting involves risk, including the possible loss of principal. Bond investments are subject to interest rate, credit, liquidity and market risks to varying degrees. When interest rates rise, bond prices generally fall. Credit risk refers to the ability of an issuer to make timely payments of principal and interest. Foreign investing involves greater and different risks than investing in US companies, including currency fluctuations, less liquidity, less developed or less efficient trading markets, lack of comprehensive company information, political instability and differing auditing and legal standards.\nFunds investing in a single industry (or group of industries), country or in a limited geographic region generally are more volatile than more diversified funds. Investments in lower-quality (\"junk bonds\") and non-rated securities present greater risk of loss than investments in higher-quality securities.\nPerformance of the Fund may diverge from that of the Underlying Index due to operating expenses, transaction costs, cash flows, use of sampling strategies or operational inefficiencies. An investment in this fund should be considered only as a supplement to a complete investment program for those investors willing to accept the risks associated with that fund. See the prospectus for details.\nHYIH RISKS:\nInvesting involves risk, including the possible loss of principal. Bond investments are subject to interest rate, credit, liquidity and market risks to varying degrees. When interest rates rise, bond prices generally fall. Credit risk refers to the ability of an issuer to make timely payments of principal and interest. Investments in lower-quality (\"junk bonds\") and non-rated securities present greater risk of loss than investments in higher-quality securities.\nThe fund seeks to mitigate the potential negative impact of rising Treasury interest rates by taking short positions in U.S. Treasury notes or bonds, or futures relating to those instruments. These short positions are not intended to mitigate credit risk or other factors that may have a greater impact on performance than rising or falling interest rates. The short positions may limit the potential positive impact of falling interest rates and there is no guarantee that the short positions will completely eliminate the interest rate risk of the long positions.\nInvesting in derivatives entails special risks relating to liquidity, leverage and credit that may reduce returns and/or increase volatility. Performance of the Fund may diverge from that of the Underlying Index due to operating expenses, transaction costs, cash flows, use of sampling strategies or operational inefficiencies. An investment in this fund should be considered only as a supplement to a complete investment program for those investors willing to accept the risks associated with that fund. See the prospectus for details.\nDiversification can neither ensure a profit nor protect against a loss.\nOther\nDBX Advisors LLC is the investment adviser to the Deutsche X-trackers Funds. Deutsche X-trackers Funds are distributed by ALPS Distributors, Inc. ALPS Distributors, Inc. is not affiliated with DBX Advisors.\nNo bank guarantee | Not FDIC insured | May lose value\n© Deutsche Asset Management. All rights reserved. DBX002415 11/30/17\n¹ Deutsche Bank Research\n² Deutsche Asset Management is the brand name of the Asset Management division of the Deutsche Bank Group. The respective legal entities offering products or services under the Deutsche Asset Management brand are specified in the respective contracts, sales materials and other product information documents.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}