{
    "url": "https://www.db.com/news/detail/20161205-deutsche-bank-strengthens-innovation-team?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "December 5, 2016",
    "tags": [
        "Company",
        "Digitalisation",
        "Entrepreneurship",
        "Research"
    ],
    "title": "Deutsche Bank strengthens innovation team",
    "body": "Deutsche Bank today announced that it has strengthened its innovation team with two new appointments. Elly Hardwick will become Head of Innovation and Philip Milne has been appointed as Chief Technology Officer (CTO) for Innovation.\nHardwick will join the bank in early December to lead the bank’s innovation activities and manage the Deutsche Bank Labs globally. She will work closely with fintechs and the bank’s business divisions to drive the adoption of new technology solutions.\nA fintech entrepreneur and former CEO of Credit Benchmark, an independent source of consensus credit risk information, she was previously Global Head of Strategy, Investment and Advisory at Thomson Reuters. Prior to that, she worked for Morgan Stanley. Hardwick holds an MBA from Harvard Business School.\nMilne joined Deutsche Bank in early November and will act as an interface between the Deutsche Bank Labs and the bank’s wider Technology organisation.\nHe has worked extensively in both the financial and technology sectors in London and California, most recently as CEO and Founder of a virtual reality start-up in Silicon Valley. He was a member of the founding teams that created the Android platform at Google and the Java platform at Sun Microsystems. Earlier in his career, he served as the Global CTO at Dresdner Kleinwort. Milne holds a master’s degree in Computer Science from the University of Cambridge and a Ph.D. in Mathematics/Computer Science from Bath University in the UK.\nHardwick will be based in London and Milne in Palo Alto. Both will report to JP Rangaswami, Chief Data Officer, Head of Strategy and Innovation for the Chief Operating Office.\n“Close collaboration with the innovation community is a priority for Deutsche Bank,” said Kim Hammonds, Member of the Management Board for Deutsche Bank and Group Chief Operating Officer. “These appointments will help accelerate the adoption of emerging technologies to enhance our service to clients and internal processes.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}