{
    "url": "https://www.db.com/news/detail/20160428-deutsche-bank-presents-artist-of-the-year-2016?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 28, 2016",
    "tags": [
        "Art",
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank Presents \"Artist of the Year\" 2016",
    "body": "Starting April 29, Deutsche Bank is presenting the first institutional solo exhibition devoted to Basim Magdy, its “Artist of the Year” 2016. While the artist, who was born in 1977 in Assiut, Egypt, and now lives in Basel and Cairo, invites visitors to take a journey into the future, he is primarily concerned with the present. In the show at the Deutsche Bank KunstHalle, his slide projections, photographs, works on paper, and installations from 2006 to 2016 combine into a stream of images that reflects the fluid boundaries between reality and virtuality.\nThe title of the exhibition, “The Stars Were Aligned for a Century of New Beginnings,” initially sounds optimistic. However, Basim Magdy plays ironically and humorously with the constantly changing cycle of hopes, utopias, and defeats. “Collective Failure,” says the artist, “has the same relevance as it did in the nineteenth century and as it will in the twenty-second. There is nothing special about our time or what we're witnessing today. We are just naive enough to reenact the same mistakes that were made so many times before.”\nIn addition to Basim Magdy’s significant film trilogy from 2014, his large-scale 64-part photographic work “An Apology of a Love Story that Crashed into a Whale” is at the center of the exhibition. Commissioned for the show, the work impressively illustrates Magdy’s handling of photography and text.\nIn recent years, Basim Magdy has participated in numerous international group exhibitions, including the Sharjah and Istanbul biennials in 2013 and the Montreal and Biennale MEDIACITY Seoul biennials in 2014. His work was on view at the highly acclaimed exhibitions “Surround Audience: New Museum Triennial 2015” and “Ocean of Images. New Photography 2015” at MoMA in New York.\nOwn part of the action\nThe exhibition is accompanied by a catalogue titled “Basim Magdy: Would a Firefly Fear the Fire that Burns in Its Heart? Artist of the Year 2016,” published by Hatje Cantz, with contributions by Regine Basha, Lauren Cornell, Britta Färber, Friedhelm Hütte, and Omar Kholeif (German/English, € 35).\nBasim Magdy developed “The Romantic Transformation of Loneliness into a Trade” for the Deutsche Bank KunstHalle. The light box with six transparencies was created in an edition of 50 + 10 A.P. and can be purchased for € 900.\nThe exhibition “Basim Magdy. The Stars Were Aligned for a Century of New Beginnings” is on view from April 29 to July 3, 2016 at the Deutsche Bank KunstHalle in Berlin. Subsequently the show travels to Rome (MAXXI, National Museum of the 21st Arts) and Chicago (Museum of Contemporary Art Chicago).\nPress photos on the exhibition can be found at: http://www.photo-files.de/deutschebankkunsthalle\nArt, Culture & Sports\nDeutsche Bank’s commitment to art is reflected by the bank’s new Art, Culture & Sport department. The new unit bundles the bank’s support programs and develops them further in conceptual terms. Together with its divisions, Deutsche wants to provide its customers with new access to the art, culture, and sports worlds.\nWith its involvement in contemporary art Deutsche Bank is setting standards worldwide, be it with the Deutsche Bank Collection, one of the world’s most important collections of contemporary artworks on paper and photography, with international exhibitions, or with the Deutsche Bank KunstHalle in Berlin. And for many years the bank has had a presence at selected art fairs such as Frieze London, Frieze New York, Art Cologne and the Tokyo Art Fair.\nInformation on Deutsche Bank’s global art program can be found at http://www.deutsche-bank.de/kunst and http://www.db-artmag.de.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}