{
    "url": "https://www.db.com/news/detail/20160426-deutsche-bank-launches-new-banking-app?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 26, 2016",
    "tags": [
        "Company",
        "Corporate products",
        "Digitalisation",
        "Private products"
    ],
    "title": "Deutsche Bank launches new banking app",
    "body": "The new “Deutsche Bank Mobile” banking app is available from the App Store starting today. Deutsche Bank Mobile is initially available for Apple iPhones 4s to 6s and will also be available for the Android operating system from the third quarter on. It provides access to the Bank’s digital ecosystem and raises the company’s digital profile. Its predecessor, the “My Bank” app, has been downloaded more than 1.5 million times.\nSmartphones play an increasingly important role in banking. Today, more than one-quarter of all clients (27%) regard the quality and quantity of the available digital services as the key factor in choosing a bank, according to a study by SNL Financial. Markus Pertlwieser, Chief Digital Officer, Private & Business Clients, at Deutsche Bank, says: “The new app is a key element of the digitalisation strategy for our private and business clients. Thanks to the new app we are making banking even more digital and user-friendly for our clients to round out our advisory services at our branches.”\nThe new app can be intuitively controlled and complies with highest security standards in mobile banking. Users can arrange functions according to their needs and customise the look of the app by choosing their own wallpaper. Clients can transfer money to friends, acquaintances or business partners with just a single click. Gesture recognition, a significant jump in performance over conventional apps, plus the integration of fingerprint login and swipe access to past account balances make the app more user-friendly than ever before.\nAdditional new features are planned over the course of the year. Contactless payment at the point of sale based on NFC technology, for example, is scheduled to become available when the Android version of the app is released. The app also opens the door to multi-bank aggregation, which lets clients monitor accounts at other financial institutions through Deutsche Bank’s online and mobile banking services for a complete overview of all account balances, including accounts at other banks.\nDevelopments on the horizon\nUsers will also be able to check their securities accounts in a later release of multi-bank aggregation. As a result, the Deutsche Bank app gives clients an easy way to get an overview of all their finances. “The open interface makes it significantly faster to add new functions to our digital ecosystem and give our clients the ability to use them from their mobile devices, in keeping with our approach of cooperating with successful fintechs and quickly integrating their technology and services into our banking offerings,” Pertlwieser adds.\nThe advancement of the app is the first project being tackled by the Bank’s Digital Factory. Currently in development, the Digital Factory will bring together some 400 software developers, IT specialists and banking experts starting mid-year to work on digital products and services for the bank’s clients.\nBy launching its new app, Deutsche Bank expects to reach the “mobile moment” – a name in the digital economy given to the point in time after which more people use smartphones or tablets than PCs to access a digital service. Mobile devices already account for more than 40% of all attempts to access the Bank’s account services today. Of Deutsche Bank’s 8 million private and business clients in Germany, 4 million use online and mobile services for their banking transactions.\nPictures are available in the download area.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}