{
    "url": "https://www.db.com/news/detail/20160426-alfred-herrhausen-society-event-us-elections-setting-the-course-for-the-united-states?language_id=1",
    "language": "DE",
    "article_type": "Event",
    "publish_date": "April 26, 2016",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "US-Elections – Setting the course for the United States?",
    "body": "Event details:\nApril 26, 2016, Berlin\n18:00 CET\n\nAfter the first primaries, America’s future is still written in the stars. Whereas Donald Trump has won the elections on the Republican side in the first states, it seems that Hillary Clinton will become the candidate for the Democratic Party.\nTogether with our American guests, we would like to discuss current trends of the election campaigns and learn more about the positions of both parties. Especially, we would like to discuss the question what impact America’s decision will have on the future of the European continent.\nYou don't like a particular policy or a particular president? Then argue for your position. Go out there and win an election. Push to change it. But don't break it. Don't break what our predecessors spent over two centuries building.\nBarack Obama, Remarks on the Budget Deal, October 2013\nGuests:\nMary Bono, former Member of the U.S. House of Representatives, Republican Party\nCarol Mosely Braun, former US-Senator, Democratic Party\nGeorg Mascolo, Director of the Joint Investigative Group from NDR, WDR and Süddeutsche Zeitung will moderate the talk\nThe audience is not only invited to take part in the debate, it will also be able to vote before, during and after the event. If you are interested in participating, please contact info.ahg@db.com for further information.\nIn his last State of the Union Address in early January, US President Barack Obama told his fellow Americans to take heart: “The United States of America,” he said, “is the most powerful nation on Earth. Period.” Globally, however, scepticism is growing about whether the United States will be able to come to grips with its problems. The current American society is deeply divided, and Europe is watching the US election campaign with concern.\nPartners\nThe event will be organized together with BMW Foundation Herbert Quandt and in cooperation with the U.S. Association of Former Members of Congress (USAFMC).",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}