{
    "url": "https://www.db.com/news/detail/20160425-economy-views-sustainability-and-financial-success?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 25, 2016",
    "tags": [
        "Research",
        "Sustainability"
    ],
    "title": "Economy Views: Sustainability and financial success",
    "body": "Watch the following video of Gunnar Friede, co-author of the study, with the main conclusions.\nPlay\nVideo\nAbout the study\nIn an extensive study, Deutsche Asset Management and the University of Hamburg investigate whether integrating environmental, social and governance (ESG) criteria into the investment process has had a positive effect on corporate financial performance (CFP), whether the effect was stable over time, how a link between ESG and CFP differs across regions and asset classes and whether any specific sub-category of E, S or G had a dominant influence on CFP.\nMethod\nThis study examines a close to complete set of academic studies on ESG-CFP that have been published since 1970 and thus delivers aggregated evidence from more than 2200 empirical studies. To the best of our knowledge, the study therefore represents the most extensive review of academic literature as it relates to ESG and CFP ever undertaken.\nConclusion\nSumming up, the authors Friede, Busch & Bassen find in this extensive review of academic literature on ESG and CFP that the business case for ESG investing is empirically well founded. ESG investing pays off financially while the ESG-CFP relation being stable over time. The study also reveals that ESG opportunities exist in many areas of the market. In particular this holds true for North America and Emerging Markets and also in non-equity classes such as bonds and real estate.\nIn the white paper ESG & Corporate Financial Performance: Mapping the global landscape, Deutsche Asset Management draws out the main conclusions from the joint study in cooperation with University of Hamburg.\nAbout the authors\nGunnar Friede\nSenior Portfolio Manager, Director, Deutsche Asset Management\nGunnar Friede is Senior Portfolio Manager at Deutsche Asset Management. He manages global multi asset funds and co-designs since many years the ESG strategy of DWS / Deutsche Asset Management within the fund management. Gunnar Friede is Certified European Financial Analyst (CEFA) and Certified International Investment Analyst (CIIA). He currently researches in collaboration with the University of Hamburg on ESG and financial performance.\ngunnar.friede@db.com\nMichael Lewis\nHead of Sustainable Finance Research, Managing Director, Deutsche Asset Management\nMichael Lewis is Head of Sustainable Finance Research at Deutsche Asset Management. Prior to his current role, Michael was Global Head of Commodities Research in the Corporate Banking & Securities division. In 2013, the Commodities Research team was ranked #2 in the EMEA Institutional Investor Equity & Fixed Income Research team survey. Michael began his career as a research analyst covering Global Macro & Rates research at Morgan Grenfell.\nmichael.lewis@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}