{
    "url": "https://www.db.com/news/detail/20160824-utility-settlement-coin-concept-on-blockchain-gathers-pace?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "August 24, 2016",
    "tags": [
        "Capital markets",
        "Company",
        "Corporate products",
        "Digitalisation",
        "Investment Banking"
    ],
    "title": "Utility Settlement Coin concept on blockchain gathers pace",
    "body": "USC is a digital cash model aimed at facilitating payment and settlement for institutional financial markets. The group will collectively build on the successful outcome of initial explorations of the Utility Settlement Coin (USC) concept, performed by UBS and Clearmatics.\nThe focus of the work will consist of financial structuring of the USC and wider market structure implications; as well as market integration points for a fully operational utility settlement coin for future use by institutions. Additionally, Clearmatics is tasked with delivering early releases of the technology platform to underpin the concept. Active dialogue with central banks and regulators will continue to ensure a regulation compliant, robust and efficient structure within which the USC can be deployed.\n\"Digital cash is a core component of a future financial market fabric based on blockchain technologies,\" said Hyder Jaffrey, Head of Strategic Investment & FinTech Innovation at UBS Investment Bank. \"There are several digital cash models being explored across the Street. The Utility Settlement Coin is focussed on facilitating a new model for digital central bank cash.\"\nThe USC concept will be developed through a series of short iterative phases and platform deployments. At each stage the aim is to increase the number of market participants, broadening engagement, connectivity and network effect.\nCash is a leg to almost every trade, so this project is key to unlocking the benefits that the industry can gain from distributed automation technology in clearing, settlement and collateral management.\nRobert Sams, Founder and CEO of Clearmatics Technologies LTD.\n“We believe digital cash will be integral to next generation market infrastructure and will deliver significant benefits to our clients.\" said Michael McFadgen, Managing Director, Euclid Opportunities.\n\"As today's settlement and clearing is a process involving many institutions, it's vital that we collaborate with our peers to develop viable alternatives to current models, creating new digital capabilities for the financial services industry.\", added Paul Maley, Managing Director, Institutional Client Group, Deutsche Bank.\n\"Recent discussion of digital currencies by central banks and regulators has confirmed their potential significance. The USC is an essential step towards a future financial market on distributed ledger technologies,\" commented Julio Faura, Head of R&D at Santander.\n“The USC initiative provides an exciting opportunity to work closely with other industry thought leaders and the regulatory community to explore the possibilities of this technology.” said Saket Sharma, Head of Treasury Services Technology at BNY Mellon.\nAbout Utility Settlement Coin (USC) concept\nUSC is an asset-backed digital cash instrument implemented on distributed ledger technology for use within global institutional financial markets. USC is a series of cash assets, with a version for each of the major currencies (USD, EUR, GBP, CHF, etc.) and USC is convertible at parity with a bank deposit in the corresponding currency. USC is fully backed by cash assets held at a central bank. Spending a USC will be spending its paired real-world currency.\nUBS and Clearmatics launched the concept in September 2015 to validate the potential benefits of USC for capital efficiency, settlement and systemic risk reduction in global financial markets. The project was initially incubated as part of the UBS Crypto 2.0 Pathfinder Program, UBS's initiative for research and experimentation on blockchain.\nThe successful conclusion of this first phase paved the way for the introduction of additional partners: BNY Mellon, Deutsche Bank, ICAP and Santander now join UBS and Clearmatics.\nAbout BNY Mellon\nBNY Mellon is a global investments company dedicated to helping its clients manage and service their financial assets throughout the investment lifecycle. Whether providing financial services for institutions, corporations or individual investors, BNY Mellon delivers informed investment management and investment services in 35 countries and more than 100 markets.\nAs of June 30, 2016, BNY Mellon had $29.5 trillion in assets under custody and/or administration, and $1.7 trillion in assets under management. BNY Mellon can act as a single point of contact for clients looking to create, trade, hold, manage, service, distribute or restructure investments. BNY Mellon is the corporate brand of The Bank of New York Mellon Corporation (NYSE: BK).\nAdditional information is available on www.bnymellon.com. Follow us on Twitter @BNYMellon or visit our newsroom at www.bnymellon.com/newsroom for the latest company news.\nAbout Clearmatics\nClearmatics is developing the next-generation enterprise technologies for distributed business process design, which enables new business models. Our distributed automation technology connects industry participants who share processes between them, while addressing a broad range of challenges faced by existing infrastructures such as security and resilience, transparency, audit and data reconciliation. In financial OTC markets, an application of the Clearmatics approach is the Decentralized Clearing Network (DCN), a suite of solutions developed by Clearmatics that combines domain expertise with engineering to build tomorrow's OTC market structure with industry partners.\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nAbout ICAP\nICAP is a leading markets operator and provider of post trade risk mitigation and information services. The Group matches buyers and sellers in the wholesale markets in interest rates, credit, commodities, FX, emerging markets and equity derivatives through voice and electronic networks. Through its post trade risk mitigation and information services ICAP helps customers manage and mitigate risks in their portfolios. For more information go to http://www.icap.com/.\nThrough Euclid Opportunities, ICAP's early-stage fintech investment business, ICAP supports innovative financial technology firms in the areas of post trade risk management, data and financial market applications. Euclid Opportunities forms part of the post trade division of ICAP, which also comprises TriOptima, Traiana, RESET and ICAP Information Services. Portfolio companies include Duco, AcadiaSoft, Enso Financial, OpenGamma and Abide Financial.\nAbout Santander\nBanco Santander (SAN SM, STD US, BNC LN) is a leading retail and commercial bank, based in Spain, with a meaningful market share in 10 core countries in Europe and the Americas. Santander is the largest bank in the euro zone by market capitalization and among the top banks on a global basis. Founded in 1857, Santander had EUR 1.52 trillion in managed funds, 12,500 branches and 190,000 employees at the close of June 2016. In the first half of 2016, Santander made underlying profit of EUR 3,280 million.\nAbout UBS\nUBS provides financial advice and solutions to wealthy, institutional and corporate clients worldwide, as well as private clients in Switzerland. The operational structure of the Group is comprised of our Corporate Center and five business divisions: Wealth Management, Wealth Management Americas, Personal & Corporate Banking, Asset Management and the Investment Bank.\nUBS's strategy builds on the strengths of all of its businesses and focuses its efforts on areas in which it excels, while seeking to capitalize on the compelling growth prospects in the businesses and regions in which it operates, in order to generate attractive and sustainable returns for its shareholders. All of its businesses are capital-efficient and benefit from a strong competitive position in their targeted markets.\nMedia Enquiries\nBNY Mellon\nRachel Moody – +1-412-234-3667 – Rachel.moody@bnymellon.com\nClearmatics\nRonan Lynch – +44-203-642 1760 – rl@clearmatics.com\nDeutsche Bank\nFrank Hartmann – +49 69 910 42744 – frank.hartmann@db.com\nICAP\nBryony Scragg – +44-207-7818 96 89 – bryony.scragg@icap.com\nSantander\nStephanie Lee – +44 7710 057648 – stephanie.lee@santander.co.uk\nUBS Group AG\nHuw Williams – +44-207-568 99 80– huw.williams@ubs.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}