{
    "url": "https://www.db.com/news/detail/20160824-deutsche-bank-and-chio-aachen-extend-partnership?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "August 24, 2016",
    "tags": [
        "Company",
        "Corporate Citizenship",
        "Sports"
    ],
    "title": "Deutsche Bank and CHIO Aachen extend partnership",
    "body": "Deutsche Bank and CHIO Aachen have reaffirmed their partnership. The World Equestrian Festival and the main sponsor have extended their agreement by an additional three years. Deutsche Bank has been supporting the world’s premier equestrian event since 1955, making it the bank’s longest-standing commitment to the world of sport.\nThorsten Strauß, Deutsche Bank’s Global Head of Art, Culture & Sport, said: “CHIO Aachen has evolved into an important platform for the bank for encounters with clients and business partners. The continuation of our sponsorship also comes at the right point in time because we are currently making an even greater commitment to nurturing aspiring young riders through our Deutsche Bank Equestrian Sport Academy, which was initiated this year.”\nMichael Mronz, General Manager of Aachener Reitturnier GmbH, said: “The fact that this successful partnership of trust between Deutsche Bank and CHIO Aachen is being extended is also the result of its constant further development.”\nDeutsche Bank is particularly committed to world-class dressage. It is the partner of the Dressage Grand Prix at CHIO Aachen. Built in 1999, Aachen’s Deutsche Bank Stadium, the world’s most famous dressage stadium, is a visible sign of this partnership.\nThrough its Deutsche Bank Equestrian Sport Academy initiative, the bank has been supporting ten young exceptional dressage talents every year since 2016. Its talent promotion efforts include financial support for individual training measures and travel to tournaments. Academy members also get access to high-profile international tournaments plus individual coaching by bank tutors, who also help foster riders’ dual career.\n\nFor further information, please contact:\nDeutsche Bank\nPress & Media Relations\nKlaus Winker\nPhone: +49 69 910 32249\nE-mail: klaus.winker@db.com\nCHIO Aachen\nNiels Knippertz\nPhone: +49 241 9171180\nE-mail: niels.knippertz@chioaachen.de",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}