{
    "url": "https://www.db.com/news/detail/20160817-deutsche-bank-appoints-anke-sahlen-and-daniel-kalczynski-as-co-heads-of-wealth-management-in-germany?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "August 17, 2016",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank appoints Anke Sahlén and Daniel Kalczynski as Co-Heads of Wealth Management in Germany",
    "body": "Anke Sahlén (48) and Daniel Kalczynski (48) will jointly manage Deutsche Bank Wealth Management (WM) in Germany, effective immediately. As Co-Heads they will pursue the goals of developing WM into the leading trusted expert advisor to wealthy clients and advancing Deutsche Bank’s market leadership in its home market.\nSahlén and Kalczynski have both spent many years at Deutsche Bank and in its Wealth Management. “The appointment of Anke and Daniel demonstrates continuity and stability – values to which wealthy clients attach great importance,” said Fabrizio Campelli, Global Head of Wealth Management. “I am pleased to appoint two recognised wealth management experts whose expertise and abilities complement one another.”\nSahlén and Kalczynski will also be responsible for Sal. Oppenheim and Deutsche Oppenheim Family Office AG and intensify cooperation with their colleagues in Deutsche Bank’s Private, Wealth & Corporate Clients division to ensure that wealthy clients have access to the best products and services within the bank.\nKalczynski joined Deutsche Bank in 1990. He has been managing WM Germany on an interim basis since April, in addition to his responsibility as Chief Operating Officer (COO) of WM Germany and prior to that of Asset & Wealth Management (AWM) Germany. His previous roles included Head of Sales Management and the Southern Region for WM Germany.\nSahlén started her career with Deutsche Bank in 1993 and has focused on advising wealthy clients both nationally and internationally ever since. She currently leads the WM team in Germany’s Eastern Region and is a member of the Management Board for that region.\nDeutsche Bank Wealth Management\nWith EUR 361 billion of assets under management globally (as of June 30, 2016), Deutsche Bank Wealth Management¹ is one of the world’s leading global wealth managers.\nDeutsche Bank Wealth Management offers high net worth clients a broad range of traditional and alternative investment solutions, providing a holistic service for all aspects of Wealth Management.\n¹ Deutsche Bank Wealth Management is the brand name of the Wealth Management business unit of Deutsche Bank Group. The respective legal entities offering products or services under the Deutsche Bank Wealth Management brand are specified in the respective contracts, sales materials and other product information documents.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}