{
    "url": "https://www.db.com/news/detail/20160808-christopher-street-day-deutsche-bank-commemorates-victims-of-homophobic-violence?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "August 8, 2016",
    "tags": [
        "Careers",
        "Company",
        "Corporate Citizenship",
        "Diversity"
    ],
    "title": "Christopher Street Day: Deutsche Bank commemorates victims of homophobic violence",
    "body": "Deutsche Bank's dbPride networks have promoted the rights of lesbian, gay, bi-sexual, transgender, and intersexual (LGBTI) individuals at a number of Christopher Street Day (CSD) events across the globe in June and July.\nIn the US and Germany, the Bank nailed its colours to the mast, raising the symbolic rainbow flag at its offices in New York, Cary, Jacksonville, Cologne and Berlin. In addition, many Deutsche Bank employees represented the bank in Pride Parades in Dublin (25 June), New York (26 June), Cologne (3 July) and Berlin (23 July).\nThis year, for the first time, the Bank's CSD slogan, “it takes many colours to make a rainbow”, was displayed on banking terminals and ATMs across Germany. At the CSD event in Cologne, employees, clients and their families also supported the “rubicon e.V.” charity, raising EUR 4,000 in donations which will be used to aid children, adolescents and families in the local area. Moreover, the Bank sponsored “Berliner Aids-Hilfe e.V.” through a funding drive that raised EUR 5,000 for people suffering from AIDS.\nThe Pride Parades commemorate the events of June 28, 1969, when a police raid on the \"Stonewall Inn\" on Christopher Street, New York, led to a LGBTI uprising. Pride Parades across the globe this year showed solidarity with the victims of the homophobic and transphobic violence that occurred in Orlando, Florida and elsewhere.\nOn June 14, Bill Woodley, Deputy CEO, Deutsche Bank Americas, and CEO DB USA Corp., called for employees to walk to the memorial fountain on Wall Street, New York, in solidarity with the victims of the Orlando attacks. Hundreds responded and gathered by the Deutsche Bank memorial fountain, donated to New York City by the Bank in commemoration of the victims of the September 11 attacks in 2001.\nThrough its active participation in CSD, the Bank underpins its commitment to creating an inclusive work environment that respects and embraces the diversity of employees, clients and communities alike. To ensure the long-term success of diverse teams, it is crucial that people from all cultures, countries, genders, sexual orientations, abilities, backgrounds and experiences can thrive. “Diversity is our strength – showing appreciation for others and collaborating without prejudice are key elements of Deutsche Bank's corporate culture,” said Gernot Sendowski, Head of Diversity & Inclusion Germany.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}