{
    "url": "https://www.db.com/news/detail/20170117-message-from-john-cryan-on-the-final-settlement-with-the-doj?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 17, 2017",
    "tags": [
        "Company"
    ],
    "title": "Message from John Cryan on the final settlement with the DoJ",
    "body": "Dear Colleagues,\nI hope you were able to make a good start to the new year. 2016 remained an intense year right up until almost Christmas Eve when we agreed a settlement in principle with the U.S. Department of Justice (DoJ). The settlement in principle concerned the bank’s issuance and underwriting of residential mortgage-backed securities (RMBS) and related securitization activities from before the 2008 financial crisis. This week the DoJ and we were able to commit the details to paper.\nAlthough it is good that we can bring this matter to a close, the price we are paying is high. The DoJ is highly critical of these transactions. The conduct they cite, which occurred from 2005 to 2007, falls short of our standards and is unacceptable. We apologize unreservedly for it. We have subsequently exited many of the underlying activities and comprehensively improved our standards.\nThe settlement with the DoJ is also a financial burden for us. As announced in December, Deutsche Bank agreed to pay a civil monetary penalty of 3.1 billion dollars and to provide 4.1 billion dollars in consumer relief in the United States, to be delivered over a period of five years. For the fourth quarter of 2016 we expect the civil monetary penalty to have a negative impact on our pretax result of nearly 1.2 billion dollars.\nDespite this financial impact, we are pleased to have resolved this matter. We had to invest a vast amount of time and energy in these negotiations, and the resolution of this matter creates a lot more certainty.\nGiven other lawsuits, it is still too early to talk of having drawn a line under all matters. We are, however, nearing our objective of being able to concentrate primarily on the future instead of repeatedly having to look over our shoulders at past events.\nTogether, we have proven our resilience during the past year – thanks to your dedication and untiring efforts, even when the going was tough. We all know that we still have some way to go. We will continue to work on our performance and will have to keep making difficult decisions but can do so with much more confidence.\nWith best wishes,\nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}