{
    "url": "https://www.db.com/news/detail/20170105-deutsche-asset-management-names-david-bianco-as-chief-investment-strategist-for-the-americas-and-head-of-equities-in-the-us?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "January 5, 2017",
    "tags": [
        "Company",
        "Investment Banking"
    ],
    "title": "Deutsche Asset Management names David Bianco as Chief Investment Strategist for the Americas and Head of Equities in the US",
    "body": "Deutsche Asset Management (Deutsche AM) today announced that David Bianco has been named Chief Investment Strategist for the Americas and Head of Equities in the US. Based in New York, he will report globally to Stefan Kreuzkamp, Chief Investment Officer and Head of Active Asset Management, and regionally to Bob Kendall, Head of Deutsche Asset Management, Americas.\nIn his dual roles, Bianco will play an integral part in assisting clients with portfolio construction across Deutsche AM’s full range of investment vehicles and asset classes, and will also lead a team of experienced investors responsible for the management of the active equity assets in the Americas.\n“We are extremely pleased to welcome David to our organization,” said Bob Kendall, Head of Deutsche Asset Management in the Americas. “David is a well-respected and familiar face within our industry and will be a key public figure for us in presenting to our clients Deutsche Asset Management’s global views on markets, economies and policies.”\nBianco has more than 20 years of investment research experience and a decade of experience as an equity strategist. He has been the bank’s US Equity Strategist since 2012. Prior to joining Deutsche Bank, Bianco held the position of Head US Equity Strategist for Bank of America Merrill Lynch Investment Research and Global Wealth Management. Before BofA, he spent seven years at UBS and five years at Financial Account Standards Board’s Financial Accounting Standards Advisory Council.\nDeutsche Asset Management\nWith EUR 715 billion of assets under management (as of September 30, 2016), Deutsche Asset Management¹ is one of the world’s leading investment management organizations. Deutsche Asset Management offers individuals and institutions traditional and alternative investments across all major asset classes.\n© Deutsche Asset Management. All rights reserved.\n¹ Deutsche Asset Management represents the asset management activities conducted by Deutsche Bank AG or any of its subsidiaries.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}