{
    "url": "https://www.db.com/news/detail/20170105-message-from-sylvie-matherat-philippe-vollot-appointed-global-head-of-anti-financial-crime?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 5, 2017",
    "tags": [
        "Company",
        "Personnel announcements"
    ],
    "title": "Message from Sylvie Matherat: Philippe Vollot appointed Global Head of Anti-Financial Crime",
    "body": "Dear Colleagues,\nI am pleased to announce that the Management Board has appointed Philippe Vollot as Global Head of Anti-Financial Crime (AFC) and Group Money Laundering Reporting Officer (MLRO).\nPhilippe has been with Deutsche Bank for more than 13 years and was most recently the Global Chief Operating Officer for Regulation, Compliance and AFC. He joined the Chief Regulatory Office as Global Head of Regulatory Relationship after his assignment as Regional COO for Middle East and Africa. He has held various positions in the Compliance, AML, Legal and Regional Management fields, in particular as Head of European Compliance at Deutsche Bank and Barclays Capital. Besides his positions in the private sector, Philippe also worked for the French Financial Markets Authority.\nIn his new role Philippe will report to me and continue to be a member of my Executive Committee. He will be based in Frankfurt.\nFollowing the end of his contract, I would like to thank Peter Hazlewood for his service. We are currently in discussions with Peter regarding an advisory role.\nDeutsche Bank will continue to strengthen its controls in order to ensure that the profits of today are sustainable and do not contribute to the provisions of tomorrow. We have increased the headcount in AFC by almost 30 percent in 2016 to 770 colleagues and will see a further rise of approximately 50 percent to more than 1,150 colleagues in the course of 2017.\nPlease join me in wishing Philippe all the best in his new role.\nKind regards,\nSylvie Matherat\nChief Regulatory Officer and Member of the Management Board",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}