{
    "url": "https://www.db.com/news/detail/20150826-deutsche-bank-hires-kinner-lakhani?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "August 26, 2015",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank hires Kinner Lakhani",
    "body": "Deutsche Bank today announced that Kinner Lakhani will join as co-Head of pan-European Banks Research alongside Matt Spick. As co-Head, Lakhani will oversee all of Deutsche Bank’s pan-European Financial Research team focusing on banking as well as financial and strategic issues. He will join Deutsche Bank in November 2015 and report to Paul Reynolds, Head of Equity Research EMEA at Deutsche Bank.\nLakhani was most recently co-Head of Citigroup’s European Banks Research team which was ranked second in both the 2015 Institutional Investor and Extel surveys. He previously worked at ABN AMRO and Morgan Stanley as a banking analyst. He joins recent hires Sebastian Radeler, who joined as Head of European Equity Strategy from Morgan Stanley and Gael de Bray who will join Deutsche Bank in December 2015 as Head of European Capital Goods Research from SocGen.\nDavid Folkerts-Landau said: “We are very pleased to welcome Kinner to Deutsche Bank’s research team. This reaffirms our strategy to invest in top quality research analysts in order to offer our international clients an exclusive advisory service based on fundamental research ideas and strong partnerships.”\n“Kinner has an excellent track record in the research industry,” said Garth Ritchie, Global Head of Equities at Deutsche Bank. “His significant experience and sector insights will complement the extensive resources we have dedicated to our Banks franchise across Sales, Trading and Capital Markets activities.”\nLakhani graduated with a Bachelor of Science degree from the London School of Economics and Political Science.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 0
}