{
    "url": "https://www.db.com/news/detail/20161027-deutsche-bank-reports-third-quarter-2016-pre-tax-profit-of-eur-619-million-and-net-income-of-eur-278-million?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 27, 2016",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank reports third quarter 2016 pre-tax profit of EUR 619 million and net income of EUR 278 million",
    "body": "John Cryan, Chief Executive Officer, said: “The results for the quarter demonstrate well the strengths of our operating businesses and the outstanding work of our people. We continued to make good progress on restructuring the bank. However, in the past several weeks these positive developments were overshadowed by the attention around our negotiations concerning the Residential Mortgage Backed Securities matter in the United States. This had an unsettling effect. The bank is working hard on achieving a resolution of this issue as soon as possible.” \nRevenues slightly up\no EUR 7.5 billion vs. EUR 7.3 billion in 3Q2015, despite a tough interest rate environment\nNoninterest expenses lower\no EUR 6.5 billion vs. EUR 13.2 billion in 3Q2015, which included significant impairments and litigation charges\no Adjusted costs of EUR 5.9 billion, down approximately EUR 350 million year-on-year\nOperating strength\no Pre-tax profit of EUR 619 million in 3Q2016, achieved despite cost burden of restructuring and severance, litigation, impairments and de-risking of Non-Core Operations Unit (NCOU) of EUR 1.0 billion\no Pre-tax profit of EUR 1.6 billion in 9M2016, achieved despite cost burden of restructuring and severance, litigation, impairments and de-risking of NCOU of EUR 3.0 billion\nImproved capital ratios due to progress in de-risking\no CRR/CRD4 fully loaded CET1 ratio of 11.1% vs. 10.8% in 2Q2016, before expected gain of ~40-50 basis points from disposal of the stake in Hua Xia Bank\no On a phase-in basis CRR/CRD4 CET1 ratio of 12.6% vs. 12.2% in 2Q2016\no Risk Weighted Assets down EUR 18 billion to EUR 385 billion, primarily reflecting de-risking of NCOU\nRestructuring on track\no Workers’ Council negotiations in Germany concluded\no Sale of Private Client Services in the U.S. completed\no Agreement on disposal of Abbey Life\nCore business successes\no Corporate & Investment Banking: Regaining strength with leadership in Corporate Finance in Germany and a top 5 position in global IPOs\no Global Markets: revenues up 10% vs. 3Q2015 driven by solid performance in Debt Sales & Trading\no Private, Wealth & Commercial Clients: credit product revenues up 5% year-on-year\no Deutsche Asset Management: profit growth year to date with a pre-tax profit of EUR 549 million in 9M2016, up 7% year-on-year\nProgress on digitalization and technology\no Digital Factory in Frankfurt and Data Lab in Dublin opened during the quarter\no Migration into the private cloud successfully started which made the reduction from 45 to 41 operating systems possible year-to-date\n\nPDF\nComplete press release Q3 2016",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}