{
    "url": "https://www.db.com/news/detail/20161025-deutsche-asset-management-expands-currency-hedged-international-fixed-income-etfs-suite?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 25, 2016",
    "tags": [
        "Asset Management",
        "Corporate products"
    ],
    "title": "Deutsche Asset Management expands currency-hedged international fixed income ETFs suite",
    "body": "Deutsche X-trackers lowers fees for two existing bond funds: HYIH and EMIH\nDeutsche Asset Management (Deutsche AM) today announced the launch of two fixed income exchange traded funds (ETFs). Deutsche X-trackers Barclays International Treasury Bond Hedged ETF (Ticker: IGVT) and Deutsche X-trackers Barclays International Corporate Bond Hedged ETF (Ticker: IFIX) will provide investors access to a broad variety of international fixed income exposures without the often high individual bond investment minimums and with the liquidity offered by an exchange-traded product.\n“During times of sharp market movements, investors are looking for stable sources of revenue. Through the new Deutsche X-trackers currency-hedged international bonds funds, we are offering investors an opportunity to potentially reduce volatility and drawdown risks while strengthening returns,” said Fiona Bassett, Head of Passive Asset Management in the Americas.\nIn our view, the currency hedging aspect of IGVT and IFIX allows investors an opportunity to preserve the reliable sources of income, stable and consistent cash flow typically associated with bond investments, decreasing the risk brought on by currency exposure.\nFiona Bassett\nIn addition, effective today, Deutsche X-trackers is also reducing management fees on two other funds in their fixed income line-up. The new fee for Deutsche X-trackers High Yield Corporate Bond – Interest Rate Hedged ETF (Ticker: HYIH) is 35 basis points, or 0.35%, and the new fee for Deutsche X-trackers Emerging Markets Bond – Interest Rate Hedged ETF (Ticker: EMIH) is 45 basis points, or 0.45%.\n“If US interest rates rise, international fixed income may help investors diversify away from concentrated US-rate exposure. Our new suite gives investors access to a variety of bonds on a currency hedged basis within the international space covering the Treasury and investment-grade corporate bond segments of the fixed income market,” Bassett said. “We are committed to providing relevant, innovative and cost-effective solutions to our clients for their international investing needs.”\nThe Deutsche X-trackers Barclays International Treasury Bond Hedged ETF seeks investment results that correspond generally to the performance, before fees and expenses, of the Barclays Global Aggregate Treasury Ex USD Issuer Diversified Bond Index (USD Hedged). The Deutsche X-trackers Barclays International Corporate Bond Hedged ETF seeks investment results that correspond generally to the performance, before fees and expenses, of the Barclays Global Aggregate Corporate Ex USD Bond Index (USD Hedged).\nDeutsche Asset Management\nWith EUR 719 billion of assets under management (as of June 30, 2016), Deutsche Asset Management¹ is one of the world’s leading investment management organizations. Deutsche Asset Management offers individuals and institutions traditional and alternative investments across all major asset classes.\n¹ Deutsche Asset Management is the brand name of the Asset Management division of the Deutsche Bank Group. The respective legal entities offering products or services under the Deutsche Asset Management brand are specified in the respective contracts, sales materials and other product information documents.\nConsider the Fund’s investment objectives, risk factors, and charges and expenses before investing. This and other important information can be found in the Fund’s prospectus, which may be obtained by calling 1-855-DBX-ETFS (1-855-329-3837) or by viewing or downloading a prospectus at www.deutsche-etfs.com. Please read it carefully before investing.\nRISKS:\nInvesting involves risk, including the possible loss of principal. Bond investments are subject to interest rate, credit, liquidity and market risks to varying degrees. When interest rates rise, bond prices generally fall. Foreign investing involves greater and different risks than investing in U.S. companies, including currency fluctuations, less liquidity, less developed or less efficient trading markets, lack of comprehensive company information, political instability and differing auditing and legal standards.\nEmerging markets tend to be more volatile and less liquid than the markets of more mature economies, and generally have less diverse and less mature economic structures and less stable political systems than those of developed countries. Funds investing in a single industry, or group of industries, country or in a limited geographic region generally are more volatile than more diversified funds.\nCredit risk refers to the ability of an issuer to make timely payments of principal and interest. Investing in derivatives entails special risks relating to liquidity, leverage and credit that may reduce returns and/or increase volatility. A Fund’s use of forward currency contracts may not be successful in hedging currency exchange rates changes and could eliminate some or all of the benefit of an increase in the value of a foreign currency versus the U.S. dollar.\nPerformance of the Fund may diverge from that of the Underlying Index due to operating expenses, transaction costs, cash flows, use of sampling strategies or operational inefficiencies. An investment in this Fund should be considered only as a supplement to a complete investment program for those investors willing to accept the risks associated with the Fund. See the prospectus for details.\nNo bank guarantee | Not FDIC insured | May lose value\nDBX Advisors LLC is the investment adviser to the Deutsche X-trackers Funds. Deutsche X-trackers Funds are distributed by ALPS Distributors, Inc. ALPS Distributors, Inc. is not affiliated with DBX Advisors or Barclays.\nDBX002334 10/18/17\n© Deutsche Asset Management. All rights reserved.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}