{
    "url": "https://www.db.com/news/detail/20161017-green-climate-fund-approves-deutsche-bank-proposal-for-sustainable-energy-for-africa?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 17, 2016",
    "tags": [
        "Africa",
        "Company",
        "Sustainability"
    ],
    "title": "Green Climate Fund approves Deutsche Bank proposal for sustainable energy for Africa",
    "body": "Deutsche Bank welcomes the Green Climate Fund’s (GCF) decision to make an initial 78.4 million US dollars investment in Deutsche Asset Management’s fund for renewable energy access in Africa. Deutsche Bank further appreciates GCF’s support to improve the capacity of project developers and financial institutions in Africa that will be engaged in its investment activities.\n“As the first commercial bank accredited by the Green Climate Fund, we are very pleased that the GCF Board has decided to become the anchor investor in our proposed Universal Green Energy Access Program (UGEAP) fund for Africa”, said Nicolas Moreau, Head of Deutsche Asset Management and member of the Management Board of Deutsche Bank AG. “This investment will allow Deutsche Asset Management to support up to USD3.5bn of investment from local banks and entrepreneurs over the next 15 years and, ultimately, support the provision of clean electrical energy to individuals and businesses”.\nThe GCF’s anchor investment of 78.4 million US dollars shall allow Sustainable Investments, the group within Deutsche AM that manages environmental and social assets, to raise a total of 300 million US dollars in capital. This amount will be invested in the first phase in Benin, Kenya, Namibia, Nigeria and Tanzania. The UGEAP has received the support by respective local governments. In phase two, the fund will be rolled out to other Sub-Saharan countries and targets to reach 500 million US dollars.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}