{
    "url": "https://www.db.com/news/detail/20161012-in-the-latest-issue-of-konzept-deutsche-bank-research-takes-a-look-at-america-s-fiscal-consensus?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 12, 2016",
    "tags": [
        "Investment Banking",
        "Research"
    ],
    "title": "America's fiscal consensus",
    "body": "What is the one thing Donald Trump, Hillary Clinton, Janet Yellen and Larry Summers all agree on? That America needs a massive new fiscal spending programme to fix the country’s infrastructure and revive economic growth. Indeed there is such consensus on the need to invest in America’s roads and bridges the case seems closed. Just to be sure, however, we devote issue #09 of Konzept to analysing the arguments behind this widely held view. They are less than convincing.\nPerhaps one reason why infrastructure spending is universally acknowledged as the solution is a lack of consensus over what it is supposed to fix. Nor is it even clear there is a shortfall in public and private investment by historical standards when the figures are appraised properly.\nMeanwhile, current macroeconomic conditions likely mean the growth benefits from a government stimulus would be marginal. Finally, the way infrastructure spending is delivered in the US remains messy and archaic. This needs to be addressed before launching a large spending programme.\nStaying in America, we also give the capital stock of S&P 500 companies a health-check and find it to be fighting fit. And with policymakers and markets both fixated by the twin trends of a strengthening dollar and anaemic labour productivity growth, we explore how over time the first helps alleviate the second. We also offer some practical solutions for the vexing issue of reforming America’s corporate tax regime.\nBeyond the US, I write about the role that ECB policies have played in the stalling of structural reforms in Europe.\nAnother article documents the progress that has been made to improve gender diversity across businesses and how newly available data is helping this cause. We also investigate how the recent behaviour of bonds and equities makes it seem like they are impersonating each other, and investors can read about improving their ability to decipher the signals from derivative markets. The rapidly-growing Chinese movie industry is the subject of another fascinating piece.\nFinally, the usual array of columns in the magazine’s rear pages takes us back to the US election again. There is a refresher from the 2008 election in the book review. And our infographic looks for correlation between infrastructure spending and per capita growth in US states – only to find none.\nDavid Folkerts-Landau\nGroup Chief Economist and Global Head of Research\nTo send feedback you can write to the team at research.haus@db.com.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}