{
    "url": "https://www.db.com/news/detail/20190619-world-refugee-day-how-deutsche-bank-supports-the-integration-of-refugees?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 19, 2019",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "How Deutsche Bank supports the integration of refugees",
    "body": "On World Refugee Day, held every year on June 20, the United Nations High Commissioner for Refugees raises awareness of the plight of refugees. According to the UNHCR, almost 69 million people around the world have been forcibly displaced from their region, more than half of them children. Of these, 20 million people are internationally registered refugees, 3.2 million are still waiting to be granted asylum.\nBeyond Turkey, Germany is one of the countries with the highest influx: 1.1 million people have been granted the right to stay as per end 2018 (+22% versus end 2017). The challenge remains to enable communities and economies to promote inclusion and to foster successful integration.\nDeutsche Bank decided to embrace this responsibility from the start, as one of the founding members of We together (Wir zusammen) – the integration initiatives of German companies. In early 2016, our CEO pledged to engage 1,000 Deutsche Bank staff members as integration coaches by the end of 2018.\nColleagues around the world accepted this challenge and pulled their weight through virtual language learning and mentoring entire families to make us surpass our target. And for the first time we partnered with Rainbow Refugees, a Frankfurt-based charity that caters to this even more marginalised community to help LGBT*IQ+ refugees find a job. Even in regions which are less acutely affected by the flow of refugees, Deutsche Bank and its foundations have supported people with immigrant backgrounds to promote and facilitate social integration and participation.\nDeutsche Bank provides...\nOur colleagues took an active role in helping the newcomers get settled in society, learn the language and find a job. They were expected to sign up for a 4-6 month period and invest 2-4 hours with their mentees. A survey among integration coaches underpins the #PositiveImpact our colleagues created:\nOn average, each of our volunteers worked with 3.4 refugees – improving the lives of 3,400 people in total.\nAbout half helped them to improve language skills and half to find employment, with about a third focused on facilitating integration into society (overlap possible).\nMore than 100 international colleagues signed-up as “remote teachers” to refugees via our online language learning offers.\nInstead of 4-6 months, our colleagues kept up their commitment for almost 13 months each – because many of the pairs became friends.\n91% of the integration coaches want the programme to continue, 89% would recommend the initiatives to others, 85% would sign up again, 63% were totally/very satisfied with the offer of our partner charities.\n\n\nEven if the initial challenge has long been met, we are set to maintain our commitment towards this community and an open and diverse society: PlusYou team challenges will continue to support charities that cater to refugees and migrants; a new eCareer tool that we offer together with our partners Volunteer Vision and Freshfields will empower refugees who are entering the job market; and the Human Resources-developed Banking Introductory Programme will go into its third round in August.\n\n\nBeyond Germany, fundraising initiatives or clothes / toy drives for refugees will stay on the agenda e.g. in Spain and Australia. And projects that foster integration and promote education of children with migrant backgrounds also remain an integral part of our Born to Be portfolio – be it together with Breaking Barriers in the UK, with Portofranco in Italy, PACES and UNRWA in MENA, as well as various partners who support migrants in the US and the APAC region.\n\n\n\n[…] Our employees and our non-profit partner organisations are committed to this cause. This is our positive impact, helping to promote diversity and openness in society.\nKarl von Rohr, President, Deutsche Bank\n“Mentoring is a lot of fun – I enjoy working and acquiring knowledge together with my mentee. It's not easy for everyone to find their place in society. Sometimes, it just takes a little help to get ahead in life. If I can be that helping hand, then I will have achieved my goal.”\nSeda Basar, Mentor, Global Transaction Banking, Deutsche Bank",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 2
}