{
    "url": "https://www.db.com/news/detail/20190617-a-first-of-its-kind-for-angola-deutsche-bank-signs-a-1-billion-euro-credit-line-to-boost-private-sector-investment?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 17, 2019",
    "tags": [
        "Corporate products"
    ],
    "title": "A first of its kind for Angola: Deutsche Bank signs a 1 billion euro credit line to boost private sector investment",
    "body": "Deutsche Bank, through the Structured Trade & Export Finance team, has arranged a 1 billion euro credit line to finance private investment projects in Angola. Arranged at the request of the Government of Angola and guaranteed by its Ministry of Finance, the credit facility will be distributed through five Angolan banks with credit decisions remaining with Deutsche Bank.\nThis new financing line will focus on agriculture, agro-industry, fishing and general industries with three objectives:\nto guarantee a greater supply of goods, services and employment for the population by supporting private projects in the relevant industries.\nto improve the country's balance of payments by supporting projects which help to reduce imports and / or promote export-related initiatives, and\nto have a positive impact on the lives of Angolans.\nTo receive financing the projects must meet these three criteria.\nThe project, which includes all Deutsche Bank regions (Asia, Europe and America), was led by the Structured Trade & Export Finance team in Madrid which has a longstanding relationship with Angola. This dates back to 2003, when Deutsche Bank signed the first credit line with the Ministry of Finance of Angola, which the Angolan government used to finance public projects in construction and civil infrastructure, the agriculture and food industry, as well as sanitation and telecommunications.\nDeutsche Bank is the first bank to arrange a private credit line of this kind in the country.\nIgnacio Ramiro, Head of Structured Trade & Export Finance for Deutsche Bank Spain, said: “With this operation we are seeking to support the private sector as a driver of positive impact on Angolan society. Deutsche Bank’s long relationship with Angola includes supporting 3 billion euros of public sector projects. Now it is time to continue this relationship and also involve private sector initiatives. Angola’s rapid transformation is creating exciting opportunities for global companies looking to partner and invest there.”\nGlobal Transaction Banking in Spain\nGlobal Transaction Banking (GTB) offers treasury management products, international trade financing and custody services to large companies, multinationals with a presence in Spain and financial institutions, as well as SMEs through collaboration with the Private & Commercial Bank division (PCB).\nGTB works with more than 6,000 SMEs with international business, while in the large corporations segment it serves more than 100 large domestic groups, Spanish multinationals and their subsidiaries outside of Spain, and 2,000 subsidiaries of foreign multinationals with business in Spain.\nDeutsche Bank was recognized by Euromoney for the third consecutive year as the best Trade Finance bank in Spain and the best provider of Cash Management services for companies and institutions in Spain, a service that includes solutions aimed to manage the treasury, payments and cash operations.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}