{
    "url": "https://www.db.com/news/detail/20190611-low-inflation-presents-challenges-for-the-economy-says-matthew-luzzetti?language_id=1",
    "language": "DE",
    "article_type": "Research",
    "publish_date": "June 11, 2019",
    "tags": [
        "Research"
    ],
    "title": "\"Low inflation presents challenges for the economy\"",
    "body": "Chief US Economist Matthew Luzzetti recently shared insights on the current global interest rate environment and the challenge that low inflation plays in efforts to support the economy when needed.\nIn the Q&A below, he talks about the misconceptions around low inflation, how the trade war is impacting short-term inflation, and what central banks are doing to reach their targets.\nLuzzetti’s thoughts on this topic are also available in a podcast. Subscribe to Podzept on iTunes & Spotify or go to the Podzept page on the Research website. \nQ1: A decade removed from the financial crisis and global bond yields remain stuck near record low levels while many central banks, excluding the Fed, continue with “emergency setting” monetary policy. What is behind these developments?\nThe peculiarity of the current global interest rate environment cannot be understated. About 10 trillion dollars of global debt is trading at negative yields, including ten-year bonds in Germany and Japan. Meanwhile, yields on US government debt, though significantly higher, are at levels so low that they have very little historical precedent prior to the past decade.\nWhile this landscape is no doubt the result of a complex chain of events, including slower trend economic growth, it is undeniable that persistently low inflation has been a critical driver. In a direct way, subdued inflation leads to lower bond yields by reducing the risk premium that investors demand for holding an asset that declines in value as inflation rises. Indirectly, low inflation is the primary cause of still unprecedented accommodation by global central banks in the form of low, and even negative, policy rates and massive purchases of assets including government bonds.\nTogether, these factors can help explain that the risk premium the US Treasury pays on a ten-year government bond is at historically low levels, and on some measures this “premium” is even negative! In other words, investors are demanding greater compensation to lend to the US government over a shorter horizon than a longer one.\nQ2: Why is low inflation such a problem? Isn’t lower inflation a positive for households’ real incomes and purchasing power?\nSlower increases in prices (i.e., low inflation) does sound like a desirable outcome. Higher wage growth coupled with lower price inflation leads to greater consumer purchasing power and higher standards of living over time.\nBut low inflation can present challenges. The most important one for the Fed is that low inflation tends to limit the ability for the Fed to use its traditional tool – reductions in short-term interest rates – to provide support for the economy when needed. The historical comparison is striking -- the Fed has cut interest rates by nearly six percentage points on average in response to past recessions. The current fed funds rate at 2.4% is significantly less than half that level.\nA result of having less capacity to ease through rate cuts is that short term interest rates are more likely to fall back close to zero and the Fed will be forced to resort to more uncertain and unconventional tools, such as large asset purchases, that have defined the post-crisis macro landscape. These unconventional tools will therefore become conventional.\nQ3: What can the Fed and other central banks do to lift inflation in line with their targets?\nRecent experience with inflation has called into question the old adage that “inflation is always and everywhere a monetary phenomenon.” While the Fed’s unprecedented monetary stimulus in the wake of the financial crisis has been successful in producing a strong labor market – the unemployment rate at 3.6% is at the lowest level since 1969 – inflation has consistently fallen short of the Fed’s 2% objective.\nThis conundrum of low inflation despite a tight labor market, which is popularly described as a flattening Phillips curve, has a variety of causes. Some of these factors are largely outside of the Fed’s control, such as legislative changes that have reduced health care inflation (20% of the core PCE index), rapid technological progress that exerts broad downward pressure on inflation particularly for goods (i.e., the “Amazonification” of inflation), and global forces that have led to a stronger dollar and lower commodity prices.\nHowever, low inflation is not completely outside of the Fed’s control. Higher inflation can be achieved through two channels: (1) setting monetary policy to allow for stronger growth and a tighter labor market, and (2) by lifting inflation expectations by convincing consumers, businesses and markets that the Fed is committed to hitting 2% inflation on a sustainable basis.\nWith regards to the latter, the Fed, which currently targets inflation over the medium term at 2%, is re-thinking its framework for conducting monetary policy. One option under consideration is a strategy where the Fed pursues above 2% inflation following a sustained period of softer inflation, as has occurred in recent years. While we are skeptical that the Fed will officially change its mandate in this way, markets are watchful because significantly higher inflation could undermine the case for near record low interest rates and the allocation of capital that has come with it.\nQ4: How do escalating trade tensions with China fit into this? Will it lead to higher inflation for US consumers, and how will the Fed react if it does?\nThe increase in tariffs that has accompanied escalating trade tensions has exerted a modest drag on US growth and a mild boost to consumer inflation. So far the trade spat with China has increased US consumer prices by a modest amount, likely only a tenth or two. However, a further escalation of tariffs to the remaining imports from China, which are more heavily skewed towards consumer goods including cell phones, would provide a much more substantial lift to core inflation, on the order of nearly half a percent.\nThe Fed should “look through” this temporary boost to US inflation and not tighten monetary policy in response. Indeed, given the current inflation shortfall from the Fed’s target and worries that inflation expectations have slipped a bit, modestly higher inflation may be a welcomed surprise to some Fed officials.\nInstead, I expect the Fed to be more concerned with the potential adverse effects from trade tensions on consumer and business confidence, financial conditions (e.g., lower equity values and wider credit spreads), and ultimately US growth. In other words, trade tensions should nudge the Fed in a dovish, rather than a hawkish, direction.\nQ5: From a longer-term perspective, are subdued inflation and low bond yields likely to be a persistent feature of the US macro and markets landscape?\nAbsent a dramatic shift in the inflation process or how monetary policy is conducted, this low inflation and bond yield environment is likely to stick. Demographic shifts, including aging populations, should continue to constrain economic growth relative to history and the various factors noted earlier should help to keep inflation pressures contained.\nA noticeable break from this expectation likely requires a revolutionary change in how the Fed views its dual mandate and conducts monetary policy. In particular, the Fed would need to convince everyone that they are willing to let the economy run hot to purposely lift expectations for future inflation.\nIt is unlikely that a central bank that has spent the last four decades building its credentials for achieving low and stable inflation will be willing to risk that hard won credibility in the near term. Indeed, Fed Chair Powell recently described the outcome of the Fed’s policy review as likely to produce “evolution rather than revolution.” We agree.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}