{
    "url": "https://www.db.com/news/detail/20190610-dbpride-rings-closing-bell-to-kick-off-world-pride-celebrations?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 10, 2019",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "dbPride rings closing bell to kick off World Pride celebrations",
    "body": "Deutsche Bank kicked off its celebration of World Pride and Stonewall 50 by ringing the closing bell at the New York Stock Exchange on Friday, June 7.\nJune marks the 50th anniversary of the Stonewall Uprising, the start of the modern LGBTQ+ rights movement, and New York City will be the first US city to host World Pride which will attract over 5 million visitors to celebrate this important anniversary.\nMatt Borstein, Global Head of Commercial Real Estate (CRE), who joined the group ringing the closing bell, noted the significance of the occasion and the impact of dbPride’s work on CRE clients.\n“It was an honor to ring the closing bell with dbPride in June,” said Borstein. “Several of our important clients have been engaged with dbPride and see our organization’s commitment to LGBTQ inclusion as a model for their own organizations.”\nDeutsche Bank has a long history of supporting the LGBTQ+ community around the world. This year, Deutsche Bank has:\nLaunched the Partnership for Global LGTBI Equality at the World Economic Forum’s Annual Meeting at Davos\nLaunched 9 Tips for LGBTQI Inclusive Business Practices on YouTube\nRemoved hotels owned by the Sultanate of Brunei in response to brutal laws targeting LGBTQ+ people and was the first company to do so\nReceived a 100% score on the Human Rights Campaign’s Corporate Equality Index\nSponsored the Channels of Influence research report launched at South by Southwest about how companies can advocate for change\nEngaged in dialogue with the Vatican on decriminalizing homosexuality\nIn continued celebration of Pride, dbPride has several events planned across the globe this month including a first-ever global summit of dbPride leaders to coincide with World Pride in New York and Pride Marches around the world.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}