{
    "url": "https://www.db.com/news/detail/20241204-charmaine-poh-named-deutsche-bank-s-artist-of-the-year-2025?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, December 4, 2024",
    "tags": [
        "Art",
        "Awards",
        "Culture"
    ],
    "title": "Charmaine Poh named Deutsche Bank’s “Artist of the Year” 2025",
    "body": "Deutsche Bank has named Charmaine Poh as its “Artist of the Year” 2025. Born in 1990, the Singaporean-Chinese artist and documentary filmmaker lives and works in Singapore and Berlin. Her cinematic and installation-based work explores themes such as identity and empowerment, the visibility and invisibility of queerness, and femininity within the Asian context. Her art is also influenced by Eastern philosophy, media critique, and the ideas of cyberfeminism. In autumn 2025, Charmaine Poh will be honored with a solo exhibition at the PalaisPopulaire in Berlin.\nThe “Artist of the Year” award recognises promising artists who have already created work that is both artistically and socially relevant. It focuses on works that align with the core elements of Deutsche Bank’s collection: paper-based art and photography.\nCharmaine Poh was nominated by Stephanie Rosenthal, Director of the Guggenheim Abu Dhabi Project, who submitted recommendations for the award to Deutsche Bank for the second time.\n“In her work, Charmaine Poh often examines intimate, self-chosen relationships that extend beyond traditional family ties,” says Rosenthal. “She is also inspired by concepts like Édouard Glissant’s notion of opacity—the right to remain opaque, ambiguous, and complex.”\nQueer lives from entirely different perspectives\nPoh studied Visual and Media Anthropology at the Free University of Berlin and began her career with experimental documentary photography. In 2024, she was featured in the main exhibition of the 60th Venice Biennale. With films such as Kin (2021) and What’s the Softest in the World Rushes and Runs Over What’s Hardest in the World (2024), as well as her installations, she works at the intersection of documentary, interviews, and visual essays. Poh creates poetic, narrative portraits that examine the construction of identity and social norms.\nA key element of Poh’s recent film work is the relationship between nature and civilisation. Her films often incorporate footage of plants, animals, and ecosystems, offering glimpses of queer lives from entirely new perspectives. Poh is particularly interested in the fundamental question of what is considered “natural”. She works with a mix of documentary and found material, staged studio shoots, performances, and artificial intelligence (AI), including avatars.\n“Charmaine Poh’s gentle, often vulnerable works stand in sharp contrast to the harsh realities faced today by minorities, the socially marginalised, and those in need of protection,” says Britta Färber, Head of Art and Culture at Deutsche Bank. “She experiments with technologies of control and formation—from AI algorithms to digital surveillance tools. This makes her work extremely relevant to our time.”",
    "number_of_ratings": 3,
    "rating": 4.7,
    "likes": 5
}