{
    "url": "https://www.db.com/news/detail/20241203-deutsche-bank-launches-merchant-solutions-in-asia-pacific-empowering-ecommerce-growth?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "December 3, 2024",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank launches merchant solutions in Asia Pacific, empowering eCommerce growth",
    "body": "Deutsche Bank has officially launched Merchant Solutions capabilities in Australia, India, Indonesia and South Korea. The solutions provide the bank’s clients with a global payment acceptance platform and access to a diverse range of local payment methods in these four markets.\nPartnership with DataMesh Group enables seamless global payment  acceptance\nThe launch follows Deutsche Bank’s strategic investment in the Australian PayTech company, DataMesh Group, announced in February 2023. Through this collaboration, Deutsche Bank leverages DataMesh’s payment orchestration layer, allowing it to work with individual payment acquirers, and enable merchants in Australia, India, Indonesia and South Korea to accept online payments within individually regulated currency zones.\nDataMesh consolidates cross-border payment data and enables Deutsche Bank’s clients to centrally manage their payments across currency borders and different jurisdictions.\nMeeting the needs of Asia Pacific's booming eCommerce Market\nOliver von Quadt, Deutsche Bank’s Head of Merchant Solutions for Asia Pacific and the United States said: “We are delighted to go live with Merchant Solutions in Asia Pacific and enable our clients to offer seamless and efficient payment services.\"\nWe see significant potential for our Merchant Solutions business in the region, which houses some of the fastest growing and most exciting eCommerce markets in the world. \nOliver von Quadt\nRachel Whelan, Head of Corporate Cash Management for Asia Pacific and the Middle East and Africa and Global Head of Payments and Transactional FX Product Management said: “Our newly launched Merchant Solutions capabilities significantly broaden our cash management offering for clients across Asia Pacific. Being able to offer a one-stop shop for our clients’ payments needs is a true differentiator for us in the market, and we look forward to growing this business in Asia in the years to come.”\nDeutsche Bank will continue to roll out Merchant Solutions capabilities across Asia over the next few years, prioritising Thailand, Vietnam, Philippines, Singapore, Malaysia and Hong Kong. The bank will focus on offering key local payment methods and helping clients to simplify connectivity to global payment acceptance platforms.\nRevenue in the eCommerce market in Asia is projected to reach USD 1.97 trillion this year, and it is expected to show an annual growth rate of 9.8%, resulting in a projected market volume of USD 3.15 trillion by 2029, according to Statista.\nFor more information, contact:                                        \nKate Fields\nPhone: +852 2203 5094\nEmail: kate.fields@db.com",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 9
}