{
    "url": "https://www.db.com/news/detail/20210927-germany-s-general-election-statement-from-david-folkerts-landau?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 27, 2021",
    "tags": [
        "Germany"
    ],
    "title": "Germany's general election: Statement from David Folkerts-Landau",
    "body": "Olaf Scholz and his centre-left Social Democrats (SPD) narrowly won Germany’s federal elections, beating the ruling conservative bloc. While the SPD secured 25.7% according to preliminary results, Armin Laschet’s union of CDU/CSU gained 24.1%, a historic low in a federal election. The Greens came in third with 14.8% of the ballot and the Liberal FDP scored 11.5%. The far-right AFD enters parliament for the second time, on 10.3%, while the leftwing Die Linke won just 4.9%.  A coalition must now be created to form a new government. Both Scholz and Laschet have insisted they will form the government.\nIn a statement, Deutsche Bank's Chief Economist David Folkerts-Landau said:\n\"The various international and economic crises during the 16 years of the Merkel government forced a rather reactive policy approach. In the coming years the consequences of US-China tensions, Brexit and the need to create a stronger EU will demand a more proactive approach from the next government. This new role, which many international observers have been demanding Germany accept for a long time, comes at a point when Germany’s economic position is threatened by adverse demographics, structural disruptions resulting from digitalisation and, most importantly, the daunting quest to reach climate neutrality during the next two decades.\nA proactive approach is all the more important as these challenges also offer great opportunities. The fact that Germany has turned challenges such as rebuilding after World War II or reunification into tremendous success stories makes me confident that this can be achieved again.\nBoth historic achievements were only possible because politicians were smart enough to let the social market economy unfold its benefits. The challenge for the new government will hence be a dual one: defining Germany’s new international role and striking the right balance between the market economy and a strong and guiding state. If we succeed, the renewed swan songs of some international observers might prove premature once again.\" ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 6
}