{
    "url": "https://www.db.com/news/detail/20210924-fitch-upgrades-deutsche-bank-s-ratings-and-maintains-a-positive-outlook?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 24, 2021",
    "tags": [
        "Company"
    ],
    "title": "Fitch upgrades Deutsche Bank’s ratings and maintains a positive outlook",
    "body": "Fitch Ratings today announced upgrades to Deutsche Bank’s ratings. The agency has raised our Long-Term Issuer Default Rating (IDR) to BBB+ from BBB, and our Viability Rating (VR) to bbb+ from bbb. Our Derivative Counterparty Rating, long-term deposit rating and senior preferred debt ratings are all raised to A- from BBB+. In addition, the agency retains its Positive Outlook on these higher ratings. The bank is now on ‘Outlook Positive’ with all three leading rating agencies.\nThis is Fitch’s first upgrade of Deutsche Bank’s benchmark IDR since the agency initiated coverage in 1988, and the first upgrade of the VR, then referred to as the Individual Rating, since 2005. It follows a similar move by Moody’s, who raised the bank’s ratings and maintained a Positive Outlook on August 4.\nSumming up the rationale for this move, Fitch pointed to successful execution of Deutsche Bank’s transformation programme: “The upgrades reflect good progress and increasingly manageable challenges arising from the restructuring initiated in 2019, which we expect to remain well on track in the second half of 2021 and 2022.”\n“This marks another milestone on our path of transformation”, said Christian Sewing, Chief Executive Officer. “This is well-deserved recognition for the efforts of our people, who are delivering a historic transformation of Deutsche Bank in challenging conditions. The right business model, a strong client franchise, conservative balance sheet management and a strong risk profile have all contributed to this result. We appreciate Fitch’s confidence that we will now complete our transformation successfully.”\nJames von Moltke, Chief Financial Officer, added: “We are very pleased that, for the second time in two months, we see a leading rating agency recognising our progress in this way. This move supports our business with clients and enables us to continue to fund our activities on favourable terms. By maintaining a Positive Outlook in addition to these upgrades, Fitch encourages us to keep up the pace of disciplined execution and complete the transformation journey.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 16
}