{
    "url": "https://www.db.com/news/detail/20210923-deutsche-bank-arranges-trio-of-inaugural-sovereign-green-bonds?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 23, 2021",
    "tags": [
        "Europe",
        "Capital markets",
        "Investment Banking",
        "Sustainability"
    ],
    "title": "Deutsche Bank arranges trio of inaugural sovereign green bonds",
    "body": "Deutsche Bank has arranged inaugural green bonds for three sovereigns in the past two weeks, demonstrating the strength of the bank’s Sovereign, Supranational and Agency (SSA) Debt and ESG Advisory platforms.\nThis week the bank priced the largest-ever green bond to date, a ten billion pound inaugural green gilt for the United Kingdom’s Debt Management Office (DMO). Anchored by its core domestic investor base, the transaction garnered a high quality orderbook in excess of 100 billion pounds, the largest green bond issuance on record.\nEarlier in September, Deutsche Bank arranged a five billion euro inaugural green bond for the Kingdom of Spain. The issue was met with strong enthusiasm from investors, with demand reaching over 60 billion euros within hours of books opening. It benefited from solid support from green investors, who received more than two thirds of the allocation.\nThe Republic of Serbia successfully placed a green seven-year one billion euro benchmark, with Deutsche Bank acting as joint bookrunner. The green tranche was placed alongside a 15-year conventional 750 million euro offering, making it the Republic’s first-ever dual-tranche transaction. Deutsche Bank has led all 12 of Serbia’s bond issuances and took the additional role of green structuring agent on this transaction.\nHenrik Johnsson, Deutsche Bank’s Co-Head of Investment Banking EMEA, said: “The investment in to our ESG Advisory team is clearly bearing fruits with a significant uptick in mandates and a growing pipeline of deals, not only from SSAs, but across the spectrum of clients, including corporates and financials as well.”\nCommenting on the bank’s momentum with SSA clients, Panos Stergiou, Head of Institutional Clients Group FIC EMEA and Head of the SSA Coverage Group at Deutsche Bank, said: “The bank’s coordinated approach has resulted in our market share for SSA debt issuance increasing by 150 basis points to 6.4 percent since last year. This is a significant achievement in what has been an intense and competitive market during the pandemic.”\nThe market has seen the equivalent of 970 billion US dollars of issuance from SSAs this year, slightly up on last year’s bumper year with 940 billion US dollars, fuelled by governments’ needs to fund COVID rescue plans. Deutsche Bank is currently third in the SSA debt origination league table, up from seventh this time last year.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 7
}