{
    "url": "https://www.db.com/news/detail/20210920-we-need-to-reinvent-ourselves-a-call-for-an-agenda-2030?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 20, 2021",
    "tags": [
        "Research",
        "Strategy"
    ],
    "title": "\"We need to reinvent ourselves: a call for an agenda 2030.\"",
    "body": "Ladies and gentlemen,\nI am aware that you all have several hours of interesting presentations and discussions behind you. I have been told how intense the debates have been. That's why I'm particularly sorry that I couldn't be here from the beginning.\nAnd I am all the more grateful to Mathias Döpfner that I can now open the evening's session. I would like to be very frank here about what I see as the issues at stake in the Bundestag election. There’s been a lot of talk about this being a key election. I would see that as an understatement.\nIt is not just that there is a lot at stake. No, it's crunch time, so to speak. We are on the cusp of a decade in which, as in the 1920s, crucial decisions will be made. The only difference is that this time, the course that we set can lead to very good results.\nThe importance of this election became clear to me last week in London. For the first time since the outbreak of the Covid pandemic, we had gathered our largest institutional clients, people who collectively manage more than 30 trillion euros in assets. The interest that investors showed in the German election and how much they knew about it surprised me.\nIt made me realise: the world is watching us right now, and it's not just investors who want to know what will become of this boy wonder in Europe, which has performed so formidably in the past decade.\nIf, on the other hand, we look at how this election is discussed in Germany, it's like being on another planet. It's all about poll numbers and supposed weaknesses of individual candidates. It's about who can still hand out which gifts and what else the state should subsidize.\nBut there’s barely any talk on how we're going to earn the money for all this. How our economy will remain competitive. What strategy we need for the next ten years. It's almost never about attack, it's almost all about defense and redistribution. About what must not happen. And about what we must no longer do.\nIt is precisely this attitude that put us in a difficult situation once before. Some of you may remember the Economist headline of June 5, 1999: \"The sick man of the euro.\"\n\"When Germany sneezes, its European neighbours feel a chill,\" it said at the time. We're not sneezing yet, but we're not quite healthy either.\nSome will now say that this picture is far too gloomy.\nDidn't we come through the covid crisis quite well? Doesn't Germany have perhaps the best-performing economy of all the euro countries? Aren't our public finances among the most solid anywhere?\nThe answer is yes. And it still gives us a window for action. I am not a doomsayer, and I am convinced that we have everything we need to continue to be the engine of Europe.\nBut I'm also convinced: Germany is at the end of a golden era - and at the beginning of a major upheaval. And that's independent of covid. This is not just about our economy urgently needing to become more digital and sustainable. It's about the fact that we need to reinvent ourselves as a whole. And we need to recharge ourselves.\nWhat do I mean by that?\nWell, the \"sick man of the euro\" has undoubtedly been nurtured back to healthby the Agenda 2010 reforms on the one hand. And on the other hand, it was also helped by an environment that was tailor-made for an export nation - after all, China's boom was linked to a boom in global trade. At the same time, wage restraint and exchange rate stability thanks to the euro led to record export surpluses.\nBut now we should admit it: this boom is coming to an end.\nAnd I'm not just thinking about the consequences of the pandemic, temporary frictions in supply chains and the phenomenon of glocalisation. I'm also thinking of China producing more and more technology itself and importing more and more selectively.\nAnd I’m thinking of the United States suddenly becoming much more protectionist, even under a Democratic president. \"America first\" still applies, as the abrupt withdrawal from Afghanistan shows.\nFor Germany and Europe, this means that we need to change - and do so quickly. Because otherwise we will lose touch. We must finally create the conditions that will enable us to fully exploit our potential.\nTo do this, we need to set a course similar to the one we set almost 20 years ago. We need an Agenda 2030 - for Germany and Europe.\nWhat does this agenda need to look like? Don't worry, I won't bother you with a detailed reform programme this evening. I would just like to present five cornerstones:\nFirst, we need to invest - and invest properly. We will need billions for digitalisation and to become sustainable - and it will have to be private-sector billions.\nThere is no shortage of money here: after all, we Germans have been generating a gigantic current account surplus for decades, of which we are very proud.\nThe problem is that we invest this national wealth suboptimally. Did you know that since 1975, the average annual return on German assets invested abroad has been three percentage points lower than our investments in our own country?\nTo give you an idea of the dimensions: the net assets of Germans abroad amounted to 1.9 trillion euros at the end of 2020. If the average annual return on this is three percentage points lower than on investments at home, then we are leaving more than 50 billion euros on the table every year - and at the same time complaining about an investment gap in our country.\nWe are hurting ourselves twice over. It does not have to be this way. We can change it - by doing everything we can to promote investment in Germany and Europe.\nTo do this, we need a three-pronged approach:\nWe need to become more attractive again as an investment location overall. Less bureaucracy and simpler legislation are two key words here.\n We must avoid imposing even higher taxes on companies and private individuals, which would slow down investment.\nAnd we need an attractive European capital market to be able to allocate investments properly.\nI agree with those who say that we cannot do without state capital. But it will certainly not work without a European capital market. We simply won't be able to finance the transformation of our economy. In other words, there will be no Green Deal without a capital markets union.\nAt the same time, the capital market is also indispensable for avoiding massive social problems such as poverty among the elderly. The combination of negative interest rates, rising prices, barely funded pensions and wasted returns on invested assets is toxic for a market economy.\nThe middle class, the backbone of our society and democracy, is in danger of shrinking.\nThis brings me to my second thesis: we must see sustainability as an opportunity - without de-industrialising ourselves in the process. Climate protection not only costs money - current estimates predict a global investment requirement of more than two trillion euros per year by 2050. It’s not just about restrictions, it’s above all a great opportunity.\nThis presupposes that we play to our strengths. And that is closely linked to digitalisation. As one of the world's largest capital goods manufacturers, we must manage to combine the digital with the sustainable.\nWe have the capabilities to do this, as VW CEO Herbert Diess impressively explained at the IAA automotive show: Our goal should be, for example, to become the world market leader in sustainable mobility solutions - be it in cars, in trains, in aircraft.\nWe have the technology, we have the engineering expertise. We could experience a kind of export boom 2.0 - this time exporting not only technology, but also sustainability knowledge and data-driven solutions.\nThird, this structural change needs less government intervention and more entrepreneurship. If we want to encourage investment and seize the opportunities of sustainability, we need to be positioned accordingly.\nTo give an example: how can it be acceptable that the construction of the Tesla battery factory in Brandenburg is nearly completed, but the permits have not even been issued yet. Nor is it acceptable for barely digital and barely networked authorities to slow down companies and drive up administrative costs.\nAnd it's also not okay that we put so much effort into preserving existing structures, consume a large part of the state budget and hold on to what is not sustainable. The motto must not be more government and less entrepreneurship, but the other way around.\nThe next federal government must create the framework that makes structural change possible - and cushion the consequences only where necessary. And it must reduce the excessive bureaucracy - the BDI has presented extensive proposals in this regard.\nFourth: We must think European - and do so from a leadership role. Germany is still the world's fourth-largest economy and, together with the 26 other EU countries, it is even the third-largest.\nThe only problem is that we are not perceived as a single entity on the world stage. This weakens us and reduces our negotiating power.\nTo change this, we urgently need to complete the single market. But that's not all: Europe must finally become more capable of making decisions again.\nWe need new governance in the EU: majority decisions must become the rule and replace the paralysing unanimity requirement wherever possible.\nMany of the rules that we impose on ourselves unnecessarily are also not practical. By that, I mean in particular antitrust law, which prevents European champions - because we worry so much about competition within Europe that we ignore competition with the rest of the world.\nSo if Europe is so strategically important, we need a clear economic policy plan.\nWho cares about how we are positioned in Brussels? Where is the strategy for an economically strong Europe? Without answers to these questions, we will not live up to our leadership role. We need to shape Europe instead of letting Europe manage us.\nWe need a vision that puts Europe's strengths first: where else in the world is there such a diverse and heterogeneous economic area based largely on the same values? Where is there such a treasure trove of knowledge, of languages, of culture?\nWe can use all of this to become the most attractive museum on earth - or the most attractive economic area in the world. Or ideally both.\nThat brings me to my fifth and final point: we need a different mentality in Europe - a culture of personal responsibility and ambition.\nWe have experienced it ourselves in our bank: when we decided to radically restructure more than two years ago, it was not only the individual measures that were decisive, but above all the attitude in our bank - the conviction among our employees that something really has to change.\nAnd what applies on a small scale, in an individual company, also applies on a large scale. Here, too, I would like to remind you once again of the Agenda 2010. It was effective not only because of its individual measures, but above all because of the signal it sent out: that everyone is responsible for their own work and their own lives.\nThis change of mind was essential. And it is again now. But when did we hear about it in this election campaign?\nI'm not saying all of this to point fingers at politics. No, it’s up to us all now.\n\"Do not ask what your country can do for you, but what you can do for your country.\"\nEveryone knows this phrase from John F. Kennedy - but far too few take it to heart. Now it's more relevant than ever. We just need to replace \"your country\" - with \"Europe\".\nThank you.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 13
}