{
    "url": "https://www.db.com/news/detail/20210913-fiat-money-fifty-and-frail-long-term-asset-return-study-2021?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 13, 2021",
    "tags": [
        "Research"
    ],
    "title": "Fiat money, fifty and frail – Long-Term Asset Return Study 2021",
    "body": "Last month effectively marked 50 years of the fiat regime. On August 15, 1971, President Nixon suspended the convertibility of dollars into gold and for all intents and purposes collapsed the 25-year-old Bretton Woods system. Given that most global currencies were fixed to the dollar at the time, this marked the end of a gold-based system.\nThe new Long-Term Asset Return Study 2021 “Fiat money, fifty and frail” highlights that the underlying money system has changed frequently over the past few hundred years – and just because the current framework is all that we know, doesn't necessarily mean it will carry on forever.\nThe research team behind the report, led by Jim Reid, Global Head of Fundamental Credit Strategy and Thematic Research, states that although gold-based money occasionally broke down for brief periods in the twentieth century, precious metals backed most global money throughout history prior to 1971. In the same way that few would question fiat money today, during the inter-war period last century, policymakers could not have conceived of an economy without the Gold Standard, despite it going through its most turbulent period in history.\n“History suggests that precious metal systems see stable or very low inflation or deflation (which has often been their downfall), limited peacetime government debt increases, and short business cycles,” the report says, whereas “fiat money has generally seen much higher and at times extreme inflation, ever higher levels of debt, but longer manufactured business cycles.”\nReid highlights that none of the 152 countries the team analysed has seen average annual inflation below 2 percent in the 50-year fiat era since 1971. Only 45 of these have seen it average less than 5 percent over the period, with 55 seeing more than 10 percent. The last 50 years has seen worldwide inflation at its highest levels ever. Although inflation has been lower in the last decade or so, Reid explains that once inflation arrives in a fiat world you are highly unlikely to see enough subsequent disinflation to offset it.\n“Gold money systems have had very strong, passionate advocates but also strong critics. It is interesting that you don't tend to see the same praise and passion for fiat money through history, possibly as it tends to arrive because other systems have failed, rather than because of a view that it is the best system,” Reid says.\nReid continues to say: “Interestingly, today crypto is starting to build up the strong passionate advocates that gold has had in the past. It also, however, attracts ridicule and disbelief. Whatever happens going forward, views, orthodoxy and money systems do change over time. Fiat money has only been the dominant framework for a small fraction of history and as such it shouldn't be too controversial to suggest it may not always be the system of choice. With endless structural deficits and extraordinary levels of money printing, we have certainly stressed its flexibility in recent years. Will there be a point when it breaks rather than bends.\"\nIf you are a Deutsche Bank Research client, you can access the report here.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 27
}