{
    "url": "https://www.db.com/news/detail/20240228-deutsche-bank-hosts-uk-government-autistic-employment-review-event?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "February 28, 2024",
    "tags": [
        "Diversity"
    ],
    "title": "Deutsche Bank Hosts UK Government Autistic Employment Review Event",
    "body": "Deutsche Bank yesterday welcomed Sir Robert Buckland KC MP, UK government minister Mims Davies, and Dr James Cusack, the CEO of Autistica, for the announcement of the findings of the Buckland Review into autistic employment, and the launch of a new neurodiversity employment tool for companies.\nThe event was hosted by Alex Wilson, Managing Director of Deutsche Bank and a senior member of Deutsche Bank’s Neurodiversity Network, and Nicola Atkinson, Chief Operating Officer for Deutsche Bank in the UK and Ireland.\nIn April 2023, the UK Department for Work and Pensions announced a governmental review of autistic employment led by Sir Robert Buckland, partnering with Autistica, the UK charity. At today’s event, Sir Robert announced the outcome of the review including 19 recommendations to support autistic people to start, stay and succeed in work. He also called on businesses to sign up to the new Autistica Neurodiversity Employers Index to develop and roll out inclusive processes and procedures.\nNicola Atkinson said: “Deutsche Bank welcomes the publication of the review led by Sir Robert Buckland. We’ve already seen the benefits neurodivergent staff can bring to our organisation and are looking forward to using the Autistica Neurodiversity Employers Index (NDEI®) to build on this further. Deutsche Bank aims to create a diverse, equitable and inclusive working environment and we are convinced that embracing Neurodiversity as a part of that will help us drive the best outcomes for our clients.”\nAlex Wilson said: “Deutsche Bank is continuously seeking to understand how best to support our teams, and the NDEI provides a powerful framework within which we can continuously improve our practices to support our neurodivergent staff throughout their career.”\nAutistica was Deutsche Bank’s Charity of the Year in 2016/7.\nThe 2016/17 partnership raised a record amount of money at the time but also sparked a greater awareness of Autism and of Neurodiversity more broadly across the bank. Since then and in conjunction with dbEnable, one of our six Employee Resource Groups,  Deutsche Bank’s Neurodiversity Network has grown to more than 1,000 members across the globe and was recognised externally last year at the “This Can Happen workplace mental wellbeing awards”, winning both Best Employee Resource Group and the overall Grand Prix award.\nAlex Wilson said: “After such a strong partnership as our Charity of the Year, Deutsche Bank are thrilled to see Autistica continue to drive such pioneering work, and we are excited to be working with them again on the Neurodiversity Employers Index (NDEI®).”\nNotes to Editors:\nDeutsche Bank’s UK Charity of the Year programme is a two-year partnership with pioneering charities that aims to address society’s most pressing issues by working with expert organisations. Since 1999, the programme has raised over £26 million and has enabled strategic growth for many charities by utilising Deutsche Bank employee skills, knowledge and expertise. The partnership’s overriding ambition is to create a lasting legacy by delivering meaningful support for the charity and the societal issues they are progressing.",
    "number_of_ratings": 4,
    "rating": 3.5,
    "likes": 3
}