{
    "url": "https://www.db.com/news/detail/20240214-deutsche-bank-announces-set-up-for-advising-uhnw-clients-in-its-home-market?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, February 14, 2024",
    "tags": [
        "Germany",
        "Strategy",
        "Wealth"
    ],
    "title": "Deutsche Bank announces set-up for advising UHNW clients in its home market",
    "body": "Deutsche Bank has announced initial details on the future coverage of ultra-high net worth (UHNW) clients in its Private Bank. As part of the reorganization of its private bank business, the bank had combined Wealth Management & Private Banking in the home market under the leadership of Lars Stoy in October 2023; Stefanie Rühl-Hoffmann has been assigned responsibility for the UHNW business.\nLooking ahead, Deutsche Bank will serve its UHNW clients in Germany, many of whom have an entrepreneurial background, regionally and enable them to access the bank's full range of services – including the services of the Corporate Bank and the Investment Bank – worldwide with specialized teams. The \"Relationship Manager Team\" consists of client advisors who act as direct contacts for the entire client relationship. They are accompanied by capital market experts (\"Investment Manager Team\"), who make the bank's relevant expertise available to them.\nMichael Kremzow will lead the Relationship Manager in the North and West regions of Germany. Stefanie Rühl-Hoffmann will temporarily head the South-East region. In addition to his responsibilities as Regional Head of Investment Manager North and West, Björn Gebhardt will head the UHNW Investment Manager team throughout Germany. Additionally, a team under Germany-wide management will coordinate the entire client service for the UHNW target group.\n\nThe group of ultra-high net worth clients requires a particularly intensive, institutional type of collaboration. For this reason, the bank is concentrating its many years of expertise in high-performance strategic financial architecture (Financial Engineering & Solutions) in the UHNW area under the leadership of Peer Paulsen, who will become part of the management team.\nIn addition, a new \"Growth Office\" will be established. The Growth Office will provide significant support in retaining and acquiring UHNW clients by implementing a new way of engaging with clients. Appointments and details of the Growth Office will be announced shortly.\n\n“I am delighted that we will be able to serve our clients even more effectively according to their needs with a very experienced team,” said Lars Stoy, Head of Private Bank Germany and responsible for Wealth Management & Private Banking. “This enables us to support the entire breadth of the private client business in our home market with needs-oriented offerings. We are the market leader in Wealth Management in Germany. Our ‘Global Hausbank’ concept combines regional presence with the advantages of a globally operating Corporate Bank and Investment Banking.”\n“In recent years, we have had very positive experiences worldwide with this service model, which we will apply even more consistently to the special needs of UHNW clients in our new team,” said Stefanie Rühl-Hoffmann, Head of UHNW in Wealth Management & Private Banking Germany. “Depending on the client's individual situation, our local teams can access all the bank's specialists worldwide, for example, when granting loans. This benefits both clients and the various divisions of Deutsche Bank.”",
    "number_of_ratings": 11,
    "rating": 4.3,
    "likes": 15
}