{
    "url": "https://www.db.com/news/detail/20240212-billions-for-batteries?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, February 12, 2024",
    "tags": [
        "Europe",
        "Germany",
        "Sustainability"
    ],
    "title": "Billions for batteries",
    "body": "Automotive Cells Company (ACC) announced today the closing of a 4.4 billion euro Project Financing for the development of three gigafactories for lithium-ion battery cell production in France, Germany, and Italy. \nDeutsche Bank is one of four European banks tasked as Underwriter, Lender, and Hedging Bank on this transaction. With seamless cooperation across coverage and product teams in the Corporate Bank and Investment Bank, the deal is an excellent example for our global growth strategy in energy transition related Project Financings. The Deutsche Bank underwritten amount of 1.1 billion euro is also contributing to the bank’s sustainable finance target.  \nA joint venture between Stellantis, Mercedes-Benz and TotalEnergies, through its subsidiary Saft, ACC will use the proceeds to fund its first gigafactory in Billy-Berclau Douvrin (BBD), France, which started production of battery modules for Stellantis in December 2023, as well as to develop a second block in BBD, the first block in Germany and another double block in Italy. “The transition to the electrification of vehicles is still on the way. To meet this immense challenge, our customers must be able to rely on robust and reliable European players like ACC, capable of delivering high volumes of competitive batteries with a low CO2 footprint. With this world-class financial community supporting us, we see clear evidence of the confidence that is placed in the ACC project. Beyond this operation, we will determine our needs as and when we conclude additional contracts. We are resolutely looking to the future, with a view to achieving our objective of growing our production capacities,” said Yann Vincent, Chief Executive Officer of ACC.\nThe project is recognised by the EU as an Important Project of Common European Interest (IPCEI) and will accelerate the development of ACC as key player in the battery industry to equip high-performance, low-carbon electric vehicles. \nThe transaction is the first debt underwriting globally at this scale in this emerging sector with Deutsche Bank taking lead roles , ranging from financing to hedging. It is also the third giga-size transaction closed in recent weeks as part of the of DB growth strategy in Project Finance, following recent announcements of Northvolt ($5 billion) and H2 Green Steel (€ 4.2 billion), in which Deutsche Bank acted as Mandated Lead Arranger. \n“This deal represents a big milestone for Deutsche Bank and our Corporate Bank. It showcases how we support the transformation of the European economy across countries and, at the same time, one of the most important industries for Germany. It also demonstrates our strategic focus on structuring and facilitation the energy transition. We are delighted to be part of this transaction and I would like to congratulate everyone involved for setting this important signal for the European, and also German, economy”, said Head of the Corporate Bank David Lynne.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 6
}