{
    "url": "https://www.db.com/news/detail/20240201-a-message-from-christian-sewing-on-our-full-year-results-2023?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 1, 2024",
    "tags": [
        "Financial Results",
        "Strategy"
    ],
    "title": "A message from Christian Sewing on our full-year results 2023",
    "body": "Dear Colleagues,\nAt the beginning of every year, I like to take some time to jot down a few thoughts I have about our bank, reflecting on our achievements, our aims, areas we need to improve and things we should change. Over the past few years, my list of positives has always been long, and this year was no exception. Once again, I am proud of what we have accomplished together. We have demonstrated impressive resilience in a difficult environment, expanded our business and shown everyone our bank is sustainably profitable. These are significant achievements, made possible by strong teamwork across borders and businesses. The upgrade in December from rating agency S&P is well-deserved recognition of our achievements, and an additional boost for business.   \nOf course, there are some areas where we can, and indeed must, improve and I’ll touch on those in a moment. First, to our full-year figures. This morning we reported pre-tax profit of 5.7 billion euros for 2023. That’s a slight increase on 2022. Our post-tax profit fell over last year, but this is due to tax effects in both years, where the positive impact in 2022 was greater.\nA much better indication of our success are our revenues: at 28.9 billion euros they were six percent higher than in 2022, which was already a strong year. Achieving this kind of growth in a difficult market environment is further evidence of how robust our business model is. And it’s also a reflection of all your hard work. At a time when our clients need us most, you are at their side with crucial support, and it’s paying off on numerous levels. Last year, we won important mandates, gained market share in key areas and regions, and saw high rates of net inflows into investment products. \nOne reason for our increased revenues was the rise in global interest rates, from which we – like most of our peers – are benefitting. This was most evident in both the Corporate Bank and the Private Bank, where we saw the highest rate of revenue growth in 2023. It’s important to me, however, that our bank’s success rests on a broad base. Net interest income makes up under half of our bank’s revenues, much less than at many other banks. And our full-year results would not have been as good if it weren’t for our teams in the Investment Bank and in our Asset Management business making a lot of the opportunities in a difficult market environment.\nIt’s precisely this mix that is cause for optimism. We know that different market phases call for different capabilities. We also know that we have the right experts within our ranks to know exactly which services our clients need and when. So, we needn’t worry about the positive effects of the interest rate turnaround wearing off. Over the past months, we have created the foundation for stronger growth in our businesses that are not related to interest payments. We have launched innovative new products, increased our market coverage and expanded our advisory capacities, by hirings in key areas and through the acquisition of corporate broker Numis in the United Kingdom.\nWe made a conscious decision to go ahead with these investments, knowing that they and a number of specific items would mean a rise in costs over the previous year. This doesn’t alter the fact, though, that cost discipline remains a high priority. Our goal is to arrive at a cost level that means the bank is protected against external influences in an uncertain environment. That’s why we implemented further efficiency measures in 2023, the impact of which we expect to start seeing this year. We are at an inflection point from which we can start reducing our costs again. We will only succeed, though, if we make cost discipline an intrinsic part of how we do business – every day. \nWe clearly stated two years ago where we want to end up: our goal is a cost-income ratio below 62.5 percent and a post-tax return on tangible equity of more than 10 percent by the end of 2025. These targets are set in stone, we have a clear path and are well on track. When it comes to revenues, having surpassed our own ambitions in the past years, we are now confident of achieving significantly more than we had originally hoped for. For the period between 2021 and 2025, our new target is compound annual growth of between 5.5 and 6.5 percent, raised from our previous expectation of 3.5 to 4.5 percent. This would translate to annual revenues of about 32 billion euros by 2025.\nOne area where we also want to be more ambitious is in our promise to shareholders. We have always said that we want to reward their loyalty and, in line with that, we announced today that we have received approval to buy back shares worth another 675 million euros. We also want dividends to grow, too. Our ambition is to be able to pay a dividend of one euro per share for the financial year 2025 – assuming we meet our financial targets and, as planned, our capital distribution goal of 50 percent. \nOur results, our targets and how we are going about achieving them will be the topic of our annual media conference at 9 a.m. CET today. You can follow my speech as well as James’ live on db.com. At 2 p.m. CET we’ll both be hosting our Quarterly Check-In on the intranet, at which you’ll be able to put your questions to us.\nI’m looking forward to hearing what you have to say. What I’m looking forward to even more, though, is to continue to write Deutsche Bank’s success story with all of you and to make 2024 another strong year after an already powerful start. We have made great progress during the past few years because we set ourselves clear goals and believed we could reach them. Together, we have shown that a combination of optimism, dedication and collaborative spirit can create something good. In these current times of social polarisation, where the focus is all too often on doom and gloom but not enough is being done to improve things, it is something that should lift our spirits.\nBest wishes,\nChristian",
    "number_of_ratings": 12,
    "rating": 4.2,
    "likes": 51
}