{
    "url": "https://www.db.com/news/detail/20221118-christian-sewing-we-need-an-agenda-2030-for-europe?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 18, 2022",
    "tags": [
        "Company"
    ],
    "title": "Christian Sewing: \"We need an Agenda 2030 for Europe\"",
    "body": "President Lagarde,\nDeputy Mayor Wüst,\nLadies and Gentlemen,\nI also would like to extend a warm welcome to you here at the Alte Oper on behalf of Deutsche Bank and our three co-hosts BNP Paribas, Commerzbank and HSBC.\nIt is an honour for me to open the European Banking Congress. This year marks the thirty-second edition of the EBC, and there have been several Congresses which happened at times when the world economy was in upheaval.\nBut I think few of us have experienced a situation like the one we are now in. A situation where so many major challenges are colliding, and decades-old certainties melt away.\nThe terrible war in Ukraine with all its human and economic implications, the global spike in inflation which is threatening economic prospects but also social cohesion, the significant disruptions in supply chains and trade flows - these are all shifts that we need to manage. And that is why the title of this year's congress - \"Coping with transformational change\" - is so apt.\nYet transformational change entails more than solutions to the current crises. It calls for new foundations for European future economic success and our prosperity in the long term. It is about ensuring Europe’s competitiveness and its leading role in the global economic order.\nAnd that means halting the downward trend we are currently on.\nOver the past 20 years, the EU's share of global GDP has fallen by a quarter in purchasing power parity terms.  It now stands at around 15 percent, behind the U.S. at 16 percent and China at just under 19 percent.\nIf you ask international observers, many of them associate Europe today with slow decision making, weak innovation, an agonizing fragmentation of interests and positions and also overregulation. An old continent going grey — that is the stereotype.\nAdd to this the over reliance and dependencies on individual counterparts, which is most obvious in the case of Russian oil and gas supplies, but it also applies to several other fields from future-critical raw materials and semiconductors to defence.\nWhat Europe needs for Strategic Autonomy\nThere is some hope that Europe could once more succeed in using a crisis as the basis for tackling crucial reforms – following what Jean Monnet wrote in his memoirs in 1976:\nEurope will be forged in crises and will be the sum of the solutions adopted.\nLadies and gentlemen, nothing could be further from my mind than to contradict this great European thought leader.\nBut I am convinced that today, almost five decades after Monnet made his statement, we do need a different approach to prove the stereotypes about Europe wrong.\nWe need to shift focus from saving Europe to building Europe.\nWe have been talking about the concept of strategic autonomy for several years – now it is time to take it seriously. That means that we Europeans must stop reacting and start developing strategic plans on how to make Europe fit for the future.  \nWe need an Agenda 2030 for Europe.\nAnd the very first step must be that we finally create a real European home market. Wherever I go and whoever I talk to, nobody understands why we don't go for it. A common market with 450 million people and consumers, not split in 27 different jurisdictions. By the way, this also means that we have to rework European anti-trust laws.\nAnd given the world we find ourselves in, a European agenda cannot ignore the issue of defence. The illusion of everlasting peace has been abruptly shattered this year, and at the same time it is obvious the US is no longer prepared to bear the burden for Europe‘s security to the same extent as in the past. The consequence is that Europe needs to take its own defence seriously. In recent months, EU countries have, rightly, already taken some steps to strengthen their capabilities. But much more needs to be done – and pan-European thinking is required.\nNo less urgent is that we put our energy supply in Europe on an independent footing. This involves new supply contracts and a broader diversification of suppliers – and a determined Europe-wide expansion of renewable energies. And let’s not only envision 100 percent energy supply – we must focus on sourcing even more energy than needed as only then prices will be competitive.\nAt the same time Europe must raise its profile in sectors that will play a key role in the future. Sustainability is a prime example here. We have a competitive edge in this area and a great opportunity to set the pace globally in one of the most important fields of the future. Other nations and continents admire us for this lead. That is why we must now work at all levels to defend it - technologically, in terms of financing, but also when it comes to political support and regulation.\nNext to sustainability, we must also focus on technology more broadly. Other key future fields with potential include innovative mobility solutions, fifth-generation mobile networks, artificial intelligence and quantum computing. Market shares are not yet distributed in these areas, and Europe would do well to join forces and focus on them.\nFinancial autonomy as missing link\nAll of this needs investment though – which leads to an area which is far too often overlooked when we talk about European strategic autonomy. And that is financial autonomy.\nIt is concerning that this key cornerstone is simply left out in the debate – just as if the financing of the upcoming transformation were a side issue. But for this transformation the financing piece is nothing else than the heart and lungs.\nThe sums that will have to be spent on a successful transformation in the coming decades are enormous, and Europe lacks the capital and financing structures to master this task on its own.\nWe urgently need to change course here if we do not want to rely primarily on foreign banks to finance Europe's future. And nobody should take this danger lightly: Losing financial sovereignty for Europe would be just as bad as the energy dependence that is causing us so much pain right now.\nTo avoid this, two things are required.\nNumber one is a political determination to create the conditions that attract private capital to a much greater extent in Europe.\nWithout a substantial increase in private-sector investments, Europe cannot be competitive. We will neither master sustainable transformation nor be able to keep pace technologically.\nThat is why it is so important to finally push ahead with the capital markets union in order to create a liquid and attractive market for domestic and foreign investors. The Capital Markets Union is a central pillar of Europe’s future viability. Without it, the European Green Deal will be impossible to do.\nUnfortunately, given the lack of political will or unity in the EU, it will take many years to complete the Capital Markets Union even in the best-case scenario. We should therefore readjust priorities and now focus on measures that can work quickly - such as facilitating securitisation. Compared to the U.S, the European market for securitisation is tiny: just one-tenth the size of the U.S. market. And the reason is outdated and restrictive regulation in Europe. That has to change. We can no longer afford to leave financing sources with such potential lying idle.\nNumber two is a more supportive environment for banks in Europe.\nEuropean strategic autonomy is impossible without strong banks that can support its economy at full strength in all situations - and that can compete on a global level.\nIn order to achieve this, we banks must first look at ourselves. There are always things we can do better, but I do see very committed and ambitions management teams across the sector. Admittedly, our industry has done well in recent years and, in a difficult environment, has achieved a level of stability and profitability that few had thought possible.\nNonetheless, the gap between us and our US competitors has not tightened. We must therefore not rest on our achievements but continue to work on ourselves to become even more efficient, get even closer to our clients and speed up significantly with regards to technology and innovation.\nAt the same, it becomes ever clearer that the current regulatory framework does little to strengthen European banks.\nGerman Finance Minister Christian Lindner – who unfortunately had to cancel his participation at today’s EBC on short notice – recently affirmed this with remarkable frankness. The minister said banking regulation had focused too much on stability and consumer protection, and too little on competitiveness and profits. And while he linked this with clear demands on us banks to do more for profitability, it felt good to hear these words from him.\nNow we need to move from words to action and recalibrate regulation in Europe. 15 years after the Global Financial crisis, it is time for regulators to acknowledge the positive developments we have seen. And that ultimately means that instead of further expanding and tightening regulation, we should also look at where it might have gone too far. Banks must be stable and resilient – and we are. But next to stability we have a clear task to finance the economy and help it grow.\nTo be clear, I am not talking here about the way bank supervisors in Europe do their job. My fundamental conviction remains that our industry would have made less progress in recent years without stronger supervision and the regulatory changes implemented since the financial crisis.\nThe issue that concerns me is that the pendulum is about to swing too far – due to regulatory and political decisions that structurally disadvantage our industry in global competition and limit our ability to support our clients and the economy as a whole.\nAllow me to go into more detail on four items that are representative:\n1. Clearing Business\nNumber one is the regulation of European clearing business after Brexit. We fully support the need for the EU to strengthen this market. This however should not come at the cost of cutting European banks off from the global markets or by imposing punitive capital requirements. Many of our clients will still want to clear outside of the EU, and ultimately it remains their choice on where to clear. The only result will be that EU banks lose out on a field that is essential for creating a deeper and more liquid European capital market.\n2. Leveraged Finance\nOne area of business where we already face significant hurdles is Leveraged Finance. Punitive buffers imposed by European regulators make it more difficult for domestic banks to compete in this business - which is a legitimate segment that will play an important role in the recovery of the broader economy, in particular when it comes to financing the large group of medium-sized companies that form the backbone of our economy.\nThis underlines how Europe still tends to treat financial sponsors as something distasteful. But when we look at the US, a lively venture capital market, but also private equity industry is part of an ecosystem which is much more effective in supporting innovation and growth than we have in Europe. It should be our aim to make best use of these sources of capital for our economies, not to side-line them.\n3. Basel III\nMy third point concerns the adoption of the Basel III framework in Europe. The recent postponement is welcome, as are the suggested transition periods and latest adjustments which acknowledge the conditions of the European banking market to a certain extent. But this does not take the uncertainty off the table. The current plans would still impose considerable additional burdens on Europe's banks. According to the recent study from the EBA, for the largest banks, capital requirements would increase by up to a quarter.\nAnd when we talk about the impact for the broader economy, the planned stricter capital requirements for loans to companies without external ratings are a real concern. That means that 80 percent of all European companies would be penalised with higher financing costs – or pushed into ratings which are neither economical nor sensible for the vast majority.\n4. Sustainable Finance\nMy last point is about financing the green transformation of our economy. Sustainable finance has become a key sector for banks and we in Europe are leaders in this field.\nHowever, I fear that we will soon lose this leadership if regulation continues as it has. Companies and banks are busy implementing different and overlapping regulations at the same time, and new ones are coming all the time.\nWhat is needed here is a consistent and balanced approach which gives companies the flexibility to implement the various frameworks step by step and actually work on their sustainable transition.\nConclusion\nLadies and gentlemen, let me conclude:\nWe are living in times of significant uncertainties with many developments that are beyond our control. It is all the more important that we set the right course for those aspects we can influence - and make courageous decisions on those we can control.\nWhere Europe is headed is among the things we can control. So let's finally move forward more boldly and make the decisions that strengthen us in Europe and enable us to seize the future.\nEuropean integration is the backbone of this plan. For me personally, Europe is a matter of the heart, but it is also a matter of reason. I am firmly convinced that we in Europe will only be able to maintain our prosperity in the future if we press ahead with unifying our continent.\nToday, we have so much financial and policymaking intelligence from all over Europe in this room, and we can look forward to great presentations and panel discussions.\nSo let's make the most of this day, learn from each other and together make a small contribution to help shape the future of the European banking industry and ensure that we best support the growth of our economy. Let’s also permanently renew ourselves, see where we can improve. The attitude of keep working to get better is so important, in particular in a people business like banking.\nWe want to be part of the solution – let us all together create the conditions so that we can actually do this.\nAnd while strengthening Europe’s financial sector is crucial for the medium- and long-term success of our economies, a major short-term priority is of course getting inflation under control – and that leads me to an institution which is at the heart and centre of both of these challenges.\nOur first speaker, who I would like to invite to the stage now, is the person who, in her fourth year in her current role, has the most difficult but also the most important role in European Finance.\nPresident Lagarde, it is certainly no exaggeration to say that the whole world is following every step you and your colleagues at the ECB take to fight inflation in the eurozone.\nAnd I would like to congratulate you on the way you have managed to turn around monetary policy; for the determination and the clarity with which you communicate to the market – and not least for the way you have captured the various currents within the ECB, at least to the extent that the ECB Governing Council speaks to the outside world with one voice.\nPresident Lagarde, I can assure you: Everybody in this room wishes you the greatest possible success in your task.\nSo thank you very much for being our guest today. And now, I’m looking forward to your keynote speech.",
    "number_of_ratings": 28,
    "rating": 2.3,
    "likes": 12
}