{
    "url": "https://www.db.com/news/detail/20221109-how-the-financial-sector-can-help-finance-conservation?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 9, 2022",
    "tags": [
        "Sustainability"
    ],
    "title": "How the financial sector can help finance conservation",
    "body": "On the sidelines of this year’s COP 27 climate conference, the financial sector is trying to find solutions to finance conservation. So-called debt for nature swaps are one such idea. These involve purchasing foreign debt at a discount, converting that debt into local currencies and using the proceeds to fund conservation activities. The key to this initiative is in the willingness of commercial banks or governments to sell debt at less than the full value of the original loan.\nClaire Coustar, Global Head of ESG Fixed Income & Currencies, discussed this topic with ministers, UN partners and experts at the opening of COP27.\nCoustar said Deutsche Bank is seeing growing client interest in investment products linked to nature conservation. “Investors are being forced to disclose how they are investing in a nature-positive way, but it is very difficult for investors to find nature positive investments,” she said.\nMany fixed income investors are looking for securities with an investment grade credit rating. Development finance institutions (DFI) can help here by providing credit enhancements to achieve investment grade ratings for debt for nature issuance.\n“I want to see more DFIs join this, it should be every global DFI thinking about how to support this initiative,” Coustar said.\nKristina Kostial, Deputy Director in the Strategy, Policy and Review Department at the International Monetary Fund, added: “Our world is facing multiple challenges, the crisis of climate and debt must be addressed. The IMF can’t do this alone, we need others to scale up debt and climate swaps, we should use these swaps to expand our toolkit by helping vulnerable countries so that they spend more on climate action.”\nChristopher Coye, the Belize Minister of Finance, said: “Debt swaps can constitute that giant step forward in the right direction both for conservation and the economy.”  \nPauline Nantongo from Ecotrust, the Environmental Conservation Trust of Uganda, said that we should not forget people when addressing the issues of climate change and when we design key performance indicators, “we must ensure that they consider the needs and aspirations of the people in these landscapes.”\nJennifer Morris from The Nature Conservancy commented: “There is not enough philanthropy in the world to solve the problem of debt relief and protecting nature.”\nClosing the session, Hanan Morsy, Deputy Executive Secretary and Chief Economist United Nations Economic Commission for Africa commented: “It is clear the climate for nature swaps is not the only solution and we also have to address the elephant in the room which is both existing and future debt, as well as redefining the link between debt and nature. By working closely together, I hope we start to make a difference.”\nFind out more about what Deutsche Bank is already doing.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 3
}