{
    "url": "https://www.db.com/news/detail/20221108-investors-increase-esg-support-despite-headwinds-esg-cio-survey-2022?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 8, 2022",
    "tags": [
        "Sustainability",
        "Wealth"
    ],
    "title": "Investors increase ESG support despite headwinds: ESG CIO survey 2022",
    "body": "Deutsche Bank’s (XETRA: DBKGn.DB / NYSE: DB) Private Bank Chief Investment Office today published its 2022 ESG client survey findings, revealing that more than half of investors (53%) regard climate change as the most important factor affecting their investment decisions, up from 47% last year.\nConducted for the second year running, this year’s CIO survey found that more private and business clients (78%) are concerned about the negative impact climate change has on the global economy, up from 74% in 2021. Many are concerned it is already having a severe impact on the global economy, or will have, in the next 10 years if left unchallenged.\nDeutsche Bank’s Private Bank ESG Chief Investment Officer and Head of the Chief Investment Office, Markus Müller said: “What is most interesting about this year’s findings is that client expectations of ESG are growing, not diminishing, even as the ESG universe reorientates through debate and development, and while volatility persists in capital markets.”\nThe CIO survey revealed that clients were willing to choose higher-rated ESG investments, even if the potential financial return is lower. Indeed, 42% of investors said they would choose a company with a AAA ESG Rating with 4% expected annual return, rather than a CCC company with 8% expected return.\n“While ESG ratings can be widely debated, this finding shows us that investors have significant expectations for real world returns, beyond financial returns. Consistent with this, more clients (78%) said they want their investments to have a positive impact in the world, slightly up from 75% last year,” he added.\nThe 2022 CIO ESG survey assessed investing awareness and attitudes about Environmental, Social and Governance (ESG) factors among 900 Deutsche Bank Private Bank and Business Banking clients in the Americas, EMEA and APAC regions between the end of July and August this year.\n“This year’s CIO ESG survey tells us that clients have an even greater thirst for knowledge when it comes to their understanding of ESG, the interconnected risks of the triple planetary crisis, and the frameworks steering the world’s transformation,” he added.\nThe annual CIO ESG client survey tracked changes in attitudes over the past 12 months.\nCompared to the previous year’s survey, key findings are:\nEnvironmental issues remain the top priority. Across age groups and among men and women, more investors (50%) see environmental issues (E pillar) as most important in ESG investment, up from 46% last year. Then 28% put Governance (G pillar) at the top of the list, similar to last year. The emphasis on E and G came at the expense of the social issues (S pillar) which fell to 23%, versus 27% in 2021.\nClimate change is seen as the most important problem. 53% of respondents regard climate change as the most important factor in investment decision making, up from 47% last year. Again, climate change ranked above ocean pollution (15%), land degradation, (21%) and biodiversity loss (7%), which fell from 11% last year.\nInvestors confirm their commitment to ESG. Some 78% of investors agreed that their investments should have a positive impact on the world, up 3 percentage points on last year’s 75%.\nMore respondents still agree that ESG can manage risk in a portfolio than disagree. 44% of respondents strongly or slightly agree with this, down only slightly from 48% last year, and higher than the 16% who strongly or slightly disagree. But, with four in ten respondents saying that they don’t know, or neither agree or disagree, many still have to be convinced.\nThe 2022 CIO ESG client survey identified some new insights:\nModerate optimism for managing climate change and biodiversity loss. 51% of investors are optimistic that humankind will be able to manage climate change through technological innovation, while 47% have faith in the power of nature-based solutions.\nMillennials are more aware than other age groups. Almost one in four (nearly 25%) of Millennials say that they have sophisticated knowledge of the concept of net-zero emissions economy, while 21% say the same for net-positive emissions economy. Millennials are also more knowledgeable and more optimistic about solutions to the triple planetary crisis.\nAwareness of new concepts is accompanied by knowledge shortfalls. Only 18% of survey respondents claim sophisticated or good knowledge of Nature-based Solutions, while 20% claim the same for Natural Capital. Moreover, less than 20% of overall respondents had a good knowledge of the concept of the triple planetary crisis.\nBiodiversity issues seen as important for portfolio returns and risks. 41% agreed that including biodiversity considerations into investment decisions would boost portfolio returns, whereas over 60% thought it would reduce nature-related risks.\nInvestors are looking to financial institutions to help manage the transition journey. 68% of investors expect their financial institution to accurately measure and manage nature-related risks; 75% expect appropriate protection of portfolios. But financial institutions can only be one driver – alongside individual investors, corporates and governments – of necessary economic change. among others, greater investors' knowledge is necessary to achieve this goal.\nDeutsche Bank’s Private Bank ESG CIO Markus Müller presented the findings at an event organized by Deutsche Bank in collaboration with the Ocean Risk and Resilience Action Alliance (ORRAA) and IOC-UNECSO at this year’s COP27 meeting in Sharm El-Sheikh, Egypt.",
    "number_of_ratings": 7,
    "rating": 4.4,
    "likes": 20
}