{
    "url": "https://www.db.com/news/detail/20190122-torsten-slok-issues-30-risks-to-markets-in-2019?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "January 22, 2019",
    "tags": [
        "Capital markets",
        "Investment Banking"
    ],
    "title": "Torsten Slok issues \"30 Risks to Markets in 2019\"",
    "body": "Chief International Economist Torsten Slok has issued a list of 30 market risks that are poised to impact financial markets in 2019. The list, featured in a video, presents a diverse picture reflective of the unpredictability and volatility of the current global markets environment.\nAccording to Slok, the risks are not presented in a specific hierarchy, however those higher on the list pose more immediate concern. He considers the top five to be:\nthe impact of the trade war on the global economic environment;\nslowing growth in China;\nthe impact of wage inflation on the Fed and equities and profit margins;\nUS Treasury issuances and impact on credit markets and Libor OIS;\nand the lack of foreign demand for US credit.\nFor example, Deutsche Bank currently sees a 35% probability that the trade outcome is to the downside due to the wide array of outcomes that can lead to different responses from the Fed. A trade war restricts trade flow between countries, lowering economic activity across those countries. A trade war is particularly painful for countries that have a high share of exports relative to GDP, which most importantly includes China and Germany.\nDeutsche Bank also recently revised its 2019 China growth forecast down to 6.1% from 6.3% based on three factors putting downward pressure on the economy: the cooling property and land cycles; the US-China trade war; and the weak confidence in the private sector. China is both a big seller and buyer of goods and services in the global economy. Therefore a slowdown in China has negative consequences for global demand including commodities used to build Chinese infrastructure.\nOngoing acceleration in wage inflation, which Slok says is not the traditional consumer price inflation but instead cost inflation, is another risk falling into the top five. Higher wage inflation means higher inflation -- the #1 issue that the Fed normally worries about. Higher wage inflation also means higher costs of production for companies, and for corporate America labor make up 2/3 of total costs. If wages increase too quickly, it could be a risk to profit margins for US corporates. “While markets are not paying much attention to this, we worry what the continued increase in labor costs may mean for rates, equities and profit margins,” said Slok.\nFourth on the list is US Treasury issuances and the impact on credit markets and Libor OIS. With big US government deficits requiring more issuance of Treasuries, the dollars to be invested in Treasuries have to come from other assets. In other words, the biggest risk is that increasing the supply of US Treasuries dramatically over the coming quarters is likely to “crowd out” money that would have gone into the stock market, corporate bonds and other assets.\nThe lack of foreign demand for US credit rounds out the top five. The biggest holder of US credit is foreigners. Hence, less QE from the ECB and BoJ, means less money coming from abroad to buy US investment grade credit, high yield credit, CLOs and loans. This increases financing costs for US corporates, which then becomes a risk to the US economic outlook.\nView the video for the complete list of “30 Risks to Markets in 2019.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}