{
    "url": "https://www.db.com/news/detail/20190121-bloomberg-profiles-wealth-management-s-insider-peek-for-millennials-into-silicon-valley?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 21, 2019",
    "tags": [
        "Corporate products",
        "Digitalisation",
        "Research",
        "Wealth"
    ],
    "title": "Bloomberg profiles Wealth Management's \"insider peek\" for millennials into Silicon Valley",
    "body": "“Banks woo billionaire heirs with insider peek at Silicon Valley,” Bloomberg News wrote on January 18 in an industry-wide profile focusing on Deutsche Bank Wealth Management’s annual NextGen Innovation Summit in Silicon Valley.\nDeutsche Bank Wealth Management is one of the leaders in giving the offspring of clients “an exclusive look at emerging tech and access to industry insiders,” according to Bloomberg.\n“It’s basically the most influential week of the year for me,” says three-time Deutsche Bank Summit participant Anna Karmann, according to Bloomberg. She tells the news organisation that the roots of the company she founded are from connections she has made on the programme.\nThe trips are “crash courses on cutting-edge tech, meant to inspire as much as to inform,” the article says. It adds that: “The programs are a melting pot of money and innovation, which creates an opportunity for everyone involved.”\nFor banks, the events help “garner loyalty among millennials who may prefer up-and-coming tech to old-guard Wall Street” ahead of the biggest transfer of wealth in history as baby boomers pass their fortunes to their heirs, the article said.\nThe article also quotes Omeed Mehrinfar, who helps oversee corporate partnerships for Plug and Play Tech Center, a startup accelerator that has worked with Deutsche Bank on its Silicon Valley programme, as well as DA Wallach, a rock musician turned tech investor who was a speaker in 2017 and 2018.\nWatch a video of Deutsche Bank Wealth Management’s third NextGen Innovation Summit last October.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}