{
    "url": "https://www.db.com/news/detail/20190121-davos-2019-digitalisation?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 21, 2019",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "Davos 2019 – Digitalisation",
    "body": "We are at the cusp of another digital revolution that threatens to increase the economic divide. Digital technologies are allowing us to open up new frontiers at unprecedented speed. But, as machines advance and efficiency increases, more and more standardised tasks will become redundant – affecting job prospects. Human productivity grows at 2 percent per annum, whilst machines productivity is doubling about every two years. People around the world understand the potential of these developments, both in terms of more goods but also in terms of the potential for further disempowerments. There is no economic law ensuring that technical progress makes the economic pie bigger for everyone.\nThe Economic Divide in a Platform World\nTuesday, January 22, 2019. 17:00 – 18:30\nThe world is at an inflection point. Digital technologies are allowing us to open up new frontiers at unprecedented speed. But there is no economic law ensuring that as technological progress makes the economic pie bigger, everyone will benefit equally. How can the tremendous value created through advancements like platforms be distributed more equally across society? Do platforms foster monopolies and exacerbate inequality, bias and a lack of diversity? How should CEOs position their businesses in a world dominated by platforms?\n\"Data is the new currency of the platform economy. It is time that European countries and citizens regain sovereignty over their data.”\nMathias Döpfner, CEO of Axel Springer on the economic divide in a platform world.\n  Will Robots Take your Job?\nThursday, January 24, 2019. 08:00 – 09:30\nThe imminent tech revolution is seen as the fourth since the industrial revolution of the late eighteenth century. Each revolution has seen previously unthinkable labour saving technology. People have lost jobs but this has been more than offset by new ones created in areas not obvious before the revolution. We think this will happen again but policy will be important as we adjust. If we are wrong and net jobs are destroyed by robots, populism will only become greater. As such we may move to a world of universal basic income and a robot tax to appease those displaced. This has huge policy implications.\n“Worries about automation have been around at least since Queen Elizabeth I was on the UK throne!”\nThe future begins now, Jim Reid says: “How we tax, regulate and redistribute the spoils of automation will be the big question of this revolution.”\nJim Reid: “Jobs will continue to be created in new industries as they have been over the last 250 plus years.”\nFire, Wheel, Engine, AI – Are We Ready?\nThursday, January 24, 2019. 12:30 – 14:00\nThe rise of artificial intelligence is being touted as the fourth industrial revolution. However most companies within Germany and even Europe are not prepared for this transformation. Especially challenged are many midsize corporations. The speed and outreach of AI is difficult to grasp based on learnings from previous management challenges. Come and discuss with industry stalwarts and academics about on what is behind the rise of AI and how to master this challenge.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}