{
    "url": "https://www.db.com/news/detail/20190117-trade-war-is-biggest-threat-to-global-growth-deutsche-bank-wealth-management-poll-finds?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 17, 2019",
    "tags": [
        "Corporate products",
        "Investment Banking",
        "Wealth"
    ],
    "title": "Trade war is biggest threat to global growth, Deutsche Bank Wealth Management poll finds",
    "body": "The possibility of a trade war represents the biggest threat to global growth in 2019, according to a public poll by Deutsche Bank Wealth Management’s Chief Investment Office.\nBefore publishing its own Insights 2019 annual outlook report with macroeconomic and market forecasts, the CIO asked visitors to the website of Deutsche Bank Wealth Management, deutschewealth.com, for their views. Seven hundred respondents answered six multiple-choice questions in the last two weeks of December 2018 about themes they expect to dominate in the year to come.\nFor the full CIO Insights outlook “Beyond the peaks: 2019”, including a video with Global CIO Christian Nolting, visit this page. \n1. Which do you think could be the most significant threat to global growth in 2019?\nTrade war was selected by 31% of respondents – way ahead of the second-biggest threat, ‘European politics’, which was selected by just 19%. The other threats, in descending order, were softer GDP growth, earnings recession, quantitative tightening and central bank errors.\nCIO view: Agree. We have repeatedly highlighted these two issues as the two major threats. Like the survey respondents, we are less worried by threats such as quantitative tightening and policy mistakes.\n2. When do you expect the 'late market cycle' to end and a downturn to begin?\nOver half our respondents, 53%, felt that the next global economic downturn would begin within one to three years. Only 10% expected to wait more than three years and 37% were concerned that the ‘late cycle’ environment would end within 12 months.\nCIO view: Broadly agree. We continue to stress that the late cycle environment has room to run, with a sharp economic downturn unlikely this year.\n3. Which regional economy do you think will perform best?\nIn spite of their trade war concerns, respondents felt the economies of Asia-Pacific and the US would show much stronger performance than those of other regions. Around 47% of respondents thought Asia-Pacific would perform best, with 31% choosing the US instead. The Eurozone lagged behind with just a 10% share of the vote. The other options were Middle East/Africa and Latin America.\nCIO view: Broadly agree. We forecast 2.4% US GDP growth in 2019 compared with 1.6% for the Eurozone. We have a long-term positive view on Asia within emerging markets, based on factors such as its solid fundamentals and policy flexibility. But we expect Chinese growth to slow to 6% in 2019.\n4. Where do you think the best equities performance will be found in 2019?\nEmerging markets in Asia were expected to offer the best equities performance in 2019 by 36% of respondents, while the US was chosen by only 16% of those polled. Defensive stocks got the second-biggest share of the vote at 23%. The other options were emerging markets in Latin America, Japan and cyclical stocks.\nCIO view: Agree. We forecast that the S&P 500 will have highest major developed market 12-month returns and we continue to state a global preference for US over European equities and overweight US equities. Forecast EM Asia returns are slightly higher than for EM overall, and we continue to prefer Asia over Latin America. We don’t do a forecast of defensive stocks compared with cyclicals.\n5. Which type of fixed-income investment do you expect to perform best in 2019?\nRespondents were divided on which fixed income asset classes would perform best in 2019. Around 28% chose investment-grade bonds and 26% chose emerging markets hard currency. The other options – developed market government bonds, high-yield bonds, and emerging markets local currency -- scored between 14% and 18%.\nCIO view: Partially agree. We have a longstanding overweight to EM hard currency bonds and we highlight them in the current Insights as offering opportunities. Short-dated US Treasuries are also looking increasingly attractive and could be considered for inclusion in well-diversified portfolios.\n6. Which strategic long-term investment themes look most promising to you right now?\nThe rise of Environmental, Social and Governance (ESG) investing was evident here: It was the third most-popular choice, selected by 17% of respondents. But by far most popular choices were technology, selected by 32%, and healthcare, selected by 28%. The other options were transportation, cryptocurrencies/blockchain and space.\nCIO view: Agree. Technology continues to underpin our longer-term themes. We stay enthusiastic on technology despite recent market reverses. However, we argue that it may be necessary to reassess preferences within the sector. We have added ESG to our long-term themes for 2019 and have written about it extensively over the past year.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}