{
    "url": "https://www.db.com/news/detail/20190116-dreaming-of-streaming?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 16, 2019",
    "tags": [
        "Digitalisation"
    ],
    "title": "Dreaming of Streaming",
    "body": "We’ve all heard many times that \"video killed the radio star\" – but good old radio is still going strong. And it will continue to do so, says Deutsche Bank’s broadcasting sector expert Laurie Davison.\nSo how will we consume music in the years to come? How will streaming develop across the world? And what will happen to the major music labels? Stay tuned for five key findings from Davison and his colleagues.\n1. Turn up the volume: the best years of the music market are still to come\nStreaming continues to be a growing market and it will constitute the overwhelming majority of music revenue in the future, thus driving music revenue growth. In 2018, streaming as a percentage of recorded music revenue crossed the 50 percent threshold. Deutsche Bank Research’s experts forecast a trade revenue of 25 billion by 2023.\n2. Growth in the West has muted, but the streaming transition continues\nDeveloped markets in the United States and Europe are currently reaching maturity and the drivers of growth are increasingly shifting to Asia. While 61 percent of streaming market dollar growth over the past five years came from developed markets, 38 percent of growth over the next five years will come from Asian markets.\n3. Playing it loud: China and Japan are set to be new key markets\nChina is likely to rank second soon behind the US. Japan will be among the top four markets, along with the US, China, and the UK. In addition, relatively new markets such as India and Indonesia could drive renewed acceleration in music industry revenue.\n4. Music to ears: major labels still perform a crucial role for artists\nThe role for major music labels is still central to the largest global recording artists in providing access to the best producers, songwriters, securing terrestrial radio airplay for new tracks, plus the on-the-ground presence across the globe for coordinating PR, marketing and physical distribution.\n5. Singing in my car: radio’s not dead\nIn the United States, for example, terrestrial radio consumption still amounts to about two hours per day. Especially when driving, we still turn on the radio because it is something that most of us have done for our entire lives. However, increasing ease of connecting a mobile device to a car’s in-dash controls and sound system, as well as embedded connectivity in vehicles, are likely to lead to greater substitution of terrestrial radio listening by music streaming.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}