{
    "url": "https://www.db.com/news/detail/20190110-beyond-the-peaks-wealth-management-cio-publishes-insights-2019-outlook?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "January 10, 2019",
    "tags": [
        "Capital markets",
        "Corporate products",
        "Investment Banking",
        "Wealth"
    ],
    "title": "Beyond the peaks: 2019 outlook",
    "body": "Investors face a new investment landscape in 2019, having passed the recent peaks in global growth, liquidity and corporate earnings growth, according to the annual outlook published this week by Deutsche Bank Wealth Management's Chief Investment Office.\n\"Recent market volatility suggests increased market uncertainty,\" said Christian Nolting, Chief Investment Officer for Deutsche Bank Wealth Management, identifying six themes for the new year. \"Global growth is likely to slow this year, but positive returns are still expected across a range of asset classes.\"\nThe themes for 2019 are based around the macroeconomic outlook, market conditions and the major asset classes:\nGrowth deceleration.\nGlobal growth is slowing and becoming less synchronised. As the US upswing matures, Europe will suffer from political uncertainty and risks remain around China. But, despite monetary policy tightening, growth will not collapse.\n\nVigilant on volatility.\nMarkets are struggling with the transition to a more normal policy environment. Other underlying volatility triggers will remain – including geopolitics, and softer GDP and earnings growth. Lower returns are likely for a given level of risk.\n\n(US) yields on the return.\nAfter a decade, investors have got used to low yields on bond investments. Now, in the U.S. at least, this is changing, with the short end of the yield curve now attractive. Other fixed income opportunities exist, but so do risks – be selective.\n\nEarnings ease.\nLooking through recent volatility, global equities still have a lot going for them. Earnings growth could however fall short of expectations as global markets adjust to reality – as a result, the CIO expects lower but still positive 12-month equity returns.\n\nU.S. dollar and oil centre-stage.\nThe CIO expects continued US dollar strength in early 2019, but think that it will be gently eroded during the course of the year. After a sharp decline in oil prices at the end of last year, supply constraints should support some recovery in 2019.\n\nTech transition.\nThe CIO's \"tomorrow’s themes today\" now include environmental, social, governance (ESG) and enhanced infrastructure investment. But this may be the year to re-evaluate preferences within the tech sector as regulation bites and sector trends diverge.\nThe report “Beyond the peaks – Investment themes for the world ahead” has further sections on multi asset and alternatives investment. It also includes our new macroeconomic and financial market numeric forecasts for 2019.",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 1
}