{
    "url": "https://www.db.com/news/detail/20190110-us-china-policy-escalation-und-markets?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "January 10, 2019",
    "tags": [
        "Investment Banking"
    ],
    "title": "US-China Policy Escalation & Markets",
    "body": "The United States and China are at a crossroad in what has become the most important bilateral relationship of the 21st Century, CIB Capital Markets Strategist Tom Joyce said in the January issue of C-SPACE, the quarterly publication for corporate executives.\n“To this end, the decisions made by both countries in the weeks and months ahead will have an outsized impact on the global economic and market outlook for 2019, and for many years beyond,” he said.\nThe path for 2019 will be highly dependent on the three drivers which made last year so challenging for markets: global growth slowdown with China at the epicenter; global central bank quantitative tightening (QT); and US-China policy escalation.\n“Global markets enter 2019 with a fact pattern that bears resemblance to early 2016: a strong dollar over the prior year, China slowdown concerns, low oil prices, wider credit spreads (due in part to oil), an equity market correction, and safe haven flows into Yen and USTs. Where we go from here may depend on the drivers that got us here: global growth, the Fed and the US-China relationship.”\nThe scope of potential US-China escalation in 2019 extends well beyond the White House and trade, and includes dozens of major US government agencies and departments focused on a myriad of complex US-China issues, including: the US Congress (Senate and House, Republican and Democrat) the Department of Commerce, Treasury Department, Department of Defense, the Department of Justice, Department of Energy, the USTR, CFIUS, and many more.\nJoyce said that with the Chinese economy and US markets under stress, the probability of a near term US-China ‘mini-deal’ in January-February, with the optics of something larger, has become quite high. Taking a longer view, however, we are perhaps transitioning into a new stage in the US-China relationship, from a 40 year period of cooperation and co-dependency, to a new era likely defined by economic and geopolitical competition.\nPDF\nClick here to read more in C-SPACE",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}