{
    "url": "https://www.db.com/news/detail/20161223-media-release-deutsche-bank-agrees-on-settlement-in-principle-with-the-doj-regarding-rmbs?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "December 23, 2016",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank agrees on settlement in principle with the DoJ regarding RMBS",
    "body": "Deutsche Bank AG (XETRA: DBKGn.DE / NYSE: DB) has reached a settlement in principle with the Department of Justice in the United States (“DoJ”) regarding civil claims that the DoJ considered in connection with the bank’s issuance and underwriting of residential mortgage-backed securities (RMBS) and related securitization activities between 2005 and 2007.\nUnder the terms of the settlement agreement, Deutsche Bank agreed to pay a civil monetary penalty of US dollar 3.1 billion and to provide US dollar 4.1 billion in consumer relief in the United States. The consumer relief is expected to be primarily in the form of loan modifications and other assistance to homeowners and borrowers, and other similar initiatives to be determined, and delivered over a period of at least five years.\nThe settlement is subject to the negotiation of definitive documentation, and there can be no assurance that the U.S. Department of Justice and the bank will agree on the final documentation.\nIn connection with the resolution of this matter, Deutsche Bank expects to record pre-tax charges of approximately US dollar 1.17 billion in the financial results for the fourth quarter as a consequence of the civil monetary penalty. The financial consequences, if any, of the consumer relief are subject to the final terms of the settlement, and are not currently expected to have a material impact on 2016 financial results. The bank will publish its preliminary results for the 2016 financial year as scheduled on February 2, 2017.\nFor a short, plain-language summary in English, Spanish, French/Creole (Haitian), Chinese, Tagalog, Vietnamese and Korean of Deutsche Bank’s consumer relief commitment under its settlement with the Department of Justice, please click on the following\nPDF\nlink.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}