{
    "url": "https://www.db.com/news/detail/20161220-deutsche-x-trackers-rings-iconic-new-york-stock-exchange-opening-bell?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "December 20, 2016",
    "tags": [
        "Asset Management",
        "Corporate products"
    ],
    "title": "Deutsche X-trackers rings iconic New York Stock Exchange opening bell",
    "body": "Today, members of Deutsche Asset Management’s exchange-traded funds (ETFs) team rang the opening bell at The New York Stock Exchange to highlight two US Deutsche X-trackers funds: the Deutsche X-trackers USD High Yield Corporate Bond ETF (HYLB) and Deutsche X-trackers Russell 1000 Comprehensive Factor ETF (DEUS).\nDeutsche X-trackers has launched five funds in 2016, bringing its total number of US ETFs to 40. Launched less than two weeks ago, HYLB became the 40th and has been a resounding success, attracting more than USD 135 million in assets under management (AUM) (as of Dec. 16, 2016). The product is the most cost efficient(1)  high-yield ETF in the US market and allows investors to gain exposure to this asset class as part of their diversification strategy.\nWith nearly USD 48 million in AUM (as of Dec. 16, 2016), DEUS is part of the DWS US platform’s innovative comprehensive factor ETFs suite that debuted late last year. DEUS is linked to the Russell 1000 Comprehensive Factor Index, which is designed to track stocks displaying five factors: value, momentum, quality, low volatility and size.\n“Deutsche X-trackers has been a trailblazer in the ETF industry since we started building out the platform just four years ago,” said Fiona Bassett, Head of Passive Asset Management in the Americas. “Clients count on us for distinctive and relevant solutions that offer new and better risk-adjusted exposures and a greater value proposition for their portfolios. As a platform, we are still at the beginning of our journey in the crowded US marketplace. However, we are looking forward to continuing our progress and building on our achievements in 2017.”\nThis year, the Deutsche X-trackers team has earned several industry accolades, including the “Best ETF Issuer in 2015”(2) honour in the annual ETF.com awards. Bassett was named “Fund Leader of the Year”(3)  by Fund Action and Fund Directions and one of the “25 Most Powerful Women in Finance”(4)  for the second year running by American Banker.\n\nConsider the Fund’s investment objectives, risk factors, and charges and expenses before investing. This and other important information can be found in the Fund’s prospectus, which may be obtained by calling 1-855-DBX-ETFS (1-855-329-3837) or by viewing or downloading a prospectus at https://etfus.deutscheam.com. Please read it carefully before investing\nHYLB RISKS: Investing involves risk, including the possible loss of principal. Bond investments are subject to interest rate, credit, liquidity and market risks to varying degrees. When interest rates rise, bond prices generally fall. Credit risk refers to the ability of an issuer to make timely payments of principal and interest.\nForeign investing involves greater and different risks than investing in US companies, including currency fluctuations, less liquidity, less developed or less efficient trading markets, lack of comprehensive company information, political instability and differing auditing and legal standards. Funds investing in a single industry (or group of industries), country or in a limited geographic region generally are more volatile than more diversified funds. Investments in lower-quality (\"junk bonds\") and non-rated securities present greater risk of loss than investments in higher-quality securities.\nPerformance of the Fund may diverge from that of the Underlying Index due to operating expenses, transaction costs, cash flows, use of sampling strategies or operational inefficiencies. An investment in this fund should be considered only as a supplement to a complete investment program for those investors willing to accept the risks associated with that fund. See the prospectus for details.\nDEUS RISKS: Investing involves risk, including possible loss of principal. Stocks may decline in value. Funds investing in a single industry, country or in a limited geographic region generally are more volatile than more diversified funds. Because the fund seeks to provide exposure to stocks based on the following multifactors – value, momentum, quality, low volatility and size – it is expected exposure to such investment factors will detract from performance in some market environments, as more fully explained in the fund’s prospectus.\nPerformance of the Fund may diverge from that of the Underlying Index due to operating expenses, transaction costs, cash flows, use of sampling strategies or operational inefficiencies. An investment in any fund should be considered only as a supplement to a complete investment program for those investors willing to accept the risks associated with that fund. See the prospectus for details.\nDiversification can neither ensure a profit nor protect against a loss.\nDBX Advisors LLC is the investment adviser to the Deutsche X-trackers Funds. Deutsche X-trackers Funds are distributed by ALPS Distributors, Inc. ALPS Distributors, Inc. is not affiliated with DBX Advisors.\nNo bank guarantee | Not FDIC insured | May lose value\n© Deutsche Asset Management. All rights reserved. DBX002453 12.20.17\n(1) Deutsche Bank Research\n(2) ETF.com\n(3) www.eyeseverywhere.com\n(4) American Banker",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}