{
    "url": "https://www.db.com/news/detail/20161215-standard-und-poor-s-announces-creditwatch-for-german-banks?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "December 15, 2016",
    "tags": [
        "Company"
    ],
    "title": "Standard & Poor’s announces CreditWatch for German banks",
    "body": "Standard & Poor's (S&P) has placed German banks on ‘Creditwatch’ to reflect the German Bank Resolution Regime, or ‘bail-in’ law, which was passed last year and takes effect on 1 January 2017.\nDeutsche Bank’s long-term issuer credit rating is placed on ‘Creditwatch positive’ (possible upgrade):\n–   Reflects the increase in loss-absorbing buffers as a result of the bail-in law.\n–   Strengthens Deutsche Bank’s creditworthiness with the vast majority of customers.\n–   Deutsche Bank’s current rating: BBB+.\n–   Senior instruments not subject to bail-in would likely move in line with the long-term issuer rating.\nThe long-term issuer credit rating represents S&P’s forward-looking opinion of overall creditworthiness and capacity to meet financial commitments:\n–   The new bail-in law strengthens the position of depositors and virtually all counterparties.\n–   S&P is the only major rating agency which has not yet introduced depositor and counterparty ratings, but intends to do so next year.\nSenior unsecured debt of German banks is placed on Creditwatch developing (possible downgrade):\n–   Under the ‘bail-in’ law, senior unsecured debt is subject to bail-in.\n–   Deutsche Bank’s current rating: BBB+.\n–   Deutsche Bank’s plain-vanilla senior instruments would likely be treated as senior subordinated debt, with a rating of BBB-.\n–   This is not a Deutsche Bank-specific issue: it affects all German banks under the new legislation.\nDeutsche Bank’s ratings in both categories would remain investment grade if the Creditwatch were implemented.\nShort-term ratings remain unchanged at P-2.\nAll ratings remain at current levels at this point: the ‘Creditwatch’ will likely be resolved in the 1st quarter 2017.\nDeutsche Bank’s position has never been stronger than today:\n\n–   Depositors and counterparties are protected under the ‘bail-in’ law by a buffer of EUR 111 billion in total loss absorbing capacity or ‘TLAC’, approximately EUR 30 billion ahead of its 2019 requirement.\n\n–   Liquidity reserves are around EUR 200 billion, and have more than tripled in the post-crisis period.\n\n–   Shareholders’ equity is EUR 62 billion, and has almost doubled in the post-crisis period.\n\n–   Both credit loss provisions and market risk (VaR) are at historically low levels.\n\n–   Level 3 assets are down over 70% in the post-crisis period and non-core assets down over 90% since the formation of the Non-Core Operating Unit (NCOU).\n\n–   Deutsche Bank has a funding base of over EUR 900 billion, of which over 70% from the most stable sources, and the 2016 funding plan is complete.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}