{
    "url": "https://www.db.com/news/detail/20150226-deutsche-bank-marks-milestone-for-usd-83-million-microfinance-fund?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "February 26, 2015",
    "tags": [
        "Capital markets",
        "Company",
        "Investment Banking",
        "Strategy",
        "Sustainability"
    ],
    "title": "Deutsche Bank marks milestone for USD 83 million microfinance fund",
    "body": "Deutsche Bank’s Global Social Finance Group today announced the conclusion of the seven-year investment term, and the release of an assessment report, for its innovative USD 83 million microfinance fund (the Fund). The Fund provided financing to 21 microfinance institutions (MFIs) in 15 countries, enabling them to transition into more resilient, sophisticated and client-responsive financial institutions.\nThrough subordinated debt financing, the Fund helped the MFIs achieve institutional strengthening and portfolio growth, along with a more diverse offering of services at a lower cost. Subordinated, long-term debt is particularly meaningful to MFIs that are seeking to strengthen and leverage their balance sheets for growth and, in some instances, in order to qualify as formally regulated institutions.\n“Deutsche Bank’s consistent strategy has been to provide capital to enable high performing MFIs worldwide to responsibly grow in order to broaden their reach to provide the un-banked poor with high quality services,” said Gary Hattem, Head of the Global Social Finance Group, Deutsche Bank.\nUsing our capabilities as a global investment bank, Deutsche Bank is able to foster commercial sustainability of MFIs at different growth stages and to encourage a balance between financial and social objectives.\nGary Hattem, Head of the Global Social Finance Group, Deutsche Bank\nThe assessment report found that since receiving the Fund’s loan in 2007, the MFIs have been able to grow their portfolios more than threefold to USD 12.1 billion from USD 3.7 billion, while increasing their number of borrowers to 5.5 million from 2.2 million. The MFIs were able to double the median number of loan product types and kept their average loan size adapted to those most in need, demonstrating the MFIs’ commitment to serving a client base composed mostly of women and rural populations.\nDeutsche Bank was the first global bank to establish a socially motivated microfinance fund in 1997, managed by its Global Social Finance Group. Since then, the Bank partnered with more than 130 MFIs in more than 50 countries, benefitting as many as 3.8 million low-income entrepreneurs through USD 1.67 billion in financing.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}