{
    "url": "https://www.db.com/news/detail/20150225-deutsche-bank-hires-jeff-urwin?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "February 25, 2015",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank hires Jeff Urwin",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) announced today that it has hired Jeff Urwin, 59, as Co-Head of Corporate Banking & Securities and Head of Corporate Finance. Urwin will become a member of the Group Executive Committee and be based in New York.\nUrwin will join Deutsche Bank from J.P. Morgan where he is Co-Head of Global Banking. Urwin joined J.P. Morgan in 2008 as part of its acquisition of Bear Stearns which he joined in 1996.\nUrwin will lead Deutsche Bank’s investment banking division together with Colin Fan, 42, Co-Head of Corporate Banking & Securities and Head of Markets. Urwin succeeds Robert Rankin, who departed Deutsche Bank earlier this year to become Chief Executive Officer of Consolidated Press Holdings, an Australian investment holding company. Urwin will report to Anshu Jain, Co-Chief Executive Officer of Deutsche Bank.\nIn 2014 Deutsche Bank achieved a record market share across corporate finance products. For the year, Deutsche Bank ranked top five globally with a record market share of 5.4% (Dealogic).\nAnshu Jain, Co-Chief Executive Officer of Deutsche Bank, said: “I am pleased to welcome Jeff to Deutsche Bank. He is a trusted, long-time advisor to clients and an experienced team leader. Jeff’s decision to join us underscores our commitment to being a client-centric bank.”\nJeff Urwin, Co-Head of Corporate Banking & Securities and Head of Corporate Finance at Deutsche Bank, said: “I am excited by the opportunity to join Deutsche Bank and to work with my new colleagues whose commitment to client advisory work is evident. I thank my colleagues at J.P. Morgan for their enduring partnership and professionalism and wish them well.”\n\nFor further information please contact:\nDeutsche Bank AG\nPress & Media Relations\nKathryn Hanes\nPhone: +44 207 547 6941\nE-mail: kathryn.hanes@db.com\nMichele Allison\nPhone: +1 212 250 4735\nE-mail: michele.allison@db.com\nFrank Hartmann\nPhone: +49 69 910 42744\nE-mail: frank.hartmann@db.com",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 10
}