{
    "url": "https://www.db.com/news/detail/20150224-deutsche-bank-and-hewlett-packard-sign-agreement?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "February 24, 2015",
    "tags": [
        "Company",
        "Digitalisation"
    ],
    "title": "Deutsche Bank and Hewlett-Packard sign agreement",
    "body": "Deutsche Bank and Hewlett-Packard (“HP”) today announced a ten-year, multibillion dollar agreement that will further modernise the Bank’s global information technology (IT) environment and aims to significantly reduce related IT infrastructure costs.\nUnder the terms of the agreement, which mainly covers wholesale banking IT infrastructure, HP will provide dedicated data centre services on demand including storage, platform and hosting.\nDeutsche Bank will retain activities such as IT architecture, application development and information security.\nAs part of a wider IT transformation programme, Deutsche Bank will upgrade and reduce the number of its IT applications, move them on to the HP platform and enhance its own processes for providing technology support to its operations.\nHenry Ritchotte, Chief Operating Officer of Deutsche Bank, said: “This agreement enables Deutsche Bank to secure standardised, world-class IT infrastructure while lowering costs. Having a more modern and agile technology platform will further improve the Bank’s ability to launch new products and services and lay the foundation for the next phase of its digital strategy.”\nMeg Whitman, Chairman, President and CEO, Hewlett-Packard, said: “Deutsche Bank is taking a proactive approach to modernising its IT infrastructure and has chosen to partner with HP in order to do that. Through this partnership, Deutsche Bank will meet its long-term business objectives through a transformation of its IT infrastructure, including a customised HP Helion solution that will enable them to focus on creating and delivering new services for their clients.”\nMeg Whitman, Chairman, President and CEO, Hewlett-Packard, said: “Deutsche Bank is taking a proactive approach to modernising its IT infrastructure and has chosen to partner with HP in order to do that. Through this partnership, Deutsche Bank will meet its long-term business objectives through a transformation of its IT infrastructure, including a customised HP Helion solution that will enable them to focus on creating and delivering new services for their clients.”\n\nFor further information please contact:\nDeutsche Bank AG\nPress & Media Relations\nDon Hunter\nPhone: +44 782 782 0054\ne-mail: don.hunter@db.com\nNicolas Nonnenmacher\nPhone: +49 69 910 41749\ne-mail: nicolas.nonnenmacher@db.com\n\nHewlett-Packard\nEMEA\nAleanna Crane\nPhone: +44777 522 7174\ne-mail: acrane@hp.com\nAmericas\nMari Hancock\nPhone: +832 483 0519\ne-mail: mari.hancock@hp.com\n  About Deutsche Bank\nDeutsche Bank is a leading client-centric global universal bank serving 28 million clients worldwide. Deutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nAbout Hewlett-Packard\nHP creates new possibilities for technology to have a meaningful impact on people, businesses, governments and society. With the broadest technology portfolio spanning printing, personal systems, software, services and IT infrastructure, HP delivers solutions for customers’ most complex challenges in every region of the world. More information about HP (NYSE: HPQ) is available at http://www.hp.com.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}