{
    "url": "https://www.db.com/news/detail/20150217-deutsche-bank-continues-to-strengthen-infrastructure-in-the-us?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "February 17, 2015",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank continues to strengthen infrastructure in the US",
    "body": "Deutsche Bank today announced three appointments within Group Technology & Operations (GTO) in New York, all at the Managing Director level. These appointments reflect the Bank’s commitment to strengthening key infrastructure staff in order to meet regulatory and operational requirements globally. As previously announced, the Bank is hiring 500 employees in the US across various control functions as part of a group of 1,300 people dedicated to ensuring that its systems and controls are best in class.\nSteve Horn was appointed to lead GTO in the establishment of Deutsche Bank’s Intermediate Holding Company (IHC). He was previously Global Head of GTO Corporate Banking & Securities Clearing and Collateral Management.\nMaggie Parent joined as Head of GTO Corporate Technology, Americas. She is responsible for supporting technology for the Intermediate Holding Company (IHC) as well as overall regulatory reporting technology in the region. Parent joined from Credit Suisse, where she was the Chief Operating Officer for Investment Banking Technology. Previously, she was with Morgan Stanley for over 20 years where most recently she held the role of Chief Operating Officer for Global Technology and Operations, while serving as the Chief Information Officer for the Americas.\nSteven Rubel joined as Global Head of Collateral Operations and Americas Head of Markets Clearing and Listed Derivatives Operations. Rubel joins with over 30 years of collateral and derivatives experience. He was most recently Global Head of Collateral Management and Global Capital Markets Treasurer at AIG.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}