{
    "url": "https://www.db.com/news/detail/20221026-deutsche-bank-reports-on-the-third-quarter-of-2022?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 26, 2022",
    "tags": [
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank reports profit before tax of € 1.6 billion, its highest third quarter since 2006",
    "body": "Post-tax profit rises more than threefold year on year to € 1.2 billion\nPost-tax return on tangible equity (RoTE)1 of 8.2%, up from 1.5%\nCost/income ratio of 72%, down from 89% in the prior year quarter\nNet revenues rise 15% year on year to € 6.9 billion with growth in all core businesses\nCorporate Bank up 25% to € 1.6 billion\nInvestment Bank up 6% to € 2.4 billion\nPrivate Bank up 13% to € 2.3 billion\nAsset Management up 1% to € 661 million\nNoninterest expenses down 8% year on year to € 5.0 billion\nAdjusted costs ex-transformation charges and bank levies¹ up 4% to € 4.8 billion, down 1% year on year if adjusted for FX movements\nCore Bank pre-tax profit more than doubles year on year to € 1.8 billion\nPost-tax RoTE¹ of 9.9%, up from 3.9% in the prior year quarter\nCost/income ratio improves to 68%, down from 83% year on year\nCapital Release Unit: further de-risking and cost reduction in the quarter\nLeverage exposure reduced from € 29 billion to € 25 billion\nNoninterest expenses down 33% year on year to € 208 million\nCommon Equity Tier 1 (CET1) ratio of 13.3%, up from 13.0% in the second quarter\nFirst nine months: revenue and profit growth with progress toward key targets\nNet revenues up 7% year on year to € 20.9 billion\nPre-tax profit up 46% to € 4.8 billion, post-tax profit up 68% to € 3.7 billion\nPost-tax RoTE1 of 8.1%, up from 4.8% in the first nine months of 2021\nCost/income ratio of 73%, down from 82% in the prior year period\nProvision for credit losses of 24 basis points of average loans\nIn the third quarter and first nine months of 2022, we delivered our best profits in more than a decade for both these periods. This underlines the success of our transformation efforts. We have significantly improved Deutsche Bank’s earnings power and we are well on track to meet our 2022 goals. This reflects the outstanding efforts of our people. We have the strength to stand by our clients in a more challenging environment while growing returns to our shareholders.\nChristian Sewing, Chief Executive Officer\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today announced its highest third-quarter profit before tax since 2006. Profit before tax was € 1.6 billion for the third quarter of 2022, up nearly threefold compared to € 554 million in the prior year quarter, while post-tax profit was € 1.2 billion, up more than threefold from € 329 million in the third quarter of 2021. Profit growth reflected 15% year-on-year growth in net revenues together with an 8% reduction in noninterest expenses.  \nPost-tax return on average tangible shareholders’ equity (RoTE)¹ was 8.2%, up from 1.5% in the prior year quarter. Post-tax return on average shareholders’ equity (RoE) was 7.4% in the quarter, up from 1.4% year on year. The cost/income ratio improved to 72%, from 89% in the third quarter of 2021.\nFor the first nine months, profit before tax was € 4.8 billion, up 46%, and post-tax profit was up 68% to € 3.7 billion. Profit attributable to Deutsche Bank shareholders was up 80% to € 3.2 billion. Post-tax RoTE1 was 8.1%, in line with the bank’s full-year target and up from 4.8% in the first nine months of 2021, while post-tax RoE was 7.2%, up from 4.3%. The cost/income ratio improved to 73%, down from 82% in the prior year period. Results for the first nine months of 2022 included bank levies of € 747 million, up € 198 million, or 36%, over the prior year period.\n2022 is a landmark year for Deutsche Bank, we have delivered revenue and profit growth and built operating strength across all four of our core businesses in the year to date. We also saw the benefits of tight risk discipline, strong capital, and conservative balance sheet management. We have laid firm foundations for the next phase of our strategy through 2025. \nJames von Moltke, Chief Financial Officer\nCore Bank profit more than doubles in the third quarter\nThe Core Bank, which excludes the Capital Release Unit, produced third-quarter profit before tax of € 1.8 billion, up 104% year on year, driven by 14% growth in net revenues to € 6.9 billion combined with a 6% reduction in noninterest expenses to € 4.7 billion.  Adjusted costs ex-transformation charges and bank levies were up 6% to € 4.7 billion and up 2% if adjusted for FX movements. Post-tax RoTE1 was 9.9%, consistent with the Core Bank’s full year 2022 target of above 9% and up from 3.9% in the third quarter of 2021. Post-tax RoE was 8.8%, up from 3.4%. The Core Bank’s cost/income ratio was 68%, down from 83% in the prior year quarter.\nThe core businesses contributed as follows in the third quarter:\nCorporate Bank: profit before tax of € 498 million with post-tax RoTE¹ of 11.9% and a cost/income ratio of 63%\nInvestment Bank: profit before tax of € 813 million with post-tax RoTE¹ of 8.7% and a cost/income ratio of 60%\nPrivate Bank: pre-tax profit of € 447 million with post-tax RoTE¹ of 9.5% and a cost/income ratio of 73%\nAsset Management: pre-tax profit of € 141 million with post-tax RoTE¹ of 16.4% and a cost/income ratio of 72%\nFor the first nine months, Core Bank pre-tax profit grew 29% to € 5.6 billion and post-tax RoTE1 was 10.0%, up from 7.5% in the first nine months of 2021, driven by strong post-tax RoTE1 in all four core businesses for the first nine months of 2022. Post-tax RoE was 8.9%, up from 6.6% year on year. The cost/income ratio improved to 69%, from 76% in the prior year period.\nCapital Release Unit: continued portfolio reduction and P&L improvement\nThe Capital Release Unit maintained its progress on portfolio reduction. Leverage exposure was further reduced from € 29 billion to € 25 billion, and risk weighted assets (RWAs) from € 25 billion to € 24 billion, during the quarter. RWAs included operational risk RWAs of € 19 billion. The Capital Release Unit remains ahead of its year-end 2022 targets for both leverage exposure and RWA reduction. Since its creation in mid-2019, the Capital Release Unit has cut leverage exposure by € 224 billion, or 90%, while RWAs are down by € 40 billion, or 62%, and by 83% excluding operational risk RWAs.\nThe Capital Release Unit also delivered its 10th successive quarter of year-on-year loss reduction with a loss before tax of € 216 million, down 37% year on year. The improvement was driven primarily by a 33% year-on-year reduction in noninterest expenses, while adjusted costs ex-transformation charges were down 37% year on year to € 154 million. Net revenues were € 17 million negative, compared to € 36 million negative in the prior year quarter, reflecting lower impacts from de-risking, risk management and funding.\nRevenue growth across all core businesses\nNet revenues were € 6.9 billion, up 15% year on year and the highest third-quarter revenues since 2016. Revenue development in the bank’s core businesses was as follows:\nCorporate Bank net revenues were € 1.6 billion, up 25% year on year, the fourth consecutive quarter of double-digit revenue growth, reflecting increases in both net interest income and commission & fee income. Net interest income growth across all business areas was supported by rising interest rates and strong operating performance, with volume growth in loans and deposits. Revenues in Corporate Treasury Services were up 28%, Institutional Client Services revenues rose 22% and Business Banking revenues were up 15%. Gross loans were up € 10 billion, or 8%, and deposits rose by € 30 billion, or 11%, over the prior year quarter. For the first nine months, Corporate Bank net revenues were up 20% to € 4.6 billion.\nInvestment Bank net revenues were € 2.4 billion, up 6% year on year. Revenues in Fixed Income & Currencies (FIC) were up 38% to € 2.2 billion, with Rates revenues more than double the prior year quarter, significant growth in Emerging Markets and Foreign Exchange, and growth in Financing. Revenue growth in these businesses more than offset significantly lower revenues in Credit Trading. Revenues in Origination & Advisory were € 95 million, down 85% year on year; excluding mark to market losses in Leveraged Debt Capital Markets, revenues were down 63% year on year. These losses drove a significant year on year decline in Origination revenues, while Advisory revenues declined but by less than the industry fee pool (source: Dealogic). For the first nine months, Investment Bank net revenues were up 8%, over a strong prior year period, to € 8.3 billion.\nPrivate Bank net revenues were € 2.3 billion, up 13% year on year. Revenues were up 5% if adjusted for a reduction in forgone revenues from the ruling by the German Federal Court of Justice (BGH) in April 2021 regarding pricing changes on current accounts and higher revenues from Sal. Oppenheim workout activities. This growth was driven by strong net interest income, FX movements and continued new business volumes. Revenues in the Private Bank Germany were € 1.3 billion, up 8%, or essentially stable if adjusted for the reduced impact of the BGH ruling. International Private Bank revenues were € 977 million, up 22%, or 14% if adjusted for Sal. Oppenheim workout activities. Private Bank net new business volumes were € 12 billion in the quarter. This included net inflows into Assets Under Management of € 8 billion, including € 6 billion into investment products and € 2 billion into deposits, and net new client loans of € 4 billion. For the first nine months, Private Bank net revenues were up 7% to € 6.6 billion and net new business volumes were € 36 billion.\nAsset Management net revenues rose 1% year on year to € 661 million. This development was driven by a 3% rise in management fees to € 626 million and a 39% increase in performance and transaction fees to € 38 million. These more than offset the non-recurrence of Other revenues in the prior year quarter, due in part to lower gains from co-investments and negative movements in the fair value of guarantees. Net inflows were € 8 billion, driven by Alternatives and Cash products. Assets under management were € 833 billion at quarter-end, down 5% versus € 880 billion in the prior year quarter but essentially flat from the second quarter, as net inflows and favorable FX movements offset lower market valuations. For the first nine months, net revenues were up 4% to € 2.0 billion.\nFor the first nine months, net revenues were € 20.9 billion for both Core Bank and Group, up 7%, the highest nine-month net revenues since 2016. Deutsche Bank affirmed that continued strong performance presents upside to the Group’s full year 2022 revenue guidance range of € 26 billion to € 27 billion.\nReductions in noninterest expenses in the quarter and year to date\nNoninterest expenses were € 5.0 billion in the quarter, down 8% year on year. This development partly reflected a significant reduction in transformation charges compared to the prior year quarter which included contract settlements and software impairment charges related to cloud migration. Adjusted costs ex-transformation charges and bank levies1 were € 4.8 billion, up 4% year on year, or down 1% if adjusted for FX movements.\nFor the first nine months, noninterest expenses were down 5% to € 15.2 billion. Higher bank levies were more than offset by lower transformation charges and restructuring and severance compared to the prior year period, as Deutsche Bank neared completion of its transformation programme. Adjusted costs ex-transformation charges and bank levies were € 14.2 billion, up 1%, and down 2% if adjusted for FX movements.\nThe workforce was 84,556 full-time equivalents (FTEs) at the end of the quarter, up from 82,915 at the end of the second quarter, an increase of 1,641 FTEs. Approximately 80% of this increase was driven by 749 graduate hires and 547 FTEs relating to continued internalisations of external staff.\nProvision for credit losses was € 350 million in the quarter, up from € 117 million in the prior year quarter. Provision for performing (stage 1 and 2) loans was € 13 million, compared to net releases of € 82 million in the prior year period, reflecting more challenging macroeconomic forecasts, largely offset by a reduction in overlays applied in previous periods and by improved portfolio parameters. Provision for non-performing (stage 3) loans was € 337 million, up from € 199 million in the prior year quarter, reflecting specific impairment events.\nProvision for credit losses was 28 basis points of average loans on an annualized basis in the quarter, and 24 basis points for the first nine months of 2022. Deutsche Bank reaffirmed its guidance for provision for credit losses of around 25 basis points for the full year 2022.\nContinued reduction in Russia Exposure\nDeutsche Bank further reduced its Russian credit exposures during the third quarter. Additional contingent risk was reduced to € 0.2 billion, down from € 0.6 billion at the end of the second quarter. This comprised undrawn commitments of € 0.2 billion, largely mitigated by Export Credit Agency coverage and contractual drawdown protection and guarantees of € 0.1 billion. Gross loan exposure was reduced from € 1.3 billion to € 1.0 billion, while net loan exposure was € 0.5 billion. In 2022 to date, additional contingent risk is down 83% and net loan exposure down 19%.\nCapital and Liquidity remain in line with goals\nThe Common Equity Tier 1 (CET1) capital ratio was 13.3% at the end of the third quarter, up from 13.0% at the end of the second quarter, above the bank’s target minimum of 12.5%. The quarter-on-quarter development net of FX movements largely reflected RWA reductions, notably in market risk and credit risk RWAs, and the positive impact on capital from strong third-quarter earnings, partly offset by deductions for dividends and Additional Tier 1 capital (AT1) coupons.\nThe Leverage ratio was 4.3% in the quarter, essentially unchanged from the second quarter. A negative impact from FX movements was offset by the positive impact of third-quarter earnings net of deductions for dividends and AT1 coupons.\nLiquidity reserves were € 262 billion at the end of the third quarter, up from € 244 billion at the end of the second quarter, including High Quality Liquid Assets of € 227 billion, up from € 207 billion during the quarter. The Liquidity Coverage Ratio was 136%, above the regulatory requirement of 100% and a surplus of € 60 billion. The Net Stable Funding Ratio was 116%, within the bank’s target range of 115-120% and implying a surplus of € 85 billion above required levels.\nSustainable Finance: volumes close to full-year target\nESG-related financing and investment volumes² during the third quarter were € 6 billion, and the cumulative total since January 1, 2020, was € 197 billion for the Deutsche Bank Group ex-DWS, close to the bank’s year-end 2022 target for a cumulative total of € 200 billion.\nTotals by business, during the third quarter and cumulative since January 1, 2020, were as follows:\nCorporate Bank: € 3 billion in sustainable financing, bringing the Corporate Bank’s cumulative total to € 35 billion\nInvestment Bank: € 9 billion in sustainable financing and capital market issuance, for a cumulative total of € 115 billion\nPrivate Bank: volumes declined by € 5 billion during the quarter, as growth in ESG investment volumes was more than offset by the implementation of the new MiFID II regulation, introduced in August 2022, which led to a net negative adjustment as certain assets were reclassified from the existing Sustainable Finance Disclosure Reporting (SFDR) methodology. The bank expects a portion of this impact to reverse in the fourth quarter as reclassification to the new MiFID standards nears completion. ESG loan volumes were essentially flat during the quarter. The Private Bank’s cumulative total at quarter end was € 47 billion, comprising € 10 billion in loans and € 37 billion in ESG investments.\nCommitment to net zero targets in carbon-intensive industries\nOn 21 October, Deutsche Bank published its net zero targets for financed emissions in key industry sectors in its corporate loan book. These targets identify percentage reductions by 2030 and 2050 in four carbon-intensive sectors: upstream oil & gas, power generation, automotive and steel. The targets cover sectors accounting for a significant proportion of financed emissions of the bank’s € 250 billion corporate loan book³ as well as key sources of global Scope 3 emissions of clients.\nThe bank aims to achieve these targets by supporting clients in carbon-intensive industries, and financing their transition strategies, on the path to achieving net zero emissions by 2050* in accordance with the Paris Agreement on Climate Change. Deutsche Bank’s methodology aims to support a progressive and orderly phase-out of fossil fuel usage while incentivizing the financing of lower carbon-intensity technologies and clients with credible transition plans.\nFurther details of Deutsche Bank’s net zero targets, methodologies and activities planned for 2023 can be found here.\nGroup results at a glance\n¹For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ on pp 17-25 of the third quarter 2022 Financial Data Supplement and “Non-GAAP financial measures” on pp. 48-55 of the third quarter 2022 Earnings Report, respectively\n²Cumulative ESG volumes include sustainable financing (flow) and investments (stock) in the Corporate Bank, Investment Bank and Private Bank from January 1, 2020, to date, as set forth in Deutsche Bank’s Sustainability Deep Dive of May 20, 2021. Products in scope include capital market issuance (bookrunner share only), sustainable financing and period-end assets under management. Cumulative volumes and targets do not include ESG assets under management within DWS, which are reported separately by DWS.\n³Gross loans and commitments as at December 31, 2021\nRead the \nPDF\nfull media release as PDF document\nFurther details on third quarter performance in Deutsche Bank’s businesses are available in the Earnings Report as of September 30, 2022.\nAn analyst call to discuss third quarter 2022 financial results will take place at 13:00 CET today. The Earnings Report, Financial Data Supplement (FDS), presentation and audio webcast for the analyst conference call are available at: www.db.com/quarterly-results\nA fixed income investor call will take place on October 28, 2022, at 15:00 CET. This conference call will be transmitted via internet: www.db.com/quarterly-results",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 84
}