{
    "url": "https://www.db.com/news/detail/20221021-deutsche-bank-publishes-targets-for-carbon-footprint-reduction?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, October 21, 2022",
    "tags": [
        "Sustainability"
    ],
    "title": "Deutsche Bank publishes targets for carbon footprint reduction",
    "body": "Deutsche Bank today announced net zero aligned targets for 2030 and 2050 in four carbon-intensive sectors. The bank’s goal is to reduce the amount of financed emissions (Scope 3) significantly by 2030. The targets represent a core element of Deutsche Bank’s sustainability strategy and reflect the bank’s commitments as a founding member of the Net Zero Banking Alliance (NZBA).\nDeutsche Bank’s methodology, which is designed to be in line with emerging best practice, aims to support a progressive and orderly phase-out of fossil fuel usage while incentivizing the financing of lower carbon-intensity technologies and clients with credible transition plans.\nNet zero targets in four key sectors\nDeutsche Bank’s targets cover sectors accounting for a significant proportion of financed emissions of its € 250 billion corporate loan book1 as well as key sources of global Scope 3 emissions of clients. Targets for each sector are as follows:\nOil & Gas (Upstream): 23% reduction in Scope 3 upstream financed emissions by 2030, and 90% reduction by 2050, in millions of tonnes of CO2\nPower generation: 69% reduction in Scope 1 physical emission intensity by 2030 and 100% reduction by 2050, in kilogrammes of CO2 equivalent per megawatt hour\nAutomotive (light duty vehicles): 59% reduction in tailpipe emission intensity by 2030 and 100% reduction by 2050, in grammes of CO2 per vehicle kilometre\nSteel: 33% reduction in Scope 1 and 2 physical emission intensity by 2030 and 90% reduction by 2050, in kilogrammes of CO2 equivalent per tonne\nSupporting client-specific transition plans\nThe bank aims to achieve these targets by advising clients in carbon-intensive industries and financing their transition strategies/efforts on the path to achieving net zero emissions by 2050.  “This is an important step to reduce the carbon footprint of our loan book progressively”, said Chief Sustainability Officer Jörg Eigendorf. “We are focusing on supporting our clients on their net zero journey. This is a crucial element of our sustainability strategy.”\nMethodology prioritizes highest-intensity sectors\nDeutsche Bank’s target-setting approach is aligned with the United Nations Environmental Programme Finance Initiative (UNEPFI) and the Glasgow Financial Alliance for Net Zero (GFANZ) principles and guidelines.\nThe bank’s science-based emission reduction pathways have been calculated using the International Energy Agency’s net zero emission scenario which limits global warming to no more than 1.5oC above pre-industrial levels by 2100. The scenario assumes that negative emission technologies, such as carbon capture and storage, offset small residual emissions in certain sectors. \nDeutsche Bank’s impact-based approach prioritizes the highest-intensity sectors and uses sector-specific metrics covering Scope 1, 2 or 3 emissions as appropriate. The bank will continue to follow the PACTA-based approach for the automotive, power generation and steel sectors, and has switched to a Scope 3 (upstream) financed emission approach for the oil & gas sector. \nThese targets will be embedded into the bank’s existing governance structures and risk appetite frameworks.\nNext steps\nThe net zero targets announced today form part of the sustainability implementation timeline outlined by Deutsche Bank at its\nPDF\nSustainability Deep Dive on May 20, 2021. In March 2023, Deutsche Bank intends to publish updates on financed emissions and pathway alignments for the year 2022 as part of the bank’s Non-Financial Report. Throughout 2023, the bank aims to further expand net zero target-setting to other carbon-intensive sectors.\nFurther information on the methodology can be found in Towards Net Zero Emissions (March 2022), available on\nPDF\ndb.com.\n¹Gross loans and commitments as at December 31, 2021. Clients in scope account for approximately 13% of Deutsche Bank’s total corporate loan commitments and approximately 50% of Scope 1 and 2 financed emissions. In addition, Oil & Gas and Automotive are key sources of global Scope 3 emissions.\n ",
    "number_of_ratings": 27,
    "rating": 1.5,
    "likes": 113
}