{
    "url": "https://www.db.com/news/detail/20221017-deutsche-bank-and-smart-are-cooperating-on-online-payment-for-the-new-smart-1?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, October 17, 2022",
    "tags": [
        "Corporate products"
    ],
    "title": "Deutsche Bank and smart are cooperating on online payment for the new smart #1",
    "body": "The smart #1 makes buying a car as easy, safe and convenient as shopping for clothes on the internet\nOnly 6 steps to the purchase of the first all-electric smart compact SUV\nPre-order phase starts on October 18, 2022\nWith the new smart #1, smart is not only breaking new ground in terms of technology and design. The company is also taking a completely new approach to sales. The next generation of all-electric vehicles will not only be available in stationary trade - customers can also configure their smart #1 completely online and buy it online in just 6 steps.\nTo ensure that payment processing works just as smartly, Deutsche Bank is now a strong partner on board: Just in time for the start of the pre-order phase on October 18, 2022, on the way to the market launch in Germany in December 2022, Deutsche Bank is taking over European payment transactions and offering potential customers on smart's e-commerce platform, tailor-made payment options.\nsmart and Deutsche Bank are making direct online sales easier than ever: With just a few clicks, customers can order their smart #1 on the smart eCommerce platform and immediately receive the appropriate payment processing. In addition to setting up the payment interface for buyers, Deutsche Bank handles incoming payments, management of payment flows, verification of new providers on the platform (e.g. providers of wallbox home chargers) and transfers to providers throughout Europe. In general, the payment methods direct transfer and manual bank transfer are possible when purchasing via the smart eCommerce platform. All payments run through the bank's own systems - this leads to a high level of transaction security and thus strengthens customer confidence in the new type of online direct sales.\nComplete transaction takes place digitally — only 6 steps necessary\nPre-orders and reservations for the new smart will be possible on the smart eCommerce platform from October 18, 2022. Delivery and sales will start in Germany in December 2022. France, Italy and other European countries will follow in 2023. On the smart eCommerce platform, customers have the option of buying or leasing their new smart #1. No matter which model the customer chooses: the entire transaction takes place digitally. In addition, interested parties do not have to click through long menus: the entire purchase process can be completed in just 6 steps. And, of course, smart customers still have the opportunity at any time to get to know and buy the smart #1 for a test drive on site from a sales or service partner of their choice.\nSecurity and privacy are top priorities\nBoth partners use appropriate technical and organisational measures to ensure the secure handling of data. Be it via the eCommerce platform by smart or the online payment offered by Deutsche Bank. The partners go hand in hand when it comes to data protection and data security.\nBuy the smart #1 conveniently, easily and securely online\n\"Together with Deutsche Bank and our leasing partner, we are making direct car sales as convenient, simple and secure as shopping on the Internet,\" says Martin Günther, CFO at smart Europe. \"On our eCommerce platform, our customers configure their smart, decide whether to buy or lease and, if they wish, for the appropriate financing.\"\nDeutsche Bank wants to grow with online marketplaces\nThrough the cooperation with smart, Deutsche Bank is continuing its strategy of establishing itself as a comprehensive financial service provider for digital marketplaces. \"Especially in the area of mobility, there is currently an enormous need for innovative payment methods on the part of digital marketplace providers and automobile manufacturers - the potential for banks that offer intelligent processing solutions is correspondingly large,\" says Ole Matthiessen, Head of Cash Management at Deutsche Bank. “Direct sales by automobile manufacturers will continue to gain in importance in the future. Banks ensure quick and uncomplicated payment – across currency borders.”",
    "number_of_ratings": 23,
    "rating": 1.6,
    "likes": 74
}