{
    "url": "https://www.db.com/news/detail/20221017-zurich-italy-and-deutsche-bank-complete-the-acquisition-of-deutsche-bank-financial-advisors-by-zurich?language_id=1",
    "language": "DE",
    "article_type": "Media Release Italy",
    "publish_date": "October 17, 2022",
    "tags": [
        "Wealth"
    ],
    "title": "Zurich Italy and Deutsche Bank complete the acquisition of Deutsche Bank Financial Advisors by Zurich",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) and Zurich Italy have completed the acquisition of Deutsche Bank Financial Advisors business by Zurich. Under the terms of the agreement signed in August 2021, 1,085 Financial Advisors, 96 employees, and over €16 bn in assets under management will pass to Zurich Bank.\nIn addition, the partnership between the two institutions in Italy continues: Deutsche Bank will provide banking products and services to Zurich Bank, for the benefit of customers and financial advisors – at the same time, Zurich Italy will continue to distribute its insurance offer through Deutsche Bank branches.\nGiovanni Giuliani, Country CEO of Zurich in Italy, said \"the creation of Zurich Bank allows Zurich to further strengthen its presence in the Italian market, which remains a key country for the Group. Zurich Bank's new network of financial advisors will contribute substantially to the further development of Zurich's distribution channels, which will now be able to count on two realities of excellence working in synergy: advisors for the financial side and agents for the insurance side.\"\nRoberto Parazzini, Chief Country Officer Italy, Deutsche Bank added: \"the closing of this transaction represents a new important step in the transformation and strategic re-focusing of Deutsche Bank's activities in Italy, in particular of the International Private Bank division, which is focusing its investments to become a reference bank for entrepreneurs and their families and a premium bank for affluent clients, while enhancing its already strong presence in the consumer credit and B2B services sectors\".",
    "number_of_ratings": 3,
    "rating": 5.0,
    "likes": 57
}