{
    "url": "https://www.db.com/news/detail/20221012-moody-s-further-upgrades-deutsche-bank-s-ratings?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 12, 2022",
    "tags": [
        "Company"
    ],
    "title": "Moody’s further upgrades Deutsche Bank’s ratings",
    "body": "The rating agency Moody’s today announced that it has upgraded all of Deutsche Bank’s long-term ratings by one notch. Our long-term deposit ratings and senior unsecured debt ratings have both been upgraded from A2 to A1 with a stable outlook, their highest level since 2012, while our Baseline Credit Assessment (BCA) is now at its highest since 2014.\nThis represents the fourth successive upgrade of Deutsche Bank by leading rating agencies, and the second upgrade by Moody’s, in the past fourteen months. The agency sees Deutsche Bank as well placed to face the headwinds in the current environment.\n“I am delighted that a key stakeholder has, once again, recognised Deutsche Bank’s progress on the path of transformation,” Christian Sewing, Chief Executive Officer, said. “Thanks to the outstanding efforts of our people, we have built a strong platform to help us steer our clients through more challenging conditions.”\nJames von Moltke, Chief Financial Officer, added: “Disciplined execution of our strategy is paying off. Higher earnings power, strong risk management, sound capital and balance sheet quality have all contributed to this highly encouraging result.”\nDrivers of this upgrade: Deutsche Bank’s progress in meeting targets…\nMoody’s made clear that this upgrade reflected Deutsche Bank’s “progress towards meeting its medium-term targets, in particular by being able to sustain improved … profitability.” The agency added: “Moody’s expects that DB’s meaningfully reduced expense base should allow the bank to safeguard operating leverage in times of temporarily higher inflation and, thereby, defend its regained earnings strength.”\n… and well positioned in a challenging environment\nMoody’s saw Deutsche Bank’s business model as well placed to face a more challenging macro-economic environment. The agency continued: “Further, recent interest-rate hikes have improved the prospects for higher returns within the bank’s core lending businesses conducted in its retail and corporate banking segments despite expectations of at least a normalization in the cost of risk.”\nKey factors: high quality funding and strong risk management…\nMoody’s mentioned other factors as key drivers of this upgrade, including Deutsche Bank’s “high quality deposit base as well as … the bank’s prudent and well controlled risk appetite that is likely to result in a sound and relatively stable asset quality through the cycle.” The agency noted: “DB has reserved € 5.0 billion in allowances for potential loan losses … this buffer will help dampen the impact on profitability and capital that may arise from a sharper-than-anticipated deterioration in asset quality.”\n… and robust capital and balance sheet management\nMoody’s added: “Further, DB has maintained solid capital and liquidity metrics, additionally supporting its improved credit profile.”\n  Deutsche Bank’s principal ratings with leading rating agencies are now as follows:",
    "number_of_ratings": 26,
    "rating": 4.7,
    "likes": 62
}