{
    "url": "https://www.db.com/news/detail/20221012-jin-yee-young-appointed-head-of-the-international-private-bank-asia-pacific?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 12, 2022",
    "tags": [
        "Asia-Pacific",
        "Wealth"
    ],
    "title": "Jin Yee Young appointed Head of the International Private Bank Asia Pacific",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today announced the appointment of Jin Yee Young as Head of the International Private Bank (IPB) Asia Pacific (APAC) on January 3, 2023, subject to relevant regulatory approvals. Based in Singapore, Young will also join the IPB’s global executive committee.\nClaudio de Sanctis, Head of the IPB and CEO EMEA said, “In Jin Yee Young we have found an outstanding leader to take the IPB in APAC to the next level. Throughout her distinguished career, Jin Yee has proven herself a strong and effective leader. As one of the most well-respected private bankers in Asia, she possesses all the skills and deep market knowledge needed to run our business. Already one of the top Ultra High Net Worth Wealth Management franchises in Asia, coupled with our highly regarded India business, we have strong ambitions to propel our business further into its next phase of growth. Our goal in this dynamic region is to become the leading financial institution for entrepreneurs and their families leveraging the full Deutsche Bank offering. I wish Jin Yee every success.”\nYoung joins Deutsche Bank with over 25 years of Wealth Management (WM) experience, most recently as Deputy CEO WM APAC and Head of WM for Singapore, Deputy CEO Singapore Branch and CEO for SymAsia Foundation at Credit Suisse. Prior to these roles, she has held senior leadership positions including Market Group Head for Singapore & Malaysia and South Asia Switzerland, and various leadership roles in markets such as Indonesia, Taiwan, China, Hong Kong & Japan.  Prior to joining Credit Suisse, she was with DBS Private Bank and Citibank Singapore.\nAfter six years as Head of our WM and IPB APAC businesses, Lok Yim will focus on his role as Chief Executive Officer of Deutsche Bank HKSAR, effective January 3, 2023.\n“Lok Yim has been instrumental in developing the bank’s Asia Pacific WM client business and positioning it for continued growth in the years ahead,” de Sanctis said. “He has been responsible for transforming Deutsche Bank’s wealth business in the region, working in a strong and productive partnership with all our business and infrastructure partners. As we transition our business to its next stage of growth, we are pleased to continue working closely with Lok in enhancing our contribution to the bank’s broader Hong Kong platform.”\nAsia Pacific CEO and Member of the Management Board Alexander von zur Muehlen added, “Wealth Management continues to be a cornerstone of our offering for clients in the Asia Pacific region, and a critical growth driver for our platform. In Hong Kong, one of our most important hubs globally, the close partnership between our wealth management, investment bank, and corporate bank businesses is a unique advantage in serving the needs of our sophisticated client base. Pulling together the full suite of our product capability across divisions as well as the power of our entire global network for our clients is a particular strength of Lok’s. Under his continued leadership, we are confident that our Hong Kong platform will continue to strengthen and grow.”",
    "number_of_ratings": 8,
    "rating": 4.5,
    "likes": 10
}