{
    "url": "https://www.db.com/news/detail/20221012-deutsche-bank-and-fiserv-launch-vert-germany-s-newest-payments-company?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 12, 2022",
    "tags": [
        "Corporate products"
    ],
    "title": "Deutsche Bank and Fiserv launch Vert, Germany’s newest payments company",
    "body": "Vert offers full-service payment acceptance solutions for merchants via mobile devices, apps and at the checkout\nVert continues to invest to meet the emerging needs of today’s merchants\nDeutsche Bank and Fiserv, a global leader in payments and financial services technology, have launched Vert, a comprehensive payment acceptance and banking services provider to small and medium-sized enterprises (SMEs). Vert is the only German provider to combine payment acceptance and processing and traditional banking solutions, meeting market demand for an integrated offering and streamlining access to innovative products for merchants of all sizes. Vert also provides next-banking-day pay-outs, providing merchants with faster access to their funds.\nMerchants are seeking user-friendly, integrated solutions that enable them to accept payments and move and manage money. Vert clients benefit from an offering that includes faster payments, modern technology, acceptance of common payment types and an online dashboard providing transaction data and other business reports.\n“By combining the strength of Deutsche Bank, Germany’s largest bank, with Fiserv, the world’s largest merchant acquirer, we can provide our Vert members with a secure, fast and technologically advanced payment acceptance solution,\" said Thorsten Woelfel, Managing Director Sales & Product at Vert.\n“Our mission is to help our members grow and get the best out of their business,\" added Gert Vido, Managing Director Shared Services at Vert.\nInitially, Vert offers three solutions, suitable for a wide range of businesses, from mobile food trucks and brick-and-mortar restaurants to retailers and medical offices.\nClover Flex is a mobile-optimised, full-featured and portable payment device that makes it possible for merchants to accept a broad range of payments and better manage their business. Clover Flex offers a tip function and apps that facilitate business management.\nThe Go by Vert app allows a merchant to use their own Android smartphone or tablet as a contactless payment terminal. Merchants can receive contactless payments in seconds – anywhere, anytime. Vert also offers secure PIN entry, the sole such solution in the German market, meaning merchants can accept payments above contactless-only limits.\nThe PAX A50 is a portable and robust card reader that enables merchants to accept card payments at the counter and at the table without having to carry around a heavy device.\nVert plans to continuously expand its product range, with solutions for online payment acceptance and for currency conversion coming soon.\n“Vert brings together the expertise of two market leaders in cash management and payment acceptance technology. In co-operation with Vert, we can provide accounts, payment solutions and banking services to our SME customers,” said Kilian Thalhammer, Head of Merchant Solutions at Deutsche Bank. \n\"With a unique combination of payment and banking capabilities, Vert is already helping small and mid-sized enterprises in Germany do business more easily, with less complexity,\" said John Gibbons, Head of EMEA at Fiserv. “We look forward to helping thousands of merchants streamline their operations and continue to delight their customers.”\nFeatures of Vert include:\nPayment on the next banking day, meaning faster access to money\nFuture-facing Android operating system solutions\nAcceptance of the most common payment methods, meaning merchants can sell more\nA single merchant portal with a complete overview of all transactions, invoices and reports\nExceptional customer service and telephone advice for business guidance\nSecure payments and data via partnership with Deutsche Bank\nNo hidden fees, so no surprises\nDeutsche Bank, together with its Postbank and Fyrst brands, has around 800,000 SMEs who will be able to access the new solutions, with some merchants already live. Vert expects rapid growth within its existing customer base. Vert’s services are also available to non-Deutsche Bank customers and the bank expects to attract new business clients in other areas as payment behavior is likely to continue to develop towards cashless payments in the future. According to a survey by Deutsche Bundesbank in 2017, 74% of respondents preferred to pay with cash. Since then, the proportion has fallen by 14 percentage points to 60% in 2021.\nFurther information about Vert can be found on the vert website.\nFor further information please contact:\nDeutsche Bank AG\nHeinrich Froemsdorf\nT. +49 69 91047689\nM. heinrich.froemsdorf@db.com                                                                \nFiserv\nMarkus Juhrs\nT. +49 911 945 8134\nM. markus.juhrs@fiserv.com\nVert – Deutsche Bank Partner\nVaniti A. Paul \nT. +49 69 7941 4013\nM. vaniti.paul@vert.de ",
    "number_of_ratings": 11,
    "rating": 3.8,
    "likes": 24
}