{
    "url": "https://www.db.com/news/detail/20221012-supporting-a-sustainable-dream?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 12, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Supporting a sustainable dream",
    "body": "Partnering with the Swades Foundation, Deutsche Bank helped transform Vihule village in Maharashtra, India into a Dream Village. Each household in the village now has access to drinking water, healthcare, sanitation, insurance, banking facilities and an assured source of income. To ensure self-sufficiency, the villagers have set up a development committee which will be responsible for maintaining and caring for their homes and village. Through the CSR In The Community programme the bank has been a significant partner in transforming the village.\nSupporting the dream\nThe journey of Vihule’s transformation to a Dream Village began six years ago, when even amenities required for a basic standard of living were not available. Over the years, the bank provided drinking water to all 104 households in the village through the installation of a tap in every home. Households were also provided with water for agriculture and water connections were installed in the government school and the Anganwadi, a childcare centre, as well. The bank collaborated with Swades Foundation to setup solar-powered water pumps to draw water from two existing bore wells and helped construct a ground water reservoir for supply through the year. To create a sustainable ecosystem, the bank also helped plant orchards in the village.\nThe inauguration of a dream\nTo commemorate the occasion, over 25 volunteers visited the inauguration ceremony and planted saplings towards further beautification of the village. Atinkumar Saha, Head of Wealth Management India said, “Very few places in India — urban or rural — can truly call themselves sustainable. Through our long-standing partnership with Swades Foundation we have provided water using solar pumps, which is an integral part of their sustainable development. We look forward to helping many more people achieve their dream of a self-sufficient lifestyle.”",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 2
}