{
    "url": "https://www.db.com/news/detail/20221004-deutsche-bank-named-the-banker-magazine-s-investment-bank-of-the-year-for-western-europe?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 4, 2022",
    "tags": [
        "Europe",
        "Investment Banking"
    ],
    "title": "Deutsche Bank Named The Banker Magazine’s Investment Bank of the Year for Western Europe",
    "body": "Deutsche Bank has been named ‘Investment Bank of the Year for Western Europe’ at The Banker’s Investment Banking Awards 2022.\nThe Banker Magazine said:\n“The accolades are awarded for the 12 months to July 2022, which was certainly a year of two halves. The last six months of 2021 saw markets really hitting their stride. Equity markets enjoyed a particularly good run and merger activity was effervescent. The buoyant mood ended in the new year, when Russia invaded Ukraine. Volatility returned to financial markets and energy prices soared. After years of slumber, inflation was back on the agenda and central banks began to raise interest rates.”\nAcknowledging Deutsche Bank’s gains, the Banker Magazine said:\n“Deutsche Bank has amassed the gains made since its 2019 restructuring and then some. It has not only grown revenues in key business lines but has also increased market share in some areas.”\nOn equities they noted that despite exiting the equities trading business, the bank has proved highly successful in providing capital markets advisory services. The piece highlighted that year to date, Deutsche Bank has led two out of three of the largest western European ECM deals, including Air France KLM’s €2.3bn capital increase and the €1.8bn accelerated bookbuild of Nordea Bank by Sampo and further stated the bank “remains a leading bank for mergers and acquisitions, where first-quarter revenues for 2022 grew by more than 80%.”\nTurning their attention to the debt capital markets franchise, The Banker observed that even though the fee pool is down, Deutsche Bank has managed to grow its fee share in the year to date against 2021 and climb the ranks in both sovereign supranational and agency (reaching second last year) and financial institutions group issuance. Notable deals the magazine referenced included the EU’s €12bn inaugural green bond and Generali’s €500m green Tier 2. The Banker also recognized Deutsche Bank’s strong track record in leveraged finance globally, highlighting that in 2021, the bank was active on a total of 47 transactions in the leveraged finance market, primarily as the lead bank. \nHenrik Johnsson, Deutsche Bank’s Co-head of Capital Markets and Investment Banking EMEA, said: “We are very pleased to win this for the second year in a row - congratulations to all the teams across our platform.” Berthold Fuerst, Global Co-head of M&A at Deutsche Bank, added: “This award is testament to everyone’s hard work, energy and determination, as well as our ongoing commitment to deliver for our clients, even in the most challenging of market environments.”",
    "number_of_ratings": 11,
    "rating": 3.9,
    "likes": 13
}