{
    "url": "https://www.db.com/news/detail/20160324-deutsche-bank-names-new-chief-governance-officer?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 24, 2016",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank names new Chief Governance Officer",
    "body": "Deutsche Bank announced today that its Management Board has decided to create an expanded Global Governance function which will bring together a number of existing functions and teams.\nThe new function will be led by Florian Drinhausen, who will assume the role of Chief Governance Officer on 1 April 2016, reporting to Karl von Rohr. He will succeed Daniela Weber-Rey, who will leave the Bank to pursue new professional opportunities.\nUnder the leadership of Daniela Weber-Rey, corporate governance at Deutsche Bank was substantially enhanced over the past three years. As part of the “House of Governance” project, she and her team simplified the Bank’s committee structures and implemented a clear set of rules with defined accountabilities. At the same time, she created a conceptual framework for assigning duties and accountabilities and established a stronger understanding of the need for robust corporate governance and its anchoring in the Bank’s organizational structures.\n“I would like to express my sincere gratitude to Daniela Weber-Rey for her personal commitment, pioneer work and achievements on behalf of the Bank,” said Karl von Rohr, member of the Management Board of Deutsche Bank. “This work constitutes a valuable foundation. Now is the time to move to the next stage and further simplify accountabilities, organizational structures and decision-making processes.”\nAll functions that have responsibility for governance matters will now be integrated. This new Global Governance function will unite not only the global and regional governance departments but also the Corporate Secretariat and the Office of the Supervisory Board.\nFlorian Drinhausen joined Deutsche Bank in 2014 and is currently Regional Co-General Counsel for Germany. Before joining the Bank, he was a partner at Linklaters LLP for ten years with responsibility for Corporate Governance and M&A.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}