{
    "url": "https://www.db.com/news/detail/20160324-a-message-from-john-cryan-and-juergen-fitschen-to-deutsche-bank-employees?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 24, 2016",
    "tags": [
        "Company",
        "Management & Leadership",
        "Strategy"
    ],
    "title": "A message from John Cryan and Jürgen Fitschen to Deutsche Bank employees",
    "body": "Dear Colleagues,\nWe are approaching what for many of you will be a holiday weekend. We would like to take this chance to look back on the year’s first quarter, and look forward to what we can expect in the next three months.\nThe first three months of 2016 saw challenging business conditions, driven in good measure by concerns over the global economy and volatile financial markets. It was also a quarter in which we continued to make progress on many fronts with the execution of our strategy. We will see that progress come to the fore.\nFor example, our new Deutsche Bank mobile app will be a highlight of the second quarter. We’ll launch it in April, and place Deutsche Bank at the forefront of digital banking. The Deutsche Bank Mobile app makes us unique on the market. It enables our clients to make payments or transfer money faster and more easily than ever. With fingerprint technology, we’ll offer a new level of security and convenience. It has unique appeal for younger clients – clients we need to win back again.\nWe are also looking forward to an intensive dialogue with our stakeholders. On 28 April we will publish our first quarter results and report on the progress with the execution of Strategy 2020. Our Annual General Meeting, on 19 May, is a highly important day in Deutsche Bank’s calendar. At this meeting we’ll engage in an in-depth dialogue with our shareholders on the progress we have made since October 2015.\nAlso ahead lies the referendum on the UK’s membership in the European Union on 23 June. Though we will not support any political campaigns in this highly important matter, Deutsche Bank has always been supportive of European integration and regards Europe as its home market – a home market which is stronger with the UK than without. But whatever the result, we are well prepared to respond.\nIn this challenging and exciting period, you will continue to see members of the Management Board intensify their communications with you, our clients, investors and the media. We aim to explain, and discuss in detail, the bank’s decisions and challenges as well as its successes.\nWe wish those of you taking time off in the coming days a well-earned rest. To all others we wish a pleasant and restful long weekend. We are grateful to all of you for your sustained efforts and commitment to building a better Deutsche Bank.\nYours sincerely,\nJohn Cryan                                        Jürgen Fitschen",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}