{
    "url": "https://www.db.com/news/detail/20160312-a-message-from-john-cryan-and-juergen-fitschen-annual-report-2015?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 12, 2016",
    "tags": [
        "Company",
        "Management & Leadership",
        "Strategy"
    ],
    "title": "A message from John Cryan and Jürgen Fitschen: Annual Report 2015",
    "body": "Dear colleagues,\nToday we published our 2015 Annual Report, together with our Human Resources Report and Corporate Responsibility Report. These provide a comprehensive view of our performance and activities in 2015 and our perspective on the way ahead.\n\nOur Annual Report reaffirms the picture we provided with our unaudited financial results on January 28. We report a net loss of 6.8 billion euros in 2015. This result was significantly impacted by specific charges of 12.4 billion euros in total on a post-tax basis related to necessary steps we took as part of Strategy 2020.\n\nThese charges overshadowed solid operating performance in our core businesses. Group revenues were 33.5 billion euros, up 5 percent.\nWe are particularly proud that Global Transaction Banking delivered record pre-tax profits, up 25 percent. Deutsche Asset & Wealth Management’s pre-tax profit was up 23 percent. Revenues in Corporate Banking & Securities were up slightly, despite a challenging second half of the year. Revenues in Private & Business Clients, on an operating basis, were in line with 2014 despite persistent very low interest rates.\n\nThe beginning of 2016 has seen volatility in the world’s financial markets. The seasonally strong first quarter might turn out to be challenging for the sector overall and Deutsche Bank is no exception. Nonetheless, in this period of market turbulence, Deutsche Bank remains very solid.\nInvesting in talent and diversity\nOur Human Resources Report outlines our progress on several dimensions in 2015. The proportion of women at the Director and Managing Director level rose again, to 20.5 percent, versus 19.4 percent in 2014. The proportion of women on our Supervisory Board is now 35 percent. We continued to invest in our people, with training and development investment up 12 percent over 2014. We continued to attract young talent, hiring 766 university graduates during 2015, up 33 percent, and hiring of new trainees for our apprenticeship programmes in Germany rose 5 percent.\nOur commitment to society\nWe are especially proud that more than 17,000 Deutsche Bankers invested around 185,000 hours of their time in volunteering projects in their communities during 2015. We expanded our Born To Be programme, which reached 1.3 million young people around the world who are seeking to achieve their full potential.\nWe conducted due diligence on the potential social or environmental impact of 1,346 business transactions or relationships – up by nearly 100 over last year. In addition, we provided financing of 5 billion euros for renewable energy projects. Our Corporate Responsibility Report gives many examples of our commitment to our communities during 2015.\nThe Management Board is committed to doing everything in its power to ensure that our people identify with Deutsche Bank and once again speak of their employer with pride – for it is our people who really make Deutsche Bank strong. Thank you for your diligence and hard work during 2015.\n\nYours sincerely,\nJohn Cryan                    Jürgen Fitschen",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}