{
    "url": "https://www.db.com/news/detail/20160308-frank-krings-named-as-chief-country-officer-for-deutsche-bank-luxembourg?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 8, 2016",
    "tags": [
        "Company"
    ],
    "title": "Frank Krings named as Chief Country Officer for Deutsche Bank Luxembourg",
    "body": "Deutsche Bank has appointed Frank Krings as Chief Country Officer (CCO) for Luxembourg, effective 15 March 2016. He will also become Chief Executive Officer (CEO) of Deutsche Bank Luxembourg S.A. and General Manager of Deutsche Bank AG Luxembourg Branch, subject to regulatory approvals. In these roles, Krings succeeds Dr. Boris Liedtke, who has decided to leave the Bank as of 31 December 2015.\nTogether with Frank Krings, Nathalie Bausch as Chief Operating Officer (COO) and Werner Burg as Chief Risk Officer (CRO) will continue to fulfill their roles on the Management Board of Deutsche Bank Luxembourg S.A. as well as on the branch management of Deutsche Bank Luxembourg AG.\nKrings will be responsible for the management of Deutsche Bank Group’s business in Luxembourg across all divisions and regulated entities, and leading the execution and development of the Bank’s country strategy. Krings will report to Ashok Aram, Deutsche Bank CEO for Europe (excluding Germany and the United Kingdom), Middle East and Africa.\nFor Deutsche Bank, Luxembourg is an important European centre of excellence for Deutsche Bank’s Asset Management, international loan and financing business, and Wealth Management. With his broad experience in banking, Frank will play a crucial role in successfully delivering our Strategy 2020 in Luxembourg. \nAshok Aram, CEO EMEA (ex Germany, UKI)\nFor the past four and a half years, Krings was General Manager and Chief Country Officer of Deutsche Bank in Thailand, also serving as Chairman of the Board of Directors of the Association of International Banks (AIB) in the Kingdom. Immediately prior to this, from October 2008 through 2010 he was a Member of the Management Board of Munich-based Hypo Real Estate Holding and Deutsche Pfandbriefbank, in which role he was mandated to oversee the restructuring of the group.\nPreviously, he spent twelve years with Deutsche Bank in Frankfurt and New York, holding various senior roles and serving on the boards of several regulated Deutsche Bank subsidiaries across Europe. Krings is of German and French nationality, and graduated with a combined degree in Business Administration and Electrical Engineering from Braunschweig Technical University.\n\nDeutsche Bank employs over 600 staff in the Grand Duchy and has been present in the country for more than 45 years.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}