{
    "url": "https://www.db.com/news/detail/20160202-stuart-lewis-chief-risk-officer-takes-part-in-bankingfutures-working-group-urging-uk-banking-sector-to-rebuild-trust?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 2, 2016",
    "tags": [
        "Corporate products",
        "Private products",
        "Research"
    ],
    "title": "Stuart Lewis, Chief Risk Officer, takes part in BankingFutures working group urging UK banking sector to rebuild trust",
    "body": "Industry leadership is critical to rebuild trust in the UK banking sector, a group of senior bankers and stakeholders including Stuart Lewis, Chief Risk Officer, said in a report released on February 1, 2016.\nThe 14-member BankingFutures working group made three recommendations following a six-month consultation with over 200 senior stakeholders. Firstly, banks must show leadership in serving the economy. Secondly, they must demonstrate that they deliver long-term value. Thirdly, they must commit to a public process involving consumers, civil society and regulators to examine their duty of care towards their customers.\n“We at Deutsche Bank are committed to playing our part in helping the banking industry to rebuild trust in the UK and further afield,” Lewis said before the launch event in London, where speakers included Andrew Bailey, Deputy Governor of the Bank of England and incoming Chief Executive of the Financial Conduct Authority.\nThe report highlighted the tensions at the heart of the UK banking sector. For example, banks have a dual responsibility to act not just as commercial institutions but also as providers of public services in the economy. Furthermore, the fact that the sector is seen as too important to fail gives it an implicit public subsidy that raises questions about the sector’s power and accountability, the report said.\n“After the financial crisis, we focused on `what system do we not want and how do we prevent it’,” Bailey said at the event. “We have to move on from that. There is a public good... Banks exist to serve the economy.”\nThe consultation addressed questions including the point at which greater levels of regulation become counter-productive, according to panelist Lord Blackwell, Chairman of Lloyds Banking Group.\n“We shouldn’t rely on the regulators to continue to be the imposers of higher standards,” Blackwell said. “We need to move to a place where trust is vested in the banks themselves.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}