{
    "url": "https://www.db.com/news/detail/20160201-bosch-chooses-deutsche-bank-s-electronic-erp-integration-solution-for-payments-in-china?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "February 1, 2016",
    "tags": [
        "Company",
        "Corporate products",
        "Digitalisation",
        "Investment Banking"
    ],
    "title": "Bosch chooses Deutsche Bank's electronic ERP integration solution for payments in China",
    "body": "Deutsche Bank today announced that it has implemented an electronic ERP integration solution for Bosch’s foreign currency and RMB cross-border payments in China.\nHeadquartered in Germany, Bosch is a leading global supplier of technology and services. The company’s operations are divided into four business sectors –automotive technology, industrial technology, consumer goods, as well as energy and building technology. With more than 360 subsidiaries and regional companies located across 50 countries, Bosch covers 150 countries.\nDeutsche Bank’s ERP integration solution enables Bosch to streamline its accounts payables processes in China introducing electronic processing of physical documents and the associated regulatory reporting.\nDuring the implementation process, Bosch was able to seamlessly transfer and consolidate all of its foreign currency and RMB cross-border payments. Its associated regulatory reporting (e-BOP) information to Deutsche Bank is transmitted through electronic transfer of information directly from its ERP system. The integrated process allows the company to benefit from more timely, secure and accurate reporting, and from increased efficiencies with the reduction of time spent on manually filling out forms.\nMahesh Kini, Managing Director, Head of Cash Management Corporates, Asia Pacific, Global Transaction Banking at Deutsche Bank, said: “We are proud to have been chosen by Bosch for this cash management solution in China. Deeply rooted in Germany, our relationship with Bosch continues to expand throughout Asia. This ERP integration solution has helped the company to streamline its payment processes in China without the need for physical document transfer and therefore to save costs.”\nChristian Zeidler, Head of Corporate Finance and Regional Treasury for APAC at Bosch, added: “China is an important hub for the Bosch group and we are pleased to deepen our relationship with Deutsche Bank in this country. Deutsche Bank’s e-solution has helped us to have even smoother workflows and address efficiency gains. The automation of regulatory reports and electronic document transfer for our local accounts payable processes helps to significantly reduce potential errors due to manual processing. We look forward to continuing to work with Deutsche Bank globally.”\n  This press release has been approved and/or communicated by Deutsche Bank AG or by its subsidiaries and/or affiliates (“DB”). Deutsche Bank AG is authorised under German Banking Law (competent authority: BaFin - Federal Financial Supervisory Authority) and by the Prudential Regulation Authority and subject to limited regulation by the Financial Conduct Authority and Prudential Regulation Authority. Details about the extent of our authorisation and regulation by the Prudential Regulation Authority, and regulation by the Financial Conduct Authority are available from us on request. Securities and investment banking activities in the United States are performed by Deutsche Bank Securities Inc., member NYSE, NASD and SIPC, and its broker-dealer affiliates. Lending and other commercial banking activities in the United States are performed by Deutsche Bank AG, and its banking affiliates.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}