{
    "url": "https://www.db.com/news/detail/20170323-deutsche-bank-presents-the-artist-of-the-year-2017?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "March 23, 2017",
    "tags": [
        "Art",
        "Company",
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank presents the \"Artist of the Year\" 2017",
    "body": "From March 24 to June 18, the KunstHalle is presenting “Bird Song”, the first institutional solo exhibition of the South African artist Kemang Wa Lehulere. Deutsche Bank’s current “Artist of the Year” – one of the most important contemporary artists of his generation in South Africa – gives insight into his artistic cosmos in Berlin with many works conceived expressly for the show.\n\nThe starting point for “Bird Song” is the artist Gladys Mgudlandlu (1917-1979). Wa Lehulere documents his research on the long-forgotten South African painter with texts and videos. He combines Mgudlandlu’s watercolors and drawings with blackboard and ink drawings as a kind of artistic dialog between present and past.\nAlso on view are two new installations, a wall carving and a video work. Their visual language is touching yet also of universal quality. Wa Lehulere begins his artistic quest with a journey into South Africa’s traumatic past and continues it with universal themes such as suppression and ideological conditioning.\n\nIn addition to solo shows – most recently until the beginning of 2017 at the Art Institute of Chicago – Kemang Wa Lehulere, who was born in Cape Town, has taken part in many international group exhibitions, including the 12th Dak’Art Biennale in Dakar (2016), the 2nd Triennial of the New Museum in New York (2012), and the 11th Biennale de Lyon (2011).\nIn Berlin, works by the artist were shown in 2014 as part of the 8th Berlin Biennale at the Museum Dahlem and in 2013/2014 at the Deutsche Bank KunstHalle in the context of the exhibition project “The Circle Walked Casually.”\n\nThe exhibition was curated by Britta Färber, Chief Curator in Deutsche Bank’s Art, Culture & Sports department. As an exclusive edition for the show, Kemang Wa Lehulere and the free jazz musician Mandla Mlangeni recorded an album and composed all of the pieces themselves. Titled “bird song album,” the vinyl record has been published in a numbered edition of 300 copies of which 40 were signed.\n\nAccompanying the exhibition is the catalog “Kemang Wa Lehulere: Bird Song. ‘Artist of the Year’ 2017” with contributions by Elvira Dyangani Ose, Britta Färber, Carlos Gamerro, Victoria Noorthoorn, and Kate Nesin (German/English, € 35).\nFollowing the presentation at the KunstHalle, with a supporting program for children, youth, and families, “Kemang Wa Lehulere: Bird Song” will be on view at MAXXI, Rome, until November 2017.\nPress photos on the exhibition can be found at: http://www.photo-files.de/\nDeutsche Bank’s commitment to art is part of the activities of the bank’s Art, Culture & Sports department. The unit bundles the bank’s support programs and develops them further in conceptual terms. Together with its divisions, Deutsche Bank wants to provide its customers with new access to the art, culture, and sports worlds. With its involvement in contemporary art Deutsche Bank is setting standards worldwide, be it with is art collection, one of the world’s most important collections of contemporary artworks on paper and photography, with international exhibitions, or with the Deutsche Bank KunstHalle in Berlin. For many years the bank has had a presence at selected art fairs such as Frieze London and Frieze New York.\nInformation on Deutsche Bank’s global art program can be found at\nhttp://www.db.com/art\nhttp://www.db-artmag.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}