{
    "url": "https://www.db.com/news/detail/20170321-big-apple-unveiled-as-fourth-innovation-lab?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "March 21, 2017",
    "tags": [
        "Digitalisation",
        "Entrepreneurship",
        "Research"
    ],
    "title": "Big Apple unveiled as fourth innovation lab",
    "body": "New York has joined an illustrious list of locations as part of Deutsche Bank’s innovation labs. Berlin, London and Silicon Valley will be joined by “The City That Never Sleeps” in the bank’s efforts to explore new technologies in partnership with fintechs.\nRather than viewing fintechs as a threat, Deutsche Bank is proactively joining forces with these entrepreneurs to develop services that benefit clients. The innovation lab concept makes it straight forward for fintech firms to work with the bank so ideas quickly become reality.\nThe lab in Lower Manhattan’s Fulton Center, a short walk from the bank’s Wall Street office, will plug into a leading ecosystem of innovation in one of the world’s largest financial hubs. It will explore exciting new areas including artificial intelligence, cloud technology and cyber security. Rather than just working in isolation, the four labs will also collaborate – creating a powerful, global network.\nThe launch event on March 20 gathered technology companies from the New York area alongside Deutsche Bank representatives including Kim Hammonds, Member of the Management Board and Group Chief Operating Officer and Elly Hardwick, Head of Innovation.\nThe Deutsche Bank Labs have three principal goals: to help the bank evaluate and adopt emerging technologies, to develop a culture of innovation and contribute to the bank's digital strategy.\nThe approach is already solving real issues. Examples include technology that tracks eye movements to make apps more intuitive; a tool for credit risk officers to easily gather client ratings and a monitoring product that identifies problems within applications and network infrastructure.\nAt the event, Hardwick welcomed more than 60 attendees from the bank and the fintech community. “We want to make Deutsche Bank the first stop for start-ups. Our innovation labs combine fresh ideas from fintechs with the scale, infrastructure and industry expertise of a global bank.”\nHammonds spoke about the importance of the labs for the bank’s broader digital strategy and the role they play in enhancing products and services to clients and enabling business growth. “The launch of the lab in New York is a further step in Deutsche Bank’s plan to be active in top global innovation ecosystems to benefit our clients today and shape how banking will be done in the future. Success for me is pretty simple – we want new companies to want to work with us.”\nLater in the evening, Hilary Mason, Founder & CEO, Fast Forward Labs, spoke about artificial intelligence and machine learning, two growing trends that are already disrupting business models. During a panel discussion, moderated by Hardwick, panelists JP Rangaswami, Deutsche Bank’s Group Chief Data Officer & Group Head of Innovation, Scott Robinson, Founder & VP, Plug and Play and George Davis, Co-founder and CEO, Frame.ai discussed the importance of partnership with the labs.\n“Getting value we want from the technology while balancing safety and soundness is where the partnership really comes in,” Rangaswami said.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}