{
    "url": "https://www.db.com/news/detail/20170309-funding-boost-for-social-start-ups?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "March 9, 2017",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Funding boost for social start-ups",
    "body": "Six social start-ups – six individual grants. All the Impact Fund’s (Wirkungsfonds) third round finalists – JUMEN, Wefugees, Eed be Eed, HelpTo, ZuBaKa and CodeDoor – left the Social Impact Lab in Frankfurt overjoyed as a winner!\nUnder the umbrella of the Impact Fund, Deutsche Bank, SAP and Social Impact gGmbH support start-ups that tangibly improve the social and economic integration of refugees in Germany. The Fund – a first of its kind – began in 2016 and provides non-repayable grants for refugee-targeted social enterprises.\nIt is part of Made for Good, Deutsche Bank’s enterprise programme for social good that aims to help start-ups and early-stage enterprises build momentum and capacity.\nIn the Impact Fund’s founding year, 200,000 euros were set aside to help twelve social enterprises develop their business models. During the Impact Fund finale the remaining 60,000 euros were allocated. And it was an exciting contest: each of the finalists applied for the maximum grant of 25,000 euros to scale their business model.\nAfter impressive pitches, an expert jury – consisting of Arasch Charifi, Deutsche Bank’s Head of Wealth Management Central Germany; Nicola Leske, Head of Communications SAP SE; Nadine Förster, ISM Mainz; and Norbert Kunz, CEO Social Impact gGmbH – decided on the individual allocations.\nSix finalists – six winners!\nJUMEN was awarded the largest grant of 22,500 euros – it offers legal advice to help refugee children get into school.\nZuBaKa received 15,000 euros to continue coordinating offers for vocational orientation, language training and mentoring at local schools.\nWefugees´ online dialogue platform for refugees and volunteers won 7,500 euros from the Impact Fund.\nEed be Eed ('hand in hand') provides an online newspaper in Arabic written by refugees, for refugees. Not only was the startup rewarded with a grant of 5,000 euros – it will receive further coaching by Social Impact in the future.\nHelpTo brings happiness to refugee children at Christmas - with a present. For this, it was provided 5,000 euros.\nThe CodeDoor team, which also received 5,000 euros, educates refugees to become software developers and teaches them how to code.\n\nThe Impact Fund’s first year-finale was a big success. Thanks to the funding received, all the social enterprises can now quickly scale up their commitment and contribute to the successful integration of refugees into society and the German labour market.\nCongratulations!\nOur colleagues followed-up on the pitches on twitter. Find out more!",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 40
}