{
    "url": "https://www.db.com/news/detail/20170306-deutsche-bank-appoints-pascal-boillat-as-group-chief-information-officer?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "March 6, 2017",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank appoints Pascal Boillat as Group Chief Information Officer",
    "body": "Deutsche Bank has appointed a Group Chief Information Officer to drive its bank-wide technology agenda.\nPascal Boillat will take on the newly-created Group CIO role with immediate effect. The role is a pivotal next step towards the bank’s goal of becoming a technology-led company. Boillat will continue to report to Kim Hammonds, Member of the Management Board for Deutsche Bank and Group Chief Operating Officer, and to serve on the COO Executive Committee.\nBoillat joined Deutsche Bank in 2016 as Chief Information Officer and Head of Operations for the Corporate & Investment Bank. In his new role, he will be responsible for defining technology strategy across the bank to serve clients while further enhancing standardisation and digital capabilities.\nBoillat will work closely with the business divisions to further modernise the bank’s IT environment to reduce complexity, risk and enable business growth. He will continue to work proactively with regulators to strengthen the bank’s controls. He will also lead the bank’s Technology Development Centers globally.\nPrior to joining Deutsche Bank, Boillat was Head of Operations and Technology for the US secondary mortgage market company Fannie Mae. Previously he worked at Citigroup, where he was responsible for managing and delivering technology solutions for institutional, retail and prime brokerage operations. Boillat has a degree in electronic engineering from the Berufsschule in Zurich.\nKim Hammonds said: “Pascal’s technical expertise and experience of leading global technology and operational transformation programs will help us continue to engineer a better bank and accelerate the overhaul of our IT systems.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}