{
    "url": "https://www.db.com/news/detail/20170305-deutsche-bank-refines-strategy-and-announces-capital-increase?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "March 5, 2017",
    "tags": [
        "Company",
        "Investment Banking",
        "Management & Leadership",
        "Research",
        "Strategy"
    ],
    "title": "Deutsche Bank refines strategy and announces capital increase",
    "body": "— Capital Ratio (CET1 fully loaded) target of comfortably above 13 percent\n— Intended capital increase of approximately 8 billion euros from the issuance of new shares with subscription rights\n— Up to 2 billion euros of additional capital accretion targeted in next two years from asset disposals and a flotation of minority stake of Deutsche Asset Management\n— Significant strengthening of position in German home market intended, while retaining global reach in Corporate & Investment Bank, Wealth Management and Asset Management\n— Simplified business model consisting of three business units\n— Corporate Finance, Global Markets and Global Transaction Banking to become part of an integrated Corporate & Investment Bank\n— Postbank and Deutsche Bank’s Private & Commercial Clients business will be combined\n— Adjusted cost base intended to decrease from 24.1 billion euros (2016, after business disposals) to about 22 billion euros (2018) and to about 21 billion euros (2021)\n— Anticipated restructuring and severance costs of approximately 2 billion euros\nDeutsche Bank (XETRA: DBKGn.DE / NYSE: DB) is taking a decisive step forward to become stronger and grow again. Decisions agreed by the Management Board and Supervisory Board on Sunday aim to reinforce the bank’s roots in its home market of Germany and its position as a leading European bank with global reach. The bank plans to combine Postbank and Deutsche Bank’s Private & Commercial clients business, float a minority stake of Deutsche Asset Management and create an integrated corporate and investment bank.\nThis strategic reorganisation is supported by a capital increase that aims to raise Deutsche Bank’s financial strength to a new level. By issuing up to 687.5 million new shares in a rights issue, the bank seeks proceeds of approximately 8 billion euros. The issue is initially underwritten by Credit Suisse, Barclays, Goldman Sachs, BNP Paribas, Commerzbank, HSBC, Morgan Stanley and UniCredit. The subscription period is expected to start on March 21 and ends on April 6.\nThrough this step, Deutsche Bank plans to reach a Common Equity Tier 1 ratio of 14.1 percent and a leverage ratio of about 4.1 percent (in each case fully loaded, pro forma as of December, 31, 2016). Up to a 2 billion euros of further capital accretion is expected through asset disposals and the flotation of a minority stake of Deutsche Asset Management. The bank targets a Common Equity Tier 1 ratio of comfortably above 13 percent and a leverage ratio of 4.5 percent.\nTo simplify its structure and better meet clients’ needs, Deutsche Bank will focus on three business divisions in the future:\nA Private & Commercial Bank that will be the clear market leader in Germany as measured by number of clients. Postbank, Deutsche Bank’s international Private & Commercial Clients business and the global Wealth Management business will be part of this division.\nDeutsche Asset Management, which should gain more operational independence through a partial IPO and be better positioned for growth.\nAn integrated Corporate & Investment Bank, which will comprise the bank’s Corporate Finance, Global Markets and Global Transaction Banking businesses, aiming primarily for a corporate-client led business.\nAdditionally, Deutsche Bank will align certain parts of its technology and other overhead functions to its business divisions to increase accountability and reduce costs. Further synergies are planned within the new divisions, mainly from the German retail and commercial business and the integrated Corporate & Investment Bank.\nThe bank will target an adjusted cost base (including Postbank) of about 22 billion euros by 2018 and about 21 billion euros by 2021, compared to 24.1 billion euros in 2016 (after business disposals). It is anticipated that this will require restructuring and severance costs of approximately 2 billion euros, the majority of which is expected to be incurred in 2017 to 2019. The bank will aim to reach a return on tangible equity of 10 percent in a normalised operating environment.\nThe management has approved payment of the AT1 interest coupons coming due in 2017 and intends to propose at the Annual General Meeting in May 2017 to pay aggregate dividends of 0.19 euros per share, including the shares to be issued in the announced capital raise. The aggregate amounts to approximately 400 million euros. The bank intends to propose at least a minimum dividend of 0.11 euros per share for 2017 and targets a competitive payout ratio for fiscal year 2018 and thereafter.\nJohn Cryan, Chief Executive Officer, said: “Our decisions are a significant step forward on the path to creating a simpler, stronger and growing bank. The capital increase will reinforce our financial strength substantially. The new three-pillar structure of our operating business should position us for significant growth, both in revenues and earnings.”\nThree strong pillars: path to future growth\nPrivate & Commercial Bank (PCB): the clear No. 1 in Germany\nSince the former management team announced a planned sale of Postbank in spring 2015, macroeconomic, legal and regulatory conditions have changed. This now offers Deutsche Bank the opportunity to create Germany’s biggest private and commercial bank, retaining a multi-brand approach. Clients can benefit from both Postbank’s highly standardised systems for day-to-day business and Deutsche Bank’s experience in providing in-depth advice.\nThe combined bank will serve over 20 million customers in Europe’s largest economy, 10 million of which are already using digital offerings. In a highly competitive market environment with low interest rates, greater scale is expected to provide a substantial competitive advantage particularly in the broader retail segment.\nDeutsche Bank and Postbank plan to develop a detailed integration plan now, which they intend to present in the course of the year. This integration aims to rationalise central functions and technology platforms, for example. Potential annual synergies are estimated at 0.9 billion euros by 2022 and require restructuring and severance costs of around 1.0 billion euros.\nAdditionally, Deutsche Bank and Postbank will join forces to invest in digitisation more efficiently. It is the bank’s ambition to build the foundation for sustainable growth in all segments of its private and commercial clients business. In Wealth Management the bank sees very attractive growth opportunities, building on its strong home market in Germany and a sizeable presence in Europe, Middle East, North America and Asia Pacific (APAC).\nDeutsche Asset Management: facilitating stronger growth\nAsset Management remains an integral part of Deutsche Bank’s business model. With a partial IPO the bank aims to unleash growth in Deutsche Asset Management’s active, passive and alternatives business lines while accentuating the division’s fiduciary role. The additional operational independence will help to attract further talent in the future. Deutsche Asset Management, with more than 700 billion euros of invested assets worldwide, is planned to be headquartered and listed in Germany. The IPO of a minority stake is planned to be completed within the next two years. Deutsche Bank intends to retain a majority stake in Deutsche Asset Management.\nCorporate & Investment Bank (CIB): combining strengths to serve clients better\nCombining the Corporate Finance, Global Markets and Global Transaction Banking businesses is expected to more effectively align the bank’s product and sales efforts, enabling better service to clients and more focused resource allocation.\nThe bank intends to shift the focus in this business to corporate clients while retaining a strong, but more focused institutional client base. From one integrated division, clients will be offered services ranging from financing and payments to hedging and advisory. A higher proportion of the division’s balance sheet is in time expected to be deployed to support corporate clients.\nRWAs\nThe bank identified a pool of legacy assets within Global Markets of approximately 20 billion euros in risk-weighted assets (RWA), excluding operational risk. This pool is planned to be run down over an extended period of time and is currently estimated to represent a negative impact to the new CIB’s post-tax return on tangible equity (RoTE) of around 200 basis points. The legacy assets pool will be managed separately and is targeted to be reduced to approximately 12 billion euros of RWA by 2020.\nGlobal Transaction Banking will remain an essential part of CIB, and investments in this business will continue. The creation of the new Corporate & Investment Bank aims to reduce spending on infrastructure. The division’s combined adjusted cost base of 12.9 billion euros in 2016 is envisioned to decrease by 0.7 billion euros by 2018.\nThese changes should place the bank in a better position to benefit from resurgent client activity across the investment banking sector. The bank’s commitment to this division explicitly includes its presence in the US and APAC.\nChanges in the Management Board\nThe new three-pillar business division structure will be supported by a new leadership structure as decided by the Supervisory Board today.\nJeffrey Urwin, currently Head of the Corporate & Investment Bank (ex-Global Markets) and the bank’s US business, will retire from the Management Board after a transition period. He will continue to support the bank, especially regarding regulatory topics in the United States.\nIn addition to his position as CEO, John Cryan will assume responsibility for the bank’s US business.\nMarcus Schenck, CFO, and Christian Sewing, CEO of Germany and Head of Private, Wealth & Commercial Clients, are appointed Deputy CEOs with immediate effect.\nMarcus Schenck will join Garth Ritchie in leading the new Corporate & Investment Bank in the course of the year. The Supervisory Board will decide on his successor as CFO in due course.\nAlongside Christian Sewing, PCB will also be led prospectively by Frank Strauss, currently CEO of Deutsche Postbank AG. It is intended that Mr. Strauss will become a member of Deutsche Bank’s Management Board in the course of the integration process in PCB.\nWith regard to the capital increase and the strategic measures, Paul Achleitner, Chairman of the Supervisory Board, said: “After the difficult restructuring of recent years, the Supervisory Board is convinced that these strategic, financial and personnel measures provide a firm foundation for sustainable growth. We are and will remain a bank rooted in Germany and Europe and with a sizeable presence in the global business with corporates, institutions and wealth management clients.”\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nIMPORTANT NOTICE\nForward-looking statements contain risks\nThis press release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations. Any statement in this release that states our intentions, beliefs, expectations or predictions (and the assumptions underlying them) is a forward-looking statement. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our trading revenues, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission (SEC).\nSuch factors are described in our SEC Form 20-F of March 11, 2015 on pages 13 through 40 under the heading “Risk Factors.” Copies of this document are readily available upon request or can be downloaded from www.db.com/ir. This release also contains non-IFRS financial measures. For a reconciliation to directly comparable figures reported under IFRS, refer to the 4Q/FY2016 Financial Data Supplement, which is available at www.db.com/ir.\nFor readers in the European Economic Area\nThis release does not constitute an offer to sell, or the solicitation of an offer to buy or subscribe for, any securities of Deutsche Bank AG. This document does not constitute a prospectus within the meaning of the EC Directive 2003/71/EC of the European Parliament and Council dated 4 November 2003, as amended (the “Prospectus Directive”).\nThe public offer in Germany and the United Kingdom will be made solely by means of, and on the basis of, a securities prospectus which is to be published following its approval by the German Federal Financial Supervisory Authority (BaFin). Any investment decision regarding any subscription rights or shares should only be made on the basis of the prospectus which will be published after its approval and will be available for download on the internet site of Deutsche Bank AG (www.db.com/ir).\nCopies of the prospectus will also be readily available upon request and free of charge at Deutsche Bank AG, Taunusanlage 12, 60325 Frankfurt am Main, Germany.\nIn any Member State of the European Economic Area that has implemented the Prospectus Directive (other than Germany or the United Kingdom) this communication is only addressed to, and directed at, qualified investors in that Member State within the meaning of the Prospectus Directive.\nFor readers in the United Kingdom\nThis communication is only being distributed to, and is only directed at, (i) persons who are outside the United Kingdom or (ii) investment professionals falling within Article 19(5) of the Financial Services and Markets Act 2000 (Financial Promotion) Order 2005 (the “Order”) or (iii) high net worth companies falling within Article 49(2)(a) to (d) of the Order, or (iv) other persons to whom it may lawfully be communicated, (all such persons together being referred to as “relevant persons”).\nThe new shares are only available to, and any invitation, offer or agreement to subscribe for, purchase or otherwise acquire such new shares will be engaged in only with, relevant persons. Any person who is not a relevant person should not act or rely on this document or any of its contents.\nFor readers in the US\nDeutsche Bank has filed a registration statement (including a prospectus) with the U.S. Securities and Exchange Commission (the “SEC”) for the offering to which this communication relates. Before you invest, you should read the prospectus in that registration statement, the supplement to that prospectus Deutsche Bank expects to file with the SEC and other documents Deutsche Bank has filed and will file with the SEC for more complete information about Deutsche Bank and this offering.\nYou may get these documents, once filed, free of charge by visiting EDGAR on the SEC Web site at www.sec.gov. Alternatively, Deutsche Bank, any underwriter or any dealer participating in the offering will arrange to send you the prospectus after filing if you request it by calling Deutsche Bank at +49 69 910-35395.\nFor readers in Canada\nDeutsche Bank intends to make the offering to which this communication relates in Canada pursuant to a Canadian offering memorandum filed with the Canadian securities regulatory authorities under an exemption from the requirement to file a prospectus in Canada. Before you invest, you should read the Canadian offering memorandum and other documents Deutsche Bank has filed and will file with the Canadian securities regulatory authorities for more complete information about Deutsche Bank and this offering.\nYou may get these documents, once filed, free of charge by visiting SEDAR at www.sedar.com. Alternatively, Deutsche Bank will arrange to send you the Canadian offering memorandum after filing if you request it by calling Deutsche Bank at +49 69 910-35395.\nNot for publication in Australia or Japan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}