{
    "url": "https://www.db.com/news/detail/20160930-deutsche-bank-survey-reveals-fixed-income-investors-poised-to-significantly-increase-allocations-to-china-s-domestic-bond-market?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "September 30, 2016",
    "tags": [
        "Capital markets",
        "Company",
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Deutsche Bank survey reveals fixed income investors poised to significantly increase allocations to China's domestic bond market",
    "body": "Deutsche Bank today released findings of a survey of fixed income investors representing an estimated US$ 14.5 trillion in global AUM and over US$ 5.1 trillion in fixed income AUM. Feedback was primarily provided by senior investment professionals from global asset management firms who are based in Asia. The aggregate share of survey respondents’ Asian local currency bond portfolio allocated to onshore Renminbi (RMB) bonds is seen increasing from roughly 5% at present to almost 13% a year from now, rising further to over 26% in five years’ time.\n\nWith respect to the nascent Panda bond market (onshore Renminbi bonds issued by non-Chinese entities) in particular, nearly half of respondents indicated they may invest within the next 12 months, with a further 38% expecting to invest in 1-3 years’ time.\n\nAt the end of August, the amount of outstanding bonds in China’s domestic RMB bond market stood at RMB60.2 trillion according to Deutsche Bank research, with the interbank bond market (CIBM) representing more than 90% of the total market. Deutsche Bank research estimates that foreign investors’ share of domestic interbank holdings was about 1.52% in August.\n\nDeutsche Bank Asia Pacific Head of Global Markets Michael Ormaechea reflected on the survey results, “We have been keenly focused on this market and the tremendous opportunity it represents due to its sheer scale and the diversification benefit it offers global investors. Investor interest and readiness to allocate to onshore RMB bonds as borne out by the survey has exceeded our own expectations. Now that access has opened up substantially for offshore investors, we expect foreign participation in China’s domestic bond market to accelerate and for onshore Renminbi bonds to be an increasingly important component of major global fixed income investors’ portfolios.”\n\nThe challenge: investors most frequently cited in limiting investment in onshore RMB flagged that the absence of onshore RMB bonds from major indices as a limitation, but 82% expect inclusion in a major emerging market fixed income index to happen within the next two years.\n\nOver half of survey respondents indicated that the shift to a registration-based, quota-free system for CIBM market access had brought forward their institution’s timeline for increasing investment in the market.\n\nFeng Gao, Deutsche Bank Chief Country Officer for China remarked, “The opening of China’s domestic bond market has been a watershed moment for Renminbi internationalization. Adoption of the Renminbi as a currency for trade has been well established; freer access for global investors to such an enormous pool of investable assets is key in unlocking the potential of the Renminbi as a currency for investment as well.”\n\nFor further information, please contact:\n\nDeutsche Bank AG\nPress & Media Relations\n\nAmy Chang\nPhone: +852 2203 8434\nE-mail: amy.chang@db.com\n\nGrace Zhang\nPhone : +86 10 5969 8617\nE-mail : grace.zhang@db.com\n\n\nAbout Deutsche Bank\n\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the\nAmericas and Asia Pacific.\n\nDeutsche Bank in China\n\nDeutsche Bank first established a presence in China in 1872 with the opening of its first overseas office in Shanghai. Headquartered in Beijing, Deutsche Bank China completed local incorporation in 2008, currently with branches in Beijing, Shanghai, Guangzhou, Tianjin, Chongqing, Qingdao, and a sub-branch in China (Shanghai) Pilot Free Trade Zone. Deutsche Bank has a regional hub in Hong Kong SAR, which celebrated its 50th year of operation in 2008. The bank also maintains securities representative offices in Beijing and Shanghai.\n\nThrough rapid organic growth and strategic investments, Deutsche Bank’s core global businesses are all active in China. These include corporate advisory and capital markets, transaction banking, as well as wealth management.\n\nOn the asset management front, Deutsche Bank holds a 30% strategic investment in Harvest Funds Management – one of the country’s leading investment managers.\n\nIn July 2009, the joint venture between Deutsche Bank and Shanxi Securities – Zhong De Securities Co. Ltd. – received a securities business license from the China Securities Regulatory Commission (CSRC). Zhong De Securities is currently approved to underwrite and sponsor stocks and bonds (including A-shares, foreign investment shares, government bonds, and corporate bonds), as well as provide corporate advisory services in the domestic capital market. Deutsche Bank holds a 33.3% ownership in the joint venture.\n\nFor more information about Deutsche Bank China: https://china.db.com.\n\nThis press release has been approved and/or communicated by Deutsche Bank AG or by its subsidiaries and/or affiliates (“DB”). Deutsche Bank AG is authorised under German Banking Law (competent authority: BaFin - Federal Financial Supervisory Authority) and by the Prudential Regulation Authority and subject to limited regulation by the Financial Conduct Authority and Prudential Regulation Authority. Details about the extent of our authorisation and regulation by the Prudential Regulation Authority, and regulation by the Financial Conduct Authority are available from us on request. Securities and investment banking activities in the United States are performed by Deutsche Bank Securities Inc., member NYSE, NASD and SIPC, and its brokerdealer affiliates. Lending and other commercial banking activities in the United States are performed by Deutsche Bank AG, and its banking affiliates. Copyright (C) 2016 Deutsche Bank AG",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}