{
    "url": "https://www.db.com/news/detail/20160928-deutsche-bank-submits-sustainable-energy-for-africa-proposal-to-green-climate-fund?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "September 28, 2016",
    "tags": [
        "Africa",
        "Company",
        "Sustainability"
    ],
    "title": "Deutsche Bank submits Sustainable Energy for Africa proposal to Green Climate Fund",
    "body": "Deutsche Bank has submitted a proposal to combine capital from the UN established Green Climate Fund (GCF) with private sector investors to finance renewable electricity access for African households, small and medium sized enterprises in cooperation with local banks.\nAn estimated 621 million people in Sub-Saharan Africa lack access to electricity, which especially affects the rural population. The lack of access to clean, reliable and affordable electrical energy, is a severe constraint for economic growth and hinders the reduction of poverty. Additionally, it creates significant air pollution which negatively weighs on the health conditions of large parts of the population and contributes to climate change.\nPierre Cherki, Global Head of Alternatives at Deutsche Asset Management said: \"We have taken our responsibility seriously as the first commercial bank accredited to the UN’s Green Climate Fund, by developing a proposal to contribute to one of the critical Sustainable Development Goals (SDG)s, specifically to “Sustainable Energy for All” (goal No. 7).\n\"The proposal builds on our track-record of working with public sector investors to raise higher amounts of private capital to achieve positive environmental and social outcomes and a return on investment. Without this proposal, private sector investors tend to be too risk adverse to invest at scale in off-grid renewable energy in Africa. And public sector capital will not be sufficient to meet this critical goal.\"\nDeutsche Bank’s proposal is called the Universal Green Energy Access Program (UGEAP). It will work with and through local financial institutions in an innovative structure to enable local banks to extend medium and long term loans in local currency or US dollars for businesses that provide clean electricity solutions. The proposal has been endorsed by the Governments of Benin, Kenya, Namibia, Nigeria and Tanzania, which is where the program will initially focus investments in the first three years. The program will be expanded thereafter to other African countries in the future.\nDeutsche Asset Management estimates that the fund’s 15 years of operation could lead to cumulative carbon emission reduction savings of approx. 50m tCO2, installation of 1,500 Megawatt of renewable electricity, improved renewable energy access for 461,400 households and businesses (450,000 new solar home systems, 10,500 solar mini-grid systems and 900 solar systems for small and medium enterprises).\nThe initiative could create up to 15,600 permanent jobs and 7,900 temporary jobs. With the fund’s dedicated Gender Policy, it is our aim that 45%+ of direct jobs and 40%+ of temporary jobs will be for women, though progress towards this goal is effected by the conduct of the fund’s investees.”\nFurther details about the Green Climate Fund and the UGEAP proposal:\n\nThe proposal will be considered by the Board of the Green Climate Fund when it convenes for its thirteenth meeting in Songdo, South Korea, from 10 to 13 October. Countries from around the world have provided initial commitments of USD 10.3bn to GCF as part of the United Nations Framework Convention on Climate Change's goal to support developing countries in reducing carbon emissions and adapting to the impacts of climate change. Deutsche Bank has been accredited to GCF in July 2015.\nThe UGEAP programme is the first that will be submitted to the Board for review.\nThe proposal takes the form of a private debt fund, managed by Deutsche Asset Management’s Sustainable Investment team. This team has USD 1.8bn in assets under management in funds focused on sustainable development initiatives in the areas of renewable energy, energy efficiency, agriculture, health, education, micro-finance and financial inclusion.\nThe UGEAP proposal will build on Deutsche Asset Management’s experience in operating the Africa Agriculture and Trade Investment Fund (AATIF) which works with local banks to improve agricultural productivity. Deutsche Bank was the first global bank to establish a socially motivated microfinance fund in 1997 and since then Deutsche Bank has partnered with more than 130 microfinance institutions in more than 50 countries, benefiting as many as 3.8 million low-income entrepreneurs through USD 1.67 billion in financing, many of which are in Africa.\nOther funds managed by the Sustainable Investment team have already made loans to several leading off-grid renewable energy companies active in Africa. The UGEAP fund will have a dedicated gender policy and social and environmental management system, based on the IFC Performance Standards.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}