{
    "url": "https://www.db.com/news/detail/20160928-phoenix-life-holdings-limited-to-acquire-deutsche-bank-s-abbey-life-assurance-company-limited?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "September 28, 2016",
    "tags": [
        "Company",
        "Investment Banking"
    ],
    "title": "Phoenix Life Holdings Limited to acquire Deutsche Bank's Abbey Life Assurance Company Limited",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) announced today that it has reached an agreement with Phoenix Life Holdings Limited, a subsidiary of Phoenix Group Holdings Limited, to sell its Abbey Life business (Abbey Life Assurance Company Limited, Abbey Life Trustee Services Limited and Abbey Life Trust Securities Limited) which is held within Deutsche Asset Management.\nUnder the terms of the transaction, Phoenix Life Holdings Limited will acquire 100% of the Abbey Life business for 935 million pounds (1.085 billion euros, based on current exchange rates).\nThe transaction is subject to regulatory approvals including that of the Prudential Regulatory Authority. The sale will have a net positive capital impact upon closing of the transaction and, on a pro-forma basis, would have improved Deutsche Bank’s Common Equity Tier 1 capital ratio (CRR/CRD 4 fully loaded) as of 30 June 2016 by approximately 10 basis points.\nThe transaction will result in an expected pre-tax loss of approximately 800 million euros, primarily resulting from impairment of goodwill and intangible assets. The transaction is not expected to have a material impact on Deutsche Bank’s Available Distributable Items.\nJohn Cryan, Chief Executive Officer of Deutsche Bank, said: “We are pleased to have reached this agreement with Phoenix Group, a specialist life fund provider which is well qualified to serve Abbey Life policyholders. Deutsche Asset Management will continue to focus on its core businesses of Active, Passive and Alternatives, while this transaction will also strengthen Deutsche Bank’s capital position. We continue to build a simpler and better Deutsche Bank.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}