{
    "url": "https://www.db.com/news/detail/20160922-joseph-lavorgna-on-the-us-presidential-election-the-optimist-in-me-thinks-maybe-churchill-was-right?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 22, 2016",
    "tags": [
        "Americas",
        "Research"
    ],
    "title": "\"The optimist in me thinks maybe Churchill was right\"",
    "body": "Q: Historically, how important is the economy in the run-up to a presidential election?\nJoseph LaVorgna: The times in the past when it’s been central have been when elections occurred against a backdrop of a recessionary or inflationary environment. That was the case in 1980, 1992, 2000 and 2008, for different reasons. In 1980, we had inflation; in 1992, there was a jobless recovery; in 2000, the stock market bubble burst; and in 2008, we were in the midst of a financial crisis. So the economy, in one form or another, has been a factor during presidential elections.\nThis year, the economy is growing – not very much, but it is growing – so in a sense it’s a bit like 2012; the economy was growing then, too, but there was a debate over how to get the growth rate faster.\nQ: And what about the effect of the election on the economy in 2016?\nJLV: It’s hard to prove, but it feels as though the corporate sector has not been spending very much on investment. I believe that reflects uncertainty as to the election outcome and the fact that both parties would, for example, like to reform the corporate tax structure, but they’ve got different ideas on how to do it. So as a business, you’re going to sit and wait to see who’s in office and then react accordingly.\nQ: Which aspects of the candidates’ policies will business be most concerned with?\nJLV: For the overall corporate sector, the possibility of corporate tax reform is the most important. Then, related to that, is the question: Are there any fiscal stimulus policies that might get the economy moving faster? If the federal government came up with a well-designed fiscal stimulus programme, it would get businesses spending more on capital than they have been doing and help to engender a much stronger economy.\nQ: How quickly do you expect to see markets move after the election?\nJLV: The markets are anticipatory, so once we get past the election, they may start moving very quickly. Indeed, as we get a bit closer to November 8, we’re going to have a better sense of who’s likely to win and what Congress will look like.\nThe make-up of Congress is probably the most important thing, in fact. To me, the worst outcome would be divided government and a feeling that we’re going to have four more years of gridlock. Any sense that the minority party is obstructionist would be bad for the economic outlook, because it would simply reinforce the trends that have been in place.\nQ: What else are you hoping to see in the aftermath of the election?\nJLV: Monetary policy, in the US and abroad, has taken on a disproportionately important role. We’ve reached the limit of monetary policymaking; in other words, if further monetary easing were to occur in the US, it would actually be detrimental to the growth outlook.\nWe’re clearly at the point where we need some fiscal stimulus. Otherwise, the economy is going to continue to grow at historically very low rates. When you’re in that type of environment, you run the risk of having a negative shock come and throw you off kilter.\nThe optimist in me thinks that maybe Churchill was right when he said that you can always count on Americans to do the right thing – after they’ve exhausted every other option. Eventually, we might get the right policy, but I’m concerned that it’ll take an economic downturn, or something that feels like it, to get policymakers and politicians to come together.\nGlobal Disclaimer\nThe information and opinions in this report were prepared by Deutsche Bank AG or one of its affiliates (collectively \"Deutsche Bank\"). The information herein is believed to be reliable and has been obtained from public sources believed to be reliable. Deutsche Bank makes no representation as to the accuracy or completeness of such information.\nDeutsche Bank may engage in securities transactions, on a proprietary basis or otherwise, in a manner inconsistent with the view taken in this research report. In addition, others within Deutsche Bank, including strategists and sales staff, may take a view that is inconsistent with that taken in this research report.\nOpinions, estimates and projections in this report constitute the current judgment of the author as of the date of this report. They do not necessarily reflect the opinions of Deutsche Bank and are subject to change without notice. Deutsche Bank has no obligation to update, modify or amend this report or to otherwise notify a recipient thereof in the event that any opinion, forecast or estimate set forth herein, changes or subsequently becomes inaccurate.\nCopyright © Deutsche Bank Securities Inc.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}