{
    "url": "https://www.db.com/news/detail/20160921-deutsche-bank-executes-its-first-cross-border-renminbi-netting-transaction-for-bosch?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "September 21, 2016",
    "tags": [
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Deutsche Bank executes its first cross-border Renminbi netting transaction for Bosch",
    "body": "Deutsche Bank today announced that it has successfully executed its first cross-border Renminbi netting transaction for Bosch under People's Bank of China (PBOC)’s centralised cross-border Renminbi management by multinational companies scheme.\nHeadquartered in Germany, Bosch is a leading global supplier of technology and services. The company’s operations consist of four business sectors – Mobility Solutions, Industrial Technology, Consumer Goods, as well as Energy and Building Technology.\nThe Bosch Group has a global netting centre in Germany for cross-border settlement transactions among intra-group companies. As part of the solution, Deutsche Bank has implemented a customised process to consolidate the RMB cross-border transactions of Bosch’s China entities and settle with Bosch’s global netting centre on a pre-defined netting schedule.\nComment\nChristian Zeidler, Head of Corporate Finance and Regional Treasury for APAC at Bosch, said: “This Renminbi netting solution will significantly benefit our global treasury operations with improved transaction costs due to the reduced number of payments, better global liquidity management across the group, and minimised onshore FX exposure by centralizing FX management in HQ Germany. Our China subsidiaries are now another step closer to full integration in our global treasury operations.”\nMahesh Kini, Managing Director, Head of Trade Finance & Cash Management Corporates – China at Deutsche Bank, said: “We are pleased to have implemented this solution for the Bosch Group. Through the first netting transaction executed, Deutsche Bank was able to consolidate approximately 2000 cross-border payments into a single transaction, and save considerable costs and efforts to Bosch entities in China. This solution demonstrates our ability to offer a full suite of RMB cross-border solutions and is also another milestone in our efforts to bring innovative solutions to our key global clients operating in China.”\n\nSuman Chaki, Managing Director, Head of Cash Management Corporates – Asia Pacific at Deutsche Bank, said: “This is a great achievement for Deutsche Bank. This successful transaction demonstrates our ability to implement customised solutions for our corporate clients to meet their cross-border transaction needs, especially in a key market like China.”\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nDeutsche Bank in China\nDeutsche Bank first established a presence in China in 1872 with the opening of its first overseas office in Shanghai. Headquartered in Beijing, Deutsche Bank China completed local incorporation in 2008, currently with branches in Beijing, Shanghai, Guangzhou, Tianjin, Chongqing, Qingdao, and a sub-branch in China (Shanghai) Pilot Free Trade Zone. Deutsche Bank has a regional hub in Hong Kong SAR, which celebrated its 50th year of operation in 2008. The bank also maintains securities representative offices in Beijing and Shanghai.\nThrough rapid organic growth and strategic investments, Deutsche Bank’s core global businesses are all active in China. These include corporate advisory and capital markets, transaction banking, as well as wealth management.\nOn the asset management front, Deutsche Bank holds a 30% strategic investment in Harvest Funds Management – one of the country’s leading investment managers.\nIn July 2009, the joint venture between Deutsche Bank and Shanxi Securities – Zhong De Securities Co. Ltd. – received a securities business license from the China Securities Regulatory Commission (CSRC). Zhong De Securities is currently approved to underwrite and sponsor stocks and bonds (including A-shares, foreign investment shares, government bonds, and corporate bonds), as well as provide corporate advisory services in the domestic capital market. Deutsche Bank holds a 33.3% ownership in the joint venture.\nFor more information about Deutsche Bank China:\nhttps://china.db.com.\n\nThis press release has been approved and/or communicated by Deutsche Bank AG or by its subsidiaries and/or affiliates (“DB”). Deutsche Bank AG is authorised under German Banking Law (competent authority: BaFin - Federal Financial Supervisory Authority) and by the Prudential Regulation Authority and subject to limited regulation by the Financial Conduct Authority and Prudential Regulation Authority.\nDetails about the extent of our authorisation and regulation by the Prudential Regulation Authority, and regulation by the Financial Conduct Authority are available from us on request. Securities and investment banking activities in the United States are performed by Deutsche Bank Securities Inc., member NYSE, NASD and SIPC, and its broker-dealer affiliates. Lending and other commercial banking activities in the United States are performed by Deutsche Bank AG, and its banking affiliates. Copyright (C) 2016 Deutsche Bank AG",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}