{
    "url": "https://www.db.com/news/detail/20160920-10-best-places-to-be-a-social-entrepreneur?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 20, 2016",
    "tags": [
        "Corporate Citizenship",
        "Entrepreneurship",
        "Research"
    ],
    "title": "10 best countries to be a social entrepreneur",
    "body": "The US is the best place for social enterprises, followed by Canada, the UK, Singapore and Israel. Completing the top ten are Chile, South Korea, Hong Kong, Malaysia and France.\nThe research\nThe research “The Best Countries To Be A Social Entrepreneur 2016” looked at the progress of social enterprise across the globe. It is significant as there has been limited tracking of the social enterprise sector to date. In the first-ever global experts’ poll survey of social enterprise, the Thomson Reuters Foundation polled more than 900 experts in 44 countries. The questionnaire was drafted by the Thomson Reuters Foundation in collaboration with StarMine, UnLtd and Deutsche Bank.\n“Being part of this research enables Deutsche Bank to help build momentum and capacity for this exciting sector. We are proud to be working with the Thomson Reuters Foundation and UnLtd to further develop the market and the conditions for success,” said Lareena Hilton, Global Head of Brand Communications & CSR.\nLeading hotspots\nThe research confirmed that social entrepreneurship is growing rapidly around the world, with 85% of respondents saying that social enterprise is becoming more established in their own countries. The findings identify Santiago and Nairobi as the leading hotspots for social entrepreneurs, together with Berlin, London and Hong Kong. The results showed that experts believe that women are well represented in management roles within the industry and that Asia offers the most favourable environment for female social entrepreneurs.\nFindings at the SOCAP\nThe research findings were announced at the SOCAP (Social Capital Markets) 2016 annual flagship conference in San Francisco last week.\nThe SOCAP is the leading gathering for impact investors and social entrepreneurs and is dedicated to increasing the flow of capital toward social good.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}