{
    "url": "https://www.db.com/news/detail/20160919-deutsche-bank-and-axel-springer-plug-and-play-join-forces-to-invest-in-technology-start-ups?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "September 19, 2016",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank and Axel Springer Plug and Play join forces to invest in technology start-ups",
    "body": "Deutsche Bank is moving one step closer to Europe’s start-up scene by partnering with the start-up accelerator Axel Springer Plug and Play to select, develop, and finance up-and-coming technology companies from sectors such as banking and insurance.\nBoth companies have now signed a cooperation agreement in Berlin. Axel Springer Plug and Play, a joint venture between the media company Axel Springer and California-based Plug and Play Tech Center, is Europe’s leading accelerator for the development of technology start-ups in the media and financial sectors. In its role as a financial institution, Deutsche Bank will be an exclusive Axel Springer Plug and Play partner.\nThrough this cooperation, both companies are pushing for a faster, more targeted way to find promising digital start-ups from sectors such as banking and insurance, support their business success and provide financing.\n1With Axel Springer Plug and Play, we have the right partner for finding the best digital start-ups throughout Europe,\n\n1For us, this is a strategic step towards accelerating the digital transformation of our core business and investing in new digital business models.\nMarkus Pertlwieser, Chief Digital Officer (CDO) of Deutsche Bank’s Private, Wealth & Commercial Clients (PW&CC)\nJörg Rheinboldt, Managing Director of Axel Springer Plug and Play: “Fintech and insurtech are rapidly developing sectors. Innovative start-ups are growing strongly and are changing user behaviour for good. Our accelerator programme has demonstrated that we are capable of spotting successful start-up teams and business models early in the game and supporting them in their growth, even in these sectors.\nHaving Deutsche Bank as a partner gives us additional expertise and the means to build on this basis in a targeted manner. We are delighted that we will be able to do an even better job of supporting start-ups in the future by working together.”\nDeutsche Bank will help select technology start-ups and will cooperate with Axel Springer Plug and Play to offer them support, workshops, and financing. In return, the bank will gain a seat on the selection committee, with voting rights. Axel Springer Plug and Play will retain a majority in the decision-making body. The start-ups selected to receive funding will also gain access to the bank’s Innovation Labs and its Digital Factory in Frankfurt, allowing Deutsche Bank to combine the new partnership with its own research and development activities in the field of digitalisation.\nAxel Springer Plug and Play has already invested in 86 digital companies. As part of a 100-day programme, it provides them with EUR 25,000 in seed financing and access to experts and mentors, as well as the use of offices at a co-working space. The best digital business models receive follow-on financing. More than 1,500 start-ups have applied for support from Axel Springer Plug and Play in the past three years. The start-ups selected to receive funding come from 32 countries, including the US and Israel.\nFor further information please contact:\nDeutsche Bank AG\nPress & Media Relations\nChristoph Blumenthal\nPhone: +49 69 910 47048\nE-mail: christoph.blumenthal@db.com\nAxel Springer Plug and Play Accelerator GmbH\nConstantin von Bergmann-Korn\nPhone: +49 30 2591 78043\nE-mail: constantin.von-bergmann-korn@axelspringer.de\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nAbout Axel Springer Plug and Play\nLaunched in 2013, the Axel Springer Plug and Play Accelerator is an early-stage startup accelerator based in Berlin. It is a joint venture between Axel Springer SE and the Plug and Play Tech Center from Silicon Valley. Three times a year, Axel Springer Plug and Play runs a 100-day program to provide startups with coaching, workshops, networking, 25,000 euros in funding and office space.\nThe program ends with so-called \"Demo Day,\" where startups pitch in front of an elite audience of local and international venture capital firms for additional seed and Series A funding. Axel Springer Plug and Play Accelerator takes a 5 percent stake in the companies in return for its support.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}