{
    "url": "https://www.db.com/news/detail/20180816-deutsche-bank-celebrates-40-years-in-belgium?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "August 16, 2018",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank celebrates 40 years in Belgium",
    "body": "Nearly all the members of the Board of Managing Directors travelled to Brussels for the opening back then. They are pictured here with the managers of the new branch\nDeutsche Bank began business in Belgium in Brussels and Antwerp, with both branches opening on August 16, 1978. In the beginning there were 50 employees – 32 in Brussels and 18 in Antwerp. Together the two locations constituted a so-called composite branch: the administrative departments were in Brussels, while all the sales-oriented departments were represented at both locations.\nStaff had to wait a further two months for the official inauguration. However, nearly every member of the Board of Managing Directors came to Belgium for the grand opening of the Brussels branch on October 16 and the Antwerp premises on October 17, 1978. Along with the inauguration came the listing of Deutsche Bank shares on the Brussels and Antwerp stock exchanges, where they were traded until 2006.\nBy opening these two branches Deutsche Bank continued its tradition of having a presence in Belgium, which began with its first branch in Brussels that operated from 1910 until 1918. Since the mid-1970s the bank had been considering re-entering Belgium. After opening branches in London (1976) and Paris (1977) establishing a presence in Brussels was a logical next step as the city was not only the headquarters of the most important institutions of the European Community, but also of many multinational corporations.\nDeutsche Bank shares are quoted for the first time on the Brussels stock exchange\n\nDeutsche Bank Antwerp, Boulevard Frankrijklei 156\nThe plans were soon expanded to include Antwerp as the second branch head office. This was justified by the importance of its port and the large volume of German investments in the region. The Board of Managing Directors of Deutsche Bank therefore resolved in April 1977 to open branches in both Brussels and Antwerp at the same time. In January 1978 a working group chaired by future branch managers Axel Wiesener and Eberhard Weiershäuser began the preparations at head office in Frankfurt.\nFirst of all, the application for a licence had to be submitted to Belgium's banking commission. The next task was to find appropriate office premises in Brussels and Antwerp. A temporary office was opened on the Place des Barricades in Brussels in April 1978. This was where the process of hiring Belgian employees began. In July, the new building in the city’s banking district was ready to be occupied so the branch moved into offices at Boulevard du Régent 50 where it stayed until 1987. In Antwerp the bank moved in at Boulevard Frankrijklei 156.\nIn 1998 Deutsche Bank acquired the Belgian branches of Crédit Lyonnais, thereby entering the broader private clients business. Since then Deutsche Bank has achieved sustained growth in the Belgian market. Assets under management have quadrupled over the past ten years, which makes Deutsche Bank one of the ten leading commercial banks in Belgium.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}