{
    "url": "https://www.db.com/news/detail/20180816-deutsche-bank-wealth-management-hires-claudio-de-sanctis-to-boost-growth-as-new-europe-head?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "August 16, 2018",
    "tags": [
        "Corporate products",
        "Wealth"
    ],
    "title": "Deutsche Bank Wealth Management hires Claudio de Sanctis to boost growth as new Europe head",
    "body": "Deutsche Bank announced today that it has hired Claudio de Sanctis as Head of Europe. In this newly formed role, de Sanctis will help boost growth in the region by building on its leading position serving clients in Germany and other domestic markets.\nDe Sanctis joins the wealth management business of Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) on December 1, 2018, from Credit Suisse, where he spent five years, most recently as Head of Private Banking, Europe. He will be based in Zurich, reporting to Fabrizio Campelli, Global Head of Wealth Management.\nThe newly formed Europe region includes Germany, where Deutsche Bank Wealth Management is the market leader, and more than a dozen other markets including Switzerland, the UK, Italy, Spain and France.\nThe Europe region is the backbone of our business and I’m very excited to have someone of Claudio’s calibre joining Deutsche Bank Wealth Management at a time when we’re so focused on strategic growth. He’s another excellent addition to the team as we invest in great people and technology to serve our sophisticated clients in Europe and around the world.\nFabrizio Campelli\nDeutsche Bank is investing in growing Wealth Management as a core element of its strategic objective to achieve a more stable and balanced business mix. The business has made a series of high-profile hires in recent months and built out areas such as wealth planning, philanthropy and risk-return engineering.\nCampelli said: “Wealth Management stands for a lot of what makes our bank unique: a truly global presence, strong relationships and the ability to put the whole organisation to work for the benefit of our clients.”\nFurther background on Claudio de Sanctis\nClaudio de Sanctis was most recently Head of Private Banking, Europe, at Credit Suisse, which he joined in 2013 as Market Area Head Southeast Asia for Private Banking, Asia Pacific. He previously spent seven years at UBS Wealth Management Europe, most recently as Market Head Iberia and Nordics. Earlier in his career he was Head of Key Clients Unit Europe at Private Banking in Barclays focusing on UHNW clients and also worked at Merrill Lynch Private Wealth Management EMEA.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}