{
    "url": "https://www.db.com/news/detail/20180814-torsten-slok-to-be-successful-add-value-to-the-thought-process?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "August 14, 2018",
    "tags": [
        "Research"
    ],
    "title": "Torsten Slok: \"To be successful, add value to the thought process\"",
    "body": "Chief International Economist Torsten Slok was a recent guest on Bloomberg Radio’s “Masters in Business” when he discussed a wide range of topics including market risks, inflation, central banks and a touch of work-life balance. Hosted by Bloomberg Columnist Barry Ritholtz, “Masters in Business” takes an in-depth look at today’s most influential thought leaders in business and finance.\nRitholtz said Slok sees the world from a very holistic perspective by looking at markets and the economy in a very broad, making his research among the most interesting and useful in the industry. The interview addresses how economics intersects with markets and investing, and how to think about what drives the economy and longer-term cycles. Here is a selection of Slok’s top quotes:\nDeutsche Bank’s “30 Market Risks for 2018”…\n“The risks can be categorized into buckets and one is the economic risk, which is where we are in the business cycle. Is there a higher risk of overheating? What sectors of the economy are out of balance? Is CapEx out of balance, are financial markets out of balance, is the banking sector — is the case that you have the housing market out of balance? The short answer is we worry a lot more about overheating and inflation rather than about recession.”\n“The second part of the list is a bucket of geopolitical risks……the trade war is on the radar screen now and we have discussions with equity investors who think that’s a big deal; but rates investors don’t think it’s a big deal because the macro implications are relatively limited.”\nInflation…\n“We think that by the end of this year, inflation is here. First, unemployment is low relative to where it was a few years ago. We’re a bit above full capacity (employment) so that’s the number one reason that’s different today. The second reason is the dollar is going down and when this happens, inflation goes up. Fiscal expansion and the trade war and tariffs will also have modest upward pressure on prices.”\nLow volatility in 2017…\n“A very important backdrop in 2017 was that monetary policy was very, very easy for many years. So in some sense this was driving markets. Essentially equities have done incredibly well simply because the amount of support not only from the Fed but also from the ECB, BOJ, S&P even PBOC in China. We saw significant money printing that needed to find a home outside of fixed income. Equities probably benefited, which was the intention from the significant amount of money printing.”\nRisks that investors or economists may be overlooking…\n“The fiscal expansion requires a lot of net issuance of treasuries and if you expand the amount of safe assets in the world, you are beginning to compete with more risky assets. This is exactly what we’re seeing in some sense with the T-bill competing with LIBOR….. if you suddenly offer investors a lot more risk-free assets like US treasuries, then investors would rather have a risk-free asset rather than a risky asset. In practical terms the US government needs to essentially double the issuance of treasuries over the next 18 months, which is what is in the pipeline.”\nSlok’s favorite economic indicator…\n“The ISM (Institute for Supply Management manufacturing index) has historically proven to be the highest correlation with GDP so I would say that’s definitely at the top of the list. Nonfarm payrolls and how many jobs we are creating, and what the unemployment rate is doing are a close second. The employment report also gives a wealth of information about what’s going on in the economy; what sectors are doing better, and what sectors are doing worse.”\nOn his chart-based approach to sharing research with clients…\n“To be successful, you need to get people’s attention by adding value to the thought process. Some of the goal is to be a little bit wild and unusual because there’s a lot of things going on that are very relevant. If I only send charts with inflation and unemployment, you would say, okay, I already know those things. So we try to have a mix of things that are sort of punchy and informative that will provide value in how you think about the investment process.”\nOn the importance of work-life balance….\n“Everything I have done in my career has had the right work life balance. For the last the 12, 13 years in the job I have today, it’s tempting to say the sky is the limit. But it would be a failure if you spend too much time on your job and too little time on other things. I’m not only talking about family and spouse and children, but also on friends and sports and doing things that are fun. I love talk about inflation and unemployment in markets, but we can’t do that like all day long. I play soccer once a week on the Brooklyn Bridge Pier Five. We are completely hopeless but it’s fun and we play to win.”",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 1
}