{
    "url": "https://www.db.com/news/detail/20180810-deutsche-bank-continues-to-invest-in-european-fund-for-southeast-europe?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "August 10, 2018",
    "tags": [
        "Corporate products",
        "Entrepreneurship",
        "Research",
        "Sustainability"
    ],
    "title": "Deutsche Bank continues to invest in European Fund for Southeast Europe",
    "body": "The European Fund for Southeast Europe (EFSE) and Deutsche Bank have once again partnered to mobilize private institutional capital for micro and small enterprise (MSE) finance in Southeast Europe and the European Eastern Neighbourhood region.\nThrough the placement of two tranches of three-year floating-rate notes in the amount of USD 20 million and EUR 40 million, Deutsche Bank has made the equivalent of EUR 57 million available for private investors to participate in EFSE’s mission of investing in the economic development and prosperity of its target region.\nBy providing funding to local banks and microfinance institutions, EFSE provides key support to MSEs in Southeast Europe and the European Eastern Neighbourhood region – a sector that plays a pivotal role in fostering growth and securing employment. As of 31 March 2018, EFSE had outstanding loans of EUR 891 million to nearly 140,000 end-borrowers among MSEs and households. Since its inception, EFSE has financed a total of more than 927,600 loans for an aggregate value of EUR 6.6 billion, and contributed to the creation of well over 760,000 jobs throughout the target region.\nEFSE was created in 2005 by the Development Bank KfW (KfW), with financial support from the German Federal Ministry for Economic Cooperation and Development (BMZ) and the European Commission.\nThe privately managed fund is set up as a public-private partnership and registered in Luxembourg. Funding by public investors is complemented by private capital investments, providing a broader and more robust funding platform for development finance. The fund’s structure builds on various investment classes with varying degrees of risk, enabling the cooperation of public donors, international financial institutions and ethically oriented private investors in order to mobilize the most capital for the greatest impact. Notes are part of the senior tranche, which, having the lowest default risk, is aimed at institutional private investors.\nEFSE is a prime example of working towards the Sustainable Development Goal of partnerships by fostering relations between the different players in the economic ecosystem, including private investors, donors and local players. In addition, the investment of Deutsche Bank again highlights the importance of tapping the power of private capital as key to achieving the ambitious Sustainable Development Goals set out by the U.N. in 2015 – among these being decent work and economic growth, along with industry, innovation and infrastructure. EFSE stands for all of these aspects of a healthy and robust financial system, which forms the basis of prospects and a secure economic future. I am very pleased to continue our successful partnership with Deutsche Bank in opening up private investor opportunities to this growing region.\nChristoph Tiskens, EFSE Board Chairman\n“Investors are seeking sustainable and responsible investments. The EFSE is an attractive opportunity and sets a great example for other public-private partnerships. As a strategic partner to EFSE, Deutsche Bank is very pleased to contribute to the Fund’s success by repeatedly mobilizing private capital”, says Stefan Hoops, Deutsche Bank’s global Head of Sales.\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Contact\nEduard Stipic\nPhone: +49 69 910-41864\nEmail: eduard.stipic@db.com\nFinance in Motion (Fund Advisor to EFSE)\nMarketing & Communications\nMerle Römer\nPhone: +49 69 271035 171\nEMail: press@efse.lu\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nAbout the European Fund for Southeast Europe\nThe European Fund for Southeast Europe (EFSE) was initiated by KfW Development Bank (KfW) with the financial support of the German Federal Ministry for Economic Cooperation and Development (BMZ) and the European Commission. It aims to foster economic development and prosperity in Albania, Armenia, Azerbaijan, Belarus, Bosnia and Herzegovina, Bulgaria, Croatia, former Yugoslav Republic of Macedonia, Kosovo, Georgia, Moldova, Montenegro, Romania, Serbia, Ukraine and Turkey. As access to finance is a key success factor in developing the micro, small and medium enterprise segments, EFSE focuses on assisting local financial sectors in strengthening their ability to ensure adequate and sustainable financing.\nThe funding EFSE provides as long-term finance is channelled to loan customers – primarily micro and small enterprises (MSEs), but also private households for home improvement – through local partner lending institutions. Supporting EFSE’s investment activities is the EFSE Development Facility, which provides partner lending institutions with technical assistance, consulting and training services to build operational capacities and professional management.\nInitiated by KfW Development Bank (KfW) on 15 December 2005 from four multi-donor programs under its management, EFSE is the first public-private partnership of its kind and the first privately managed fund in development finance to leverage private funding for MSE finance in the target region.\nCapital is provided by donor agencies, international financial institutions and private institutional investors, including:\nthe German Federal Ministry for Economic Cooperation and Development (BMZ),\nthe European Commission (EC),\nthe Government of Albania, Small and Medium Business Credit Support CJSC (SMBCS), a subsidiary of the Central Bank of Armenia,\nthe Development Bank of Austria (Oesterreichische Entwicklungsbank, OeEB),\nthe Swiss Agency for Development and Cooperation (SDC),\nthe Danish International Development Agency (Danida),\nKfW as Lead Investor, the International Finance Corporation (IFC),\nthe Netherlands Finance Company (FMO),\nthe European Bank for Reconstruction and Development (EBRD),\nthe European Investment Bank (EIB),\nand Deutsche Bank.\nHauck & Aufhäuser Asset Services S.à r.l., Luxembourg, acts as EFSE’s Fund Manager and Finance in Motion GmbH, Germany, as Advisor.\nFor more information about the European Fund for Southeast Europe, please visit https://www.efse.lu/\nFollow the EFSE on Facebook at facebook.com/EFSEfund and Twitter twitter.com/efsefund",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 32
}