{
    "url": "https://www.db.com/news/detail/20180810-deutsche-bank-wealth-management-steps-up-growth-plans?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "August 10, 2018",
    "tags": [
        "Company",
        "Corporate products",
        "Strategy",
        "Wealth"
    ],
    "title": "Deutsche Bank Wealth Management steps up growth plans",
    "body": "Deutsche Bank Wealth Management is stepping up its growth plans a year after announcing it would hire 100 new client-facing employees to meet surging client demand around the world for sophisticated international private-banking services.\nPatrick Campion, Head of Wealth Management Americas, told the Financial Times this week that the US business is on a mission to “grow, grow, grow”. Ultra-high net worth wealth is growing at over twice the rate of GDP in the US, with wealth creation concentrated in areas like New York, California, Miami and Chicago.\n“The growth characteristics for our market are strong and it makes sense to invest in the US,” Campion told the Financial Times. “We’re at a turning point for our business. The future looks bright.”\nA quarter of WM’s new front-office hires are in the Americas, a half in Asia Pacific, and most of the remainder in the UK, Middle East, Italy and Spain.\nThe Asia Pacific region is still recruiting intensively after bringing on board about 100 relationship managers and infrastructure employees in the first half, Lok Yim, regional head of the business, said in an interview with Bloomberg this week.\n“I don’t think there’s a limit apart from what we can digest,” Yim told Bloomberg. “We want to grow, but sustainably and safely.”\nFuelled in part by demographic change as baby boomers prepare to transfer their wealth to the next generation, the WM business is building out areas such as wealth planning, philanthropy, managed investments, institutional investors and risk-return engineering.\nAt the same time, WM is investing in client-focused digital technology and recently won a prestigious technology award for its NextGen app, which offers millennial clients opportunities for networking and sharing information.\n“The market is growing as wealth increases, and we have the excellence to participate in that,” Deutsche Bank Chief Executive Officer Christian Sewing said at the Annual General Meeting in Frankfurt in May.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}