{
    "url": "https://www.db.com/news/detail/20180801-100-homes-for-100-families?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "August 1, 2018",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "100 homes for 100 families",
    "body": "Colleagues from Deutsche Bank South Africa marked the centenary of Nelson Mandela’s birth by volunteering on local community projects that support the political leader and philanthropist’s call to “make of the world a better place.”\nContinuing the bank’s longstanding tradition of celebrating Nelson Mandela Day on July 18, 10 colleagues helped to build a home for a family in the Lawley township on the outskirts of Johannesburg. The Plus You programme contributed to Habitat For Humanity South Africa’s campaign to build 100 homes for 100 families.\nGugu Motsei from the Operations team/Global Transaction Banking said: “It was a well-structured and organized event. I felt a great sense of altruism achieved through helping to build a decent home for one of the 100 families in need.”\nAnother 100 Deutsche Bank employees and family members took part in the annual MTN 702 Walk the Talk held on Sunday 22 July. They walked to raise awareness for one of Deutsche Bank’s Born to Be project partners, the Youth Citizens Action Programme. The programme asks young people, through school-based projects, to lead the way in addressing the challenges we face as a society. Helen Mokoena, Operations Expert in Global Business Services commented: “Walking for a good cause with my family is great, it also teaches my children about the challenges others are facing.”\nOn top of the hands-on involvement of our volunteers, Deutsche Bank made a direct donation to Rise Against Hunger Africa that will help to provide 15,000 nutritious meal packs to Early Childhood Development centers around the Johannesburg area.\n“Helping those at the margin of society is an integral part of our CSR agenda. We act to enable communities and economies to prosper and contribute to the revitalization of distressed areas” says Lareena Hilton, Global Head of Brand Communications & Corporate Social Responsibility.\nHabitat for Humanity is a longstanding partner of Deutsche Bank in other regions as well. Recently, several Wealth Management colleagues participated in a Brush with Kindness volunteer day. The Brush with Kindness programme of Habitat for Humanity New York City offers painting, landscaping and minor repair services for underfunded public spaces, ensuring well-maintained and uplifting neighborhoods for all New Yorkers.\nIn Thailand, 78 volunteers travelled to the Phetchaburi Province, about 150 kilometers from Bangkok, and demonstrated that bankers can lend a helping hand in construction efforts. They spent their time in knee deep water, using natural materials such as rocks and bamboo to build two check dams – small, sometimes temporary dams - for the local community.\nMandela Day\nEvery year on July 18, Nelson Mandela Day remembers Mandela’s achievements in working towards conflict resolution, democracy, human rights, peace, and reconciliation. Nelson Mandela Day invites people and organizations to take action and inspire change. In South Africa, Deutsche Bank has a long tradition in celebrating this day organizing Plus You volunteering activities to make a difference in the local community.\nPlus You – Deutsche Bank’s Volunteering and Giving Community\nWe encourage our employees to become involved as Corporate Volunteers whenever they can to maximise the impact of our CSR programmes. In 2017, more than one in five Deutsche Bank employees (excl. Postbank) – 17,417 people globally – volunteered over 235,000 hours in our education, enterprise, and community projects. We incentivise volunteering through paid leave, charitable donations, and in-kind support.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}