{
    "url": "https://www.db.com/news/detail/20221123-how-we-live-from-grey-to-green?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 23, 2022",
    "tags": [
        "Employee engagement",
        "Sustainability"
    ],
    "title": "How We Live: from grey to green",
    "body": "Cities are the driving forces of modern life. By 2050 as much as two-thirds of the global population will be urban. Green spaces are an essential part of any city, for biodiversity as well as mental and physical health. Our environmental impact programme How We Live advocates for parks, playgrounds and other community resources that provide green among the grey. And since a sustainable city is also an inclusive city, we support projects that widen economic opportunities connected to the environment as well.\nResearch shows cities are especially vulnerable to climate change. New York has recognised rising temperatures and sea levels are not the only threats to its long-term future, so it is working in parallel to address the social inequality that limits access to economic opportunity for some of its citizens. Our partnership with JobsFirstNYC helped launch The Green Economy Network, which aims to provide under-represented New Yorkers with the knowledge, skills and resources to find well-paid jobs in a local economy being reshaped by climate, sustainability and resiliency challenges.\nThe city’s creative sector is playing its part in protecting the environment. Arts and education centre Materials for the Arts promotes creative reuse of unwanted materials. Instead of adding to landfill, materials are put in the hands of arts professionals, educators and school students across the city, free of charge, to create something new. Deutsche Bank volunteers support educational and outreach programmes that promote a broader sustainability curriculum.\nOne of the objectives of How We Live is to build a deeper understanding of the natural world and New York is home to one of the most innovative examples of youth education on urban environmental issues anywhere. Brotherhood Sister Sol uses community gardening to engage youth in the Harlem Neighborhood. By maintaining greenhouses and gardens and running a local farmers market, these young people gain valuable skills while demonstrating the potential of urban agriculture to their community.\nThe environmental movement in cities is transforming otherwise unused land into vibrant community gardens and urban farms. Thanks to the ingenuity of Cidades Sem Fome, urban vegetable gardens are popping up throughout Brazil. The project turns empty areas into viable green spaces where neighbourhood residents can work, plant and grow.\nDeutsche Bank employees recently helped create a new garden in eastern São Paulo, where unemployment and food insecurity are high. Their colleagues in Germany and the UK are also involved in local environmental conservation and community development, teaming up to build new gardens, maintain playgrounds and protect biodiversity in partnership with local organisations.\nCommunity bonds matter more than ever as the rising cost of living creates hardship for those who can least afford it. Deutsche Bank volunteers in London help neighbours in need through the Felix Project, a local charity that rescues fresh food from going to waste so it can be made into healthy meals. Bringing communities together is the goal of the Polish-German Gardens project in Warsaw too. As well as being a symbol of the friendship between Poland and Germany, Skaryszewski Park is an educational resource on the garden cultures of both countries. Local Deutsche Bank volunteers help maintain the park.\nPreserving parks and increasing green spaces helps reduce the adverse environmental impact of cities, one of the targets of UN Sustainable Development Goal (SDG)11: Sustainable Cities and Communities. But making that a reality requires all of us to be more conscious of the environment — to improve where we live, we need to change how we live.\nDeutsche Bank employees in India have taken matters into their own hands when it comes to dealing with one of the most prevalent environmental issues in their society. According to government estimates the country produces 3.5 million metric tonnes of plastic waste every year, most of which ends up in landfill or the ocean where it causes severe harm to the environment and marine life. The cheap plastic bags used by street vendors add to the problem, so employees used their annual volunteering event, named The Power of One, to make more than 11,500 environmentally friendly paper bags for vendors to use instead.\nAll the employees who volunteer on projects around the world embody the principle behind How We Live: we share responsibility for the world around us, and when we work together to protect the environment, the results are more powerful and far-reaching.\nMore information can be found on our How We Live website.\n   ",
    "number_of_ratings": 36,
    "rating": 3.0,
    "likes": 32
}