{
    "url": "https://www.db.com/news/detail/20221123-deutsche-bank-private-bank-outlook-2023?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 23, 2022",
    "tags": [
        "Capital markets",
        "Wealth"
    ],
    "title": "Outlook 2023 from Deutsche Bank Private Bank CIO",
    "body": "Today Deutsche Bank Private Bank’s Chief Investment Office (CIO) released its investment outlook for 2023, identifying 12 key themes underpinning investment conditions in the new year. \nThe outlook, coined ‘Resilience versus Recession’, looks through the current inflationary environment to see opportunities in capital markets and fixed income, while navigating recession risk in the Eurozone and the US, and transition risk with energy and ESG.\nGlobal Chief Investment Officer Christian Nolting said: “Overall on the outlook for 2023 we are cautiously optimistic.  We expect mild recessions in Europe and the US, but improving dynamics in Asia where supply chains are all but resolved. As rates stabilize and inflation abates, there should be opportunity for equities and fixed income, while alternatives like real estate and private equity offer potential risk premia.”\nThe CIO’s key themes for next year are:\nGrowth – Stop and go. Mild recessions expected in Europe and the U.S. in 2023 – but improving growth dynamics in China and India and supply chain issues all but resolved. Technology is key to upping productivity growth to enhance economies’ sustainable growth potential.\nInflation – Lower and higher. Price rises will moderate due to easing commodity prices, unchained supply chains and central bank action but inflation will remain a problem in 2023. Upside risks from complacent central banks, expansionary fiscal policy, wage demands and effects of income redistribution.\nPolitics – The United States of Europe? Russian and energy crisis leading to defence and energy cooperation Joint financing of major fiscal initiatives (e.g. the Green Deal and NextGenerationEU) also points the way forward and ECB is fostering a common money and bond market.\nBonds – Approaching equilibrium (1998-2014). 2022 sell-off opens up fresh yield opportunities in 2023 against a medium-high but managed inflation background. Most yields already up to 1998-2014 average levels. Yield and quality not a contradiction anymore with fundamentals solid – focus on liquidity.\nFX – King dollar: turnaround. Dollar dominance now poised to fade with aggressive U.S. hiking cycle sufficiently priced in. Euro may stabilize given persistent Eurozone inflation (relative to U.S.). Currency wars unlikely as commodity import price concerns dissuade competitive devaluations.\nStocks – From TINA to TAPAs? Slower economic growth will lead to earnings downgrades – but inflation will keep them moderate. Lower bond volatility key to sustained performance. U.S. markets dominated by secular growth stories; Europe a classic value play; China near maximum pessimism.\nInfrastructure – The best is yet to come. Infrastructure is the backbone of sustainably growing economies. Climate change and the energy crisis require huge public and private investment – with opportunities here and in other new economy (digitalization) and old economy areas.\nAlternatives – If you don’t like beta, try alpha. Alternatives may provide risk premia and active return (alpha) above overall market gains (beta). Real estate a potential inflation hedge. Private equity and debt have their own opportunities and challenges, but with potential diversification benefits.\nRisks – Known unknowns. Geopolitics (e.g. Taiwan), monetary policy errors, liquidity crises, real estate crash, tech wars – and don’t forget the “unknown unknowns”. Biggest concern is a bond market sell-off, with U.S. Treasury yields up to 7% or more.\nPortfolios – Comeback of 60/40. Inflation necessitates a focus on purchasing power with equities providing a potential. Expect further questioning of bonds’ stability function in portfolios. Frequent portfolio adjustments may be necessary. Look for alternative sources of risk and return.\nAsia – Hope in the year of the rabbit. China’s economy to pick up pace in 2023 with greater political clarity and more market-relevant initiatives. Regional reopening continues with global production chains normalizing. Chinese equities could be a major value trade; Indian equities may offer tech opportunities.\nESG – Energy transition: climate is a macro essential. COP27 commitments complement major recent policy initiatives in the EU and U.S. But we need to factor in the ideas and goals of developing economies too – with social issues given high priority. A successful energy transition must be seen as fair.",
    "number_of_ratings": 29,
    "rating": 4.6,
    "likes": 13
}