{
    "url": "https://www.db.com/news/detail/20221109-deutsche-bank-expands-support-for-egypt-s-sustainability-ambitions?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 9, 2022",
    "tags": [
        "Sustainability"
    ],
    "title": "Deutsche Bank expands support for Egypt’s sustainability ambitions",
    "body": "Deutsche Bank is expanding its support for the Government of Egypt’s ambitious plans for energy transition by becoming a founding member of a dedicated private sector finance working group.\nThe six-bank working group was created by The Glasgow Financial Alliance for Net Zero (GFANZ), a global coalition of leading financial institutions committed to accelerating the decarbonization of the economy. It will  support Egypt’s enhanced efforts to achieve inclusive and sustainable growth, including a low-carbon emissions goal and developing resilience and adaptability to climate change. These plans are part of Egypt’s so-called Nexus for Water, Food & Energy (NWFE).\nIt will specifically focus on identifying barriers to sourcing the necessary private investment, advocating for the reforms necessary to address those barriers, and identifying approaches that could help attract private finance at scale.\nClaire Coustar, Global Head of ESG and Sustainable Finance Fixed Income & Currencies, said: “Deutsche Bank has a long-standing presence in Egypt, having been in the country for over 60 years and facilitating landmark transactions including Egypt’s inaugural green bond. Egypt continues to be an important client and market for Deutsche Bank, and we are extremely pleased to be able to continue our support for Egypt through the GFANZ-led working group and the mobilisation of private capital required for the country’s national Climate Change Strategy 2050.”  \nThe GFANZ Private Sector Finance Working Group for Egypt’s Nexus for Water, Food & Energy also includes Bank of America, Citigroup, Commercial International Bank (CIB), HSBC and Standard Chartered.",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 10
}