{
    "url": "https://www.db.com/news/detail/20221102-how-we-live-digging-deep-for-life-on-land?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 2, 2022",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement",
        "Sustainability"
    ],
    "title": "How We Live: digging deep for life on land",
    "body": "Research from the United Nations shows that land biodiversity is declining faster than at any time in human history. Deforestation is just one aspect of the damage to land that is contributing to climate change, affecting lives and livelihoods, and putting species at risk of extinction. Nourishing biodiversity on land is one of the goals of our environmental impact programme, How We Live, through interventions that range from tree planting to sustainable farming.\nPlanting a tree has multiple positive impacts. Forests are habitats to more than 80 percent of all species and play an important role in human life, too, supplying us with water, purifying the air we breathe and shielding us from the effects of storms and floods. How We Live builds on Deutsche Bank’s long-standing involvement in restoring woodland: since 2010, our employees have planted over half a million trees worldwide.\nOur global initiatives\nIn Asia Pacific, employee volunteers in nine countries are helping us reach the milestone of 100,000 trees planted in the region.\nAt the Gaia Nature Conservation Centre in Vietnam, trees planted by Deutsche Bank employees will help sustain local wildlife that includes an endangered elephant population. The impact of these conservation efforts will be measured scientifically to contribute to wider environmental research and policy.\nMany How We Live projects also combine action with education.\nIn the Philippines, Japan and Singapore, planting is used to build community responsibility for the environment. Meanwhile in India a project in partnership with Swades Foundation aims to keep communities together by establishing fruit-bearing tree plantations in rural areas.\nDue to the effects of climate change and deforestation on traditional crop production, farmers had been moving away to find work. This initiative will help 2,500 farmers earn a sustainable income from produce such as mango, coconut, sapodilla, cashew and guava.\nDeutsche Bank and Swades Foundation have been working towards rural transformation since 2016. Through the partnership’s flagship programme, more than 11,500 households now have access to safe drinking water and over 1,000 rural households have adequate water for irrigation.\nTrees play a vital role in healthy urban communities as well, providing shade, shelter and resilience against the changing climate. That is especially important in places like Florida in the United States, where temperatures and humidity levels soar in summer. Employees from our Jacksonville office have been working for a decade now with Greenscape to make the city greener by planting a combination of mature trees and seedlings for both immediate and long-term impact on the local environment.  \nThrough our Deutsche Bank South Africa Foundation, we continue to partner with Food and Trees for Africa who help us to work together, by planting trees or developing food gardens to support local communities. We are creating green spaces and even livelihoods through the sale of their fresh produce, intersecting environmental and social issues.\nIn Germany, Deutsche Bank has been working with environmental charity Trinkwasserwald for over 10 years to combat climate change. This partnership helps turn evergreen forests into mixed woodlands by planting heat-resistant deciduous species among the conifers. This increases the local water supply and improves climate protection by absorbing more CO2 from the atmosphere. So far, more than 4,000 colleagues have helped create around 92 hectares of mixed woodland that generates over 70 million litres of additional drinking water each year. In the UK as well, employee volunteers are involved in community development programmes across London and Birmingham with environmental benefits that include annual tree planting events, working with local experts to establish a considered, impactful approach. In addition, employees can join in to help restore community gardens and wildlife spaces.\nDeutsche Bank volunteers in the south of Italy are helping to combat a different kind of environmental threat — disease. The Xylella Fastidiosa bacterium has had a devastating impact on the trees that are central to the landscape, climate and economy of the Puglia region. Volunteers are helping to replace the many centuries-old trees that have been lost.\nSustainable agriculture is also the focus of the partnership between our International Private Bank (IPB) and the non-profit organisation Farming For Climate in Belgium. Deutsche Bank’s leadership in sustainable finance is helping local farmers transition to more environmentally friendly methods. Profits from a designated IPB green investment product helps fund Farming For Climate’s work.\nHow We Live is part of Deutsche Bank’s contribution to the United Nations Sustainable Development Goals. The aim of UN SDG 15 is to protect and restore life on land. As these many projects around the world demonstrate, change is possible when we dig deep.\nMore information can be found on the How We Live website.",
    "number_of_ratings": 36,
    "rating": 2.5,
    "likes": 18
}