{
    "url": "https://www.db.com/news/detail/20221101-global-advisory-board-to-advise-deutsche-bank-on-key-trends-in-business-and-politics?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, November 1, 2022",
    "tags": [
        "Boards and Committees",
        "Management & Leadership",
        "Personnel announcements",
        "Strategy"
    ],
    "title": "Global Advisory Board to advise Deutsche Bank on key trends in business and politics",
    "body": "Management Board has appointed six highly respected business leaders, academics and politicians as founding members\nPaul Achleitner appointed Chairman of the new Global Advisory Board\nInaugural meeting today in New York\nDeutsche Bank's Management Board has created a new Global Advisory Board comprising experts from business, academia and politics, whose task it is to advise the Management Board on fundamental macroeconomic, geopolitical and technological developments that have a significant impact on the bank's operating environment.\nThe Management Board has appointed Paul Achleitner, former Chairman of the bank’s Supervisory Board, as the founding Chairman of the Global Advisory Board. Other members are:\nHenry Kissinger, former US Secretary of State\nEric Schmidt, former CEO of Google and Executive Chairman of Alphabet\nIndra Nooyi, member of the Board of Directors of Amazon, member of the Supervisory Board of Philips, former Chair and CEO of PepsiCo\nRafael Reif, President of the Massachusetts Institute of Technology (MIT)\nJim Hagemann Snabe, Chairman of the Supervisory Board of Siemens, former Co-CEO of SAP\nThe Global Advisory Board meets for the first time today in New York. In future, there will be two official meetings per year. Advisory Board members are also available to the Management Board with their advice between the meetings. Regular guests at the Advisory Board meetings will be Deutsche Bank Supervisory Board Chairman Alexander Wynaendts, Chief Executive Officer Christian Sewing and Chief Economist David Folkerts-Landau.\n\"In a rapidly changing world, it is of great importance, especially for a global financial institution, to identify social, technological and geopolitical developments at an early stage in order to draw the right conclusions for our bank and its clients,\" says Alexander Wynaendts.\n\"I am delighted that we have been able to recruit six experienced business representatives, politicians and academics for our new Global Advisory Board,\" adds Christian Sewing. \"Their insights will help us, as a Global Hausbank, to be a crucial partner for our clients on issues concerning the future.\"\nPaul Achleitner, Chairman of the Global Advisory Board, says: \"Economic activity is shaped more than ever by the technological revolution of our time. Added to that are the historic challenges of geopolitical tensions and a changed view of globalisation. The Advisory Board will develop ideas and proposals on how the bank and its clients can best navigate this environment, manage risks and seize the opportunities that arise.\"",
    "number_of_ratings": 9,
    "rating": 3.0,
    "likes": 15
}