{
    "url": "https://www.db.com/news/detail/20231025-a-message-from-christian-sewing-on-q3-results-2023?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 25, 2023",
    "tags": [
        "Financial Results"
    ],
    "title": "A message from Christian Sewing on Q3 results 2023",
    "body": "Dear Colleagues,\nThe past few months have, once again, made us painfully aware of the uncertain environment in which we operate globally. They were marked by natural disasters such as the earthquake in Morocco and the flood in Libya, as well as by geopolitical conflicts. We are all still reeling from the terrible attacks on Israel two and a half weeks ago, which we strongly condemn. Our thoughts are with our colleagues in Israel and our sympathy is with all innocent victims in the region. And we are also concerned for the fate of civilians in Gaza with no links to the terrorists.\nIn such a volatile situation, our first duty is to be there for our clients – and the most important prerequisite for this is that we are robust ourselves. Our third quarter results, published this morning, demonstrate this strength. We increased our pre-tax profit by 7 percent year-on-year to 1.7 billion euros. After nine months, we have already achieved a pre-tax profit of 5.0 billion euros. The last time we did better was 12 years ago. This is despite booking nearly 950 million euros in non-operating costs since the beginning of the year.\nThe basis for this successful quarter is strong client demand for our services. In Q3 we recorded net inflows into investment products of 11 billion euros and 18 billion euros in new deposits. Our revenues rose again by 3 percent year-on-year to 7.1 billion euros in the period from July to September. In all four divisions, the positive trends that we have already seen in recent quarters continued.\nThe Corporate Bank increased revenues by 21 percent year-on-year. In addition to the broad revenue base, which grew at double-digit percentages in all businesses, we also see very positive developments in new business here: the number of transactions with multinational corporations grew by around 40 percent year-on-year in the first nine months.\nIn the Investment Bank, we were once again able to leverage our strength in our FIC business as well as in financing. In addition, there were signs of cautious recovery in the O&A business. Despite a more difficult market environment, revenues fell only slightly by 4 percent compared to the exceptionally good prior-year quarter. Excluding negative effects from debt valuation adjustments, they were essentially flat to the previous year's level.\nThe development of the Private Bank was particularly encouraging, increasing its revenues by 3 percent overall and by 9 percent when adjusted for specific items. In Germany, revenues were 16 percent higher. I'd like to emphasise this, even as our business in Germany has recently come under heavy criticism. You know about the difficulties we experienced in customer service since the summer. This has led to a lot of negative client reactions and headlines. The fact that we nevertheless once again recorded billions of euros in inflows into Private Bank products shows that our clients continue to rely on us. This makes it even more important that we do everything we can to remedy the service restrictions that still exist. We are on the right track here and have cleared two-thirds of the backlogs. This gives us great confidence that we will be able to offer our clients the level of service they rightly expect from us again by the end of the year, as planned. I would like to thank all those who are working on this and who are engaging in dialogue with our clients during this difficult time.\nIn Asset Management, the difficult market environment continues to put pressure on our business. As management fees fell slightly and performance and transaction fees fell sharply, overall revenues were 10 percent lower year-on-year. DWS has taken countermeasures to address this situation, which have already had an impact in Q3; adjusted costs fell by 8 percent year-on-year. Combined with net inflows of 2 billion euros, this creates a good basis for higher results in the coming quarters.\nWith our strength across all four businesses, our broad product offering, and our unique global network, we are well positioned to continue to grow, together with our clients, in the coming quarters. That is why we are confident that we will not only be able to meet the strategic goals we have set ourselves for 2025, but even exceed them.\nIn terms of revenues, we are on course to exceed expectations again this year. We expect to be able to achieve a level of around 29 billion euros of revenues. This would imply a significantly higher growth rate than the 3.5 - 4.5 percent that we have set ourselves as a compound annual average from 2021 to 2025.\nWe are also on track in terms of costs; adjusted costs rose only slightly in the third quarter, which is a good result against the backdrop of persistent, very high inflation. At the same time, we have already achieved a significant portion of the operational efficiencies planned for 2025, and we know exactly what tactical and structural measures are needed to achieve the rest and reduce our cost/income ratio from the current 72 percent to less than 62.5 percent. Data and technology are playing an increasingly important role in this.\nThe factor that makes us particularly confident is our capital strength. At the end of the third quarter, our CET 1 capital ratio was at 13.9 percent and thus significantly higher than our own expectations. This is mainly because we are making use of our capital much more efficiently. In the current year, we have reduced risk-weighted assets by around 10 billion euros through optimisation measures, without this having a negative impact on revenues. This means that we have already achieved a large part of the 15 –20 billion euros that we promised by the end of 2025, and we are raising our goal by a further 10 billion euros, based on the work done over the past six months.\nIn addition, we have identified further capital opportunities and we now see scope to free up additional capital of 3 billion euros. On the one hand, this gives us additional potential to increase capital distributions to shareholders beyond the 8 billion euros we previously announced to pay out by 2025. On the other hand, we can now invest more in technology, controls and, in particular, our businesses, thus accelerating the implementation of our Global Hausbank strategy.\nIt is crucial here that we make targeted investments in the areas in which we are strongest and deliver the most added value for our clients. However, it is equally important that the investments go into those fields where we can achieve double-digit returns with comparatively little capital investment. This, along with continued cost discipline, is the key to lifting our profitability to the levels that investors expect from us. In the third quarter, our return on tangible equity (RoTE) was 7.3 percent. Adjusted for non-operating costs and with bank levies apportioned equally across the year it would have been nearly 9 percent. Our goal of achieving a return of more than 10 percent in 2025 is therefore absolutely within reach.\nAs we have always said, this too can only be an intermediate step. Our aspirations and our potential are much greater. I am convinced that Deutsche Bank has every opportunity to catch up with the market leaders in Europe. We have a strong foundation, we have a clear path on how to get to the top. And the best thing is that we have it in our own hands to achieve our potential.\nEverybody on the Group Management Committee is determined to take advantage of the great opportunity that is presented to us. That's what we work for every day, and we're happy to have you all behind us. On behalf of all my colleagues on the GMC, I would like to thank you for another excellent quarter, in which you did not allow yourself to be slowed down by special challenges.\nI'm looking forward to it, and I'm looking forward to moving forward with you. \nBest wishes,\nChristian Sewing",
    "number_of_ratings": 15,
    "rating": 4.5,
    "likes": 21
}