{
    "url": "https://www.db.com/news/detail/20231025-deutsche-bank-reports-on-the-third-quarter-results-of-2023?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 25, 2023",
    "tags": [
        "Financial Results"
    ],
    "title": "Deutsche Bank reports nine-month 2023 profit before tax of € 5.0 billion and raises capital outlook",
    "body": "Nine-month profit before tax up 3%, reflecting revenue growth and cost discipline\nNet revenues up 6% year on year to € 22.2 billion\nNoninterest expenses up 7% to € 16.2 billion including nonoperating costs1 of € 943 million\nAdjusted costs¹ up 2% to € 15.3 billion despite inflation pressures\nPost-tax profit of € 3.5 billion, down 6%, reflecting a higher tax rate\nPost-tax return on tangible equity (RoTE)¹ of 7%; cost/income ratio of 73%\nAdjusted post-tax RoTE¹ of 9% and cost/income ratio of 68%\nNet inflows of € 39 billion across the Private Bank and Asset Management\nStrong capital management and enhanced capital outlook support business growth as well as acceleration and expansion of distribution goals\nCommon Equity Tier 1 (CET1) ratio rises to 13.9% after absorbing regulatory impacts of 38 basis points (bps) and share buybacks\nScope to free up additional ~ € 3 billion of capital from increased RWA reduction potential and updated Basel III estimates through 2025\nCapital distributions reach € 1.6 billion over 2022 and first nine months of 2023\nThird-quarter profit before tax of € 1.7 billion, up 7% year on year\nPost-tax profit of € 1.2 billion, down 3%, reflecting a higher tax rate\nPost-tax RoTE¹ of 7.3% and cost/income ratio of 72%\nFurther revenue growth and asset inflows in the third quarter\nNet revenues up 3% year on year to € 7.1 billion\nNet inflows of € 11 billion across the Private Bank and Asset Management\nFull year 2023 revenue expectation of ~ € 29 billion\nContinued cost discipline in the quarter\nNoninterest expenses of € 5.2 billion, up 4% year on year\nAdjusted costs¹ up 2% to € 5.0 billion despite inflation pressures\nProgress on operational efficiency with further measures underway\nStrong risk and balance sheet management in the quarter\nProvision for credit losses of € 245 million, 20 bps of average loans\nDeposits rise by € 18 billion to € 611 billion\nLiquidity coverage ratio of 132%, a surplus of € 51 billion\nThese results demonstrate strong and sustained business growth momentum combined with continued cost discipline. Furthermore, we have materially improved our capital outlook thanks to our strong results and focused capital efficiency measures. This gives us scope to invest in growing our Global Hausbank model, further improve returns, and increase and accelerate distributions to our shareholders. \nChristian Sewing, Chief Executive Officer\nDeutsche Bank (XETRA: DBGn.DB / NYSE: DB) today announced profit before tax of € 1.7 billion for the third quarter of 2023, up 7% compared to the third quarter of 2022 and the highest for any third quarter since 2006.\nThird quarter post-tax profit was € 1.2 billion, down 3% compared to the prior year quarter. The year-on-year development reflected an effective tax rate of 30% in the quarter, compared to 23% in the prior year quarter which benefited from the geographical mix of income. \nPost-tax RoTE¹ was 7.3%, compared to 8.2% in the third quarter of 2022. Post-tax return on average shareholders’ equity (RoE) was 6.5%, down from 7.4% in the prior year quarter. The year-on-year development in both ratios primarily reflected the higher tax rate, increased total equity due to organic capital generation, and higher Additional Tier 1 (AT1) coupons compared to the prior year quarter. These effects more than offset the positive impact of growth in profit before tax. The cost/income ratio was 72%, unchanged from the prior year quarter.\nFor the first nine months, profit before tax was € 5.0 billion, up 3% year on year, after absorbing nonoperating costs of € 943 million, up from € 170 million in the first nine months of 2022. Excluding nonoperating costs, profit before tax would have been € 5.9 billion in the first nine months of 2023, up 19% from € 5.0 billion in the prior year period. Post-tax profit in the first nine months was € 3.5 billion, down 6% year on year; the year-on-year development reflected higher nonoperating costs and an effective tax rate of 30%, compared to 24% in the prior year period. \nPost-tax RoTE¹ for the first nine months was 7.0%, compared to 8.1% in the prior year period, and post-tax RoE was 6.3%, down from 7.2% in the prior year period. The year-on-year development in both ratios reflected the aforementioned rises in the tax rate, total equity, and AT1 coupons compared to the prior year period. The cost/income ratio was 73%, unchanged year on year.\nJames von Moltke, Chief Financial Officer, said: “Our progress on capital efficiency, and on scoping future regulatory requirements, give us much greater clarity on our potential to free up additional capital. With better visibility on revenue growth, strong risk management and continued cost control, we’re increasingly confident that we can accelerate our growth and shareholder return strategies despite the uncertainties in the environment.”      \nAssuming an equal apportionment of bank levies and excluding nonoperating costs, post-tax RoTE¹ would have been 8.8%, up from 8.7% in the first nine months of 2022. Post-tax RoE would have been 7.9%, up from 7.8% in the prior year period. The cost/income ratio would have been 68%, down from 71% in the prior year period.\nProgress on accelerated execution of the Global Hausbank strategy\nDeutsche Bank made progress in accelerating execution of its Global Hausbank strategy on all dimensions during the quarter. In summary:\nRevenue growth: Deutsche Bank delivered year-on-year revenue growth of 6% in the first nine months of 2023, and a compound annual growth rate over 2021 of 6.9% in the twelve months to September 30, 2023, above the bank’s target of 3.5% – 4.5%, and the bank expects full-year 2023 revenues of around € 29 billon. The bank made further strategic investments in capital-efficient and fee income-generating businesses and completed the acquisition of Numis, the UK corporate broker, in early October 2023. The Private Bank and Asset Management together attracted € 39 billion in net inflows in the first nine months of 2023, which drove growth in assets under management of € 66 billion across the two businesses in this period.\nOperational efficiency: Deutsche Bank aims for incremental operational efficiencies of € 2.5 billion annually, predominantly by 2025. Key initiatives are largely running in line with or ahead of plan, headcount reduction measures in senior non-client-facing staff have been completed and further workforce efficiency measures are in place. Further measures underway include streamlining front-to-back processes and optimization of the distribution network; the number of branches has been reduced by 93 in the first nine months of 2023.  \nCapital efficiency: Around € 10 billion of Deutsche Bank’s 2025 RWA optimization target of € 15-20 billion was already achieved by the end of the third quarter, without material impact on revenues. Progress included data and process enhancements and an additional securitisation transaction during the quarter; additional portfolio measures are in progress, including optimized hedging and reductions in sub-hurdle lending. Given progress to date and further reduction potential, the bank has identified scope to increase its RWA reduction target by € 10 billion, to € 25-30 billion. Additionally, the bank’s latest analysis indicates that the impact on RWA from the implementation of Basel III requirements will be € 10-15 billion lower than originally estimated. Taken together, these factors create potential to free up additional capital of around € 3 billion through 2025.\nRevenues: outperforming strategic targets\nNet revenues were € 7.1 billion, up 3% year on year, and up 6% if adjusted for specific items. These items included the non-recurrence of prior year positive impacts from workout activities related to Sal. Oppenheim in the Private Bank, and a lower benefit from debt valuation adjustments (DVAs) in the Investment Bank. For the first nine months, net revenues were € 22.2 billion, up 6%, and up 8% ex-specific items.\nRevenue development by business was as follows:\nCorporate Bank net revenues were € 1.9 billion in the third quarter, up 21% year on year. All segments delivered double-digit year-on-year growth, driven by strong net interest income and continued pricing discipline. Revenues in Corporate Treasury Services were up 11% to € 1.0 billion, Institutional Client Services revenues rose 18% to € 472 million, and Business Banking revenues grew 71% to € 369 million. Deposits increased by € 15 billion to € 286 billion during the quarter. For the first nine months, net revenues were up 27% to € 5.8 billion. Corporate Treasury Services revenues were up 19% to € 3.3 billion, Institutional Client Services revenues rose 23% to € 1.4 billion, and Business Banking revenues rose 69% to € 1.1 billion. Deutsche Bank was named ‘Best Bank for Cash Management’ and Transaction Bank of the Year for Western Europe’ in The Banker’s 2023 Transaction Banking Awards.\nInvestment Bank net revenues were € 2.3 billion in the quarter, down 4% year on year and essentially flat if adjusted for the aforementioned reduction in DVA benefit to € 5 million, down from € 91 million in the prior year quarter. FIC Sales & Trading (FIC) revenues were € 1.9 billion, down 12% from the exceptional levels of the prior year quarter. Revenues in Rates, Foreign Exchange, Emerging Markets and Financing were lower compared to an unusually strong prior year quarter, while revenues in Credit Trading were significantly higher, driven by improvements in flow business and strong performance in Distressed. Origination & Advisory revenues were € 323 million, up more than three-fold year-on-year, and up 56% if adjusted for the non-recurrence of leveraged lending markdowns in the prior year quarter. Leveraged Debt Capital Markets saw a year-on-year recovery in market share which more than offset year-on-year revenue declines in Investment Grade Debt and Advisory revenues, both reflecting a lower industry fee pool (source: Dealogic). For the first nine months, net revenues were € 7.3 billion, down 12%. Revenues in FIC were € 6.4 billion, down 13%, while revenues in Origination & Advisory grew 17% to € 941 million. Deutsche Bank was named ‘Best Global FX Provider’ in the Euromoney FX Awards for 2023.\nPrivate Bank net revenues were € 2.3 billion in the quarter, up 3% year on year and up 9% if adjusted for the non-recurrence of Sal. Oppenheim workout activities in the prior year quarter. Higher revenues from deposit products, driven by higher net interest margins, more than offset lower fee income, lower loan revenues and the negative year-on-year impact of FX movements. Revenues in the Private Bank Germany grew 16% to € 1.5 billion. Revenues in the International Private Bank were down 13% to € 845 million, or up 2% if adjusted for the non-recurrence of € 110 million in revenues from Sal. Oppenheim workout activities and of approximately € 15 million from Deutsche Bank Financial Advisors in Italy, divested in the fourth quarter of 2022, together with negative FX impacts of around € 20 million. Assets under Management rose by € 5 billion to € 547 billion during the quarter, as net inflows of € 9 billion and positive FX movements of € 3 billion more than offset a negative impact of € 7 billion from lower market levels. For the first nine months, net revenues were up 8% to € 7.2 billion, and up 10% if adjusted for the non-recurrence of € 119 million in revenues from Sal. Oppenheim workout activities in the prior year period. Revenues in the Private Bank Germany rose 15% to € 4.6 billion. Revenues in the International Private Bank were € 2.6 billion, down 3%, or up 4% if adjusted for the aforementioned non-recurrence of prior year revenues from Sal. Oppenheim workout activities and of approximately € 50 million from Deutsche Bank Financial Advisors, together with negative FX movements of € 15 million. Assets under Management were € 547 billion, up by € 28 billion in the first nine months, driven largely by net inflows of € 22 billion.\nAsset Management net revenues were € 594 million in the third quarter, down 10% year on year. This development principally reflected lower performance fees, the mark-to-market of co-investments and FX movements. Assets under management rose slightly to € 860 billion during the quarter; net inflows of € 2 billion, driven by Passive, and favorable FX movements more than offset the impact of lower market valuations. For the first nine months, net revenues were € 1.8 billion, down 10% compared to the first nine months of 2022, reflecting lower management fees and significantly lower investment income. Assets under management grew by € 38 billion in the first nine months, compared to a decline of € 94 billion in the first nine months of 2022; net inflows were € 17 billion, compared to net outflows of € 18 billion in the prior year period.\nNoninterest expenses: modest rises in adjusted costs\nNoninterest expenses were € 5.2 billion in the third quarter, up 4% year on year. This development partly reflected nonoperating costs of € 199 million, up from € 75 million in the prior year quarter, comprising € 105 million in litigation charges relating mainly to longstanding matters and € 94 million in restructuring and severance relating to accelerated execution of the bank’s Global Hausbank strategy. Adjusted costs, which exclude these items, were € 5.0 billion, up 2%, below the rate of inflation despite the cumulative impact of investments in business growth, technology and controls in recent periods, partly offset by favorable FX movements.\nFor the first nine months, noninterest expenses were € 16.2 billion, up 7%. The year-on-year increase was driven by nonoperating costs of € 943 million, up from € 170 million in the first nine months of 2022. Adjusted costs were € 15.2 billion, up 2% from the prior year period, or 3% excluding FX movements, despite continued investments and inflationary headwinds.\nThe workforce rose by 2,204 internal full-time equivalents (FTEs) to 89,260 during the quarter. This development reflected strategic hiring, graduates joining during the quarter and the ongoing internalisation of external FTEs, partly offset by leavers related to operational efficiency measures during the quarter.\nCredit provisions remain in line with full-year guidance\nProvision for credit losses was € 245 million in the third quarter, down from € 401 million in the second quarter. Performing (stage 1 and 2) loans saw provision releases of € 101 million, reflecting model changes and improved macroeconomic forecasts for the US which primarily impact the Corporate Bank and Investment Bank. Provision for non-performing (stage 3) loans was € 346 million, up slightly from € 338 million in the previous quarter.\nFor the first nine months, provision for credit losses was € 1.0 billion, or 28 bps of average loans. For the full year 2023, Deutsche Bank reaffirms its expectation for provision for credit losses to be at the upper end of its communicated range of 25-30 bps.\nStrong capital management\nThe Common Equity Tier 1 (CET1) capital ratio was 13.9% at the end of the third quarter, up from 13.8% at the end of the second quarter, and substantially above the bank’s 2025 capital objective of around 13%. This development reflected the positive impacts of organic capital generation from net income, benefits from data and process optimization as part of the bank’s capital efficiency measures, and lower credit risk RWAs. These more than offset a negative impact of 38 bps from regulatory changes, in line with guidance and predominantly reflecting the first-time recognition of newly-approved wholesale and retail models, and the negative impact of deductions for share buybacks and dividends.\nThe Leverage ratio was 4.7% in the quarter, in line with the previous quarter. The positive impact of a € 1 billion reduction in leverage exposure to € 1,235 billion was offset by the Tier 1 capital change in line with a CET1 capital movement during the quarter.\nShare repurchases during the quarter amounted to approximately 27.5 million shares for a total consideration of approximately € 271 million, just over 60% of the € 450 million anticipated by year-end 2023 as announced on July 25, 2023. This brought total distributions to shareholders, through share repurchases and dividends, to approximately € 1.57 billion through the full year 2022 and the first nine months of 2023, well on track towards the bank’s targets for total distributions of over € 1 billion in 2023 and € 1.75 billion over 2022 and 2023, with further buybacks anticipated in 2024.\nLiquidity and funding strength\nLiquidity reserves were € 245 billion at the end of the third quarter, up slightly from € 244 billion at the end of the second quarter, including High Quality Liquid Assets of € 210 billion. The Liquidity Coverage Ratio was 132%, above the regulatory requirement of 100%, representing a surplus of € 51 billion. The Net Stable Funding Ratio was 121%, slightly above the bank’s target range of 115-120% and representing a surplus of € 105 billion above required levels.\nDeposits grew by € 18 billion to € 611 billion during the quarter, driven largely by the aforementioned growth of € 15 billion in Corporate Bank deposits.    \nSustainable Finance: further progress toward targets\nEnvironment, Social and Governance (ESG)-related financing and investment volumes² were € 11 billion ex-DWS in the quarter, bringing the cumulative total since January 1, 2020 to € 265 billion, including € 50 billion in the first nine months of 2023. Deutsche Bank aims for a cumulative total of over € 500 billion ex-DWS by the end of 2025.\nIn the third quarter, Deutsche Bank’s businesses contributed as follows:\nCorporate Bank: € 3 billion in sustainable financing, raising the Corporate Bank’s cumulative total since January 1, 2020 to € 50 billion.\nInvestment Bank: € 7 billion in sustainable financing and capital market issuance, for a cumulative total of € 159 billion since January 1, 2020.\n € 1 billion growth in ESG assets under management and new client lending, and a cumulative total of € 56 billion since January 1, 2020\nOn October 19, 2023, Deutsche Bank published its initial Transition Plan, outlining the bank’s progress to date and future roadmap for achieving net zero emissions by 2050. This publication covers the bank’s strategy, policies and progress to date on reducing emissions in its own operations, its value chain, and its business with clients. The Transition Plan also includes net zero targets in three additional carbon-intensive sectors in the bank’s corporate loan portfolio, in line with Deutsche Bank’s commitments as a member of the Net Zero Banking Alliance.\nOn October 10, 2023, Deutsche Bank announced the formation of a new Nature Advisory Panel, which aims to help the bank assess nature-related risks and identify new financial product offerings tied to the challenge of reversing biodiversity loss. The Panel brings together senior Deutsche Bank executives with experts from external organisations including the United Nations, World Wide Fund for Nature and The Nature Conservancy. \nGroup results at a glance\n¹For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ on pp 15-20 of the third quarter 2023 Financial Data Supplement and “Non-GAAP financial measures” on pp. 56-61 of the third quarter 2023 Earnings Report, respectively.\n²Cumulative ESG volumes include sustainable financing (flow) and investments (stock) in the Corporate Bank, Investment Bank and Private Bank from January 1, 2020 to date, as set forth in Deutsche Bank’s Sustainability Deep Dive of May 20, 2021. Products in scope include capital market issuance (bookrunner share only), sustainable financing and period-end assets under management. Cumulative volumes and targets do not include ESG assets under management within DWS, which are reported separately by DWS.\nRead the \nPDF\nfull media release as PDF document.\nFurther details on third quarter performance in Deutsche Bank’s businesses are available in the Earnings Report as of September 30, 2023.\nAnalyst call\nAn analyst call to discuss third quarter 2023 financial results will take place at 11:00 CET today. The Interim Report, Financial Data Supplement (FDS), presentation and audio webcast for the analyst conference call are available at: www.db.com/quarterly-results\nA fixed income investor call will take place on October 27, 2023, at 15:00 CET. This conference call will be transmitted via internet: www.db.com/quarterly-results",
    "number_of_ratings": 13,
    "rating": 5.0,
    "likes": 44
}