{
    "url": "https://www.db.com/news/detail/20231013-deutsche-bank-completes-acquisition-of-numis?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main / London, October 13, 2023",
    "tags": [
        "Company",
        "Investment Banking"
    ],
    "title": "Deutsche Bank Completes Acquisition of Numis",
    "body": "Deutsche Bank AG today announces that it has completed its acquisition of Numis Corporation Plc. Reflecting the combined strength and reputations of both brands in the UK and internationally, together they are pleased to introduce ‘Deutsche Numis’, a leading force in UK investment banking and the adviser of choice for UK listed companies.\nThe transaction accelerates Deutsche Bank’s Global Hausbank strategy to become the first point of contact for clients in financial services and will unlock a deeper engagement with corporates across the UK. Deutsche Numis will serve more than 170 corporate broking clients and will continue to broaden its relationships with existing and new clients by delivering comprehensive financial and advisory solutions to support their ambitions.\nDeutsche Numis will assume a leading position across advisory services, corporate broking, and ECM – including IPOs, research, sales and execution. As part of Deutsche Bank Group, Deutsche Numis will also be able to offer broader corporate finance capabilities as well as access to a broad international network.\nAlex Ham and Ross Mitchinson will become Co-CEOs of Deutsche Numis, reporting to Henrik Johnsson, Co-Head of EMEA Investment Banking at Deutsche Bank and the new Chairman of Deutsche Numis. Luke Savage, former Chairman of Numis, will continue to sit on the Board and work closely with the leadership team.\nFabrizio Campelli, Head of Corporate Bank and Investment Bank at Deutsche Bank said: “The combination of Deutsche Bank’s UK and Ireland corporate finance business with Numis is a perfect partnership and we are delighted to bring the teams together under the new brand, Deutsche Numis. The transaction is strongly aligned to our Global Hausbank strategy, allowing us to expand our reach amongst UK and international corporates in Europe’s largest investment banking market, and underlines our long-term commitment to the UK. We are proud to introduce Deutsche Numis as a leading corporate broker in the UK and we look forward to working with Alex, Ross and the rest of the team.”\nAlex Ham, Co-CEO of Deutsche Numis said, “Deutsche Numis is now a leading force in UK investment banking, building on a long track record of providing innovative financial advice and solutions for ambitious public and private companies, and investors doing business in the UK. We are delighted to now be part of the wider Deutsche Bank Group and are looking forward to working together with our new colleagues across all our businesses.”\nRoss Mitchinson, Co-CEO of Deutsche Numis said, “Continuing to deliver for our people and our clients will be at the heart of Deutsche Numis and we are confident that the professionalism, high performance, and client service that has long underpinned both companies will only be further enhanced by this combination. We look forward to continuing to build our position in UK investment banking, enhanced by the scale and strength of Deutsche Bank, including the ability to draw on a global industry capability and a broader array of financing solutions.”\nMore information regarding the transaction can be found at https://investor-relations.db.com\n\nFor further information please contact:\nDeutsche Bank Communications\nVictoria Garrod                  \nCharlie Olivier         \n+‍44 20 7547 2409\nDeutsche Numis Communications\nNoreen Biddle Shah\n+44 7711 356 978\nFGS Global (PR Adviser to Deutsche Bank)                                           \nJames Murgatroyd\nCharlie Chichester\nRory King\n+44 20 7251 3801\nFTI Consulting (PR Adviser to Deutsche Numis)\nEdward Bridges\nDaisy Hall\nAmbrose Fullalove\n+44 20 3727 1000",
    "number_of_ratings": 12,
    "rating": 4.7,
    "likes": 47
}