{
    "url": "https://www.db.com/news/detail/20231012-india-s-inclusion-in-the-global-bond-index-emerging-markets-index?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 12, 2023",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "India's inclusion in the Global Bond Index-Emerging Markets index",
    "body": "India's inclusion in a major global bond index is a recognition of the country's growing economic prowess. Deutsche Bank’s Global Head of Emerging Markets and APAC Research, Sameer Goel explains 3 things you need to know about India's inclusion in the Global Bond Index-Emerging Markets (GBI-EM) index starting June 2024, in our latest Asia Insights video.\nYou can also read the full transcript of the video here: \n“It's finally on GBI-EM, a global fixed income benchmark widely followed by dedicated emerging market investors has announced that India will be included in the index starting middle of next year.\nThere are three things that make this inclusion important.\nOne, India is the second largest bond market in the EM. Including it in the index would make EM benchmark investment more diversified and more representative of economic potential and market capitalization.\nTwo, for a capital deficit economy like India with large investment needs, this gives access to a big and sticky pool of benchmark driven savings allocation, which would help bring down the cost of funding, over the next year to 18 months. That could amount to $25bn or more as investors who track this index will build up exposure.\nLonger term, this should open the door for India to get included in bigger global benchmarks and drive a more virtuous cycle of capital inflows, more stable financing of the current account gap and reduced volatility.\nSameer Goel\nThree, this adds to the broader appeal for investment into India’s macro-opportunities, which are underpinned by a strong demographic advantage skilled labor force, political stability, and business friendly reforms, and which are set to double the size of its economy between now and 2030.\"\n ",
    "number_of_ratings": 3,
    "rating": 5.0,
    "likes": 5
}