{
    "url": "https://www.db.com/news/detail/20231011-deutsche-bank-invests-in-kodex-ai?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 11, 2023",
    "tags": [
        "Digitalisation"
    ],
    "title": "Deutsche Bank invests in Kodex AI",
    "body": "The bank’s Corporate Venture Capital (CVC) group has invested in Kodex AI, a Berlin based startup developing an AI-powered solution tailored to the specific needs of the financial industry.\nThe investment follows a collaboration which started earlier this year as part of the bank’s Entrepreneur in Residence programme, which invites talented entrepreneurs to partner with the bank to validate, develop and scale their ideas. Over the past months, Kodex AI’s co-founders Thomas Kaiser and Claus Lang have worked with the bank’s teams on a large language model (LLM) based specialised AI-solution that can be used to extract and analyse data from financial documents.\nThe model was specifically trained for the financial industry in order to precisely understand complex technical terminology and contexts. This allows for deeper and more accurate analysis of financial documents compared to general AI models. Unlike traditional solutions that are limited to text, the solution can also interpret visual elements such as tables.\n“Kodex AI developed a solution that addresses the specific needs of a highly regulated industry and has the potential to significantly enhance the efficiency of how financial data is being extracted and analysed,” said Gil Perez, Deutsche Bank’s Chief Innovation Officer. “I look forward to continuing our close partnership helping Thomas and Claus grow their company to meet all the quality needs and security requirements of the banking industry.”\nOne use case currently being piloted within Deutsche Bank focuses on non-financial risk. Kodex AI’s solution here is an intelligent and user-friendly chatbot that can help employees get quick answers to policy-related questions and navigate through the high volume of complex documents.\nKodex AI is the latest addition to the bank’s CVC portfolio, following the investment into Binalyze and Plan A. The CVC programme is a core element of the bank’s innovation agenda. “Our focus is on strategic corporate venture capital investments in startups that use technology to either support and enable innovative services, or increase productivity of processes”, said Joerg Landsch, Head of Central Corporate Venture Capital, Deutsche Bank. “We commit capital, expertise, access and resources to our strategic investments to enable growth and success.”\nFurther information about the CVC programme can be found here. Or contact the central CVC team at: corporate.venture-capital@db.com",
    "number_of_ratings": 6,
    "rating": 4.2,
    "likes": 9
}