{
    "url": "https://www.db.com/news/detail/20231004-volker-steuer-appointed-as-head-of-human-resources?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 4, 2023",
    "tags": [
        "Personnel announcements"
    ],
    "title": "Volker Steuer appointed as Head of Human Resources",
    "body": "Deutsche Bank has announced the appointment of Volker Steuer as Head of Human Resources, effective immediately. Steuer will continue to report to Rebecca Short, Member of the Management Board and Group Chief Operating Officer, and be based in Frankfurt.\n“Our workforce will need to evolve along with our transformation and our HR function will play a central role in achieving this,” said Rebecca Short. “In a field of outstanding internal and external candidates, Volker Steuer stood out for his extensive experience across HR and his deep understanding of Deutsche Bank and our home market. I have been impressed by his vision and energy and look forward to working with him to focus on where HR can deliver the most value to our partners in the bank.”\nSteuer joined Deutsche Bank as an apprentice and has assumed a number of leadership positions at the bank in a career spanning more than 30 years. These include HR Business Partner for our businesses, infrastructure functions and Germany, as well as Head of Labour Relations. He was most recently Head of HR Germany and HR Business Partner for the Private Bank, as well as co-leading our HR function on an interim basis.\n“It is an honour and a privilege to become Head of HR for our iconic institution and lead this function and our people strategy through the next phase of the bank’s transformation,” said Volker Steuer. “The workplace and the expectations of our clients are shifting, and we have a responsibility to support and enable our employees to perform at their best. We want Deutsche Bank to continue to be a destination and home for exceptional and motivated people.”",
    "number_of_ratings": 4,
    "rating": 4.0,
    "likes": 8
}