{
    "url": "https://www.db.com/news/detail/20191218-deutsche-bank-to-launch-new-digital-legal-document-management-system-globally?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "December 18, 2019",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank to launch new digital legal document management system globally",
    "body": "Deutsche Bank announced today that it has signed a contract for the NetDocuments cloud-based legal document management system. It will ensure secure and fast access to relevant documents for all Legal department employees of Deutsche Bank, who are located in 27 countries and operating globally. The NetDocuments system will make the collaboration between Legal department employees better and faster, thereby enhancing their daily working experience.\nStefan Simon, Chief Administrative Officer of Deutsche Bank and Senior Group Director, said: “With this innovative document management system we have found an effective and modern platform which also ensures the highest security and governance standards. It will provide our lawyers with the tools and information they need to ensure more efficiency in their daily business around the globe and share knowledge with colleagues.”\nThe new platform will form an important part of the bank’s broader digital strategy of further modernising and simplifying systems and working processes. It will allow the bank to shut down outdated, fragmented IT systems and to reduce IT costs further. Legal department employees will benefit from one core platform that will be more intuitive and that also supports access via mobile devices.\nJosh Baxter, Chief Executive Officer of NetDocuments, said: “Our collaboration with Deutsche Bank is based on our world class security pedigree as well as a level of growth-focused scalability which remains unmatched in our market. We are confident Deutsche Bank will be able to execute on its main objectives of accelerating decision making and productivity through consistency afforded by the mature NetDocuments cloud platform.”\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nChristine Peters\nPhone: +49 69 910 62303\nEmail: christine.peters@db.com\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}