{
    "url": "https://www.db.com/news/detail/20191217-makingmagichappen-a-special-time-for-giving-and-sharing?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 17, 2019",
    "tags": [
        "Employee engagement"
    ],
    "title": "Making Magic Happen",
    "body": "Deutsche Bank employees create a positive impact for clients and society throughout the whole year, but the holiday season is a special time for giving and sharing and supporting the less fortunate in communities around the world.\nDecember always begins with World AIDS Day, with our colleagues sending a strong signal for a world without prejudice and social exclusion. From the teddy bear sales at five locations, we raised more than 21,000 euros this year in Germany for Deutsche Aids-Hilfe. Earlier this year, Deutsche Bank signed the charity’s declaration, pledging its support for a work place without discrimination of HIV-positive individuals.\nCharity bazaars and Christmas parties in support of our partner organisations have also become something of a holiday tradition at a number of Deutsche Bank locations.\nIn Singapore, the Christmas Charity Bazaar features seven of our community partners and performances by charities. Deutsche Bank Hong Kong has a Christmas market with local entrepreneurs, raising funds for the Asian University for Women in Bangladesh. In Dubai, community group “Jingles” is singing carols with our staff to raise funds to pay for cancer treatment for children in need in partnership with the volunteer humanitarian organization Emirates Red Crescent.\nArtisan goods and sustainable garments – Made for Good\nOver in the US, New York’s 60 Wall lobby played host to the second annual Made for Good holiday pop-up, featuring artisan goods from CSR incubators Hot Bread Kitchen and Acción. The market enables employees to support local, underserved small business owners while sharing the entrepreneurial spirit during the holiday season.\n\n\nAt the Festive Market Place in the UK, employees have the chance to buy from five Made for Good social enterprises as well as two of the 2019 Deutsche Bank Awards for Creative Entrepreneurs winners: Petit Pli, a sustainable clothing manufacturer that aims to reduce clothing waste by producing garments that grow with your child; and Bukky Baldwin, an ethical and sustainable fashion company, which aims to support and raise awareness for the neglected needs of marginalised communities in Manchester.\nRaising money for our charities of the year\nOther UK-based employees are busy organising festive parties for children and seniors in London and Birmingham, or the Big Festive Toy Drive in support of our chosen UK Charities of the Year, Cure Leukaemia and Rays of Sunshine. We are proud to say that in 2019, we raised more than 2 million pounds for our Charities of the Year – 900,000 pounds alone was raised by the bank’s One Day initiative, which encourages employees to donate a day’s salary to charity.\nSoup, shoe boxes and winter wishes\nFood drives and soup kitchens are another way that Deutsche Bank employees show their support: FareShare in the UK, the Annual National food collection in France, in soup kitchens at a Frankfurt church or at the Whitechapel Mission in London.\n\n\nMore than 2,000 colleagues in Germany volunteered in some 50 team challenges during the pre-Christmas season, arranging Christmas parties in kindergartens, schools or for people with disabilities, and donating gifts, for example to the “Christmas in a shoe box” project.\nIn Manila, employees donated 1,200 bears to underprivileged children. In Spain, employees help make a dream come true for the less fortunate in the “Una Sonrisa por Navidad” (A Smile for Christmas) initiative.\nAnd in the Netherlands, employees spread joy by organising festive events at a care home for the elderly and people with mental health conditions.\nIn the US, Deutsche Bank’s Corporate Social Responsibility (CSR) team is celebrating ten years of fulfilling “Winter Wishes” this year, collecting gifts for 1,200 young people in underserved New York City public schools. It also supports a gift drive that delivers over 1,000 additional gifts to our Born to Be partner organisations in Harlem and the Bronx, and hosts a creative mentoring party for fifty eight year olds.\nLareena Hilton, Global Head of Brand Communications & CSR at Deutsche Bank, reflects the end of the year: “We’d like to thank our colleagues all over the world for their continued commitment as corporate volunteers and the #PositiveImpact they create in their communities. Our 150th anniversary in 2020 will provide further momentum for their efforts, as we encourage them to find their personal 150 moment within our Plus You volunteering and giving community. Watch out for more to come …”\nSeason’s greetings to all!",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 2
}