{
    "url": "https://www.db.com/news/detail/20191210-our-future-is-in-our-own-hands-message-to-staff-from-christian-sewing-on-the-investor-deep-dive?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 10, 2019",
    "tags": [
        "Company"
    ],
    "title": "“Our future is in our own hands”",
    "body": "Dear Colleagues,\nThe day has arrived. We will meet analysts for an intensive discussion today at our “Investor Deep Dive”. It’s about explaining in detail to our investors and the wider public what makes us unique and how much potential we have. Many colleagues have worked for months to compile and structure the details. The preparation started in August and was demanding for all of us. I would like to thank everyone involved very much for this.\nI have been looking forward to this day. Five months after our strategy announcement we can give a comprehensive status report. We have had a very good start to the most radical transformation of our bank in two decades. In implementing our strategy we are in line with plan and even ahead in several areas.\nThe exit from Equities Trading in the Investment Bank is well advanced, including approvals to transfer our Prime Finance and Electronic Equities businesses to BNP Paribas. And we are also advancing faster than originally expected with the sale of legacy assets from other parts of our business. Our Capital Release Unit has already begun to work on transactions which were planned for next year.\nThe asset reductions in the Capital Release Unit help our capital ratio. We expect our Common Equity Tier 1 ratio to be above 13 percent through year-end. We can therefore stick to our commitment to manage our transformation without asking our shareholders for more capital.\nIn the third quarter we reduced our adjusted costs year-on-year for a seventh quarter in a row, excluding transformation charges and bank levies. And this trend is continuing.\nIn addition, our new IT strategy, recently announced by Bernd Leukert and Frank Kuhnke, will help us become more efficient and meet our cost targets.\nAdjusted for specific revenue items and transformation effects, revenues and pre-tax profit in our Core Bank were relatively stable year-on-year in the first nine months of 2019 – despite the noise about strategic discussions and a challenging environment.\nI am especially proud of our Investment Bank. We have established our new setup very fast, and the business’ performance in the meantime has been better than expected. We are pleased with revenue performance so far in the fourth quarter, especially in our Fixed Income and Currencies Sales & Trading business where revenues are above the prior year period. We have also adjusted our revenue expectations for the coming years slightly upwards.\nThis strong start to our transformation was extremely important. We have been able to demonstrate that we are able to not only meet but even outperform our plans. So I would like to thank you again: for your great commitment and your successful efforts.\nWe have achieved this despite additional headwinds in the second half of the year. The economic outlook has become more difficult, although there have been more positive signals recently, and in the Eurozone interest rates are even lower than expected this summer. This inevitably has implications for us.\nHowever, we reaffirm our 8 percent post-tax return on tangible equity target in 2022, while recognising that these headwinds have made this more ambitious. We are implementing measures to offset the negative revenue impact of low interest rates. This includes increasing loan volumes while remaining conservative in our risk management, and better managing our liquidity reserves.\nThe way our discussions with clients have developed since July gives me further confidence. Many of those clients who were reluctant to do business with us due to uncertainty about our strategy now have the confidence to enter into long-term transactions. Just one example: more than three dozen corporates and large institutional clients have decided to come back to us in the past few months. They recognise that we are relevant for them. And that is true for all of our four core businesses:\nOur newly created Corporate Bank has quickly established itself. Here we can see the importance of our global network. With US corporates we are already doing more business in Asia than in Germany. At the same time, Germany is a role model: corporate clients in our home market use an average of seven of our products, compared with only four products in the rest of the world. With a new global coverage model we intend to roll out regional best practice across the Corporate Bank.\nIn our refocused Investment Bank about 75 percent of our revenues are in businesses where we are one of the top five global players. Here too we have a position we can build on. In our Rates and Emerging Markets Debt businesses we are seeing the benefits of our restructuring efforts. Of course we have to reduce costs further but we are confident that revenues won’t suffer. Having largely established our front office setup, we are now focusing on making our processes more efficient – and there we still have a lot of potential.\nFor our Private Bank low interest rates are a particular challenge, especially in Germany. However we are confident that we can at least partially offset these headwinds by working intensively with our clients. They expect us to advise them on how to escape from the interest rate pressure by moving their investments to higher-returning assets. We have had strong performance in this respect this year. Our salesforce in Germany has achieved excellent results as demonstrated by increasing loan volumes and assets under management.\nAt the same time we have the potential to become still more efficient. Having completed the merger of Deutsche Bank and Postbank, we can now further reduce costs in our central functions, our branches and our IT systems.\nWe also see great potential in Wealth Management where the 13 percent increase in our coverage staff since the beginning of the year has resulted in additional inflows.\nDWS demonstrates the impact focused and disciplined management can have. As we have improved investment returns for our clients, the number of DWS funds with a 4 or 5 star Morningstar rating has increased by a quarter since the beginning of last year. Our clients recognise this and are entrusting us with additional assets, resulting in the third consecutive quarter of net inflows.\nWhile all our business divisions have their individual strengths we also have significant potential in terms of cooperation. The strength of our products and our global network differentiate us from many of our peers. In recent months we have reinforced cross-divisional cooperation to make use of this potential. FX4Cash, our currencies hedging tool developed in partnership between the Corporate Bank and the Investment Bank, recorded its highest revenues ever in the third quarter. And Wealth Management is working more closely with the Corporate Bank and the Investment Bank, for example, to support entrepreneurs more comprehensively.\nAt the same time, we are not easing up in terms of cost discipline. We are on track to meet our adjusted cost target of 21.5 billion euros for 2019 and expect to reduce costs further to 19.5 billion euros next year. Based on already implemented measures which will become fully effective only next year, we have achieved almost half of the reductions we need to hit our 2020 target.\nHowever, we have to remain disciplined beyond next year in order to reduce adjusted costs to 17 billion euros by 2022 as planned. Due to our detailed plans and our track record so far we are confident in this respect. Our future is in our own hands.\nThis is all the more reason why we in the Management Board and the Group Management Committee feel reassured by your endorsement. More than 70 percent of you support our new strategy and, according to our latest surveys, internal brand perception is back at the highest level since late 2017.\nOver the past 20 months, collectively we have earned a new level of credibility that we can now build on. We have demonstrated that we can meet our targets. What we have accomplished in the first five months since our strategy announcement should embolden us all.\nI would like to thank you on behalf of the Management Board for your commitment to our course of action. We will get there together if we continue in the same way we started this fundamental transformation – quarter by quarter, month by month, day by day.\nBest wishes,\nChristian Sewing",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}