{
    "url": "https://www.db.com/news/detail/20191210-ecb-reduces-deutsche-bank-s-capital-requirement?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "December 10, 2019",
    "tags": [
        "Capital markets",
        "Company",
        "Corporate products",
        "Investment Banking"
    ],
    "title": "ECB reduces Deutsche Bank's capital requirement",
    "body": "The European Central Bank has reduced Deutsche Bank’s (XETRA: DBKGn.DE / NYSE: DB) Common Equity Tier 1 (CET 1) capital ratio requirement from 11.84% to 11.59%, effective 1 January 2020. This decision acknowledges the progress Deutsche Bank has made since the first SREP assessment in 2016 and follows the 2019 Supervisory Review and Evaluation Process (SREP). The decrease is entirely attributable to the reduction in the ECB’s Pillar 2 requirement from 2.75% to 2.50% which will become effective on 1 January 2020.\nA reduction in capital requirement reduces the level below which Deutsche Bank would be required to calculate a Maximum Distributable Amount (MDA). The MDA is used to determine restrictions on distributions in the form of dividends on CET 1 capital, new variable remuneration and coupon payments to holders of Additional Tier 1 instruments.\n“We welcome the ECB’s decision to reduce Deutsche Bank’s capital requirement”, James von Moltke, Chief Financial Officer, said. “This reflects the progress we have made and our ongoing commitment to conservative balance sheet management and strong internal controls. Our current CET 1 ratio is comfortably above requirements, and we are committed to maintaining robust capital levels throughout the implementation of our transformation strategy.”\nDeutsche Bank’s CET 1 capital ratio requirement effective on 1 January 2020 comprises: the minimum Pillar 1 requirement of 4.50%; the reduced Pillar 2 requirement of 2.50% (down from 2.75%); the capital conservation buffer of 2.50%; the bank specific countercyclical buffer of 0.09% currently expected for January 2020; and the requirement arising from Deutsche Bank’s designation as a Global Systemically Important Bank, or G-SIB, of 2.00% (reflecting DB’s G-SIB scores from data as of December 2017).\nThe ECB has also set new minimum requirements for other capital definitions. Corresponding 2020 requirements are set for Deutsche Bank’s Tier 1 capital ratio to be 13.09% and for the Total capital ratio to be 15.09%. All requirements are articulated on a phase-in basis. In comparison, Deutsche Bank’s last reported consolidated capital ratios on a phase-in basis were 13.39% CET 1 capital ratio, 15.62% Tier 1 capital ratio and 17.40% Total capital ratio, all as of 30 September 2019.\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nChristian Streckert\nPhone: +49 69 910 38079\nE-mail: christian.streckert@db.com\nEduard Stipic\nPhone: +49 69 910 41864\nE-Mail: eduard.stipic@db.com\nInvestor Relations\n+49 800 910 8000 (Frankfurt)\n+44 20 7541 4100 (London)\ndb.ir@db.com\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}