{
    "url": "https://www.db.com/news/detail/20191206-criminal-investigations-into-deutsche-bank-employees-in-connection-with-regula-closed?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "December 6, 2019",
    "tags": [
        "Company"
    ],
    "title": "Criminal investigations into Deutsche Bank employees in connection with \"Regula\" closed",
    "body": "The Frankfurt public prosecutor's office has closed investigations into two employees of Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) in the so-called Regula proceedings due to lack of sufficient suspicion in accordance with paragraph 170 (2) of the German Code of Criminal Procedure. The proceedings were linked to German client interactions with off-shore entities which were established by Regula Ltd., a subsidiary of Deutsche Bank. The bank has sold Regula Ltd. in March 2018.\nThis step means that the allegations of aiding and abetting tax evasion and of money laundering that were made against the suspected bank employees and the bank have been dropped. At the same time, the bank accepts in a separate fine proceeding a fine of 5 million euros as well as the confiscation of avoided expenses in the amount of 10 million euros, payable as a result of shortcomings in its control environment.\n“With the closure of these proceedings it is clear that the prosecutors have not found any instances of criminal misconduct on the part of Deutsche Bank employees following the raid of our Frankfurt office in November 2018. The investigation that has now been closed due to lack of sufficient suspicion had a heavy impact on Deutsche Bank last year,” said Joerg Eigendorf, group spokesman of Deutsche Bank. “It is true that the bank had weaknesses in its control environment in the past. We identified these weaknesses and we have addressed them in a disciplined manner.”\nDeutsche Bank has increased the number of employees in its Anti-Financial Crime unit threefold. The Bank has invested 700 million euros since 2016 in modernising its key controls.\nIt was in connection with this investigation that – together with Federal Criminal Police officers – the Frankfurt public prosecutor’s office raided Deutsche Bank’s headquarters in Frankfurt and other business premises in and around Frankfurt on November 29, 2018.\nA spokesman for the Frankfurt public prosecutor's office stated that they were able to close investigations earlier than originally anticipated thanks to the excellent and close cooperation with Deutsche Bank. The public prosecutor’s office also stated that it is still in talks with Deutsche Bank in connection with the investigation into Danske Bank and that these talks are constructive and well advanced.\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nSebastian Krämer-Bach\nPhone: +49 69 910 43330\nEmail: sebastian.kraemer-bach@db.com\nInvestor Relations\n+49 800 910-8000 (Frankfurt)\n+44 20 7541-4100 (London)\ndb.ir@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}