{
    "url": "https://www.db.com/news/detail/20191204-positiveimpact-wins-european-excellence-award-for-storytelling?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 4, 2019",
    "tags": [
        "Company"
    ],
    "title": "#PositiveImpact wins award for Storytelling",
    "body": "We are pleased to announce that #PositiveImpact, Deutsche Bank's global brand strategy and campaign, has won a prestigious communications award at this weekend's European Excellence Awards.\n#PositiveImpact was shortlisted in the Storytelling category against competition including Norwegian Airlines, Kapersky, Eurelectic and Boehringer Ingelheim. Other category winners include Adidas, CocaCola, Ikea, O2 and Siemens.\nA judging panel of industry experts from agencies and in-house communications departments across Europe were impressed how Deutsche Bank used film to communicate the bank’s purpose in action through client stories. They recognised Deutsche Bank with the award for Storytelling after learning how employees are also able to get involved and support the campaign by sharing their own #PositiveImpact stories on our internal engagement hub.\nGlobal Head of Brand Communications & CSR, Lareena Hilton said: “We’re thrilled to have been recognised for a European Excellence Award, along with other very well-known global brands. The jury noted how #PositiveImpact has created a clear purpose for the bank. We made a conscious decision to launch the campaign internally first because we wanted employees to feel part of the campaign and be able to share their own #PositiveImpact stories. It’s great to see colleagues engaged with why we all come to work every day and what that means for our clients.”\nEmployee engagement with #PositiveImpact began with the internal launch of the campaign in May 2017, followed by its public debut in June 2018 using client testimonial stories from all parts of the bank.\nThese stories are told through adverts, films and case studies, all of which describe how Deutsche Bank has helped clients to achieve their plans and ambitions.\nCEO Christian Sewing’s words underline the strategic relevance of the campaign’s focus on client relationships. In a recent message to employees he said: “The trust of our clients is our most precious asset. There is no better way to get positive recognition than by delivering great service to our clients.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}