{
    "url": "https://www.db.com/news/detail/20170216-we-together-celebrates-its-first-anniversary?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 16, 2017",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "\"We together\" celebrates its first anniversary",
    "body": "In February 2016, Deutsche Bank joined forces with 35 other German companies to foster the effective integration of refugees under the We together (Wir zusammen) umbrella. Since then, 170 members have joined and pilot projects have become powerful initiatives – with the network growing.\nAs a responsible corporate citizen, Deutsche Bank sends a strong signal in favour of a diverse society. The Bank pledged to engage 1,000 employees from across Germany to serve as integration coaches for refugees between 2016 and 2018. “This is our tangible contribution to fostering an open-minded society and to promoting a welcoming culture in our German home market,” says John Cryan, Chief Executive Officer of Deutsche Bank.\nFrom the start, the response to the internal call for action has been very encouraging. Almost 400 colleagues have registered as integration coaches and 250 tandems have been matched or will start soon. Only recently, 24 Deutsche Bank employees signed up as new “job-buddies” at an event in Frankfurt.\nFeedback from integration coaches\nAs part of a tandem, colleagues and refugees can achieve a great deal: start a friendship, improve language skills and create a path towards becoming integral members of society and the German labour market. “In November, I went to see a second division football game with six men from the shelter I am volunteering at. It was so much fun. That evening, I realised how engaging it is to do something exciting like this together,” integration coach Frank Hoffmann reports.\nAnother mentor is pleased that her 10-year-old mentee is settling in well in her new surroundings. “This is the first time she is going to school; in her hometown, the war prevented her from doing so. She is really happy about getting to learn new things – and studies with a lot of discipline and energy.”\nTo bring its pledge to life, Deutsche Bank cooperates with the following six charities that operate on a national level: JOBLINGE, Rock your Company!, Über den Tellerrand, Start with a Friend (Beyond your Plate) , Mentor – die Leselernhelfer (the reading coaches) and Volunteer Vision.\nIn 2016, nine kick-off mentoring and networking events were organised by the programmes. Several Deutsche Bank volunteers helped to set-up the initiatives in Berlin, Hamburg, Frankfurt and Cologne – further locations are already being planned. Even a “digital location” took shape in 2016: Volunteer Vision connects integration coaches online – everywhere.\n1,000 Deutsche Bank staff members as Integration Coaches can now look back on one year of successful integration projects – highlighting how much we can achieve together. The first year in numbers:\n400 integration coaches\n250 tandems\n30 mentors in the digital mentoring-programme\n10 weeks of language courses at the headquarters of the Bank\n9 kick-off matching-events\n24 new registrations during the first info-event 2017\n\"I was interested to learn what it means to be an integration coach when I first signed up. JOBLINGE did a great job preparing us for this role. Being a mentor was sometimes challenging, but I got so much out of helping young people to find an internship or a job. Even if not everything turned out to be a success, I will continue to support this programme – and have meanwhile become a 'job buddy' for a second mentee.\" Frank Tieker, integration coach\n\"I am so happy that my mentor supports me in finding a vocational training and meets up with me every week. With his help, I can improve my language skills, learn more about working in Germany and become better at maths. I want to find a training position soon – and hope that my mentor can be of help.\" Ridwan, mentee, 19 years",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}