{
    "url": "https://www.db.com/news/detail/20170215-stuart-kirk-don-t-write-off-investment-research?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 15, 2017",
    "tags": [
        "Investment Banking",
        "Research"
    ],
    "title": "Stuart Kirk: Don't write off investment research",
    "body": "Investment research faces the biggest challenge to its business model since Eliot Spitzer, the pugnacious former attorney-general of New York, jammed a mile-high wedge between analysts and bankers 15 years ago. From January, clients must pay for research directly rather than via commission. A horrible shock is predicted as analysts such as me discover what they are really worth. Many say research is in terminal decline regardless.\nSuch doom and gloom is not shared by the so-called sellside, however – and we are a cynical bunch. We see a bright future where newly unbundled content is king and clients are happy to pay for it. Outsiders are too pessimistic because they do not have the data we do. This is not their fault. Indeed, it is exactly because the economics of research is mixed up with sales and trading that regulators want to untangle the mess so clients can see what they are paying for.\nWhy are the naysayers wrong?\nTake readership. Low click-through rates are often cited as a sign of disengagement but analysts are now encouraged to summarise their ideas into the body of emails so clients do not have to download whole reports. On average, about a third of these emails are opened – a significant number. More encouragingly, openings skyrocket when original work is presented in an attractive way. Our best content is often more widely read than much paid-for financial commentary.\nIt has also recently been claimed that research must be suffering because headcount is down a 10th since 2012. But that is slightly better than for investment banking overall with an 11 per cent decline, according to Coalition data. New technology has reduced employees in publishing and distribution but areas of importance remain covered.\nFor example, the top eight global research houses analyse the same number of companies they did a decade ago – 3,150 each on average.\nThe snub that investment research is not valuable is even flakier. Clients fight over meetings with our best analysts and the media ask us for 300 reports a quarter. And, while the sellside’s forecasts are no worse than other professions, analysts are not paid to pick when I was a portfolio manager back in the late 1990s we charged 1 per cent in management fees.\nSellside research by contrast costs a fraction as much, around 0.05-0.1 per cent, or to use the industry parlance, 5-10 basis points. That is a bargain given the unrivalled knowledge on offer – not to mention the corporate access, conferences, models, positioning data and much more we throw in as well.\nHow much of a bargain we cannot prove under a bundled model. But clients tell us how valuable we are, and they tell independent consultants, too. An annual Greenwich Associates survey asks the buyside – the fund managers and other investors – to apportion its commission payments according to the services received. Year after year, the responses show that clients allocate 45 per cent of commissions for research, 35 per cent for execution and 20 per cent for sales.\nSure, research can improve. There is still too much volume versus quality (my department publishes about 50,000 reports a year). We must also be better at embracing technology to make our content easier to use. Some clients have already given up on us, building their own analyst teams instead. But, again, this is not so bad from where we sit. Ironically, large buyside research platforms end up consuming even more sellside content.\nDoes providing research make sense for bank shareholders, though?\nConsider that in the past decade every investment bank has reviewed its operations and made tough decisions, including closing entire business lines. Yet not one has ceased doing investment research. That is because every part of a bank benefits from research, either directly or indirectly.\nTraders see that commissions are two times higher when a stock is covered by an analyst. Bankers know the success rate of getting on a deal is five times greater. Plus, we do everything from giving speeches at wealth management conferences to providing briefings for senior management. It is also nice that we do not require capital.\nResearch has always generated revenues, if it’s sometimes hard to see. That is about to change and with luck these revenues will soar. We know from data on readership, meeting requests and phone calls that demand for research more than doubles during periods of uncertainty such as Brexit or Donald Trump’s election victory. And the sellside has suffered alongside active management as the dispersion of total returns declined after the crisis – the world was too boring, too uniform. Expect a renaissance in research now things are hotting up again.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}