{
    "url": "https://www.db.com/news/detail/20170203-management-board-apologises-for-former-misconduct?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 3, 2017",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Management Board apologises for former misconduct",
    "body": "Dear Clients,\nOn Thursday of this week, we reported our full year results. They were severely impacted by several legal settlements that we agreed with clients and public authorities. Since I became Chief Executive Officer of Deutsche Bank 18 months ago, we have incurred settlement costs totaling approximately five billion euros for incidents that largely occurred many years ago.\nThese legacy issues have not only cost us a lot of money; they have also cost us dearly in terms of reputation and trust. There are still other matters from the past that will burden our results, but we have now settled the bulk of our major legal issues.\nTherefore I would like to take this opportunity to express, also on behalf of the Management Board of Deutsche Bank, our deep regret for what happened. We would like to apologise sincerely.\nSerious errors were made - for example, with regard to our residential mortgage backed securities business in the US between 2005 and 2007, about which we recently reached a settlement with the Department of Justice. In this matter, conduct at that time did not meet our standards and was completely unacceptable. Unfortunately the same also applies in other instances.\nIt is also a fact, however, that the vast majority of Deutsche Bank employees were neither involved in, nor bore any responsibility for, the legal issues that the bank has dealt with recently. It was generally the misconduct of a relatively small number of individuals pursuing their own short-term interests that jeopardised Deutsche Bank’s most valuable asset: its reputation. Many more people felt the repercussions – not only clients and investors, but also all of our decent, honest colleagues who identify so strongly with Deutsche Bank.\nLadies and Gentlemen, wherever human beings work, there will always be mistakes. However, we, the Management Board members and the bank’s senior management as a whole, will do everything in our power to prevent a repetition of such incidents.\nOur goals are a Deutsche Bank that …\n… is trusted by its clients.\n… is true to its heritage and responsibilities.\n… attracts and inspires people who share our values.\n… creates first-class solutions for its clients.\n… and delivers sustainable profits.\nIn short, we want to be a bank that contributes to economic growth and to the community. A bank that can generate a positive impact – for its clients, employees, investors and society.\n\nYours sincerely,\nJohn Cryan\nOn behalf of the Management Board of Deutsche Bank\n ",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 0
}