{
    "url": "https://www.db.com/news/detail/20191113-inequality-tops-torsten-slok-s-20-risks-to-markets-in-2020?language_id=1",
    "language": "DE",
    "article_type": "Research",
    "publish_date": "November 13, 2019",
    "tags": [
        "Research"
    ],
    "title": "Inequality tops Torsten Slok's 20 risks to markets in 2020",
    "body": "Torsten Slok, Chief Economist, Deutsche Bank Securities, has issued his 20 Risks to Markets in 2020.\nTopping the list is the continued increase in inequality. Slok appeared on CNBC’s Closing Bell to talk about this in more detail.\n“The trend we have seen is wealth inequality, income inequality and healthcare inequality have been going in the same direction for 30 years and has been swiped aside by investors,” said Slok. “It’s an issue we think will become important in 2020 and ‘21 and investors need to have a view on if the current trend will continue or will something be done about it.”\n\n\n\nSlok added that depending on the outcome of the election, addressing inequality could mean more government spending, higher taxes and/or various ways of addressing spending on - for example - health, education and other things that can address inequality.\nTrade war uncertainty is also high in the list. According to Slok the trade war would continue to weigh on capex and durable goods which are still trending lower with no “sign of a turnaround.” This is also the case for manufacturing and CEO confidence indicators are also pointing down. “The big issue (with the trade war) is not will there be a signed agreement, but how are CEOs going to respond?”\n20 risks to markets in 2020\nContinued increase in wealth inequality, income inequality and healthcare inequality.\nPhase one trade deal remains unsigned, continued uncertainty about what comes after phase one.\nTrade war uncertainty continued to weigh on corporate capex decisions.\nOngoing slow growth in China, Europe and Japan Triggering significant US dollar appreciation.\nImpeachment uncertainty & possible government shutdown.\nUS election uncertainty; implications for taxes, regulation and capex spending.\nAntitrust, privacy and tech regulation.\nForeigners lose appetite for US credit and US Treasuries following Presidential election.\nMMT-style fiscal expansion boosts growth significantly in US and/or Europe.\nUS government debt levels begin to matter for long rates.\nMismatch between demand and supply in T-bills, another repo rate spike.\nFed reluctant to cut rates in election year.\nCredit conditions tighten with more differentiation between CCC and BBB corporate credit.\nCredit conditions tighten with more differentiation between CCC and BBB consumer credit.\nFallen angels: More companies falling into BBB. And out of BBB into HY.\nMore negative-yielding debt sends global investors on renewed hunt for yield in US credit.\nDeclining corporate profits means fewer dollars available for buybacks.\nShrinking global auto industry a risk for global markets & economy.\nHouse price crash in Australia, Canada and Sweden.\nBrexit uncertainty persists.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}