{
    "url": "https://www.db.com/news/detail/20201120-us-election-2020-a-pyrrhic-victory-for-the-democrats?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 20, 2020",
    "tags": [
        "Research"
    ],
    "title": "US election 2020: a Pyrrhic victory for the Democrats",
    "body": "It is finally (almost) done. Joe Biden will be the 46th President of the United States, Kamala Harris his Vice President. Of course, there will be continued legal wrangling, but the majority of electors will vote for the Democrat on December 14 and he will take office on January 20. However, this allegory of the change of government hides a completely different story.\nThe Democrats have taken the White House but the predicted \"blue wave\" failed to materialise. Although Biden received more votes than any previous presidential candidate, Donald Trump also got ten million more votes than in 2016. In fact, the Democrats lost ground in many areas, from congressional elections to state governors and legislators to regional referendums. Although Trump was voted out of office, he does not seem to have damaged the popularity of the Republican Party – quite the contrary.\nStrong Republicans\nHistorically the party that wins the White House makes gains both in the House of Representatives and at the state level – but not this time. The Republicans are likely to retain control of the Senate unless there is a big surprise in the upcoming run-off election in Georgia. Furthermore, they were able to reduce the Democrats’ majority in the House of Representatives; according to the latest projections, they took nine seats from them. The Republicans made historic gains at the state-level as well. There are now 23 states in which the Republicans hold the governorship and control both houses of the legislature. The Democrats hold this ‘trifecta’ in only 15 states.\nBut that's not all. There were also votes on specific policy measures in various states at the same time as the elections. These referendums give us deep insights into the political mood in the country. And the picture is clear: many if not most of the left-leaning propositions on the ballots were rejected. In California, for example, there was a failed attempt to allow positive discrimination in favour of minorities – an identity politics issue that the Democratic left wing cares deeply about.\nThose who look only at Biden's victory are therefore misjudging the true message of this election, which is the key to understanding the future developments in the United States. Although a majority of voters wanted a different president, they also clearly rejected an activist Democratic economic and social agenda. The fact that the expected landslide did not happen has enormous implications for US politics in the legislative period that is starting now – but also beyond.\nWhat can we expect and not expect from a Biden government?\nLet’s start with the short term. When Joe Biden moves into the White House, he won't find much room for manoeuver there. The Republicans have the majority in the Senate – under the leadership of Mitch McConnell, who already showed when Barack Obama was in office that he is willing and able to block a Democratic president as much as possible. The Senate must also approve all appointments to the cabinet; progressive candidates like Elizabeth Warren, who is controversial even among the Democrats, have zero chance to make it through the confirmation process. And even the traditional way out for a president without a parliamentary majority, ruling by Executive Order, is likely to often end up in the Supreme Court, which is dominated by a 6:3 majority of conservative judges after Trump's nominations.\nAs a result, the Biden government will be forced to be more of a caretaker administration rather than an activist administration. A radically new, left-wing economic and social policy won’t even get off the ground. Biden will therefore be unable to significantly expand Medicare coverage or reverse Trump's tax cuts. The same applies to a “green new deal\", a minimum wage of 15 dollars, a break up of technology companies or an economic stimulus package of 2 to 3 trillion US dollars that the Democrats had in mind.\nAn important area for Biden will be foreign policy, as the US president can take action there largely without Congressional approval. Trump's biggest mistake was his unwillingness to work within and strengthen alliances to leverage US global influence. In contrast, Biden is likely to embrace and repair the major alliances that lent stability to geopolitics for the past 70 years – from the UN to the WTO, WHO and IMF. However, he too will argue for a stronger home-made European defence effort, while strongly supporting NATO. Biden's policy towards China will be less confrontational, but not necessarily less effective than Trump's more erratic approach. A US-led anti-China alliance with Japan, Korea, India, Australia and perhaps even Russia would be far more threatening to the People's Republic than tariffs and export restrictions. Biden, unlike Trump, would be able to form such an alliance.\nUnder Biden, the US will probably rejoin the Paris climate agreement. However, the Senate is unlikely to approve the legislation required to reach agreed emissions goals. Biden will therefore have to hope for initiatives from states such as California.\nPositive economic outlook\nA divided government has historically been good for the economy. It prevents either party from implementing a radical programme of economic measures. The new president and Congress should be able to come up with a reasonable economic stimulus package of 750 billion to 1 trillion US dollars fairly quickly, which includes funds for unemployment benefits, another round of the paycheck programme, financial aid for schools and funds for coronavirus testing and contact tracing.\nIn general, no further significant increases in government spending are expected in the coming years – the Republican representatives, who already blocked Trump's desired spending, and Biden himself, who has a reputation for prudent economic management, will prevent this. The burden of keeping the recovery going will, therefore, remain squarely with the Federal Reserve. Thus, we do not expect any change in the Fed’s accommodative policy in support of the economy. Overall, the US economy could grow by 4 to 5 percent in 2021. This will help the stock market, as will the fact that technology companies will continue to benefit from the temporary boom caused by the pandemic – and will not have to fear being broken up for now.\nThe Democrats, who are increasingly turning into a party of the educated coastal elites, will now go through a painful time of soul-searching, the middle blaming the resurgent left for the losses and vice versa. In doing so, the party could drift even further towards the left in an attempt to reclaim the working class vote from Trump. But many of the liberal visions of the Democratic left don’t play well with the target group – for them, Trump's Republicans are closer to their world. “We are a working class party now,” tweeted Republican Missouri senator Josh Hawley on election night. “That’s the future.”\nTrump and his Republican supporters in Congress are likely to keep alive the narrative that the election was stolen from them – with the goal of leading a strong and engaged Republican base into the 2022 Congressional elections and, in the best case, achieving a majority in the House of Representatives as well. But this is only an interim goal. Ultimately, Republicans are already focused on recapturing the White House in 2024.\nThis means that the political debate in the US in the coming years will remain a struggle with familiar fronts: on one side the educated elites in the coastal regions and the cities, who benefit from technological advances, who can work from home and remain largely untouched by the economic ravages of the pandemic and who continue to enjoy the benefit of the historic appreciation of their financial and real assets over the past decade. And on the other side the relatively under-educated, asset-poor working class that has been bearing the brunt of the pandemic and the ongoing technologically-driven shifts in labour markets. This group of those who feel left behind helped Trump take office in 2016 and will continue to grow. With a view to the presidential election in 2024, this group could once again become crucial.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 8
}