{
    "url": "https://www.db.com/news/detail/20201109-deutsche-bank-announces-sale-of-postbank-systems-to-tata-consultancy-services?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 9, 2020",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Deutsche Bank announces sale of Postbank Systems to Tata Consultancy Services",
    "body": "Deutsche Bank and Tata Consultancy Services (TCS) today announced an agreement concerning the sale of Postbank Systems AG to TCS.\nUnder the terms of the transaction, TCS will acquire 100 percent of the shares of Postbank Systems AG from Deutsche Bank AG. Postbank Systems and its around 1,500 employees will become part of TCS. The sale represents an important step forward for Deutsche Bank’s announced strategic transformation.\nBernd Leukert, Chief Technology, Data and Innovation Officer at Deutsche Bank said: “As part of our move to one technology organisation, we are consolidating the IT platform for our retail banking brand Postbank into the Deutsche Bank platform. TCS is already a trusted IT services partner for Deutsche Bank and this strengthens our relationship further. We are confident that TCS is the ideal owner for Postbank Systems. With this transaction, we have agreed a structure that serves all parties’ interests. It provides clarity to Postbank Systems staff and gives them the opportunity to become part of the success and growth story of TCS.”\n“We are pleased to deepen our long-standing partnership with Deutsche Bank, continue to help accelerate their digital transformation, and to acquire market specific capabilities in the banking domain,” said N G Subramaniam, Chief Operating Officer and Executive Director, TCS. “We warmly welcome Postbank Systems’ IT professionals into the TCS family, and invite them to avail the learning and development opportunities here, and help script the next chapter of TCS’ growth in Germany.”\nTCS is an IT services, consulting and business solutions organisation with over 453,000 consultants in 46 countries. The acquisition of Postbank Systems will contribute to Tata Consultancy Services continued growth in Germany and in the Financial Services Industry.\nThe transaction will not affect Deutsche Bank’s plans nor disrupt its schedule for modernising its IT platform. It will serve to further deepen the existing strong relationship with TCS.\nThe transaction is subject to both parties finalising further agreements, which they intend to do by year-end-2020. Furthermore, the transaction is subject to customary regulatory and governmental approvals.\nThe transaction represents an additional step in Deutsche Bank’s transformation and is consistent with previously-communicated financial plans. It will result in the acceleration of expected transformation impacts of approximately 120 million euros as part of the strategy announcement in July 2019.\n\nFor further information please contact:\n\nDeutsche Bank AG\nSebastian Kraemer-Bach\nPhone: +49 (69)910-43330\nEmail: sebastian.kraemer-bach@db.com\n\nMarkus Dahlem\nPhone: +49 (69)910-62016\nEmail: markus.dahlem@db.com\nTata Consultancy Services\nArushie Sinha\nPhone: ++919960454744\nEmail: arushie.sinha@tcs.com\nChristoph Weissthaner\nPhone: +49 15222521330 \nEmail: c.weissthaner@tcs.com\n\nAbout Deutsche Bank\nDeutsche Bank provides retail and private banking, corporate and transaction banking, lending, asset and wealth management products and services as well as focused investment banking to private individuals, small and medium-sized companies, corporations, governments and institutional investors. Deutsche Bank is the leading bank in Germany with strong European roots and a global network.\n\nAbout Postbank Systems AG\nPostbank Systems is a full-range captive IT service provider that bundles the IT competence of the former Postbank. The company provides its project, application management and infrastructure operations services exclusively to the Postbank brand, BHW “Bausparkasse” and further subsidiaries of Deutsche Bank. Postbank Systems has its headquarters in Bonn, Germany, and has about 1,500 employees working from Berlin, Bonn, Frankfurt, Hamburg, Hamelin, Hanover, Munich, Nuremberg and Saarbruecken.\n\nAbout Tata Consultancy Services Ltd. (TCS)\nTata Consultancy Services is an IT services, consulting and business solutions organisation that has been partnering with many of the world’s largest businesses on their transformation journeys for over 50 years. TCS offers a consulting-led, cognitive powered, integrated portfolio of business, technology and engineering services and solutions. This is delivered through its unique Location Independent AgileTM delivery model, recognised as a benchmark of excellence in software development.\nA part of the Tata group, India's largest multinational business group, TCS has over 453,000 of the world’s best-trained consultants in 46 countries. The company generated consolidated revenues of US $22 billion in the fiscal year ended March 31, 2020, and is listed on the BSE (formerly Bombay Stock Exchange) and the NSE (National Stock Exchange) in India. TCS' proactive stance on climate change and award-winning work with communities across the world have earned it a place in leading sustainability indices such as the Dow Jones Sustainability Index (DJSI), MSCI Global Sustainability Index and the FTSE4Good Emerging Index. For more information, go to www.tcs.com.",
    "number_of_ratings": 6,
    "rating": 2.8,
    "likes": 36
}