{
    "url": "https://www.db.com/news/detail/20201109-record-demand-for-deutsche-bank-s-senior-debt-issue?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 9, 2020",
    "tags": [
        "Corporate products"
    ],
    "title": "Record demand for Deutsche Bank’s senior debt issue",
    "body": "Deutsche Bank today launched a dual tranche of senior non-preferred debt instruments for a tenor of 5 and 10 years, callable after 4 and 9 years respectively. The order book, of close to 10 billion euros, was the largest ever for any Deutsche Bank senior debt instrument. These euro-denominated issuances will raise a total of 3 billion euros with a coupon of 160 basis points over mid-swap for the 5 year tenure and 210 basis points over mid-swap for the 10 year instrument.\nWith our 2020 external funding plan largely complete, the proceeds of this issuance will be used to pre-fund the 2021 requirements, as we explained on last week’s third-quarter Fixed Income Investor Call. This will strengthen our position in respect of Total Loss Absorption Capacity (TLAC) and Minimum Requirement for own funds and Eligible Liabilities (MREL).\nThis issuance follows a positive market reaction to our third quarter results. Last week, Moody’s announced its decision to raise the outlook on Deutsche Bank’s credit ratings from negative to stable – the first positive move on Deutsche Bank’s ratings since May 2007. Following this upgrade, spreads on Deutsche Bank’s five year euro senior non-preferred bond tightened by 26 basis points over the course of last week, enabling Deutsche Bank to issue at more favorable rates.\nIn its report, Moody’s commented on the strength of Deutsche Bank’s liquidity and funding: “In addition to its solid capitalization, high liquidity remains a comparative, credit-positive strength of DB. The bank reported liquidity reserves of 253 billion euros as of 30 September 2020, which substantially mitigates the refinancing risks associated with its more confidence-sensitive wholesale market funding.”\nDixit Joshi, Group Treasurer said: “Record demand for this issue, following our successful issuances earlier in the year, is another sign of growing market confidence in Deutsche Bank. Following last week’s upgrade from Moody’s and with the US election behind us, our timing worked well. This enables us to manage our future funding requirements well and further strengthen Deutsche Bank’s balance sheet.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}