{
    "url": "https://www.db.com/news/detail/20240604-bitpanda-expands-partnership-with-deutsche-bank?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 4, 2024",
    "tags": [
        "Corporate products"
    ],
    "title": "Bitpanda expands partnership with Deutsche Bank",
    "body": "Deutsche Bank will provide real-time payment solutions for Bitpanda customers for both incoming and outgoing transactions\nBitpanda will be able to provide local IBANs for users in Germany\nFintech unicorn Bitpanda is expanding its partnership with Deutsche Bank to provide real-time payment solutions for incoming and outgoing transactions for users in Germany. This API-based account solution will provide Bitpanda with access to German IBANs, streamlining and enhancing the experience for users and ensuring  confidence, speed and efficiency. This is just the latest step taken as part of Bitpanda’s efforts to provide a tailored local solution and supporting the continued strengthening of Bitpanda’s position as the leading digital-asset trading platform in Europe. Deutsche Bank already supports the operational needs of Bitpanda as its European Hausbank for cross-currency solutions in Austria and Spain.\nBitpanda is a regulated multi-asset broker platform offering more than 2,800 selected virtual assets and indices as well as stocks, ETFs and commodities to retail investors. Deutsche Bank represents another major institutional partnership for Bitpanda, who are currently undergoing a period of significant growth. Cooperation with traditional financial services providers is a strategic goal throughout 2024 for the unicorn, which believes that such integration will shape the future of the financial services industry.\nLukas Enzersdorfer-Konrad, Deputy CEO of Bitpanda, commented: “Bringing the best parts of the industry together is where we can create real value for people.  Deutsche Bank’s commitment to working with new and innovative players in the financial industry continues to make our partnership possible. From today, we can access a range of Deutsche Bank’s products, unlocking benefits for our team and our users.”\nKilian Thalhammer, Global Head of Merchant Solutions, Deutsche Bank, added: “We are always looking to partner with companies who share our commitment to user safety and security. With Bitpanda, a recognised and regulated fintech provider, we are confident to help build a secure and trusted environment for users in this innovative field of virtual asset investing. With our strategy to be the bank of choice for the high-potential platforms, the partnership with Bitpanda represents a key milestone as we shape this emerging ecosystem through active engagement with leading industry players.”",
    "number_of_ratings": 14,
    "rating": 4.9,
    "likes": 29
}