{
    "url": "https://www.db.com/news/detail/20180215-deutsche-bank-s-alternative-investment-survey-reveals-investors-renewed-optimism-towards-hedge-funds-in-2018?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "February 15, 2018",
    "tags": [
        "Asset Management",
        "Corporate products",
        "Sustainability"
    ],
    "title": "Survey reveals investors' renewed optimism towards hedge funds in 2018",
    "body": "Deutsche Bank today released its 16th annual Alternative Investment Survey, Back on track: Hedge funds deliver, investors commit, one of the industry’s largest and longest-standing hedge fund investor surveys. This year 436 global hedge fund investors representing 2.1 trillion US dollars in hedge fund assets shared insights into their current sentiment and allocation plans for 2018.\n“It has been a transitional time for the hedge fund industry. We are seeing a shift in momentum with improved performance and positive flows,” said Greg Bunn, Global Co-Head of Prime Finance at Deutsche Bank. “One in two investors plans to grow their allocation to hedge funds in the next 12 months. We found that the average respondent expects to boost the size of their portfolio by 129 million US dollars this year.”\nSurvey respondents included investors from 21 different countries across the EMEA, Americas and Asia Pacific regions and representing two thirds of industry assets. Compiled by Deutsche Bank’s Capital Introduction Group, the survey is one of the most comprehensive in the industry, focused on pension funds, sovereign wealth funds, endowments, foundations, insurance companies, consultants and funds of hedge funds.\nMarlin Naidoo, Global Head of Capital Introduction and Hedge Fund Consulting at Deutsche Bank, said: “While investors are committing more capital to hedge funds as part of their overall portfolio the competition for these dollars remains strong. This is because most investors expect to keep their number of allocations constant, creating a ‘one in, one out’ scenario. Fund managers need to continue to differentiate themselves via outperformance, bespoke fee arrangements and uncorrelated investment strategies.”\nThis year’s survey came after a strong year for risk assets globally. Many equity indices ended the year at or close to multi-year highs.\nIn addition, the hedge fund industry ended the year up high single digits, posting the best annual performance since 2013.\nAshley Wilson, Global Co-Head of Prime Finance and EMEA Head of Equity Trading at Deutsche Bank, said: “Investors appear more optimistic in their outlook for Europe and Asia. Our survey indicates that investor interest in European hedge funds has more than doubled year on year and that thirty percent of respondents are planning to add exposure to Asia. These regions provide more alpha opportunities across multiple countries with diverse market structures.”\nBelow are the highlights of Deutsche Bank’s 16th annual Alternative Investment Survey:\nHedge funds met targets in 2017\nRespondents’ hedge fund portfolios broadly met their 2017 return targets – the first year that investors achieved their set targets in four years. The average respondent’s portfolio achieved a year to date return of +7.97% as of November 30, 2017, compared to +2.99% in the previous year.\nNet inflows of USD 41 billion are predicted in 2018, driving industry assets to USD 3.42 trillion\nLooking back to 2017, the hedge fund industry grew by 6.4% and assets under management reached an all-time high of USD 3.21 trillion by year-end, surpassing the USD 3.14 trillion predicted by investors in last year’s survey. Investors are optimistic in their outlook for the industry in 2018, expecting hedge funds to receive USD 41 billion in net new investor capital for the year versus USD 10 billion last year.\nEvent-driven funds are the most in demand\nEvent-driven funds received USD 6.9 billion of net inflows in Q4 2017, representing the largest increase in net new capital of all broad-based strategies quarter on quarter. Twenty-two percent of investors are planning to allocate to event-driven managers over the next twelve months (versus 10% last year), making it the most sought after strategy in 2018.\nFundamental equity long/short is back in vogue\nOne in five respondents is planning to add to fundamental equity long/short funds in 2018, making it the second most in-demand strategy for the year ahead. This result comes in stark contrast to our findings last year where only 4% of respondents were looking to add to fundamental equity long/short.\nEnvironmental, social and governance (ESG) funds see a meaningful increase in demand\nOne in five respondents currently allocates to socially responsible/environmental, social and governance (ESG) investments – up from 13% last year. Of these respondents, two-thirds (67%) are looking to increase their allocation to ESG funds in 2018.\nEuropean and Asian hedge funds will be the focus in 2018\nWestern Europe has displaced North America as the most sought after investment region, with 37% of investors planning to add to their European exposure in 2018 (versus 17% in last year’s survey). Asia is close behind: 30% plan to add to Asia including Japan (up from 21% last year)\nOne size does not fit all: investors are securing bespoke fee structures\nResults suggest that hedge fund fee arrangements are becoming increasingly dynamic and are based on a variety of different factors, such as fund assets under management, age and strategy as well as the nature of the investment. For example, half of investors have negotiated lower fees for a longer lock up or larger allocation size, while 42% of respondents are invested in a fund whose management fee reduces as assets under management increase.\nMedia Contacts\nAurelie Leonard: +44(0207)54-14209; aurelie.leonard@db.com\nOlayinka Fadahunsi: +1(212)250-8159; olayinka.fadahunsi@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}