{
    "url": "https://www.db.com/news/detail/20180209-lunar-new-year-the-dog-an-orchestra-and-a-new-moon?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 9, 2018",
    "tags": [
        "Art",
        "Corporate Citizenship"
    ],
    "title": "Lunar New Year: the dog, an orchestra and a new moon",
    "body": "Each Lunar New Year, also known as Chinese New Year, is characterised by one of 12 animals from the Chinese zodiac - this year will be the Year of the Dog.\nUshering in the Year of the Dog in Singapore, the world-renowned Singapore Chinese Orchestra (SCO) played to a packed lobby at Deutsche Bank’s Singapore office in One Raffles Quay on February 7. Deutsche Bank is a long-standing partner of the SCO through its Born to Be music programme.\nSponsored by Deutsche Bank, the orchestra drew a crowd of around 500 colleagues and passers-by, who stopped to enjoy the powerful performance in the large entrance space. Deutsche Bank employees showed their skill on the drums as they performed alongside the SCO for the audience which also included charity partners and beneficiaries. Deutsche Bank's charity partners also took part, selling festive treats at a 'pop up' marketplace.\nThe SCO is Singapore's flagship Chinese orchestra made up of more than 80 musicians and known for its high performance standards and versatility. As well as preserving traditional arts and culture through its music, the orchestra incorporates modern cultural influences in its performances.\nEarlier this month, staff in Beijing and Shanghai, Deutsche Bank’s two biggest offices in China, held staff events where colleagues took to the stage. The winning performance was a hand shadow dance by the Global Transaction Banking (GTB) team in Beijing.\nLunar New Year is one of the most celebrated and vibrant events in the Chinese calendar. It starts with the new moon that comes between January 21 and February 20, and ends with a colourful lantern festival the following month. It is a major Chinese holiday and celebrated in countries and territories with large Chinese populations, including mainland China, Hong Kong, Taiwan, Singapore, Indonesia, Malaysia, Thailand, Vietnam, Cambodia and Mauritius.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}