{
    "url": "https://www.db.com/news/detail/20180208-deutsche-bank-research-picks-holes-in-the-coalition-agreement?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 8, 2018",
    "tags": [
        "Research"
    ],
    "title": "Deutsche Bank Research picks holes in the coalition agreement",
    "body": "Barbara Böttcher, Dieter Bräuninger and Stefan Schneider from DB Research expect that the SPD grass roots will approve the coalition agreement by a small majority and that a grand coalition will be formed. The balloting of the SPD’s 463,700 members may take until March and represents the final hurdle to be cleared for a grand coalition.\nThe three economists have analysed the still fresh draft coalition treaty in their paper entitled “\nPDF\nGroko coalition treaty: More spending than strategy.” Their main conclusions make for rather sobering reading:\nAt first glance Europe looks set to be the major beneficiary of the coalition agreement. The agreement declares a commitment to a more proactive policy course together with France and promises more money for Europe overall. However, the key sections in the agreement concerning the strengthening of Europe provides relatively large scope for interpretation. This leeway could dash the high hopes of EU partners as soon as specific decisions are pending.\nA consistent future-oriented fiscal policy cannot be deduced from the measures proposed.\nInfrastructure investment is high on the agenda: 18 billion euros are to be pumped into education and digitalisation in the next four years, while another 16 billion euros is earmarked for housing construction, transportation and helping local authorities, for instance with refugee integration.\nThe proposed fiscal and economic policy measures lack consistency. Investments in education and digitalisation are the prerequisites to ensure that Germany is equipped for the future. These, however, are negated by ever stricter regulation of the labour market and housing construction that will then nullify some of the productivity gains.\nTax policy will significantly ease the burden on families and people on low and middle incomes, but singles on higher incomes and corporate Germany cannot expect any tangible relief.",
    "number_of_ratings": 17,
    "rating": 1.0,
    "likes": 19
}