{
    "url": "https://www.db.com/news/detail/20180207-what-is-driving-market-volatility-views-from-deutsche-bank-experts?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 7, 2018",
    "tags": [
        "Capital markets",
        "Investment Banking"
    ],
    "title": "What is driving market volatility? Views from Deutsche Bank experts",
    "body": "The significant volatility in equity markets that began on Friday, February 2 has continued over the past few trading days.\nOn Monday the Dow Jones Industrial Average closed down 4.6 percent with the S&P 500 4.10 percent lower, the worst day since August 2011. The VIX index, a measure of the stock market’s expectation of volatility, saw its biggest daily climb ever, both in percentage terms (+116 percent) and absolute terms (+20.0 to 37.32).\nOn Tuesday US bourses were volatile but later rallied, with the Dow Jones Industrial Average (+2.33 percent) and the Nasdaq (+2.13 percent) both rebounding. Markets in Europe were all lower with both the DAX (-2.32 percent) and FTSE (-2.64 percent) falling.\nWhat can explain this market turbulence and how long will it last? Here is a summary of opinions from across Deutsche Bank.\nStefan Kreuzkamp, Chief Investment Officer for Deutsche Asset Management, maintains that a market correction was overdue and that, in addition to technical factors, a steady rise in inflation may have played a part.\n“Given that until recently, investor sentiment was near record highs, we think that some sort of correction was indeed overdue. Perhaps the latest strong US employment report newly rekindled inflation fears and ensuing concerns that interest rates might rise more swiftly than expected, are some of the causes of the correction.”\nTorsten Slok, Deutsche Bank’s Chief International Economist, also points to recent economic data to explain the volatility. “It is the threat of higher inflation and higher interest rates that is worrying the stock market because higher wages means lower profit margins and higher inflation means faster rate hikes from the Federal Reserve, as the FOMC (Federal Open Market Committee) tries to slow down the economy and ultimately the revenue growth of S&P 500 companies.”\nUlrich Stephan, Chief Investment Officer for Private & Commercial Clients, highlights that the bull market has been running since March 2009 and that valuations had risen significantly in 2017.\nHe cautions: “I assume that we are seeing a correction in the bull market and not an entry into a bear market.” He says that it is difficult to pinpoint how long periods of market weakness will last but looks to previous events. “Historically, corrections of 10 to 15 percent are not uncommon. An average correction takes about four months and a recovery to previous levels also takes about four months.”\nChristian Nolting, Chief Investment Officer for Deutsche Bank Wealth Management, is adhering to his long-term positive view of investment in equities. Nevertheless, investors are advised to keep a close eye on inflationary developments over the remaining course of the year. According to Nolting, it would be make very good sense to secure portfolios against rapidly rising inflation.\nNolting's in-depth analysis for clients of Deutsche Bank Wealth Management:\n“After the S&P 500 recorded its best start to the year since 1997, over the last few days we have seen volatility on the international stock markets returning to its highest level since August 2015. This meant the Dow Jones Industrial Average Index and the S&P 500 experienced corrections from their recent highs of January 26th of around 10 percent respectively.\nUnder the heading of the first of our ten theories “Forewarned is forearmed” in our outlook for 2018, we advised that the likelihood of a correction at an advanced stage of the cycle had become more probable.\nOnce again, we underline our long-term positive stance regarding equities. The reasons for this rest on the basic economic environment in the US and around the world, exceptionally good earnings growth, accounting policy adjustments, as well as the improbability of beginners’ mistakes being committed in US monetary policy, because, even if the new Fed chairman Powell is new to office, he is not likely to raise key interest rates too much, thereby impacting financing conditions, which on a 12-month horizon, could lead to a recession.\nNevertheless, investors are advised to keep a close eye on inflationary developments over the remaining course of the year. It would be make very good sense to secure portfolios against rapidly rising inflation.\nEven if a rate hike could have been anticipated in the wake of solid economic growth, investors are anxious about the speed of the interest rate hikes, the technical hurdles they have already surmounted and the multi-year highs they have already scaled. Investors are also discouraged by the prospect of further US interest rate increases in 2018. However, we do not believe interest rates will pose a major threat unless yields on 10-year US Treasuries exceed 3.25 percent – nor do we expect the Fed to carry its interest rate increases too far.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}