{
    "url": "https://www.db.com/news/detail/20200130-deutsche-bank-reports-continued-progress-on-strategic-transformation?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "January 30, 2020",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank reports continued progress on strategic transformation",
    "body": "Christian Sewing, Chief Executive Officer, said: “Our new strategy is gaining traction. Stabilising revenues in the second half of 2019 and our consistent cost discipline both contributed to better operating performance than in 2018. Our client business is developing well, right across the bank. With our strong capital position and a Common Equity Tier 1 capital ratio of 13.6%, we’re very confident we can finance our transformation with our own resources and return to growth. \"\n2019 net loss entirely driven by transformation-related effects\nPre-tax loss of 2.6 billion euros includes 3.0 billion euros in transformation charges1, goodwill impairments and restructuring and severance expenses\nNet loss of 5.3 billion euros additionally includes transformation-related deferred tax asset valuation adjustments of 2.8 billion euros which do not significantly impact capital\n70% of anticipated cumulative transformation-related effects2 already recognised\nCommon Equity Tier 1 ratio of 13.6%, up from 13.4% in the third quarter of 2019, after ahead-of-target risk weighted asset reduction by the Capital Release Unit\nCore Bank (ongoing core businesses): stabilising and gaining momentum in 2019\nRevenues down 2% on a reported basis, stable excluding specific revenue items3\nReported pre-tax profit of 543 million euros; adjusted pre-tax profit4 of 2.8 billion euros, excluding specific revenue items, transformation charges, goodwill impairments and restructuring and severance expenses, up 7% vs. 2018\nFourth-quarter results underline further progress on transformation\nPre-tax loss of 1.3 billion euros includes 1.1 billion euros in transformation charges and restructuring and severance expenses.\n8th successive year-on-year reduction in quarterly adjusted costs excluding transformation charges and bank levies\nCore Bank: loss before tax of 437 million euros; profit of 465 million euros excluding specific revenue items, transformation charges as well as restructuring and severance expenses\nCapital Release Unit: risk weighted asset reduction from 56 billion euros to 46 billion euros during quarter, better than target by 6 billion euros; pre-tax loss of 856 million euros, in line with expectations\nCost reductions on track\nNoninterest expenses of 25.1 billion euros in 2019 including transformation charges of 1.1 billion euros, goodwill impairments of 1.0 billion euros as well as restructuring and severance expenses of 805 million euros\nFull-year adjusted costs5 in line with target, at 21.5 billion euros excluding transformation charges and fourth-quarter expenses associated with the bank’s Prime Finance platform being transferred to BNP Paribas6\nGroup headcount reduced to 87,597 full-time equivalents, in line with target, down by over 4,100 in 2019\nResults reflect transformation effects and growth in Core Bank adjusted profit\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today announced delivery on all major elements of its transformation strategy planned for 2019. Results were in line with, or ahead of, all 2019 financial targets.\nDeutsche Bank’s full-year net loss of 5.3 billion euros was entirely driven by transformation-related effects. As a result of progress on its transformation strategy announced on July 7th, 2019, Deutsche Bank reported a pre-tax loss of 2.6 billion euros in 2019 after absorbing transformation charges of 1.1 billion euros, goodwill impairments of 1.0 billion euros and restructuring and severance expenses of 805 million euros.\nThe bank’s full-year net loss additionally included transformation-related deferred tax asset valuation adjustments of 2.8 billion euros. All these transformation-related effects were broadly in line with projections. As at the end of 2019, Deutsche Bank had recognised 70% of the anticipated cumulative costs to achieve its transformation strategy between 2019 and 2022.\nIn the fourth quarter of 2019, Deutsche Bank reported a pre-tax loss of 1.3 billion euros, including transformation charges of 608 million euros as well as restructuring and severance expenses of 473 million euros. A net loss of 1.5 billion euros reflects the aforementioned effects and transformation-related deferred tax asset valuation adjustments of approximately 400 million euros.\nCore Bank: stabilising and building momentum\nThe Core Bank, which excludes the Capital Release Unit, reported a pre-tax profit of 543 million euros in 2019. Adjusting for transformation charges of 635 million euros, goodwill impairments of 1.0 billion euros, restructuring and severance expenses of 649 million euros and specific revenue items of 108 million euros, pre-tax profit in the Core Bank would have been 2.8 billion euros, up 7% versus 2018 similarly adjusted.\nCore Bank revenues were 23.0 billion euros, down 2% year-on-year. Excluding specific revenue items, revenues were stable despite a more challenging interest rate environment and uncertainties in the global economic outlook which intensified during 2019.\nIn the fourth quarter the Core Bank reported a pre-tax loss of 437 million euros. Adjusting for transformation charges, restructuring and severance expenses and specific revenue items, pre-tax profit would have been 465 million euros, up from a profit before tax of 78 million euros in the prior year quarter. Fourth-quarter revenues were 5.5 billion euros, up 5% year-on-year, or 8% adjusted for specific revenue items.\nCapital Release Unit: costs in line with expectations, deleveraging ahead of target\nThe Capital Release Unit reported a pre-tax loss of 856 million euros in the fourth quarter and a full-year pre-tax loss of 3.2 billion euros, in line with expectations. This reflects both residual expenses and the non-recurrence of revenues associated with discontinued business activities. In addition, revenues in the third and fourth quarters were impacted by hedging and de-risking costs relating to reductions in leverage exposures and risk weighted assets which were better than plan as at year-end 2019.\nDelivering on targets: capital strength\nThe Common Equity Tier 1 (CET1) capital ratio improved to 13.6% during the fourth quarter, comfortably meeting recent guidance of above 13% for year-end 2019.\nDeutsche Bank reduced risk weighted assets (RWAs) by 18 billion euros on an FX-neutral basis to 324 billion euros during the quarter. This contributed a positive impact of 73 basis points on Deutsche Bank’s CET1 ratio, which more than offset the negative impact on this ratio arising from reduced capital of 47 basis points, principally relating to the bank’s fourth-quarter net loss.\nThe Capital Release Unit reduced RWAs by 10 billion euros to 46 billion euros during the fourth quarter, down from 72 billion euros at the end of 2018, a reduction of 36%. This was 6 billion euros better than the Unit’s year-end target for RWAs of 52 billion euros.\nDeutsche Bank reaffirmed its confidence in meeting its target of a CET1 ratio above 12.5% at all times during execution of the transformation strategy through 2022. The bank reaffirms its confidence in its ability to finance its transformation through existing capital resources.\nLeverage reduction ahead of target\nDeutsche Bank reduced leverage exposure by 123 billion euros during the quarter to 1,168 billion euros at year-end. This was driven primarily by progress in the Capital Release Unit, which reduced leverage exposure by 50 billion euros to 127 billion euros, versus a target of approximately 140 billion euros. Further reductions arose from a reduction in cash balances, seasonal reductions in the Investment Bank and currency movements, partly offset by loan growth.\nAs a result, Deutsche Bank’s leverage ratio improved to 4.3% on a phase-in basis and 4.2% on a fully loaded basis during the quarter, ahead of its 4% year-end 2019 target. The bank reaffirmed its goal of increasing its leverage ratio to 4.5% by the end of 2020 and to around 5% by 2022.\nDelivering on targets: cost reduction\nNoninterest expenses were 25.1 billion euros in 2019, up 7%. Adjusted costs were 21.5 billion euros, down 6% and in line with target, excluding transformation charges and expenses of 102 million euros incurred in the fourth quarter of 2019 associated with the Prime Finance platform being transferred to BNP Paribas and which are consistent with those eligible for reimbursement under the terms of the transfer agreement.\nReimbursement is effective from December 1st, 2019, and as a result approximately one third of the aforementioned fourth-quarter cost has been recorded as reimbursable in revenues for the month of December. In the fourth quarter, noninterest expenses were 6.4 billion euros, while adjusted costs were 5.1 billion euros, down from 5.4 billion euros in the prior year quarter, excluding transformation charges. This represents the eighth consecutive year-on-year reduction in these costs excluding bank levies.\nCost reductions were achieved across all major categories except IT expenses, which remained essentially stable during 2019, reflecting Deutsche Bank’s commitment to continue spending on technology and controls in line with its transformation strategy.\nCompensation and benefits expenses were down in both the full year and fourth quarter, partly reflecting workforce reductions of over 4,100 full-time equivalents during 2019. Headcount at year-end was 87,597 full-time equivalents, in line with the bank’s previously announced target of below 90,000.\nProfessional service fees were also reduced in both the fourth quarter and full year, reflecting disciplined management of non-compensation costs.\nTransformation effects reflect rapid execution of strategy\nDeutsche Bank continued to recognise transformation effects as planned. In 2019, the bank incurred 70% of the total anticipated costs to achieve transformation between launch in July 2019 and 2022. These anticipated costs have risen by approximately 400 million euros versus prior expectations, mainly with respect to the impairment and amortisation of software which has no impact on capital.\nTransformation-related effects included transformation charges of approximately 1.1 billion euros, primarily impairments and amortisation of software intangibles and real-estate charges, as well as impairments on goodwill and intangible assets of around 1.0 billion euros, transformation-related restructuring and severance charges of approximately 700 million euros, and deferred tax asset valuation adjustments of 2.8 billion euros.\nTransformation charges are costs, included in adjusted costs, which are directly related to Deutsche Bank’s transformation as a result of the new strategy announced on July 7, 2019. Such charges include the transformation-related impairment of software and real estate, legal fees related to asset disposals as well as the quarterly amortisation on software related to the Equities Sales and Trading business and onerous contract provisions. Transformation charges for the Group and each segment can be found on pages 15-22 of the fourth quarter/full year 2019 Financial Data Supplement published on the Deutsche Bank website www.db.com/quarterly-results.\n\nTransformation-related effects are financial impacts resulting from the new strategy announced on July 7, 2019. These include transformation charges, goodwill impairments in the second quarter 2019, as well as restructuring and severance expenses from the third quarter 2019 onwards.\n\nIn addition to the aforementioned pre-tax items, transformation-related effects on a post-tax basis include pro-forma tax effects on the aforementioned items and deferred tax asset valuation adjustments in connection with the transformation of the Group. Transformation-related effects for the Group and each segment can be found on pages 15-22 of the fourth quarter/full year 2019 Financial Data Supplement published on the Deutsche Bank website, as above\n\nSpecific revenue items generally fall outside the usual nature or scope of the business and are likely to distort an accurate assessment of the divisional operating performance. Specific revenue items for the Group and each segment and a reconciliation between reported revenues and revenues excluding specific items can be found on pages 15-22 of the fourth quarter/full year 2019 Financial Data Supplement published on the Deutsche Bank website, as above.\n\nAdjusted profit (loss) before tax is calculated by adjusting the profit (loss) before tax under IFRS for specific revenue items, transformation charges, impairments of goodwill and other intangibles, as well as restructuring and severance expenses. A reconciliation between reported and adjusted profit before tax for the Group and each segment can be found on pages 15-22 of the fourth quarter/full year 2019 Financial Data Supplement published on the Deutsche Bank website, as above.\n\nAdjusted costs are calculated by deducting (i) impairment of goodwill and other intangible assets, (ii) litigation charges, net and (iii) restructuring and severance from noninterest expenses under IFRS. A reconciliation between noninterest expenses, adjusted costs and adjusted costs excluding transformation charges for the Group and each segment can be found on pages 3-11 of the fourth quarter/full year 2019 Financial Data Supplement published on the Deutsche Bank website, as above.\n\nAdditional description of this item can be found on page 4 of this release.\nBusiness segment performance\nCorporate Bank\nFourth-quarter net revenues were 1.3 billion euros, down 5%, both on a reported basis and adjusted for specific revenue items.\nGlobal Transaction Banking revenues were 942 million euros, down 6%, mainly driven by lower levels of smaller episodic items in the current quarter including lower credit recoveries and the non-recurrence of a gain on an investment. Cash Management revenues were impacted by lower interest rates, partly offset by a shift in deposit mix and deposit tiering and pricing measures introduced partway through the quarter. Trade Finance revenues declined slightly due to a slowdown in structured products and lower insurance recoveries while Securities Services revenues were impacted by the bank’s exit from Equities trading activities.\nCommercial Banking revenues were 350 million euros, down 2% year-on-year, as the impact from negative interest rates was partly offset by loan growth.\nFull-year net revenues were 5.3 billion euros, essentially flat year-on-year. Growth in Cash Management, Trade Finance and Trust & Agency Services was offset by lower Securities Services revenues, mainly driven by the non-recurrence of a prior year gain on sale and the impact of the exit from Equities trading activities. Commercial Banking revenues were up 4%, driven by both loan growth and higher fee income.\nNoninterest expenses were 1.3 billion euros in the fourth quarter, up 38%, including 154 million euros of transformation charges and 123 million euros in costs for severance and restructuring. Adjusted costs excluding transformation charges rose 12%, driven by higher spending on technology and internal controls and higher internal service cost allocations. Full-year noninterest expenses were 4.8 billion euros, up 26%, driven by transformation charges of 160 million euros, costs for severance and restructuring of 150 million euros and goodwill impairments of 492 million euros.\nProvision for credit losses for the full year 2019 increased to 286 million euros, or 24 basis points of loans, driven by a small number of specific names.\nProfit before tax: the Corporate Bank reported a loss before tax of 107 million euros in the quarter. Adjusted for transformation charges and restructuring and severance, profit before tax was 170 million euros. Full-year profit before tax was 137 million euros. Adjusted for the aforementioned items, goodwill impairments and specific revenue items, pre-tax profit was 939 million euros, versus 1.3 billion euros in 2018.\nInvestment Bank\nFourth-quarter net revenues were 1.5 billion euros, up 13%. Excluding specific revenue items, revenues were up 22%.\nFixed Income & Currency (FIC) Sales & Trading revenues were 1.2 billion euros, up 31%, and up 34% excluding specific revenue items. Credit Trading saw strong growth driven by flow and distressed businesses, while Foreign Exchange revenues were essentially flat. Rates and Emerging Markets Debt delivered strong year-on-year growth; a near-doubling of revenues in Rates, both quarter-on-quarter and year-on-year, reflected an improved trading environment and higher client flows. Origination & Advisory revenues were 340 million euros, down 12%. Growth of 27% in Debt Origination revenues was more than offset by significantly lower Advisory revenues after a strong third quarter.\nFull-year net revenues were 7.0 billion euros, down 7% year-on-year and down 3% adjusted for specific revenue items. FIC Sales & Trading was essentially flat, as was Debt Origination, while revenues were lower in both Advisory and Equity Origination.\nNoninterest expenses rose by 5% to 1.6 billion euros in the quarter. Adjusted costs, excluding transformation charges of 137 million euros, were down 7% versus the prior year quarter and 6% in the full year. This reduction was driven by a reduction in front-office workforce and related compensation expenses, lower service cost allocations and disciplined management of non-compensation costs. Full-year noninterest expenses were down 2% to 6.4 billion euros, despite transformation charges of 214 million euros.\nProvision for credit losses was 20 basis points in the fourth quarter, and for the full year remained low at 14 basis points of loans.\nProfit before tax: the Investment Bank reported a loss before tax of 71 million euros in the quarter. Adjusted for transformation charges, restructuring and severance as well as specific revenue items, profit before tax in the fourth quarter was 136 million euros. Full-year profit before tax was 433 million euros, while adjusted for aforementioned items, full-year profit before tax was 863 million euros.\nPrivate Bank\nFourth-quarter net revenues were 2.0 billion euros, down 4%, or down 2% if adjusted for specific revenue items.\nRevenues in the Private Bank Germany declined 7%, reflecting interest rate-driven compression of deposit margins, funding cost allocations and lower gains from asset sales. This was partly offset by the 7th consecutive quarter of loan growth, with 2 billion euros in net new client loans, mainly mortgages. Private and Commercial Business International revenues were up 3% as strong growth in loan products and investment products, combined with repricing measures, offset margin compression.\nWealth Management revenues were down 3%, due to a 14 million-euro decline in revenues relating to Sal. Oppenheim legacy workout activity and the non-recurrence of a 40 million-euro gain on a property sale in Sal. Oppenheim in the prior year quarter. Adjusting for these items, revenues were up 11%, reflecting improved market conditions and targeted hiring.\nFull-year net revenues were 8.2 billion euros, down 5%. Excluding specific revenue items, revenues were down 2%, as loan growth and an increase in fee income, together with repricing measures, materially offset interest rate headwinds.\nProvision for credit losses remained stable at 15 basis points of loans in 2019.\nFourth-quarter noninterest expenses were 2.2 billion euros, up 10%. Adjusted costs excluding transformation charges were 1.8 billion euros, down 5%, reflecting benefits from reorganisation measures and strict cost discipline. Full-year noninterest expenses were 8.2 billion euros, up 8%, reflecting the second-quarter goodwill impairment of 545 million euros, severance and restructuring costs of 158 million euros and transformation charges of 191 million euros. However, adjusted costs excluding transformation charges were down 4%, primarily reflecting approximately 200 million euros of merger-related cost synergies in the Private Bank Germany.\nProfit before tax: the Private Bank reported a loss of 283 million euros in the fourth quarter. Adjusted for transformation charges, restructuring and severance and specific revenue items, profit before tax in the fourth quarter was 45 million euros. In the full year, the business reported a loss before tax of 265 million euros. Adjusted for aforementioned items and goodwill impairments, full-year profit before tax was 524 million euros.\nAsset Management\nFourth-quarter net revenues were 671 million euros, up 31%, while full-year net revenues were 2.3 billion euros, up 7%, driven by a significant rise in performance fees in the key areas of Multi-Asset and Alternatives. Management fees were slightly higher in the quarter and essentially flat for the full year, as four consecutive quarters of net asset inflows helped offset the impact of margin compression.\nNoninterest expenses were 438 million euros in the fourth quarter, up 3%. Adjusted costs, excluding transformation charges of 21 million euros, were up 9% to 419 million euros, reflecting higher compensation and benefits and the non-recurrence of a positive adjustment in service provider allocations for the year 2018. Full-year costs were essentially flat as higher compensation expenses were offset by savings in professional service fees and marketing expenses.\nProfit before tax was 177 million euros in the fourth quarter and tripled year-on-year. Adjusted for transformation charges as well as restructuring and severance expenses, profit before tax in the fourth quarter was 202 million euros. Full-year profit before tax was 468 million euros, up 27%, or 539 million euros if adjusted for the aforementioned effects.\nFourth-quarter net inflows were 12 billion euros, the fourth consecutive quarter of net inflows. For the year 2019, net inflows were 25 billion euros, compared to net outflows of 23 billion euros in 2018, with positive flows across the key product areas of Multi-Asset, Alternatives and Passive. Asset Management achieved a positive net flow rate of 4%, in line with its 3-5% target.\nAssets under management grew by 103 billion euros, or 16%, to 768 billion euros during 2019, driven both by market performance and net inflows. Flagship products delivered substantial outperformance, while the number of 4- and 5-star Morningstar rated funds increased further in 2019.\nCorporate & Other\nCorporate & Other reported a fourth-quarter pre-tax loss of 154 million euros, compared to a loss before tax of 109 million euros in the fourth quarter of 2018, and a full-year loss before tax of 229 million euros versus a loss before tax of 433 million euros in 2018. The negative quarterly development was largely driven by higher funding and liquidity charges reflecting certain funding costs held centrally, reflecting the bank’s funds transfer pricing framework. A higher positive contribution from valuation and timing differences offset higher litigation expenses.\nThe reduction in full-year loss before tax was mainly driven by higher income from valuation and timing differences, partly offset by higher litigation expense and higher funding and liquidity charges.\nCapital Release Unit\nLeverage exposure was 127 billion euros at quarter-end, 13 billion euros ahead of the 2019 target, primarily due to reductions across Equities portfolios. This represents a full-year reduction of 55% versus 281 billion euros at the end of 2018.\nRisk weighted assets (RWAs) were 46 billion euros, 6 billion euros below the year-end target of 52 billion euros, and compared to 56 billion euros at the end of the previous quarter and down by 36% versus 72 billion euros at the end of 2018.\nNet revenues were negative 179 million euros in the fourth quarter, broadly in line with expectations, driven by negative mark-to-market impacts, hedging and de-risking costs. Full year revenues were 208 million euros, down 89%, reflecting the non-recurrence of revenues associated with discontinued business activities and the aforementioned effects.\nNoninterest expenses were 691 million euros in the quarter, down 10% versus the third quarter of 2019. Adjusted costs excluding transformation charges decreased by 11% to 497 million euros, principally reflecting reductions in headcount from the initial impact of business exits. Full-year noninterest expenses were 3.4 billion euros, essentially flat versus 2018.\nLoss before income taxes was 856 million euros in the quarter, and 3.2 billion euros in the full year after transformation charges of 510 million euros and severance and restructuring costs of 157 million euros. Both fourth-quarter and full-year results were ahead of management expectations.\nThe figures in this release are preliminary and unaudited. The Annual Report 2019 and Form 20-F are scheduled to be published on March 20th, 2020.\nToday a media conference will be held at 10:00 CET. This event can be followed by webcast. Further details can be found on the Deutsche Bank website: https://www.db.com/newsroom\nAn analyst call to discuss fourth-quarter 2019 financial results will take place at 13:00 CET today. A Financial Data Supplement (FDS), presentation and audio-webcast for the analyst conference call are available at:\nwww.db.com/quarterly-results\nA fixed income investor call will take place on Monday, February 3rd, 2020, at 15:00 CET. This conference call will be transmitted via internet: www.db.com/quarterly-results",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}