{
    "url": "https://www.db.com/news/detail/20200124-international-education-day-investing-in-future-generations?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 24, 2020",
    "tags": [
        "Corporate Citizenship",
        "Education"
    ],
    "title": "Investing in future generations",
    "body": "Today, 24 January, International Education Day celebrates education and learning as humanity’s greatest renewable resource. Education is a fundamental human right central to achieving the United Nations’ 2030 Sustainable Development goals.\nThe UN Secretary General, António Guterres states: “We must do far more to advance Sustainable Development Goal 4, to ensure inclusive and equitable quality education and promote lifelong learning opportunities for all.”\nGlobally, around 265 million youth do not enter or complete school, keeping them trapped in the cycle of poverty and unable to meet their full potential. In South Africa it is estimated that approximately 45 percent of youth do not complete secondary education, with many children living below the poverty line.\nDeutsche Bank, as part of its commitment to ensure inclusive and equitable quality education opportunities under its global Born to Be Programme, continues to work towards ensuring that children in 29 countries get the right start.\nOne particularly successful example is South Africa, where the bank’s investment in early childhood education initiatives focuses on boosting the numbers of, and developing, qualified pre-school teachers in poorer communities. These teachers play a central role in the growth and wellbeing of young children during their critical physical and mental development phase, maximising their innate potential.\nThis year and in recognition of International Education Day, Deutsche Bank South Africa is celebrating the 205 pre-school teachers participating in accredited Early Childhood Development programmes through four of its long-term project partners.\nIndirectly over 15,000 children will benefit through the professional development of these practitioners where these children will receive quality care and learning they need to support their physical, emotional and cognitive advancement.\nGracious Ngomani, a teacher on the 2019 Brainwave Careers programme said: “It’s so important to watch or be conscious of the manner in which you teach at a pre-school, as it has an impact on the child's learning for his or her entire life span.”\nOne of Deutsche Bank’s strategic CSR pillars, Born to Be is made up of over 180 education-led projects, all of which demonstrate the bank’s commitment to addressing the social issues around young people’s potential and unemployment across the globe.\nLareena Hilton, Global Head of Brand Communications and Corporate Social Responsibility, said: “We are incredibly proud that since 2014, Born to Be has provided more than 4.5 million young people with education opportunities. Now active in 29 countries, our Born to Be programme continues to have a positive impact in every region. We look forward to seeing this grow further and we are close to reaching our target of helping change the lives of 5 million young people by 2020.”\nFind out more about Born to Be’s global impact, read other personal life-changing stories and watch our film at www.db.com/lifechanger\nThe 205 pre-school teachers participating in accredited Early Childhood Development programmes are doing so through four of Deutsche Bank’s long-term project partners:\nBrainwave Careers: Earlier this week (21 January), Deutsche Bank welcomed the 2020 intake of Tembisa township pre-school teachers starting their formal accredited NQF4 and 5 programme;\nSparrow Schools began 2020 with the first cohort of 18 unemployed youth working towards obtaining early childhood education qualifications through the Deutsche Bank sponsorship. Sparrows Schools also opened its new George Marsh Training Centre Training Centre on International; Education Day.\nNtataise: 40 years as a leader in early childhood education, Ntataise, which means to lead a young child by the hand, helps Deutsche Bank to improve the lives of children through its training, mentoring and capacity building in the development of pre-school teachers with a new group starting this month.\nKhululeka: Khululeka facilitates the provision of high quality education and care of young children and this year, in partnership with Deutsche Bank, it will provide accredited training to pre-school teachers. Most of these participants are unqualified pre-school teachers working in under-resourced schools and nurseries.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 2
}