{
    "url": "https://www.db.com/news/detail/20200123-christian-sewing-in-davos-europe-needs-a-new-narrative-to-drive-growth?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 23, 2020",
    "tags": [
        "Europe"
    ],
    "title": "Christian Sewing in Davos: Europe needs a new narrative to drive growth",
    "body": "Europe’s strategy for returning to economic growth must include a “new narrative” explaining its broader purpose, Christian Sewing said at the World Economic Forum in Davos this morning. Speaking on a panel titled \"After Brexit: Renewing Europe's Growth\", the CEO said measures such as supportive monetary and fiscal policies, deregulation and promoting innovation remain essential.\nBut to catch up with the US and Asia, they must be accompanied by “a new narrative for Europe”. “People still see Europe as the project which brought peace. That was a fantastic achievement. But we need to explain to our people what Europe stands for now,” Sewing said.\nThis means framing initiatives such as deregulation and the European Green Deal around this wider narrative, to explain what it means for Europeans and the bloc’s potential. “If we do this, then I think there are great chances for this region.”\nThe importance of the European Union’s updated social mission also influences Sewing’s views on monetary policy.\nWhile banks can to some extent restructure to offset negative rates, he explained, the vast majority of EU citizens are losing out, creating a political issue.\nTurning to Brexit, Frank Appel, CEO of Deutsche Post DHL Group, summed up the panellists’ views that it remains “a bad idea that will hurt the UK and Europe.” However, it was also highlighted that the certainty which has emerged following December’s UK General Election was good for all sides.\n“I don’t like the result but it is certain,” said Paolo Gentiloni, Commissioner for Economy, European Commission, adding that: “11 months is a very short time to negotiate a trade deal but we will do everything in our power to create the best possible relationship with the UK.”\nThis point was echoed by Sewing who said the EU must do everything it can to minimise uncertainty and focus on creating “a platform for growth”.\nThe discussion also included Roberto Gualtieri, Minister of Economy and Finance of Italy; and was moderated by CNBC anchor Sara Eisen.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}