{
    "url": "https://www.db.com/news/detail/20200113-us-outlook-a-less-than-roaring-start-to-the-20s?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 13, 2020",
    "tags": [
        "Research"
    ],
    "title": "US Outlook: A less than roaring start to the '20s",
    "body": "Deutsche Bank’s US economists expect modest growth of about 2 percent in the US in 2020, driven by a resilient labor market and solid consumer spending.\nIn a research note to clients entitled US Outlook: A less than roaring start to the '20s and a renaissance in Fed policy, Chief US Economist Matthew Luzzetti and team see a resilient economy with an improved balance of risks entering 2020 after weathering several crosscurrents, including sputtering global growth and elevated trade policy uncertainty, in 2019. Supporting this view, global growth momentum has shown tentative signs of bottoming, more adverse outcomes from trade talks and Brexit have been avoided, and US leading indicators have stabilized.\nThe team believes upside risks to growth this year should remain capped and expect capex momentum to be constrained by a transition from trade policy uncertainty to election doubts. “Improved growth prospects for 2020 rest importantly on our assumptions that a trade escalation is avoided with China and auto tariffs are permanently put aside. Escalation on these fronts, along with some generic election year uncertainty, would put the fragile improvement in consumer and business sentiment in doubt and risk pushing the economy into a mild recession.”\nBeyond 2020, Deutsche Bank’s growth outlook picks up by a modest 0.1 percentage points per year due in part to further monetary policy accommodation.\nIn terms of the Federal Reserve, the team expects the pivot point for policy in the coming years to be how the Committee responds to persistent inflation weakness, something Chair Jerome Powell has deemed \"one of the major challenges of our time.”\nDeutsche Bank does not see these inflation concerns pushing the Fed to cut rates in 2020 but rather expects its initial response will likely pursue an \"opportunistic reflation\" by guiding markets towards unchanged rates for longer. But with this passive approach most likely failing to stoke inflation pressures, a desire to avoid the disinflationary fates of other major developed market economies will likely push the Committee to cut rates in 2021.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}