{
    "url": "https://www.db.com/news/detail/20200113-davos-2020-we-need-to-talk-about-sustainable-growth?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 13, 2020",
    "tags": [
        "Corporate Citizenship",
        "Research",
        "Sustainability"
    ],
    "title": "Davos 2020: we need to talk about (sustainable) growth ...",
    "body": "Ahead of the World Economic Forum’s meeting in Davos, a new report from Deutsche Bank Research summarises topics the team expects to address in conversations with leaders of global organisations, politicians, entrepreneurs, investors, and other experts on the subject of growth and the increasing awareness of its side effects.\n“The purpose of this exercise is not to promote any specific course of political action. Rather, it is to ensure that when policymakers have these discussions, they do so fully aware of the economic consequences and can plan accordingly,” says Jim Reid, Global Head of Thematic Research & Credit Research.\nThe new report is organised into four sections. First, it explains several different ways in which growth has given humanity great benefits. For centuries prior to the first Industrial Revolution in the late-1700s, there was little observable economic growth, and standards of living and health were stagnant. The economic growth that was then kick-started by the first Industrial Revolution provided the necessary conditions for the improvements in sanitation and medicine in the second Industrial Revolution a century later, a game changer for health and living standards.\nSecond, it examines the negative side effects of growth – particularly debt, inequality, and climate change. Debt has exploded and inequality has increased. The most pressing side effect has been the damage to the environment. 21 of the planet's hottest years on record have been seen over the last 23 years. Many scientists believe that we’ve passed a tipping point in terms of permanent environmental damage. The report also highlights that it seems that a tipping point has recently been reached in the public awareness of the impact humans are having on the environment.\nThird, it examines the trade-offs involved in taking aggressive action to address climate change. Reid and his team believe that we will soon enter a stage where there will be a realisation of the immense economic and personal trade-offs we will collectively have to make in order to hit climate targets. The sacrifices may shock citizens and be difficult to administer in democracies.\nFinally, it looks at how progress towards more sustainable growth is being made and how it might continue in the years ahead. “One avenue for growth is to take advantage of new technologies”, Reid says, who continues by saying that “indeed, there is reason to hope that if the world is on the cusp of a fourth Industrial Revolution – one of artificial intelligence – then technological advancements could reach a point over the coming decade where they begin to be implemented at a rapid pace.\nThis could also help reverse the hard-to-explain dip in productivity growth over the last few decades.\nPDF\nRead the full report.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}