{
    "url": "https://www.db.com/news/detail/20200106-brexit-should-be-a-wake-up-call?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 6, 2020",
    "tags": [
        "Corporate products",
        "Private products",
        "Research"
    ],
    "title": "“Brexit should be a wake-up call”",
    "body": "As of January 31, 2020 the European Union will primarily be a continental European union. As someone who grew up with the dream that some day I would be a citizen of a proper European Union, the departure of the UK from the EU has been the most disheartening political event of my adult life. The British Anglo-Saxon political, economic, and cultural values provided a pragmatic counterweight to French statism and German ordoliberalism. Now the European Union will be dominated by French statecraft and German economic might.\nThe general election in the UK was, if nothing else, a second Brexit referendum. Large parts of the British population – outside of London at least – having, in spirit, already bidden their farewell to the EU. Brexit is the result of an avoidable failure of European policy. A less dogmatic approach to immigration rules and more effort to woo the British very likely would have given former Prime Minister David Cameron what he needed to swing the referendum.\nNow the shoe is on the other foot. Boris Johnson attained a historic majority to take quick and far-reaching economic and political decisions. The new government can implement fiscal and exchange rate policies to put Britain on a better competitive footing. The UK benefits from London being the only truly global city in Europe, as well as having some of the world’s most outstanding universities at the heart of an innovative British ecosystem.\nOne can only hope that Brexit is a wake-up call\nThe government also has enough tools to deal with a brief corrective recession should the UK fail to reach a trade agreement with the EU this year. Indeed, such a shock may even well force a faster adjustment of the economy away from traditional manufacturing. It is quite feasible that Britain will become a strong economic competitor. Closer ties to the US and other Anglo-Saxon countries are just one of many building blocks in achieving that goal.\nBy contrast, the EU has not so far taken the existential steps towards integration. It is more divided on key issues such as immigration and fiscal policy, as well as on industrial policy and competition policy. Neither the banking union nor the capital market union have been completed. And there is no common military platform – something that could at least partially reduce the EU’s dependence on the mercurial US president.\nThe yellow vests political protest in France shows no sign of abating. New elections in Italy might soon see it with a far-right government. Nationalism is growing in Eastern Europe. And there’s the ECB holding onto a negative rates policy that is undermining savers’ trust and is corroding financial stability, growth and, in turn, support for Europe. One can only hope that Brexit is a wake-up call.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}