{
    "url": "https://www.db.com/news/detail/20211027-deutsche-bank-reports-profit-before-tax-of-EUR-554-million-in-the-third-quarter-of-2021?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 27, 2021",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank reports profit before tax of € 554 million in the third quarter of 2021",
    "body": "Profit before tax rises 15% year on year despite significant rise in transformation charges¹\nAdjusted profit before tax¹ rises 39% to € 1.2 billion\nTransformation charges¹ of € 583 million versus € 104 million in prior year quarter\nCore Bank profit before tax of € 898 million, in line with prior year quarter\nCapital Release Unit improves result: loss before taxes down 19% to € 344 million\nGroup net income rises 6% to € 329 million\nNet revenues rise 2% to € 6.0 billion as business growth offsets normalising markets\nLoan growth of € 11 billion in the quarter\nPrivate Bank: business growth of € 9 billion lifts year to date total to € 38 billion\nAsset Management: net inflows of € 12 billion drive assets under management to a record € 880 billion\nAdjusted costs reduced while transformation charges impact noninterest expenses\nNoninterest expenses rise 4% year on year to € 5.4 billion\nAdjusted costs ex-transformation charges¹ down 3% year on year to € 4.7 billion\n90% of total expected transformation-related effects¹ now recognised\nCapital, risk and balance sheet discipline maintained\nCommon Equity Tier 1 (CET1) capital ratio of 13.0%, in line with guidance\nProvision for credit losses down 57% year on year to € 117 million\nCapital Release Unit further reduces RWAs to € 30 billion, ahead of end-2022 target\nFull-year 2021 sustainability targets exceeded after nine months\nThird quarter ESG financing and investment volumes of € 27 billion\nCumulative volumes since beginning of 2020 rise to € 125 billion, above year-end 2021 target of € 100 billion\nFirst nine months of 2021: significant year on year profit growth\nNet income of € 2.2 billion, up more than fivefold\nGroup profit before tax rises nearly fourfold to € 3.3 billion, reflecting:\n5% growth in net revenues to € 19.5 billion\n4% reduction in adjusted costs ex-transformation charges1 to € 14.6 billion\n83% reduction in provision for credit losses to € 261 million\nCore Bank profit before tax up 64% to € 4.3 billion\nPost-tax RoTE¹ rises from 4.3% to 7.5% with cost/income ratio of 76%\n  ¹ For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ on pp 17-25 of the third quarter 2021 Financial Data Supplement\nIn the third quarter, we again demonstrated the operating strength of our business: our revenues have proven to be resilient, we have increased our pre-tax profit despite additional transformation charges, and we have already exceeded our full year 2021 sustainability target. We are focused on driving efficiencies while maintaining strong controls, and we are confident of achieving Deutsche Bank’s 2022 targets.\nChristian Sewing, Chief Executive Officer\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today reported a 15% year on year rise in pre-tax profit to € 554 million in the third quarter of 2021 after recognising a further € 583 million in transformation charges. Adjusted profit before tax(1), which excludes transformation-related effects and specific revenue items, rose 39% year on year to € 1.2 billion and net income in the quarter rose 6% year on year to € 329 million.\nTransformation charges recognised in the quarter consisted predominantly of technology-related items, including approximately € 450 million relating to a contract settlement and software impairments, principally triggered by the bank’s migration to the cloud.\n90% of the total transformation-related effects anticipated through year-end 2022 are now fully recognised. Deutsche Bank reaffirmed its intention to recognise most of the remaining transformation-related effects by year-end 2021.\nThird quarter profit before tax and adjusted profit before tax1 include an impact of € 98 million, predominantly in foregone revenues, from the ruling in April 2021 by the German Federal Court of Justice (‘BGH ruling’) requiring active customer consent for pricing changes on current accounts. This impact is expected to be considerably lower from the fourth quarter of 2021 onwards, as approximately two-thirds of the accounts affected now have the necessary consent agreements in place. These will become effective in the fourth quarter. \nFor the first nine months of 2021, profit before tax was € 3.3 billion, despite € 798 million in transformation charges and € 324 million relating to the BGH ruling. The year-to-date impact of the BGH ruling comprised € 192 million in foregone revenues and € 131 million in litigation provisions. In the first nine months of 2020, profit before tax was € 846 million after € 283 million in transformation charges. Adjusted profit before tax(1), which excludes transformation-related effects and specific revenue items but includes the impact of the BGH ruling, was €4.3 billion, up from € 1.5 billion in the prior year period.\nNet income was € 2.2 billion in the first nine months, up more than five-fold from € 435 million in the prior year period. Post-tax return on average shareholders’ equity was 4.3%, up from 0.1% in the same period of 2020, while post-tax return on average tangible equity (RoTE)¹ was 4.8%, up from 0.2% in the prior year period. Adjusted post-tax RoTE¹ was 6.6%\nThe four core businesses contributed to growth in nine-month post-tax RoTE as follows:\nCorporate Bank: 7.0%, up from 3.2% year on year;\nInvestment Bank: 13.5%, up from 10.6%;\nPrivate Bank: 2.7%, up from negative 1.8%;\nAsset Management: 28.3%, up from 20.3%.\nGroup cost/income ratio was 82%, down from 87% in the first nine months of 2020.\nCore Bank: profit up 64% in the first nine months of 2021\nIn the Core Bank, which excludes the Capital Release Unit, profit before tax was € 898 million in the third quarter, in line with € 909 million in the third quarter of 2020, despite € 570 million in transformation charges, up from € 66 million in the prior year quarter. Adjusted profit before tax1 was up 23% year on year to € 1.5 billion. Post-tax RoTE¹ was 3.9% in the quarter, while adjusted post-tax RoTE¹ was 7.3%.\nFor the first nine months, Core Bank profit before tax rose 64% year on year to € 4.3 billion and adjusted profit before tax1 was € 5.2 billion, also up 64%. Post-tax RoTE was 7.5%, up from 4.3% in the prior year period, compared to the Core Bank’s 2022 reported post-tax RoTE target of above 9%. Adjusted post-tax RoTE was 9.4%.\nCapital Release Unit: continued bottom line improvement and portfolio reduction\nThe Capital Release Unit reported a loss before tax of € 344 million in the quarter, a loss reduction of 19% versus the third quarter of 2020. This improvement was driven primarily by a 19% reduction in noninterest expenses to € 312 million.\nThe Capital Release Unit maintained progress on portfolio reduction during the third quarter. Leverage exposure was reduced from € 71 billion to € 61 billion, primarily driven by continued portfolio reduction actions and transfers of Prime Finance client relationships. Deutsche Bank aims to meet or exceed its year-end 2022 leverage exposure reduction target of € 51 billion by year-end 2021. RWAs were further reduced to € 30 billion, already ahead of the year-end 2022 target of € 32 billion.\nIn the first nine months, the Capital Release Unit reported a loss before tax of € 1.0 billion, a loss reduction of 43% versus the € 1.8 billion loss in the first nine months of 2020. This improvement was driven largely by a 32% reduction in noninterest expenses to € 1.1 billion, and a 37% year on year reduction in adjusted costs ex-transformation charges to € 901 million, down from € 1.4 billion the first nine months of 2020.\nSince the third quarter of 2020, the Unit has reduced leverage exposure by 32% from € 90 billion to € 61 billion, and RWAs by 23% from € 39 billion to € 30 billion.\nRevenues: resilience in core businesses\nGroup net revenues were € 6.0 billion in the third quarter, up 2% year on year despite continued normalising markets, low interest rates and € 96 million in foregone revenues from the BGH ruling.  Core Bank net revenues were € 6.1 billion, up 2%.\nFor the first nine months, Group net revenues were € 19.5 billion, up 5%, and Core Bank net revenues were also € 19.5 billion, up 4%.\nThird quarter revenue development in Deutsche Bank’s core businesses was as follows:\nCorporate Bank net revenues were € 1.3 billion, stable year on year. Business growth and deposit re-pricing offset interest rate headwinds and a year on year decline of € 59 million in items episodic in nature which comprise portfolio rebalancing actions, recoveries related to credit protection and other one-time effects. Excluding episodic items, revenues were up slightly, and no specific items affected revenues in the period. By quarter end, accounts with deposits of € 94 billion were covered by charging agreements, up from € 88 billion in the second quarter, and contributing € 96 million in quarterly net revenues. Loan growth was € 3 billion in the quarter. Nine-month net revenues were € 3.8 billion, down 3% year on year and essentially flat excluding items episodic in nature and currency translation effects.\nInvestment Bank net revenues were € 2.2 billion, down 6% year on year. Revenues in Fixed Income & Currencies (FIC) were down 12% at € 1.6 billion. Significantly higher revenues in Financing were offset by declines in Credit, Rates and Foreign Exchange revenues as solid levels of client activity were more than offset by normalising market conditions and lower volatility. Emerging Market revenues were higher, driven by performance across regions. Origination & Advisory revenues were up 22% year on year at € 648 million, reflecting growth across Debt Origination, Equity Origination and Advisory. Nine-month net revenues were € 7.7 billion, up 4% year on year. For the first nine months, Deutsche Bank ranked No. 1 in Origination & Advisory in Germany with a share of 8.7% (source: Dealogic). Deutsche Bank was named Best Investment Bank in Western Europe by The Banker magazine in its 2021 Investment Banking Awards.\nPrivate Bank net revenues were € 2.0 billion, down 2% year on year. Revenues were stable excluding specific items and € 94 million in foregone revenues arising from the BGH ruling. Revenues in the Private Bank Germany were down 6%, and up 1% if adjusted for the impact of the BGH ruling, while revenues in the International Private Bank were up 6%, and up 1% excluding specific items. New business volumes were € 9 billion, including € 5 billion in net inflows of investment products and € 3 billion in net new client loans. Nine-month net revenues were € 6.2 billion, up 1% year on year, despite a € 188 million impact from the BGH ruling. Year to date new business volumes were € 38 billion, above the Private Bank’s full-year 2021 target of € 30 billion, including net inflows of investment products of € 22 billion and net new client loans of € 11 billion.\nAsset Management net revenues were € 656 million, up 17% year on year and the highest for seven quarters, driven primarily by a rise in management fees to the highest level for over six years. This was driven by six consecutive quarters of net inflows and market performance in a supportive market environment. Net inflows were € 12 billion, reflecting contributions across all asset pillars, and included € 5 billion in environmental, social and governance (ESG) assets, the highest quarterly ESG inflows of 2021 to date. Net inflows, together with a positive impact from currency movements, drove assets under management up by € 21 billion to a record € 880 billion. Since the third quarter of 2020, assets under management have grown by € 121 billion including net inflows of € 46 billion. For the first nine months, net revenues were up 18% to € 1.9 billion while net inflows were € 33 billion, including ESG net inflows of € 13 billion.\nFurther progress toward completing recognition of transformation charges\nNoninterest expenses rose 4% to € 5.4 billion in the quarter, including € 583 million in transformation charges. These were driven primarily by a contract settlement and software impairments, principally triggered by Deutsche Bank’s migration to the cloud. Both of these are expected to reduce run-rate costs in future quarters. Adjusted costs ex-transformation charges were down 3% to € 4.7 billion in the quarter.\nDeutsche Bank’s workforce was 84,512 full-time equivalents (FTEs) at the end of the quarter, up by 715 versus the second quarter. Selective hiring to support business growth and internalisation of contract staff were largely offset by workforce reduction measures and other departures, while the quarter-on-quarter FTE increase predominantly reflected the annual arrival of new graduate hires during the quarter. Since the end of the prior year period, the workforce has been reduced by just under 2,500 full-time equivalents despite selective hiring, internalisations and graduate hires.\nFor the first nine months, noninterest expenses were € 15.9 billion, down 2% despite a near-threefold year on year increase in transformation charges to € 798 million. Adjusted costs ex-transformation charges were € 14.6 billion, down 4% year on year.\nCredit provisions remain significantly below prior year\nProvision for credit losses was € 117 million in the quarter, down 57% year on year, reflecting a supportive credit environment, high quality loan book and strict risk discipline. Provision for non-performing loans (stage 3) was € 199 million, down 51% year on year. This was partly offset by net releases of € 82 million of provision for performing loans (stage 1 and 2) driven by a more stable macro-economic outlook.\nFor the first nine months, provision for credit losses was down 83% year on year to € 261 million, or 8 basis points of average loans on an annualised basis, down from 47 basis points in the first nine months of 2020.\nConservative capital and balance sheet management\nThe Common Equity Tier 1 (CET1) capital ratio was 13.0% at the end of the quarter, in line with previous guidance, down from 13.2% at the end of the second quarter. This development mainly reflects higher RWAs due to methodology changes driven by regulation, as expected, together with RWA increases related to client-related activity. The latter were largely offset by a reduction in Operational Risk RWAs arising from improvements in the bank’s risk profile. As at the end of the third quarter, CET1 capital reflected deductions for common share dividends of € 641 million.\nThe Leverage Ratio (fully loaded) remained stable at 4.8% in the quarter, reflecting continued progress on leverage exposure reduction in the Capital Release Unit offset by currency translation effects. On a phase-in basis, the leverage ratio was 4.9%.\nLiquidity reserves were € 249 billion in the quarter, versus € 254 billion at the end of the previous quarter, including High Quality Liquid Assets of € 217 billion. The Liquidity Coverage Ratio was 137%, above the bank’s target of 130%, and preliminary Net Stable Funding Ratio was 123% in the quarter, above the bank’s target range of 115-120% and with a surplus of € 109 billion above required levels.\nSustainable Finance: full year 2021 target exceeded after € 27 billion in third quarter volumes\nCumulative environmental, social and governance (ESG)-related financing and investment volumes reached € 125 billion excluding DWS since the beginning of 2020. This exceeds Deutsche Bank’s target of at least € 100 billion by year-end 2021, on a path to the bank’s target of at least € 200 billion by year-end 2023.\nThird-quarter ESG-related financing and investment volumes were € 27 billion excluding DWS, in line with the record levels of the previous quarter. The bank’s businesses contributed as follows:\nCorporate Bank: € 3 billion in sustainable financing, raising the Corporate Bank’s cumulative total to € 18 billion;\nInvestment Bank: € 17 billion in sustainable financing and capital market issuance, bringing the Investment Bank’s cumulative total to € 73 billion. In 2021 to date, Deutsche Bank ranked top-five globally in ESG-related debt and sustainability-linked bond issuance as measured by fees, up from 8th in the full year 2020 (Source: Dealogic);\nPrivate Bank: € 5 billion growth in ESG assets under management and a further € 1 billion in new client lending, raising the business’s cumulative total to € 34 billion.\nProgress in the businesses during the quarter included:\nActing as bookrunner on four of the six largest ESG bond issues of the quarter as measured by face value (source: Dealogic);\nLeading three inaugural sovereign green bonds, notably a £ 10 billion issue for the UK Debt Management Office, a € 5 billion inaugural green bond for the Kingdom of Spain;\nExecuting the bank’s first green repurchase agreement, raising £ 20 million;\nRaising $ 200 million through the bank’s first green Formosa Bond, which will help fund renewable energy projects and energy efficiency improvements;\nThe Corporate Bank further expanded its offering for the German Mittelstand and built out its capability to structure sustainability-linked loans in this segment.\nThe Private Bank Germany introduced Blue Economy funds to build resilience in regions most vulnerable to ocean risk.\nDeutsche Bank underwent a “Sustainable Procurement Maturity Review” for the first time by EcoVadis, and was rated “proactive”. The bank also defined a path to 100% renewable electricity usage for its own operations by 2024 via the use of Energy Attribute Certificates.\nCumulative ESG volumes include sustainable financing (flow) and investments (stock) in the Corporate Bank, Investment Bank and Private Bank from January 1 2020 to date, as set forth in Deutsche Bank’s Sustainability Deep Dive of May 20, 2021. Products in scope include capital market issuance (bookrunner share only), sustainable financing and period-end assets under management. Cumulative volumes and targets do not include ESG assets under management within DWS, which are reported separately by DWS.\nRead the full media release in the\nPDF\ndownloadable PDF.\nAnalyst call\nAn analyst call to discuss third quarter 2021 financial results will take place at 13:00 CEST today. An Earnings Report, Financial Data Supplement (FDS), presentation and audio webcast for the analyst conference call are available at: www.db.com/quarterly-results\nA fixed income investor call will take place on, October 29, 2021, at 14:00 CEST. This conference call will be transmitted via internet: www.db.com/quarterly-results",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 48
}