{
    "url": "https://www.db.com/news/detail/20211008-deutsche-bank-automates-tax-processes-for-post-trade-settlement-in-indonesia-in-partnership-with-xceptor?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "October 8, 2021",
    "tags": [
        "Asia-Pacific",
        "Corporate products"
    ],
    "title": "Deutsche Bank automates tax processes for post-trade settlement in Indonesia in partnership with Xceptor",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) Corporate Bank today announced the roll-out of an automated workflow platform for the administration of capital gains withholding tax during the post-trade settlement process in Indonesia, using the Xceptor Tax Solution.\nThis enhancement will help to reduce manual processes and decrease the time to calculate withholding tax amounts down to seconds. Deutsche Bank will also utilize APIs to send real-time settlement details to the Xceptor Tax Solution. In addition, the solution will electronically manage the documentation process. \nIn February 2020, Deutsche Bank’s Corporate Bank announced its partnership with Xceptor to automate the bank’s core processes in Indonesia, as part of its broader optimization and digitization strategy.\nThe Xceptor Tax Solution delivers end-to-end processing capabilities in the world of Operational Withholding Tax. The solution comprises of five major components covering the main back-office processes in a custody tax operation.\nAnand Rengarajan, Managing Director, Global Head of Sales and Head of Asia Pacific – Securities Services at Deutsche Bank, said: “Our continued efforts to execute on the bank’s global optimization and digital strategy within our Securities Services business are of critical importance. Product enhancements such as the automation of tax processes, which we will look to replicate in other markets, directly benefit our foreign institutional clients such as global custodians, sovereign wealth funds and asset managers by providing faster turnaround times and improved accuracy.”\nAndrew Kouloumbrides, CEO of Xceptor, said: “We are delighted to partner with Deutsche Bank to simplify post-trade settlement processes. The flexibility of the Xceptor Tax Solution to handle capital gains tax calculations and other financial transaction taxes means our customer can automate these complex manual processes and improve the speed, accuracy and service to their customers.”\nFor further information please contact:\nDeutsche Bank AG                                       \nMedia Relations                                           \nAmy Chang\nPhone: +852 2203 8434\nEmail: amy.chang@db.com",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 7
}