{
    "url": "https://www.db.com/news/detail/20211001-deutsche-bank-named-investment-bank-of-the-year-for-western-europe-by-the-banker-magazine?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "October 1, 2021",
    "tags": [
        "Investment Banking"
    ],
    "title": "Deutsche Bank named Investment Bank of the Year for Western Europe by The Banker magazine",
    "body": "Deutsche Bank has been named ‘Investment Bank of the Year for Western Europe’ in The Banker Investment Banking Awards 2021.\n“A clear story of turnaround, Deutsche Bank is able to evidence a strong performance across its investment bank including in M&A, ESG bonds and notably in ECM,” the independent judging panel explained. The turnaround has “enabled itself to be more focused and prioritise areas where it can really add value for clients”.\nHenrik Johnsson, Deutsche Bank’s Co-head of Investment Banking EMEA, said: “Since the bank’s radical restructuring, our new model - which focuses on our core strengths and puts corporate and institutional relationships at the heart of the Investment Bank - has been vindicated, with the business not merely meeting the targets set out in the summer of 2019, but exceeding them.”\nThe bank’s Equity Capital Markets (ECM) business was notably praised by the judges: “In European ECM, Deutsche Bank has improved its market position and worked on several important deals.” On its Mergers and Acquisitions (M&A) business, the judges said: “The bank has underscored its continued commitment to the M&A market by advising on a series of landmark deals for long-term corporate clients across several jurisdictions and sectors.”\nBerthold Fuerst, Global Co-head of M&A at Deutsche Bank, said: “This prestigious accolade is a testament to the team’s hard work. Deutsche Bank has emerged as a clear industry leader in a number of market segments in a highly competitive environment. Solid growth in debt origination, a rebound in LDCM and a strong showing in equity origination, contributed to our Origination & Advisory revenues increasing 34% in 2020.”\nAlso singled out for praise was the bank’s commitment to the environmental, social and governance (ESG) sector, evidenced by its establishment of a new sustainable finance unit last year. “It has already been making a noticeable impact and is fast becoming a go-to issuer for corporates and sovereigns, supranational and agency issuers for sustainable bonds,” the judges said.\nThe Banker’s Investment Banking Awards recognise the banks that are “putting sustainability at the heart of what they do, have gone above and beyond to provide excellent service and execution for their clients – even during the most challenging of circumstances – and that have introduced impactful innovation into their work”. The winners were decided by an independent judging panel, including representatives from The Banker, law firm Linklaters and the data providers Dealogic and Refinitiv.\nPlease read the full article from The Banker (paywall).",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 6
}