{
    "url": "https://www.db.com/news/detail/20190319-deutsche-bank-s-alternative-investment-survey-finds-china-and-distressed-strategies-are-key-drivers-of-investor-demand-in-2019?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "March 19, 2019",
    "tags": [
        "Asset Management",
        "Corporate products"
    ],
    "title": "Deutsche Bank's Alternative Investment Survey finds China and distressed strategies are key drivers of investor demand in 2019",
    "body": "Increasing appetite for exposure to Asian hedge funds, specifically China equity long short as well as distressed strategies, are likely to be dominant themes in 2019, according to Deutsche Bank’s latest annual survey of hedge fund investors. One of the most comprehensive global surveys of hedge fund investor sentiment, Deutsche Bank’s Alternative Investment Survey is now in its seventeenth edition. This year’s survey covered 425 allocators managing or advising on $1.74 trillion in hedge fund assets and located in 28 countries.\n“The repositioning of investors to the East shows a decisive turn in investor preference,” said Marlin Naidoo, Global Head of Capital Introduction and Consulting at Deutsche Bank. “The level of experience and institutionalization of portfolio managers in the region has grown and improved over the years. These groups are expected to benefit from less competition and crowding than developed markets, while the region’s inefficiencies\nprovide managers with opportunities to generate differentiated returns.”\nAsia is the most sought after investment region for the first time since 2010, with more than a third of the investors surveyed reporting plans to increase their allocation to the region.\nRespondents identified distressed-focused funds as the most sought after strategy for the upcoming year, up from 23rd place in last year’s survey. Investors are hoping to capitalize on distressed debt managers taking advantage of rising interest rates and renewed market volatility after almost a decade of sub 1% interest rates and availability of cheap financing.\nHighlights of Deutsche Bank’s 17th annual Alternative Investment Survey:\nAsia, and in particular China, is a key focus for investors in 2019\nFor the first time since 2010, Asia is the most sought after region in our survey. Asian hedge funds have seen overwhelmingly positive sentiment from investors with 36% of investors planning to increase exposure to the region in 2019 on a net basis despite lacklustre performance in 2018.\nDistressed strategies received $6.5 billion of net inflows in Q4 2018, representing the largest increase in net new capital of all strategies quarter on quarter. Based on survey results, we expect to see continued demand for the strategy in 2019. Distressed strategies have displaced event driven to become the most sought after strategy for the upcoming year, up from 23rd place in our last year’s survey.\nQuant performance cut both ways in 2018\nStatistical arbitrage exceeded performance expectations for one in every three allocators with a similar number of allocators reporting underperformance last year.\nCTA and alternative risk premia strategies were the most disappointing in terms of performance with 73% and 69% of respondents respectively feeling these strategies underperformed their expectations.\nDiscretionary macro is expected to outperform in 2019\nWhen asked which one strategy they believe will perform the best in 2019, investors chose discretionary macro while global equity long/short is expected to be the worst performing strategy. There is a distinct shift in investor appetite away from global generalist equity strategies in favour of sector and regional specialists.\nInvestors plan to add to hedge funds despite underperformance\n46% of respondents plan to grow their allocation to hedge funds in 2019. The average hedge fund portfolio managed by our respondents generated a year to date return of +1.60% (as of 30 November 2018), 558 basis points lower than their +7.17% full year average performance target making it the largest shortfall between realized and target performance over the past 7 years when we last asked this question.\nOnly 13% of responding investors met their performance target in 2018, a substantial drop from 2017 when this statistic was 68%.\nToday, a record 69% of investors have less than 25 direct investments in their hedge fund portfolio, compared to 37% five years ago. Managers are competing for a place amongst 28 funds in the average investor’s portfolio, 14 less than five years ago.\n52% of investors plan to maintain or reduce the number of allocations in their portfolio in 2019.\nPrivate wins over public\n54% of respondents who allocate to private equity and private credit plan to grow their allocation. Private equity is expected to be the most common recipient of hedge fund redemptions with over half of the investors who plan to reduce their allocation to hedge funds in 2019 moving into this asset class.\nFor further information please contact:\nDeutsche Bank AG\nPress & Media Relations\nAmericas\nOlayinka Fadahunsi\nPhone: 1(212)250-8159\nEmail: olayinka.fadahunsi@db.com\nEMEA\nRupert Trefgarne\nPhone: +44(20)754-15635\nEmail: rupert.trefgarne@db.com\nAsia\nAmy Chang\nPhone: +852 2203 8434\nEmail: amy.chang@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}