{
    "url": "https://www.db.com/news/detail/20190317-a-message-from-christian-sewing-to-employees-of-deutsche-bank?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "March 17, 2019",
    "tags": [
        "Management & Leadership"
    ],
    "title": "A message from Christian Sewing to employees of Deutsche Bank",
    "body": "Dear colleagues,\nToday we have informed the public that, in the context of reviewing strategic options, we are engaging in discussions with Commerzbank.\nFor months now, there have been permanent rumours regarding potential mergers. That is why it is personally important to me to provide you with some more context.\nYou may recall that last September I said that, first and foremost, we intend to do our homework. In this regard, we have made a lot of progress over the last couple of months. This is something we can be proud of and that we can build on.\nAt the same time, however, we have to assess opportunities as they arise. I have consistently stressed that consolidation in the German and European banking sector is an important topic for us. We have to assess how we want to play a part in shaping it. Our stated aim remains to be a global bank with a strong capital markets business – based on a leading position in our home market in Germany and in Europe, and with a global network. This is what our clients expect from us. What is also important to me is that we will only pursue options that make economic sense, building on the progress we made in 2018.\nThat is why we, the Management Board, will review the options that present themselves to us carefully. It is our responsibility and it is our duty. In doing so, we will keep the interests of the bank and all of our stakeholders in mind. At this point in time, there is no certainty at all that any transaction will materialise. Experience has shown that there may be a lot of potential economic and technical factors that could hinder or prevent such a step.\nIn the meantime, I would ask you to focus on your daily business and to be there for our clients. They count on us and their trust is our most precious asset. There is no better way for us to get positive recognition than by delivering great service to our clients.\nThank you for your loyalty and your commitment.\nYours,\nChristian Sewing",
    "number_of_ratings": 1,
    "rating": 3.0,
    "likes": 0
}