{
    "url": "https://www.db.com/news/detail/20190315-the-latest-news-from-the-capital-for-the-platform-economy?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "March 15, 2019",
    "tags": [
        "Corporate products",
        "Cryptocurrencies",
        "Digitalisation",
        "Private products",
        "Research"
    ],
    "title": "The latest news from the capital for the platform economy",
    "body": "Every year, tens of thousands of visitors and employees of companies in the tech, media, film, television and music businesses descend on downtown Austin in Texas for the South by Southwest (SXSW) conference to talk about the future and what it might look like. The conference “remains a tool for creative people to develop their careers by bringing together people from around the globe to meet, learn and share ideas,” says Roland Swenson, SXSW Managing Director.\nDeutsche Bank sent a delegation to this year’s conference, not only to collect ideas and participate in panels and meetups, but to present to a broader stakeholder audience the progress we have made in our digital transformation.\nLast year’s SXSW was mainly about blockchain, cryptocurrencies, crowdsourced investment and everything in between. This year, by contrast, only 11 events had ‘blockchain’ in their title. The main topics ranged from the problems plaguing the world's most influential internet platforms, artificial intelligence and self-driving cars, job design and the future of work, through to the evolution of transportation and delivery systems.\nSXSW is really focused on what’s transformational, what’s changing the way in which people do things. This approach is aligned with the bank’s strategic decision to gain a leading role in the platform economy. “It’s about customer centricity, this is a historic change for companies that were product focused and sold it through their own channels.\nMarkus Pertlwieser, Chief Digital Officer of the Private & Commercial Bank and head of the bank’s delegation\nThe conference illustrated that the financial sector is set for major changes: “When you look at the retail segment, the big competitors will be the tech giants. Part of their offering is payments and the next step will be financing. If you want to buy something, but find that you don’t have sufficient credit in your account, there will be consumer finance”, said Pertlwieser. “Banks are well advised to collaborate more, like BMW and Mercedes are doing on the mobility platform.” In a panel discussion Pertlwieser then explained why the platform economy is a game changer: “We have to ask, how will people do banking in the future? It’s a challenge, and you have to change the mindset”, he said. Deutsche Bank’s answers are modern digital products such as Zinsmarkt, which integrates interest rate offers from various banks, and Yunar, an app that makes it simple to use several loyalty programmes. Talking about Zinsmarkt, Pertlwieser explained: “I think this is maximum convenient and it also gives us new customers and new assets. This was a strategic discussion - we decided to open our platform and over the last year more than one billion was invested by our customers via that market.”\nAnother important topic was privacy. In a panel discussion about data protection the German online activist Markus Beckedahl warned how big tech companies like Facebook use their customers’ data in ways that these customers are unaware of. “It’s good to have a system like Verimi, that is located in Germany and subject to German data protection laws. This is an important step for privacy”, said Beckedahl.\nWatch other SXSW 2019 highlights below:",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}