{
    "url": "https://www.db.com/news/detail/20180528-artificial-intelligence-potential-for-productivity-and-growth-risks-of-widening-global-inequality?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 28, 2018",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "Artificial intelligence – potential for productivity and growth; risks of widening global inequality",
    "body": "Rapid developments in artificial intelligence (AI) and robotics could boost productivity and spur economic growth and innovation globally but could also widen the gap between developed and developing countries as richer nations might increasingly adopt technology to carry out tasks that were previously outsourced, warns Deutsche Bank Research.\nIn the first of a new series of reports examining the effects of the digital revolution on our lives, work and society, DB’s Strategic Research team says economies around the world are likely to be impacted differently by the diffusion of advanced technologies. “Wealthy industrial countries might increasingly ‘re-shore’ production that, over the last decades, had been outsourced and fostered economic development in lesser developed economies abroad,” they say. In emerging markets, would automation mainly threaten the relevance of traditional manufacturing powerhouses? Or could technological diffusion also bring new opportunities for start-ups and small companies?\nOpening with an acknowledgement that these scenarios are fundamentally uncertain, Digital Economics: how AI and robotics are changing our work and our lives aims to spark debate and provide structure to discussions rather than “offer simplified answers”.\nTurning from economies to individual workers, the report considers the impact on human society if AI, “at some point even becomes superior in all relevant cognitive, physical and perhaps even emotional capacities.” Arguing that computers already perform many tasks better than humans, the report highlights that these are typically “manual and hard or standardised physical labour”. But adding in “the whole range of cognitive abilities” to AI could extend this phenomenon from the factory floor to the executive offices, driving a totally new phase of digital disruption.\nThe report wonders whether in such a scenario, the implied automation of jobs would be compensated with the creation of new tasks and professions, as was the case in previous periods of drastic technological transformations. Alternatively, could it lead to a “leisure society” where machines provide everyone with sufficient means for living - or potentially cause increased inequality, mass unemployment and impoverishment? How would such a scenario affect the underlying political systems, the role of governments and the welfare state?\nRaising other questions such as will computers “overrun” their human creators and whether AI can help solve climate change; the series seeks to explore the broader economic and political implications of key technologies.\nPDF\nRead the report.\nView the full list of DB Research’s publications on digitalisation.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}