{
    "url": "https://www.db.com/news/detail/20180528-germany-s-biggest-private-und-commercial-bank-is-launched?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 28, 2018",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Germany's biggest Private & Commercial Bank is launched",
    "body": "DB Privat- und Firmenkundenbank AG concludes legal merger of Postbank and Deutsche Bank’s private and commercial clients business\nChristian Sewing: “We have reached a key milestone and aim to generate synergies of at least 900 million euros per year by 2022 at the latest\nFrank Strauß: “As the undisputed leader in Germany’s banking market we intend to drive the digital transformation of our business and continue to grow”\nGermany's biggest Private & Commercial Bank has been launched: DB Privat- und Firmenkundenbank AG was entered in the Commercial Register on May 25, 2018. It is a wholly owned subsidiary of Deutsche Bank AG and the legal entity created by the merger of Deutsche Bank Privat- und Geschäftskunden AG and Deutsche Postbank AG.\nDeutsche Bank’s entire German private and commercial clients business thus serves more than 20 million private clients, around 50 percent of whom use the bank’s online offering, as well as one million commercial and corporate clients. Assets under management, including sight deposits, exceed 331 billion euros. With some 28,000 employees it serves its clients at more than 10,000 access points. The private and commercial clients business will continue to operate both brands – Deutsche Bank and Postbank – so clients will retain their established contacts.\nThis is the biggest merger of two banks since the European Central Bank’s single supervisory mechanism was established. Christian Sewing, Chief Executive Officer of Deutsche Bank AG, said: “I’m delighted that we have managed to merge the two banks as planned. This means we have reached a key milestone. As we continue with our reorganisation plan we will cut costs and boost revenues. We will then grow synergies gradually to at least 900 million euros per year by 2022 at the latest.”\nTo achieve this a total of 1.9 billion euros will be spent on restructuring expenses and other investments, predominantly in IT. The cost/income ratio of this business is to be reduced to below 65 percent by 2022.\nThe new DB Privat- und Firmenkundenbank shows our commitment to our home market. Starting from this position of strength as the undisputed leader in Germany’s banking market we intend to drive the digital transformation of our business, continue to grow and consistently make a significant contribution to group earnings.\nFrank Strauß, Member of the Management Board of Deutsche Bank AG and Head of Private & Commercial Bank\nOne key prerequisite for the targeted growth is that the European Central Bank has now granted the capital waiver that enables the bank to manage liquidity better across DB Privat- und Firmenkundenbank and other Deutsche Bank businesses. The Pfandbrief licence for the new legal entity has also been approved. This allows the new bank to continue operating Postbank’s Pfandbrief, a type of covered bond, business with mortgage Pfandbriefe and public-sector Pfandbriefe.\nIn addition, the bank has received all the resolutions and approvals required to extend the legal decree of Deutsche Postbank AG to the new legal entity as its legal successor, which authorises the bank to employ former public servants. A long-term extension of the cooperation contract with Deutsche Post for the branch network has been signed in advance.\nMoreover, the bank has reached agreement on a key issues paper with trade union representatives in order to ensure the necessary job reductions are carried out in a socially responsible manner. The Deutsche Bank and Postbank brands have further enhanced their respective profile over recent months.\nTwo brands - one bank\nWhile Deutsche Bank sees itself especially as a partner and risk manager providing comprehensive advisory services to its clients, Postbank will cover standardised, day-to-day banking needs. “Two brands – one bank” is the corresponding motto. In addition, the merger will lead to growth prospects in selected private and commercial banking divisions, for example, asset management, lending, and digital banking.\n“The new DB Privat- und Firmenkundenbank is also already Germany’s biggest online bank,” Strauß said. “We can and will expand this lead in digital transformation.” In addition to the integrated online solutions for clients of Deutsche Bank and Postbank the digital platform will be expanded to include new products and services that go beyond traditional banking. Deutsche Bank will disclose initial details in 4Q2018.\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Contact\nAnke Hallmann\nPhone: +49 (0)69 910 14546\nE-Mail: anke.hallmann@db.com\nJoachim Strunk\nPhone: +49 (0)228 920 12000\nE-Mail: joachim.strunk@postbank.de",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}