{
    "url": "https://www.db.com/news/detail/20180522-urban-economics-shows-connection-between-geography-and-stock-returns?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 22, 2018",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "Urban economics shows connection between geography and stock returns",
    "body": "Investors should consider geographic location when choosing investments and machine learning will redefine the way quantitative strategies work. These were among the wide range of topics discussed at Deutsche Bank’s 5th Annual Global Quantitative Strategy Conference in New York last week.\nOutlining his latest research in urban economics, Professor Sheridan Titman of the University of Texas at Austin, highlighted the connection between a company’s location and its stock returns; even if companies in the same location are in different industries. To elaborate on the importance of what he called geographic momentum and performance, Professor Titman presented studies showing a range of variables that can affect stock prices including factors outside of financial indicators.\nOne study showed the correlation between geographies and various forms of misconduct including that of public officials. Another showed location as a predictor of bankruptcy, which prompted Professor Titman to advise adding location to credit models.\nResearch shows that 70-80% of new companies going public after 1980, including Apple, Alphabet, Amazon, Microsoft and Amgen, are concentrated in two locations – Seattle and Northern California’s Bay Area. This indicates limited geographies correlate with value creation over the past 40 years.\nProfessor Titman’s key message for investors: think about location in the same way you think about industry and include geographical information in investors’ estimations of risk and potential market outperformance.\nPeter Selman, Global Head of Equities, welcomed 300 clients at 60 Wall Street who attended to hear from some of today’s leading financial minds including Marco Lopez De Prado, founder of True Technologies, which develops investment strategies for institutions using machine learning and computing technologies. He highlighted the pitfalls of machine learning, which is relevant for investors who are trying to introduce this new technology into their investment processes.\nIn another presentation, the bank’s US Head of Quantitative Strategy, Ronnie Shah, explained the concept of “fundamental acceleration”, which involves using a novel machine learning technique to estimate future fundamentals. For more of the team’s research visit the US Quant Strategy web page.\nAndy Moniz, Chief Data Scientist, dbDIG (Data Innovation Group), introduced α-DIG, the bank’s new interactive web tool. It leverages natural language processing (NLP) to provide insights on a company’s human capital, innovation, brand value, management quality and environmental sustainability.\n“In today’s service based economy, investors need to go beyond accounting data to quantify the value of company intangibles,” said Moniz. “a-DIG is designed for investors seeking to integrate alternative data into investment strategies, and for thematic and ESG investors who want to incorporate the impact of non-financial issues on company valuations.” Visit the α-DIG website  for more information.\nSpyros Mesomeris, Global Head of Quantitative Research and Co-Head of dbDIG, highlighted the strength of the bank’s Quantitative Research team globally. \"Quant is an extremely strong franchise at Deutsche Bank and well-supported in New York, London, and Hong Kong,” said Mesomeris. “We remain ahead of the curve on innovation: with the recent launch of a-DIG, we are filling a big gap in the data market by leveraging data science to quantify the impact of company intangibles.”\nOther notable speakers included Professors Richard Sloan of the University of Southern California and Kent Daniel of Columbia University.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}