{
    "url": "https://www.db.com/news/detail/20180516-helping-young-people-to-shape-their-own-futures?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 16, 2018",
    "tags": [
        "Africa",
        "Corporate Citizenship",
        "Education"
    ],
    "title": "Helping young people to shape their own futures",
    "body": "Encouraging teenagers to participate in the social discourse: this is the goal of the Youth Citizens Action Programme (Y-CAP) in South Africa. One way of doing this is to hold a competition for schoolchildren to find who has the best solution for a social issue close to their heart. The winning team receives prize money to put its ideas into action.\nSiphiwe Ntuli was the runner-up, just missing out on the prize money. But she and her team didn’t need money to solve their problem: the mess and dirt in the area around their school in Pietermaritzburg. The teenagers came up with a plan. They collected rubbish, asked their fellow pupils and neighbours to help – and campaigned to keep the neighbourhood clean in future. This required them to be persuasive and persistent. So they were particularly pleased about the recognition they received from Y-CAP and the extra opportunity to raise awareness for their cause.\nI have just so enjoyed watching the girls develop — watching that sense of accomplishment and seeing what can happen when you empower them to do things for themselves.\nGlynnis Podmore, teacher at Russel Girls’ High School\nChildren’s art at the stock exchange\nIn the centre of Johannesburg, children from disadvantaged backgrounds have to struggle with difficult circumstances on a daily basis. They live, for the most part, in the poorest parts of the city. The Little Artists School gives these children free art lessons so that they can learn to express and process their experiences in creative form.\nAmong the things the children learn there are how to prepare their work and to finish what they have started. They gain the self-confidence to follow their dreams and eventually take charge of their own lives.\nThe children’s artwork is regularly put on display and up for auction, for example, at Deutsche Bank’s offices or at the Johannesburg stock exchange. Some 275 children have proudly exhibited their creations in recent years. Several of them have made art their profession, with some even returning to teach at the Little Artists School.\nIn other parts of the world, too, Born to Be initiatives of Deutsche Bank and its foundations help children and teenagers to develop their potential. Some of them support girls in discovering and developing their technical talents, since the uptake of STEM (Science, Technology, Engineering, Maths) subjects is still male-dominated.\nEncouraging more girls to take STEM subjects is the ambition of Anne-Marie Imafidon and her Student to STEMette programme. In this context, she enlists the help of industry role models from Deutsche Bank and many other companies to inspire the next generation of young women into STEM careers.\nThe STEMettes attend industry events and take part in real life hackathon challenges for example developing an app for charity Autistica. “This journey helped push and prepare me for my internship applications that I submitted in the autumn and I am officially a spring intern at Deutsche Bank later this year,” said Sobelema, a recent participant.\nThe Pathways to Banking and Finance is a programme that looks to inspire and support students from disadvantaged backgrounds into careers in banking. Supported by Deutsche Bank volunteers, 300 teenagers will be getting to know the industry and their entry possibilities. The aim is to promote diversity and widen access to the finance sector.\nIn Germany, two Born to Be flagship events are coming up in June. Studienkompass will celebrate this year’s graduation in Frankfurt. And six teams of students will compete at the Build Your Future-Challenge in Deutsche Bank’s Quartier Zukunft in Berlin.\nDeutsche Bank has committed itself to making a positive impact on the lives of five million children and teenagers by 2020.\nIt can call on a wealth of experience and achievements in this regard. In the last year alone it supported 158 education projects in 25 countries, helping 1.2 million children and teenagers to develop their potential. Over 4,000 of the bank’s employees have participated in these youth engagement projects.",
    "number_of_ratings": 18,
    "rating": 2.0,
    "likes": 7
}