{
    "url": "https://www.db.com/news/detail/20180515-deutsche-bank-acquires-india-based-fintech-start-up-quantiguous-solutions-to-accelerate-the-bank-s-open-banking-strategy?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 15, 2018",
    "tags": [
        "Company",
        "Digitalisation",
        "Entrepreneurship",
        "Research",
        "Strategy"
    ],
    "title": "Deutsche Bank acquires India-based FinTech start-up Quantiguous Solutions to accelerate the bank's Open Banking strategy",
    "body": "Deutsche Bank today announced that it has acquired Quantiguous Solutions, a Mumbai-based software company, to strengthen its Global Transaction Banking franchise. With the help of Quantiguous, the bank will accelerate the development of its Open Banking platform that forms the core for developing innovative client applications and connecting corporate clients, FinTechs and partner companies to Deutsche Bank’s Transaction Banking platforms and services.\n“The future of banking depends on connectivity which is key to drive growth for our global franchise,” said John Gibbons, Head of Global Transaction Banking. “The need to provide an easy-to-use, seamless customer experience, with new digital services offered across a broad number of touchpoints has never been greater.”\n“This acquisition significantly ups the game for Deutsche Bank’s Open Banking strategy. The injection of this high-quality talent pool from Quantiguous into the bank’s digital franchise will help us go to market faster”, said Thomas Nielsen, Chief Digital Officer, Global Transaction Banking at Deutsche Bank.\n“We are excited to become part of Deutsche Bank. This is a remarkable opportunity for us to build an Open Banking platform on a global scale, with an international bank that is committed to the concept of Open Banking. We have always believed that this is the foundation for a connected financial ecosystem”, added Akhilesh Kataria, Founder and CEO, Quantiguous Solutions.\nAs part of the acquisition, Deutsche Bank will take over all employees of Quantiguous, who will join the core team responsible for the development and roll-out of the transaction bank’s global API programme. The bank and Quantiguous didn’t disclose the value of the transaction.\nDeutsche Bank AG\nMedia Contact\nFrank Hartmann\nTel.: +49 69 910 42744\nEmail: Frank.Hartmann@db.com\nGeorge Cherian\nTel: +91 22 66703324\nEmail: George.cherian@db.com\n\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\n\nAbout Quantiguous Solutions\nQuantiguous solutions specialises in Open Banking solutions that enable financial institutions to rapidly deploy smart, simple and secure API’s to corporates, partners and FinTechs. Based in Mumbai, India; Quantiguous Solutions is a pioneer in API Banking since its inception in 2014.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 1
}