{
    "url": "https://www.db.com/news/detail/20190724-deutsche-bank-reports-net-loss-driven-by-transformation-charges-in-the-second-quarter-of-2019?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 24, 2019",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank reports net loss driven by transformation charges in the second quarter of 2019",
    "body": "Christian Sewing, Chief Executive Officer, said: “We have already taken significant steps to implement our strategy to transform Deutsche Bank. These are reflected in our results. A substantial part of our restructuring costs is already digested in the second quarter. Excluding transformation charges the bank would be profitable and in our more stable businesses revenues were flat or growing. This, combined with our solid capital and liquidity position, gives us a firm foundation for growth.\"\nSecond quarter and first half 2019 highlights\nSecond-quarter net loss of 3.1 billion euros after strategic transformation charges of 3.4 billion euros\n– Substantial portion of expected transformation charges now taken\n– Large majority of transformation charges have no impact on capital position\nSecond-quarter net income would have been 231 million euros and pre-tax profit 441 million euros excluding transformation charges\nRevenues down 6% or 5% if adjusted for specific items¹; revenues essentially flat or growing in more stable businesses (Global Transaction Banking, Private & Commercial Bank and Asset Management) if adjusted for specific items¹\nContinued volume growth in the first half year\n– Loan growth of 14 billion euros\n– Net asset inflows of 20 billion euros\n– Assets under management up 88 billion euros\nNoninterest expenses of 7.0 billion euros and adjusted costs² of 5.7 billion euros. Excluding transformation charges, in the second quarter:\n– Noninterest expenses down 3%\n– Adjusted costs down 4%\n– 6th consecutive quarter of year-on-year adjusted cost reduction ex-bank levies\nCapital position remains robust: Common Equity Tier 1 ratio of 13.4%\nSubstantial progress on strategy execution\n– Cash Equities positions exited/system shutdown initiated\n– Negotiation of Prime Finance/Electronic Equities sale on track\n– Over 900 employees given notice or informed their role will be eliminated\nAs at 30 June 2019, businesses to be transferred into the Capital Release Unit accounted for (pro forma):\n– Leverage exposures of 250 billion euros\n– Risk weighted assets of 65 billion euros\nFinancial impact of strategic transformation charges\nAs a result of its announced restructuring, Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) reported a net loss of 3.1 billion euros in the quarter. Charges related to strategic transformation, including the impact of a lowered outlook on business plans, were 3.4 billion euros.\nExcluding these charges, net income would have been 231 million euros versus 401 million euros in the prior year period.\nThe bank reported a loss before income taxes of 946 million euros including 1.4 billion euros in pre-tax transformation-related charges. Excluding these charges, pre-tax profit would have been 441 million euros versus 711 million euros in the second quarter of 2018.\nStrategic transformation charges of 3.4 billion euros comprised Deferred Tax Asset (DTA) valuation adjustments of 2.0 billion euros, plus 1.4 billion euros comprising 1.0 billion euros of impairments on goodwill³ reflecting a lowered outlook on business plans, and 351 million euros of impairments on software and provision for existing service contracts. The large majority of these charges have no impact on Common Equity Tier 1 capital.\nFor the first six months of 2019, the bank reported a loss before income taxes of 654 million euros and a net loss of 2.9 billion euros, primarily driven by transformation-related charges in the second quarter of 2019. Excluding these charges, first-half pre-tax profit would have been 733 million euros, and first-half net income would have been 432 million euros. In the first six months of 2018, profit before tax was 1.1 billion euros and net income was 521 million euros.\nExecution of Deutsche Bank’s transformation strategy is underway. In the first six months of 2019 the bank reduced leverage exposures in business to be transferred to the Capital Release Unit by 38 billion euros and risk weighted assets by 9 billion euros. Negotiations are on track for the sale of Prime Finance and the Electronic Equities platform to BNP Paribas. In Cash Equities, Deutsche Bank has exited positions and the shutdown of systems is in progress. Over 900 employees have either been given notice or informed that their role will be eliminated since the announcement of the transformation strategy.\nRevenue share of more stable businesses is growing\nNet revenues were 6.2 billion euros in the quarter, down 6% on a reported basis compared to the prior year quarter and down 5% excluding specific items¹. These items contributed a positive 109 million euros in the quarter, versus a positive 194 million euros in the prior year quarter.\nRevenues in the Corporate & Investment Bank (CIB) were 2.9 billion euros, down 18% year-on-year, while revenues in the Private & Commercial Bank (PCB) were down 2%, or essentially flat if adjusted for specific items¹. Revenues in Asset Management were up 6% year-on-year.\nRevenues in more stable businesses – Global Transaction Banking, the Private & Commercial Bank and Asset Management – made up 65% of revenues in the quarter. These revenues were down 2% on a reported basis and up 1% adjusted for specific items\n¹ Specific revenue items, 2nd quarter 2019 versus 2nd quarter 2018\nVolume growth in loans and assets under management\nLoan growth was 4 billion euros on a reported basis. In the first six months, loan growth was 14 billion euros.\nAssets under management (AuM) grew by 18 billion euros during the quarter, including net inflows of 9 billion euros. In the first six months of 2019, AuM increased by 88 billion euros with cumulative net inflows of 20 billion euros.\nCosts down excluding strategic transformation charges\nNoninterest expenses were 7.0 billion euros in the quarter, versus 5.8 billion euros in the prior year quarter, including the aforementioned 1.4 billion euros of transformation charges. Excluding these charges, noninterest expenses were down 3% year-on-year.\nAdjusted costs (Noninterest expenses and adjusted costs, 2nd quarter 2019 versus 2nd quarter 2018) were 5.7 billion euros in the quarter. Excluding transformation-related charges, consisting of the aforementioned impairments on software and provision for existing service contracts, adjusted costs were 5.3 billion euros, down 4% year-on-year. This decline was driven by lower compensation and benefits expenses and professional service fees which more than offset higher IT expenses. The bank remains on track to meet its full-year target for adjusted costs of 21.5 billion euros excluding transformation-related charges.\n² Noninterest expenses and adjusted costs, 2nd quarter 2019 versus 2nd quarter 2018\nThe workforce declined to 90,866 on a full-time equivalent (FTE) basis at the end of the quarter, a reduction of approximately 600 in the quarter, partially due to the disposal of the bank’s Portuguese retail operations during the quarter, and down by approximately 4,600 since the end of the second quarter of 2018.\nCredit quality remains solid\nProvision for credit losses was 161 million euros in the quarter, up by 66 million euros versus the prior year quarter, reflecting higher provisions set aside to take account of forecasted weaker macroeconomic conditions. However, it remains low by historical standards, reflecting the low risk profile of the loan portfolio. Provision for credit losses in PCB remained essentially unchanged versus the prior year quarter at 87 million euros, as new provisions were partially offset by gains on portfolio sales.\nThis reflects strong underwriting standards and a supportive credit environment. Provision in CIB was 72 million euros, up from a low level of 11 million euros in the prior year quarter, reflecting forecasted weaker macroeconomic conditions and larger releases recorded in the prior year quarter.\nCapital and balance sheet strength largely unaffected by transformation charges\nThe Common Equity Tier 1 (CET 1) ratio was 13.4% at the end of the quarter, down from 13.7% at the end of the first quarter, and largely unaffected by the aforementioned DTA adjustments and goodwill impairments which comprised the majority of the transformation charges. The quarter-on-quarter development reflected an impact of approximately 20 basis points from two final decisions relating to regular reviews by the European Central Bank.\nIn addition, the payment of the 2018 common share dividend and of coupons on Additional Tier 1 (AT1) capital instruments reduced the CET 1 ratio by approximately 10 basis points. In the first six months, the CET 1 ratio declined from 13.6% to 13.4%, largely reflecting the aforementioned second-quarter effects.\nRisk weighted assets (RWA) were 347 billion euros, essentially flat quarter-on-quarter. Increases in Credit Risk RWA were offset by reductions in Operational Risk RWA due to continued improvement in the bank’s loss profile. In the first six months of 2019, RWAs declined by 4 billion euros, reflecting a modest first-quarter reduction.\nThe fully loaded Leverage Ratio was 3.9% in the quarter, stable relative to the first quarter. Leverage exposures declined by 41 billion euros. Cash balances were reduced, while additional reductions in leverage exposures related to Sales & Trading activities were partly offset by loan growth, reflecting the bank’s continued efforts to rebalance its business mix toward more stable revenue sources. In the first six months of 2019, the fully loaded leverage ratio declined from 4.1% to 3.9%, and the phase-in ratio declined from 4.3% to 4.2%, largely reflecting an increase in leverage exposures in the first quarter.\nLiquidity reserves remained strong at 246 billion euros at the end of the second quarter, down from 260 billion euros in the first quarter and 259 billion euros at the end of 2018. The decline of 13 billion euros during the first six months of this year was driven by active measures to reduce and redeploy excess liquidity.\nThe Liquidity Coverage Ratio (LCR) at the end of the quarter was 147%, up from 141% in the previous quarter. At this level, the LCR is 47% above the required level of 100%, equivalent to a surplus of 67 billion euros.\n______________________________\n³ Goodwill impairment charges, which were triggered by the bank’s revision to its strategic plan as part of the transformation planning process, were higher than those charges disclosed on announcement of the bank’s strategy on 7 July 2019. This resulted from the detailed application of the bank's divisional strategic plan to the Cash-Generating Unit “Global Transaction Banking & Corporate Finance”. For further information, please refer to section “Impact of Deutsche Bank’s transformation” of the Interim Report\nGroup results at a glance\nDevelopment in the business segments\nCorporate & Investment Bank (CIB)\nNet revenues were 2.9 billion euros, down 18% year-on-year.\nGlobal Transaction Banking (GTB) revenues were 949 million euros, down 6% year-on-year. Adjusted for a specific item1 relating to a one-time gain recorded in the prior year quarter, revenues in the quarter were essentially stable year-on-year. Growth in Cash Management and in Trade Finance was offset by perimeter adjustments in Securities Services.\nSales & Trading (Fixed Income) revenues were 1.3 billion euros, down 4%, or 11% if adjusted for a specific item1 relating to a change in valuation of an investment. This development reflected a resilient performance in Credit, which was offset by the impact of lower volatility on FX revenues, while Rates produced a solid performance if adjusted for perimeter adjustments made in 2018. Overall Sales & Trading (Fixed Income) revenues were negatively impacted by the year-on-year impact of portfolio items.\nOrigination & Advisory revenues were 407 million euros, down 30%. This development reflects lower industry fee pools, especially in geographies (EMEA) and products (Leveraged Debt) which are normally areas of strength for Deutsche Bank.\nSales & Trading (Equity) revenues were 369 million euros, down 32% year-on-year. This development reflects the strategic reshaping announced in the second quarter of 2018, together with lower client flows in the second quarter of 2019 due to the market’s anticipation of a strategic downsizing of the bank’s Equities franchise.\nProvision for credit losses was 72 million euros in the quarter, versus 11 million euros in the prior year quarter. This development reflects a weaker macroeconomic outlook and substantial releases in the second quarter of 2018.\nNoninterest expenses were up 22% year-on-year to 3.8 billion euros impacted by transformation charges totalling 810 million euros. These comprised 491 million euros of impairment of goodwill plus 319 million euros of impairment on software and provisions for existing service contracts. This latter item also impacted adjusted costs which were up by 3%. Excluding this item, adjusted costs were down 7% year-on-year, driven by strategic perimeter reductions in 2018 and continued cost discipline.\nCIB reported a loss before tax of 907 million euros in the quarter, driven in large part by the aforementioned 810 million euros of transformation charges.\nFor the first six months of 2019, CIB reported a loss before income taxes of 1.0 billion euros, compared to a pre-tax profit of 678 million euros in 2018. The decrease was primarily driven by the aforementioned impairments.\nDeutsche Bank’s core investment banking franchise scored notable successes in the first half of 2019. Deutsche Bank played a lead role in 16 of the top 25 fee events and was No. 1 issuer of high yield debt in EMEA with a market share of 8.3%, up from third in the first half of 2018 (source: Dealogic).\nIn the 2019 Euromoney FX survey, Deutsche Bank rose to second place, from eighth in 2018, and was ranked first in Western Europe, versus fifth last year. In the same survey, Deutsche Bank rose to third place in electronic trading, up from eighth in 2018.\nCorporate & Investment Bank results at a glance\nPrivate & Commercial Bank (PCB)\nNet revenues were 2.5 billion euros, down 2% year-on-year. Excluding specific items¹ and adjusted for exited businesses, revenues grew by 2%, as growth in loan volumes and improved investment revenues more than offset the negative impact of continued deposit margin compression.\nIn the Private & Commercial Business (Germany), revenues were 1.7 billion euros, up 2% year-on-year as strong growth momentum in business volumes and re-pricing measures more than offset continued deposit margin compression.\nThe Private & Commercial Business (International) generated revenues of 366 million euros, down 3% year-on-year following the change in the treatment of loan fees in Italy. Excluding this effect, revenues were essentially flat year-on-year as growth in loans and investment revenues offset impacts from the low interest rate environment.\nWealth Management (Global) revenues were 429 million euros, down 9% year-on-year. If adjusted for the specific item1 arising from gains on workout activities relating to legacy Sal. Oppenheim positions in both quarters, revenues were up 4% year-on-year due to strong growth in Emerging Markets.\nNoninterest expenses were 2.6 billion euros, up 20%, and were impacted by transformation-related charges totalling 557 million euros. These comprised 545 million euros for an impairment on goodwill and 12 million euros for an impairment on software. The latter also impacted adjusted costs, which were down 4% at 2.1 billion euros, reflecting benefits from reorganisation measures and continued strict cost discipline. On an FTE basis, the workforce was down by 459 in the quarter and by 2,682 year-on-year, including reductions of approximately 1,700 related to the deconsolidation of operations in Poland and Portugal.\nPCB recorded a pre-tax loss of 241 million euros after the aforementioned 557 million euros in transformation-related charges. Excluding these charges, profit before tax would have been 316 million euros in the quarter, compared to 262 million euros in the prior year quarter.\nProvision for credit losses was essentially flat year-on-year at 87 million euros, reflecting gains on portfolio sales and continued strong underwriting standards.\nFor the first six months of 2019, PCB reported a profit before tax of 46 million euros, compared to 586 million euros in the first six months of 2018. The decrease was primarily driven by the aforementioned transformation-related charges.\nExcluding these charges, pre-tax profit would have been 603 million euros in the first half of 2019, up 3% versus the prior year period, despite benefits from specific revenue items such as real-estate sales gains which were substantially higher in the first half of 2018.\nPost-tax Return on Tangible Equity (RoTE) for the first half of 2019 was 0.5%; excluding transformation-related charges, the post-tax RoTE would have been 7% for this period.\nGrowth in business volumes: PCB’s AuM grew by 3 billion euros to 505 billion euros during the quarter. Adjusted for the impact of the sale of the Portuguese business, growth of 6 billion euros in the quarter was driven by net inflows of 5 billion euros. Loans were stable in the quarter. Net growth of 2 billion euros in loans to clients was largely offset by the sale of securities classified as loans, mainly promissory note loans.\nIn the first six months of 2019, PCB achieved net inflows of 13 billion euros in assets under management, of which 10 billion euros related to term deposits, and loan growth of 3 billion euros. Net growth of 6 billion euros in loans to clients was partly offset by the sale of securities classified as loans and exchange rate movements.\nPrivate & Commercial Bank results at a glance\nAsset Management (AM)\nNet revenues were 593 million euros, up 6% year-on-year. The increase was driven by episodic performance fees and essentially flat management fees as improved market conditions and positive asset flows offset the unfavourable impact of net outflows in 2018.\nNoninterest expenses were 471 million euros, up 7%, with adjusted costs up 6% to 442 million euros, predominantly due to higher compensation expenses on carried interest relating to episodic performance fees.\nProfit before tax was 89 million euros in the second quarter, down 5% year-on-year, reflecting an increase in noncontrolling interest driven by higher standalone profitability in DWS. Post-tax RoTE was 14%.\nFor the first six months of 2019, Asset Management reported profit before tax of 185 million euros, up 12% from 165 million euros in the first six months of 2018.\nGrowth in assets under management: assets under management increased by 15 billion euros to 721 billion euros during the quarter. This increase reflected positive market performance and net new money inflows of 4 billion euros driven by targeted growth areas of Passive and Alternatives offset by declines in traditional fixed income and equities. In the year to date, assets under management grew by 56 billion euros including net inflows of 7 billion euros which includes a positive contribution from strategic partnerships.\nAsset Management results at a glance\nCorporate & Other (C&O)\nNet revenues were 182 million euros in the second quarter of 2019, up from negative 91 million euros in the prior year period. This development was driven primarily by the mark-to-market impact of hedging activities in connection with the bank’s arrangements to fund business activity across different currencies, notably US dollars, as spreads widened compared to the second quarter of 2018.\nNoninterest expenses were 117 million euros in the quarter, up from 77 million euros in the prior year period. This development was primarily due to differences between plan and actual infrastructure expenses, which are allocated to business divisions based on plan with any differences between plan and actual allocations being captured within C&O. Shareholder expenses increased year-on-year by 12 million euros to 130 million euros, due to increased strategic project and business consulting costs.\nProfit before income taxes was 113 million euros in the quarter, versus a loss before income taxes of 119 million euros in the prior year quarter.\nIn the first six months, profit before income taxes was 109 million euros, compared to a loss of 286 million euros in the prior year period.\nCorporate & Other (C&O) results at a glance\nAn analyst call to discuss second-quarter 2019 financial results will take place today, Wednesday, July 24, 2019, at 13.00 CEST. This conference call will be broadcast via internet: www.db.com/quarterly-results\nA Fixed Income investor call will take place on Friday, July 26, 2019, at 15.00 CEST. This conference call will be broadcast via internet: www.db.com/quarterly-results\nThe Earnings Report, the Financial Data Supplement (FDS), the presentation and the audio-webcast for the analyst conference call are available at: www.db.com/quarterly-results\nThe Deutsche Bank Pillar 3 Report Q2 2019 will be published on August 21 and will be available at:\nwww.db.com/regulatory-reporting\nThis document contains non-IFRS financial measures. For a reconciliation to directly comparable figures under IFRS, to the extent not provided herein, please refer to the Financial Data Supplement.",
    "number_of_ratings": 1,
    "rating": 3.0,
    "likes": 0
}