{
    "url": "https://www.db.com/news/detail/20190715-neal-pawar-joins-deutsche-bank-as-group-chief-information-officer?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 15, 2019",
    "tags": [
        "Company"
    ],
    "title": "Neal Pawar Joins Deutsche Bank as Group Chief Information Officer",
    "body": "Deutsche Bank hired Neal Pawar as Group Chief Information Officer, effective early September. He will be based in New York and report into Bernd Leukert. Pawar will also join the Group Management Committee.\nPawar joins from AQR Capital, the investment management firm, where he was most recently a Principal and Chief Technology Officer. Prior to AQR, Pawar was Managing Director and Chief Information Officer for UBS Wealth Management in Zurich, and a partner responsible for technology at the New York based quantitative firm D.E. Shaw & Co.\n“In our recent strategy update we identified technology as a cornerstone for success,” said Frank Kuhnke, Group Chief Operating Officer. “Someone of Neal’s calibre and experience deciding to join Deutsche Bank further strengthens our capabilities as we modernise and simplify our technology for the benefit of our clients. Having announced Bernd Leukert as our future Management Board Member responsible for Technology, Data and Innovation, Neal represents another key hire who will complement the experts we have at the bank.”\nAl Tarasiuk, the current Group Chief Information Officer, will become a senior strategic advisor to Bernd Leukert.\nTarasiuk joined Deutsche Bank in 2015 and prior to becoming Group Chief Information Officer held the positions of Chief Information Security Officer and Chief Security Officer.\n“I would like to thank Al for his strong personal and expert leadership in defining and executing our technology journey,” said Frank Kuhnke. “He has revamped our Information Security framework and has been vital in implementing our cloud and data centre strategy. We look forward to benefitting from his expertise in his new role of senior strategic advisor.”\nDeutsche Bank continues to invest in making its technology more effective and efficient. Earlier this year, the bank deployed its first in-house application in the public cloud and was awarded a Red Hat Innovation Award for its industry-leading Fabric platform.\n  For further information please contact:\nDeutsche Bank AG, Media Relations\nFrankfurt am Main\nSebastian Krämer-Bach\nPhone: +49 69 / 910 43330\nEmail: sebastian.kraemer-bach@db.com\nLondon\nSenthuran Shanmugasivam\nPhone: +44(20)754-72838\nEmail: senthuran.shanmugasivam@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}