{
    "url": "https://www.db.com/news/detail/20190707-deutsche-bank-outlines-significant-strategic-transformation-and-restructuring-plans?language_id=1",
    "language": "DE",
    "article_type": "Ad-hoc Release",
    "publish_date": "July 7, 2019",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Deutsche Bank outlines significant strategic transformation and restructuring plans",
    "body": "Frankfurt am Main, 7 July 2019, 4.29 PM – As part of its ongoing commitment to improve long-term profitability and returns to shareholders, Deutsche Bank’s Management Board announces a series of measures to restructure the bank’s operations. These measures include:\nThe exit of Global Equities and a significant reduction in Corporate and Investment Banking risk weighted assets\nDeutsche Bank will exit its Equities Sales & Trading business, while retaining a focused equity capital markets operation. In addition, the bank plans to resize its Fixed Income operations in particular its Rates business and will accelerate the wind-down of its existing non-strategic portfolio. In aggregate, Deutsche Bank will reduce risk-weighted assets currently allocated to these businesses by approximately 40%.\nThe bank will create a new Capital Release Unit to manage the efficient wind-down of the assets related to business activities, which are being exited or reduced. These assets and businesses represented EUR 74 billion of risk-weighted assets and EUR 288 billion of leverage exposure, as of 31 December 2018.\nThese actions are designed to allow Deutsche Bank to focus on and invest in its core, market leading businesses of Corporate Banking, Financing, Foreign Exchange, Origination & Advisory, Private Banking, and Asset Management.\nA significant restructuring of businesses and infrastructure\nDeutsche Bank will implement a cost reduction program designed to reduce adjusted costs to EUR 17 billion in 2022 and is targeting a cost income ratio of 70% in that year.\nTo facilitate its restructuring, Deutsche Bank expects to take approximately EUR 3 billion of aggregate charges in the second quarter of 2019, of which approximately EUR 0.2 billion would impact Common Equity Tier 1 capital. These charges include a Deferred Tax Asset write-down of approximately EUR 2 billion and impairments of approximately EUR 0.9 billion. Additional restructuring charges are expected in the second half of 2019 and subsequent years. In aggregate, Deutsche Bank currently expects cumulative charges of EUR 7.4 billion by the end of 2022.\nManaging the transformation through existing resources\nDeutsche Bank management intends to fund its transformation from its existing resources without requiring additional capital. This reflects the bank’s current strong capital position as well as management’s confidence in the high quality and low risk nature of the assets, which it is exiting. In connection with these decisions, the Management Board intends to recommend no common equity dividend be paid for the financial years 2019 and 2020. The bank expects to have capacity for payments on additional tier 1 securities throughout the transformation phase.\nUpdated capital and leverage targets\nThe Management Board believes that the future business mix is consistent with a lower capital requirement. After consultation with the bank’s regulators, the bank now intends to operate with a minimum CET1 ratio of 12.5% going forward. As a result of the significant deleveraging actions, the bank targets a fully-loaded leverage ratio of 4.5% by the end of 2020 rising to approximately 5% by 2022.\nPreliminary Second Quarter Results\nIncluding the charges related to the restructuring described above, Deutsche Bank expects to report a second quarter 2019 loss before income taxes of approximately EUR 500 million and a net loss of EUR 2.8 billion. Excluding these charges, Deutsche Bank expects to report second quarter 2019 income before income taxes of approximately EUR 400 million and net profit of EUR 120 million. Results reflect revenues of EUR 6.2 billion with noninterest expenses of EUR 5.6 billion and adjusted costs of EUR 5.35 billion.\nThe bank intends to release second quarter results on 24 July 2019.\nNote: Divisional figures in this document showing the pro-forma effect of resegmentation are unaudited and preliminary and subject to change.\nContact:\nSebastian Krämer-Bach\nGlobal Head of External Communications\nPhone: +49 69 910 43330\nEmail: sebastian.kraemer-bach@db.com\n_________________________________________________________________\nDeutsche Bank AG\nTaunusanlage 12\n60325 Frankfurt am Main\nGermany\nISIN: DE0005140008\nWKN: 514000\nListed: Regulated market in Berlin-Bremen, Duesseldorf, Frankfurt (Prime Standard), Hamburg, Hanover, Munich und Stuttgart; EUREX; NYSE\nThe International Securities Identification Numbers (ISINs) of further financial instruments issued by Deutsche Bank AG, and admitted to trading on a domestic organized market or for which such admission has been applied for, are listed in the attached PDFs.",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 14
}