{
    "url": "https://www.db.com/news/detail/20190707-deutsche-bank-announces-radical-transformation?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 7, 2019",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Deutsche Bank announces radical transformation",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) is radically transforming its business model to become more profitable, improve shareholder returns and drive long-term growth. To execute its transformation, the bank will significantly downsize its investment bank and aims to cut total costs by a quarter by 2022.\nThe highlights of the new strategy are:\nCreating a fourth business division called the Corporate Bank which will be comprised of the Global Transaction Bank and the German commercial banking business.\nExiting the Equities Sales & Trading business and reducing the amount of capital used by the Fixed-Income Sales & Trading business, in particular Rates.\nReturning 5 billion euros of capital to shareholders starting in 2022, facilitated by a new Capital Release Unit (CRU) to which the bank plans initially to transfer approximately 288 billion euros, or about 20% of Deutsche Bank’s leverage exposure, and 74 billion euros of risk weighted assets (RWA) for wind-down or disposal¹.\nFunding the transformation through existing resources including maintaining a minimum Common Equity Tier 1 ratio of 12.5%. The bank expects to execute its restructuring without the need to raise additional capital.\nAs a result, the bank’s leverage ratio is expected increase to 4.5% in 2020 and approximately 5% from 2022.\nReducing adjusted costs² by 2022 by approximately 6 billion euros to 17 billion euros, a reduction by a quarter of the current cost base.\nTargeting a Return on Tangible Equity (RoTE) of 8% by 2022.\nInvesting 13 billion euros in technology by 2022, to drive efficiency and further improve products and services.\nChristian Sewing, Chief Executive Officer of Deutsche Bank, said:\n“Today we have announced the most fundamental transformation of Deutsche Bank in decades. We are tackling what is necessary to unleash our true potential: our business model, costs, capital and the management team. We are building on our strengths. This is a restart for Deutsche Bank – for the long-term benefit of our clients, employees, investors and society.”\n“In refocusing the bank around our clients, we are returning to our roots and to what once made us one of the leading banks in the world. We remain committed to our global network and will help companies to grow and provide private and institutional clients with the best solutions and advice for their respective needs – in Germany, Europe and around the globe. We are determined to generate long-term, sustainable returns for shareholders and restore the reputation of Deutsche Bank.”\nPaul Achleitner, Chairman of the Supervisory Board of Deutsche Bank, said:\n“This fundamental transformation is the right response to the major changes and challenges in the financial industry. Deutsche Bank has been through a difficult period over the past decade, but with this new strategy in place we now have every reason to look forward with confidence and optimism. We have a talented and dedicated team at the helm to relentlessly execute what we promise today and to create a sustainably profitable bank. Our shareholders have supported our bank’s restructuring for years and that’s why a substantial return of capital over time is an important part of our new strategy.”\nRefocusing operating businesses\nThe transformation includes the creation of a Corporate Bank which will be the main hub for corporate and commercial clients of Deutsche Bank and Postbank. The Global Transaction Bank, which provides an essential service to many national and international corporates, will be at the core of the new division.\nOn an average day the equivalent of around one trillion euros is transferred through Deutsche Bank’s systems. In addition, around one million commercial and corporate clients from the Private & Commercial Bank in Germany will form part of the new Corporate Bank. The RoTE of the Corporate Bank is expected to grow from 9% in 2018 to more than 15% in 2022¹.\nDeutsche Bank’s Investment Bank will focus on its traditional strengths in financing, advisory, fixed income and currencies. This is expected to increase activity in areas of particular relevance for corporates, including credit and foreign exchange products. As the bank continues to provide strategic advice to corporate clients including a focused equity capital markets business, it will keep an equity and macro research capacity as well as a targeted equity sales force.\nDeutsche Bank will exit its Equities Sales & Trading business, while retaining a focused equity capital markets operation. In this context, Deutsche Bank has entered into a preliminary agreement with BNP Paribas to provide continuity of service to its prime finance and electronic equities clients, with a view to transferring technology and staff to BNP Paribas in due course. This agreement remains subject to various conditions and approvals.\nIn addition, the bank plans to resize its Fixed Income operations in particular its Rates business and will accelerate the wind-down of its existing non-strategic portfolio. In aggregate, Deutsche Bank will reduce risk-weighted assets currently allocated to these businesses by approximately 40%.\nGoing forward, the bank plans that almost 75% of Investment Banking revenues will be generated in businesses where Deutsche Bank today enjoys a top-5 market position. The RoTE of the Investment Bank is expected to increase to more than 6% in 2022¹.\nThe Private Bank will cover private customers across all segments as well as small business clients. Its objective is to build on its position as market leader in Germany, as a focused bank in Europe and as a highly competitive global wealth manager. To achieve this the bank will accelerate the integration of Deutsche Bank and Postbank in Germany, in total aiming to reduce Private Bank costs by 1.4 billion euros by 2022. Additionally 200 million euros will be delivered in the current year.\nWhile reducing operating costs, a major focus of our investments will be on the digitalisation and the development of platforms. In Wealth Management, Deutsche Bank will invest in new client advisors, especially in the growing markets of Asia. The RoTE in the Private Bank is expected to grow from 5% in 2018 to more than 12% in 2022¹.\nDWS remains a pillar of Deutsche Bank’s strategy and will continue to pursue its objective of becoming one of the top-10 asset managers globally. DWS expects to grow its RoTE even further from 18% in 2018 to over 20% in 2022.\nReshaping Deutsche Bank is expected to drive better and less volatile financial results. Revenues are expected to grow from 22.8 billion euros in the core bank in 2018 to around 25 billion euros in 2022, reflecting realistic growth assumptions¹.\nBalance sheet reduction and sustained capital strength\nLow-return assets or assets that no longer fit into the new strategy will be moved into a Capital Release Unit (CRU) for wind-down. Based on December 2018 balance sheet positions, approximately 74 billion euros of risk-weighted assets (RWA) will be transferred to the CRU. The bank targets to reduce the CRU’s market and credit risk-related RWA of approximately 38 billion euros to less than 10 billion euros by 2021. The bank will work with regulators to reduce the 36 billion euros of operational risk RWA in the CRU over time¹.\nLeverage exposure in the CRU of 288 billion euros, as of December 2018, is planned to be mostly unwound by 2022. Deutsche Bank now targets a fully-loaded leverage ratio of 4.5% in 2020 and of approximately 5% from 2022¹.\nDeutsche Bank’s new minimum Common Equity Tier 1 (CET 1) target ratio of 12.5% takes into account the significant adjustment in the business model towards a more balanced and stable bank as well as improvements in its control environment over the past years.\nThis plan has been discussed in detail with the bank’s home regulator which supports the direction and transformation of Deutsche Bank as well as the targets laid out as part of the multi-year transformation process. Deutsche Bank is committed to working closely with its supervisors around the world, as it has been doing consistently over the last several years.\nFreeing up capital for shareholders\nIn light of the bank’s current capital position and reflecting its confidence in the high quality and low risk nature of the assets, Deutsche Bank will look to fund its transformation within its existing resources. As a consequence, Deutsche Bank does not plan to pay common equity dividends for the financial years 2019 and 2020. The bank expects to have sufficient capacity for payments on additional tier 1 securities throughout the transformation phase.\nThe announced measures are in the longer term expected to free up capital of 5 billion euros to be returned to shareholders through share buybacks and dividends starting in 2022.\nCosts to execute the transformation\nTo implement the transformation, the bank expects one-off charges including impairments, restructuring costs and severance payments of 7.4 billion euros by 2022. For 2019, the total impact is expected to be approximately 5.1 billion euros, thereof about 3 billion euros in the second quarter.\nIncluding the charges related to the restructuring described above, Deutsche Bank expects to report a second quarter 2019 loss before income taxes of approximately 500 million euros and a net loss of 2.8 billion euros. Excluding these charges, Deutsche Bank expects to report second quarter 2019 income before income taxes of approximately 400 million euros and net profit of 120 million euros.\nResults reflect revenues of 6.2 billion euros with noninterest expenses of 5.6 billion euros and adjusted costs² of EUR 5.35 billion euros.\nDeeper cost reduction and improved returns\nThe restructuring actions will include a workforce reduction of approximately 18,000 full-time equivalent employees to around 74,000 employees by 2022. In aggregate, the bank expects to reduce adjusted costs by approximately 6 billion euros to 17 billion euros in 2022.\nWith this transformation plan, the bank aims to reduce its cost-income ratio to 70 percent in 2022. It targets a post-tax Return on Tangible Equity of 8 percent at the Group level by 2022.\nEfficient infrastructure supporting innovation and improving controls\nDeutsche Bank is committed to investing a further 4 billion euros in improving controls by 2022. The bank will combine its Risk, Compliance and Anti-Financial Crime functions to strengthen processes and controls while also increasing efficiency.\nTo reshape and improve its long-term competitive position, the bank will undertake a restructuring of its infrastructure functions, which include back office systems and processes that support all business divisions. These functions will become leaner, more innovative and more digital.\nA separate Technology function will be created which will have responsibility to further optimize Deutsche Bank’s IT infrastructure. It will also drive the digitalisation of all businesses. This is set to boost innovation as well as further strengthen the internal control environment. The bank will make targeted investments in technology and innovation, utilising a budget of 13 billion euros by 2022.\nNotes:\n¹ Divisional figures are pro-forma for re-segmentation, preliminary, unaudited and subject to change\n² Adjusted costs are defined as total noninterest expenses excluding the impairment of goodwill and other intangibles, litigation expenses and restructuring and severance\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations \nSebastian Krämer-Bach \nPhone: +49 69 910 43330 \ne-mail: sebastian.kraemer-bach@db.com \n\nCharlie Olivier\nPhone: +44 207 545 7866\ne-mail: charlie.olivier@db.com\nInvestor Relations\n+49 800 910-8000 (Frankfurt)\n+44 20 7541-4100 (London)\n+1 212 250-0604 (New York)\ndb.ir@db.com\nFurther details will be provided at an analyst presentation on Monday, July 8, at 14:00 CEST which will be transmitted on Deutsche Bank’s website www.db.com.\nA Capital Markets Day will be held in the fourth quarter of 2019 that will cover divisional business strategies and provide an update on progress in the execution of Deutsche Bank’s strategy.\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 22 March 2019 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 4
}