{
    "url": "https://www.db.com/news/detail/20190703-2019-deutsche-bank-awards-for-creative-entrepreneurs-announced?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 3, 2019",
    "tags": [
        "Company",
        "Corporate Citizenship",
        "Culture"
    ],
    "title": "2019 Deutsche Bank Awards for Creative Entrepreneurs announced",
    "body": "Last night five winners of the Deutsche Bank Awards for Creative Entrepreneurs (DBACE) were announced, winning a share of £50,000 for their creative business. With the creative industries contributing more than £100 billion to the UK economy every year, DBACE supports young UK-based entrepreneurs driven by a mission to build and sustain social value through enterprise. The programme is part of Deutsche Bank’s global social enterprise programme, Made for Good, and has been delivered in partnership with not-for-profit creative industries incubator MeWe360.\nThe winners were revealed at a ceremony hosted by Gemma Cairney¹ (BBC Radio 1) at The Conduit in the heart of London’s West End. The five winners are:\nActivate the City! – Karen Jelenje\nEncouraging and empowering young people in Bristol to become community champions and work locally to transform vacant and redundant space that would otherwise be used for fly tipping, loitering and illegal activity. The youth-led transformations become public space to provide wider social and economic benefits in disadvantage communities.\nBlack Ballad – Bola Awoniyi & Tobi Oredein\nA subscription lifestyle media brand empowering black women globally by celebrating their culture, community and stories. By championing black female writers and creators, the Black Ballad membership provides access to content, events and experiences that rebalance the lack of representation in media.\nBukky Baldwin – Ibukun Jesusanmi Baldwin\nAn ethical fashion and textiles company based in Manchester aiming to empower marginalised communities. The brand has been collaborating with refugee and homeless charities to provide individually catered training programmes that are both practical and holistic in nature.\nMental Health The Arts – Angela Awuah\nAn early intervention creative arts academy for young people in South London between the ages of 13 and 25 with direct and indirect experience of mental illness. Educating, equipping and empowering young people to cultivate creative coping mechanisms through talks, workshops and the arts.\nPetit Pli – Ryan Mario Yasin\nDesigning out waste across the entire garment value chain by engineering versatile garments that grow as the wearer does. The garments are embedded with a patent-pending auxetic structure, which expands bi-directionally to mimic the growth of children aged nine months to four years - that’s seven sizes and seven times less waste.\n¹ Gemma Cairney is a multi-award-winning broadcaster (BBC Radio 1, BBC Radio 4, BBC Radio 6 Music), published author and production company founder.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}