{
    "url": "https://www.db.com/news/detail/20160412-combined-cycle-cogas-power-plants-for-egypt-deutsche-bank-hsbc-and-kfw-ipex-bank-structure-and-arrange-eur-3-5-billion-in-financing?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 12, 2016",
    "tags": [
        "Corporate products",
        "Investment Banking",
        "Private products",
        "Research",
        "Sustainability"
    ],
    "title": "Combined Cycle (COGAS) power plants for Egypt: Deutsche Bank, HSBC and KfW IPEX-Bank structure and arrange EUR 3.5 billion in financing",
    "body": "Over EUR 3.5 billion to finance the largest combined cycle power plants in the world\nDeutsche Bank, HSBC and KfW IPEX-Bank structure and arrange ECA-underwritten financing for 17 international banks\nGerman technology expert Siemens to deliver its latest generation of gas turbines to Egypt for the three high-efficiency power plants\nDeutsche Bank, HSBC and KfW IPEX-Bank have jointly structured and arranged the Hermes-underwritten financing for the Beni Suef, Burullus and New Capital combined cycle plants in Egypt. A consortium of 17 international banks is raising the debt capital of EUR 3.5 billion. For exporter Siemens, the Egyptian order is the biggest in the company’s history. The total investment cost for the three power plants will run to EUR 6 billion.\nTogether, Deutsche Bank, HSBC and KfW IPEX-Bank are acting as Coordinating Initial Mandated Lead Arrangers (CIMLAs) for the financing. The banks have been mandated for the project by the state-owned Egyptian Electricity Holding Company (EEHC). The CIMLAs are also acting as co-bookrunners for the syndication of the Hermes-covered finance with Deutsche Bank acting as coordinating bookrunner. KfW IPEX-Bank assumes an additional role as Hermes and Facility Agent. The coordinating bank for environmental and social project due diligence for the Beni Suef and Burullus power plants is Deutsche Bank. HSBC is acting as environmental coordinator for New Capital.\nGiven the transaction’s size and complexity the CIMLA’s swift execution has been impressive. The mandate was awarded in June 2015 following a Memorandum of Understanding signed by Siemens and Egypt at the Sharm-El-Sheikh conference in March of the same year and Egyptian President Abdel Fattah el-Sisi’s subsequent state visit to Germany. In November 2015, the loan agreement was signed for the first project in Beni Suef. March 2016 then saw the financial close for the other two power plants, Burullus and New Capital. The loans are guaranteed by the Egyptian Finance Ministry.\n\nThe core component of each of the natural gas-fired combined cycle power plants, which are to be built at three different locations across the country, will be eight latest-generation Siemens gas turbines. The H-Class, as it is known, is a maximum efficiency turbine, thus providing not only a reliable energy supply but also a greener one.\nThe three large power plants, all of the same design, will each have a 4,800 megawatt production capacity, with a combined capacity of 14.4 gigawatts. Upon completion in 2018 they will be the largest in the world. The projects will boost Egypt’s electricity production by 50% and make a significant contribution to the country’s national economic development.\n\nFor further information please contact:\nDeutsche Bank AG\nPress & Media Relations\nNicolas Nonnenmacher\nPhone: +49 (0) 69 910 41749\nE-mail: nicolas.nonnenmacher@db.com\nStuart Haslam\nPhone: +971 (0) 4 4283 860\nE-mail: stuart.haslam@db.com\nHSBC\nZeyad MOURAD\nPhone: +202 2529 1113\nE-mail: zeyad.mourad@hsbc.com\nKfW IPEX-Bank GmbH\nThomas Krick\nPhone: +49 (0)69 7431 8454\nE-mail: thomas.krick@kfw.de",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}