{
    "url": "https://www.db.com/news/detail/20160407-kemang-wa-lehulere-is-artist-of-the-year-2017?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 7, 2016",
    "tags": [
        "Art",
        "Company",
        "Corporate Citizenship"
    ],
    "title": "Kemang Wa Lehulere is \"Artist of the Year\" 2017",
    "body": "South African artist Kemang Wa Lehulere is Deutsche Bank's new \"Artist of the Year\" 2017. He will present his first institutional solo exhibition in Germany at the Deutsche Bank KunstHalle in Berlin in spring 2017.\n“Kemang Wa Lehulere is a refined artist of the highest order. He explores the relevance of the artistic gesture in post-Apartheid South Africa. In his wall drawings, collages, and complex performances, he revisits his own history and the pain of his society by creating poignant images that are never literal or explanatory, but are instead a territory to be traversed, understood, and revealed”, explains Victoria Noorthoorn, Director Museo de Arte Moderno de Buenos Aires.\nThe award is given on the recommendation of the Deutsche Bank Global Art Advisory Council which consists of the renowned curators Okwui Enwezor, Hou Hanru, Udo Kittelmann, and Victoria Noorthoorn. After Wangechi Mutu, Yto Barrada, Roman Ondák, Imran Qureshi, Victor Man, Koki Tanaka, and Basim Magdy, Kemang Wa Lehulere is now Deutsche Bank’s 8th international \"Artist of the Year“.\nKemang Wa Lehulere was born in 1984 in Cape Town, South Africa and lives in Johannesburg and Cape Town. He is perceived as one of the most important representatives of a new generation of South African artists who work in all different kinds of genres and media in order to develop new artistic perspectives and narrative modes, as well as new forms of political action. Wa Lehulere’s drawings combine allusions to the apartheid era in his home country South Africa and found pictorial material, personal memories, and texts.\nHis work echoes how traces of racism and injustice are blurred and ignored, revealing the gap between individual biography and official historiography. He realizes his performances, videos, installations, and chalk drawings, which are based on extensive research, as a solo artist whilst continuing with collaborative work. This includes projects with the South African exhibition platform Center for Historical Reenactments which was established in 2010. From 2006, he worked with the Cape Town based artist group Gugulective, which he cofounded.\nWa Lehulere’s works often have a focus on black South African history, re-looking and re-imagining the archive of narratives relating to black artists, musicians and authors in an attempt to prevent their work and lives from sinking into oblivion. Thus, his exhibition History Will Break Your Heart, that is currently touring South Africa, recalls artists such as Gladys Mgudlandlu and Ernest Mancoba. The latter is regarded as the first modern black South African artist who cofounded the artist group CoBrA in the 1940s.\nKemang Wa Lehulere has taken part in numerous international group exhibitions, including the 8th Berlin Biennale (2014), the 2nd Triennial of the New Museum in New York (2012), and the 11th Biennale de Lyon (2011). Back in 2013-14, drawings by the artist from the Deutsche Bank Collection were shown at the Deutsche Bank KunstHalle as part of the exhibition project The Circle Walked Casually.\nIn 2015, he received the Standard Bank Young Artist for the visual arts. Starting on April 16, his art will be represented at the EVA International in Limerick City, Ireland, and as of May 3 at the 12th Dak’Art Biennale in Dakar, Senegal.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}