{
    "url": "https://www.db.com/news/detail/20160406-deutsche-bank-opens-innovation-lab-in-silicon-valley?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 6, 2016",
    "tags": [
        "Company",
        "Digitalisation",
        "Entrepreneurship",
        "Research"
    ],
    "title": "Deutsche Bank opens innovation lab in Silicon Valley",
    "body": "Deutsche Bank announced today that it has opened an innovation lab in Silicon Valley, with a launch event attended by its Co-Chief Executive John Cryan on Tuesday.\nThe lab in Palo Alto will enable the Bank to evaluate emerging technologies from Silicon Valley and apply them to enhance its products, services and internal processes. It will also further strengthen the Bank’s ability to innovate, while deepening its relationships with start-ups.\nDeutsche Bank is working in partnership with IBM, which is contributing resources, expertise and relationships to the Bank-led efforts.\nThe opening follows the successful launch of innovation labs in Berlin and London last year.\nCryan and Kim Hammonds, Group Chief Operating Officer, heard elevator pitches from 15 start-ups keen to work with the Bank at the event, which was also attended by venture capital firms along with Deutsche Bank clients and technology partners.\nThe early-stage start-ups pitched a range of ideas including software that analyses data in documents, an online identity verification portal and a number of blockchain-related initiatives.\nThe Bank's innovation lab team has been active in Silicon Valley since 2014, previously working from a local start-up accelerator centre.\nThe team has met with more than 500 start-ups in the Valley, introducing those with the most promising ideas to representatives from Deutsche Bank’s business divisions to trial and develop technology solutions.\nThe three innovation labs, known as Deutsche Bank Labs, form part of the digital element of the Bank’s Strategy 2020. The Bank plans to spend up to EUR 1 billion on digital initiatives over the next five years.\nKim Hammonds, Group Chief Operating Officer of Deutsche Bank, said: “The Silicon Valley lab will help Deutsche Bank offer clients new and improved products and services, strengthen efficiency and deepen its relationships with the Valley’s innovation and investor communities.” ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}