{
    "url": "https://www.db.com/news/detail/20160406-deutsche-bank-publishes-quarterly-pro-forma-2015-results-for-new-corporate-divisions?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 6, 2016",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank publishes quarterly pro-forma 2015 results for new corporate divisions",
    "body": "Today Deutsche Bank (XETRA: DBKGn.DE/ NYSE: DB) published a Financial Data Supplement (“FDS”) which presents the view of the Bank’s 2014 and 2015 financial results in the new 1Q2016 segmental structure. From 2016 onwards and in accordance with its Strategy 2020, Deutsche Bank business operations have been organized under a new structure with the following segments:\nGlobal Markets (“GM”),\nCorporate & Investment Banking (“CIB”),\nPrivate, Wealth and Commercial Clients (“PW&CC”),\nDeutsche Asset Management (“Deutsche AM”),\nPostbank (“PB”) and\nNon-core Operations Unit (“NCOU”)\nIt is intended to report the new segment structure for the first time as part of its 1Q2016 interim financial statements on 28 April 2016.\nThe key changes compared to Deutsche Bank’s previously reported segmental information in its former 2015 segment structure are outlined below.\nGlobal Markets (GM)\nThe new segment GM includes the sales and trading related activities of the former Corporate Banking & Securities (“CB&S”) segment.\nRevenues related to certain financing activities previously included within “Loan Products” in CB&S are now included within “Sales &Trading - debt and other products”. Mark-to-market gains/losses relating to RWA mitigation on Credit Valuation Adjustment (CVA) RWA, Funding Valuation Adjustment (FVA) and certain CVA calculation methodology refinements previously reported under “Sales &Trading” revenues are now included in “Other”.\nDebt Valuation Adjustment (DVA) continues to be reported within “Other”. This category also includes transfers from and to the new segment Corporate & Investment Banking (“CIB”) resulting from client coverage and product distribution.\nCorporate & Investment Banking (CIB)\nThe new segment CIB combines the Corporate Finance business components of the former Corporate Banking and Securities (“CB&S”) and Global Transaction Banking (“GTB”) businesses. Transfers from and to the new segment Global Markets related to client coverage and product distribution are included in “Loan Products & Other”.\nPrivate, Wealth and Commercial Clients (PW&CC)\nWithin the new segment PW&CC, Deutsche Bank has combined its German and International Private and Commercial Clients (“PCC”) businesses formerly included in the Private & Business Clients (“PBC”) segment with the Wealth Management (“WM”) activities formerly included in Deutsche Asset & Wealth management (“DeAWM”). Revenues from HuaXia Bank are presented separately within PW&CC to reflect the expected disposal of this investment as part of Strategy 2020.\nDeutsche Asset Management (Deutsche AM)\nThe segment Deutsche AM contains the Asset Management activities included in the former DeAWM segment and focuses on providing investment solutions to institutions and intermediaries that serve individual clients.\nPostbank (PB)\nTo reflect the planned deconsolidation as formulated in the Strategy 2020 Postbank is now presented as a separate segment, which combines both core and non-core components of Postbank previously recorded in the NCOU segment.\nThe reported numbers in the Postbank segment will deviate from Postbank's stand-alone reporting as a consequence of e.g. consolidation effects and the impact of purchase price allocation items.\nNon-core Operations Unit (NCOU)\nAs a key change compared to the former structure the NCOU segment no longer contains the aforementioned non-core components related to Postbank.\nThe goodwill impairment losses in the 2015 results related to CB&S and PBC were allocated to the new segments Global Markets/Corporate & Investment Banking and PW&CC/Postbank respectively based on the goodwill balances related to these business units prior to the 3Q2015 impairment.\nCertain Liquidity Management activities previously included within the business segments are now being centrally managed by Treasury and therefore have been transferred to “Consolidation and Adjustments” and are reflected in the business segments on an allocated basis.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}