{
    "url": "https://www.db.com/news/detail/20160405-hella-uses-deutsche-bank-as-cross-border-renminbi-bank-to-bridge-china-and-germany?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 5, 2016",
    "tags": [
        "Corporate products",
        "Investment Banking"
    ],
    "title": "HELLA uses Deutsche Bank as cross-border Renminbi bank to bridge China and Germany",
    "body": "Deutsche Bank announced today that it has executed the first transactions under the recently implemented cross-border payment structure for Hella KGaA Hueck & Co. (‘HELLA’) to link the company’s existing Renminbi (‘RMB’) business in mainland China with HELLA’s headquarters in Lippstadt, Germany. The structure will enable HELLA to maximise the utilisation of its internal funds while reducing its foreign currency exposure.\nHELLA is a global, family-owned company listed on the stock exchange, with a history spanning more than 100 years. The company develops and manufactures lighting technology and electronic products for the automobile industry, having one of the largest retail organisations for vehicle parts and accessories in Europe*.\nSince 2008, Deutsche Bank serves over ten entities of the HELLA group in mainland China with a wide spectrum of banking services, ranging from domestic RMB cash pooling, payments and collections, and trade finance, to FX hedging and advisory.\nWith Deutsche Bank’s comprehensive solution, HELLA is now able to use accessible liquidity at group level as a stable source of funding in China, thereby providing a natural hedge for local flows while keeping flexibility and scalability for future growth. Deutsche Bank will also set up the link between the local US dollar cash pooling structure in mainland China with the global US dollar cash pool of HELLA group, resulting in improved liquidity management and reduced interest costs.\nCarl Pohlschmidt, Head of Corporate Finance and Tax at HELLA, said: “We are delighted to work with Deutsche Bank in China. The Bank’s cross-border RMB cash pooling solution will greatly benefit our global business as it maximises our liquidity utilisation and improves our intra-company financing capabilities in this important market for us. We feel that Deutsche Bank’s expertise in on- and offshore RMB business provides a significant added value to our success.”\nCarl Wegner, Managing Director, Head of Global Transaction Banking, Greater China at Deutsche Bank, added: “We are pleased to expand our relationship with HELLA, and to have the opportunity to support the company’s business growth by linking China with its headquarters in Germany. Our solid experience with local and cross-border liquidity management in Renminbi and foreign currencies to date has allowed for a smooth and efficient implementation process.”\n* Source: HELLA",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}