{
    "url": "https://www.db.com/news/detail/20180130-chief-international-economist-talks-us-tax-reform-at-davos?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 30, 2018",
    "tags": [
        "Research"
    ],
    "title": "Chief International Economist talks US tax reform at Davos",
    "body": "Torsten Slok, Chief International Economist, provided an audience at the World Economic Forum 2018 in Davos, Switzerland, with insights into the risks associated with US tax reform and what the policy means for investors.\nIn\nPDF\nUnderstanding the implications of the US Tax Reform, Slok explained that one risk is that the US tax reform may boost inflation in an economy, which is already operating at full capacity and full employment. “These are the conditions that intensify inflation pressures,” said Slok.\nThe second risk is the impact on the supply of Treasuries. “The tax package needs to be financed and the associated increase on Treasury supply comes at a time when the US Treasury supply is already rising because of increasing deficits and the Fed shrinking their balance sheets,” added Slok.\nSlok explained that an increase in the supply of Treasuries without a corresponding increase in demand for Treasuries will lead to higher interest rates and hence higher borrowing costs for the US government and ultimately for consumers and companies.\nFinally, calculations by the Joint Committee on Taxation show that the tax package may exacerbate existing trends in inequality, which could have implications for political outcomes and hence markets. Slok covers the topic of wealth inequality extensively in his recent chart book entitled\nPDF\nUS Wealth and Income Inequality, which shows that more families than ever before – an estimated 30 percent – have zero or negative non-home wealth.\nSlok wrapped up the presentation by laying out the implications these risks will likely have on investors and the markets over the coming year. In summary:\nThe Fed will hike rates four times in 2018. Higher US inflation and ECB exit from quantitative easing in Q22018 will push US and European rates higher.\nBond markets will experience a gradual increase in rates driven by US inflation and the ECB exit.\nStock markets will trend higher as a result of low rates, liquidity, deregulation and tax reform; but be cautious of populist backlash in November.\nFX markets will see the EUR/USD rising to 1.30 as European growth experiences an upside and the associated ECB exit will continue to support EUR/USD.\nCommodities will move higher with the strong support of global growth; however property bubble and problems in the financial system in China are cause for worry.\nEmerging Markets will experience imbalances since EM normally suffers from higher US rates but are helped by higher commodity prices.\nPDF\nRead all of Slok’s presentation.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}