{
    "url": "https://www.db.com/news/detail/20180125-deutsche-bank-joins-center-for-the-fourth-industrial-revolution?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 25, 2018",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "Deutsche Bank joins Center for the Fourth Industrial Revolution",
    "body": "Emerging technologies such as artificial intelligence, distributed ledger and digital trade can create a number of benefits – for both businesses and society. However, in a world that is more connected than ever, risks can emerge if policies, standards and incentives are poor.\nThe World Economic Forum’s Center for the Fourth Industrial Revolution aims to bring market participants together to ensure governance around these technologies is “stable, interoperable, predictable and transparent”. At the Annual Meeting in Davos-Klosters, Deutsche Bank was announced as a new partner.\nThere are compelling reasons to be part of the group. As financial services becomes more technology-led, Deutsche Bank needs to adapt its models and market approach to take advantage of emerging technologies. However, this must be done safely, securely and with no adverse societal effects.\nBeing part of the Center means Deutsche Bank can work alongside governments, policy makers, regulators, industry and academia to establish a framework that best enables emerging technologies. This builds on the bank’s collaboration with the start-up community through its Innovation Labs and digital groups to prototype and deliver client outcomes.\n“Digital innovation is central to the bank’s growth and our service to clients,” said Kim Hammonds, Group Chief Operating Officer. “Emerging technologies are already transforming our industry and banks are on a journey to becoming platform companies. Being involved in the Center for the Fourth Industrial Revolution will position us to drive and influence the rules and standards that govern this exciting space.”\nSet up in San Francisco, the Center’s existing corporate partners include Accenture, Huawei, Microsoft, Salesforce and SAP.\nMore information can be found on World Economic Forum website.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}