{
    "url": "https://www.db.com/news/detail/20180123-john-cryan-bangs-the-drum-for-a-strong-europe?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 23, 2018",
    "tags": [
        "Company",
        "Corporate products",
        "Private products"
    ],
    "title": "John Cryan bangs the drum for a strong Europe",
    "body": "Even the gale-force winds raging across Germany could not dampen the good mood at the Deutsche Bank reception in Berlin. But CEO John Cryan’s speech also made it clear that not everything is ideal in Germany and Europe. He stressed that Germany’s input is essential to achieving a strong European Union. The “feared wave of victories for anti-European sentiment” failed to materialise at the elections held in many EU countries in 2017. But now it is all the more important that policymakers find clear answers to the issues for the future of the “European project“, according to Cryan.\nHis call was undoubtedly well received by one high-ranking guest from Brussels in particular: European Commissioner Günther Oettinger was one of the 500-plus guests at the event. Oettinger, who is highly influential on European budgetary matters, altered his schedule at short notice in order to attend. He joined the numerous businesspeople present and an array of representatives from the worlds of politics, associations, media, academia and culture. Many guests also expressed their appreciation that so many senior managers and Management Board members were also in attendance. Besides John Cryan, Christian Sewing and the members of the management of the East Region as the official hosts, Supervisory Board Chairman Paul Achleitner and Management Board members Kim Hammonds, Sylvie Matherat, Marcus Schenck and Karl von Rohr also participated in the reception.\nIn his speech Cryan also made his position clear on the exploratory talks about forming a new government, stating that Germany was still coping quite well with the protracted efforts. “Sooner or later, however, too many political question marks will prompt companies to postpone their long-term investments,” he said. At the same time he welcomed the importance attributed to Europe in the exploratory talks document drawn up by the CDU, CSU and SPD. The numerous members of parliament and federal policymakers – headed by economics minister Brigitte Zypries – listened attentively as Cryan cited two principles that could make Europe a model: “we are stronger politically and economically than when we act alone”, was his first assertion, referring to Europe's negotiating position as it competes with other economic blocs. And secondly, he argued that as much as possible has to be decided at the local level, where people live – and thus advocated stronger backing for the principle of subsidiarity. Otherwise voters would continue to turn their backs on Europe.\nCryan spoke out in favour of key solutions in areas that they would strengthen Europe as a whole, citing security policy, monetary policy – including financial market policy – and other business issues such as digitalisation. In this context Cryan praised the dynamic start-up scene in Berlin. One of the prerequisites for European start-ups to become internationally competitive in the platform economy era is better access to capital, he asserted. Not only is the venture capital situation not fully developed, the capital market lacks the kind of depth needed to float young companies on the stock market with the same success we regularly see in the US.\nWhat role does Deutsche Bank play in this context? We want to be the leading European bank with global reach. And addressing clients and guests, Cryan added: “We want you to benefit from a bank that is taking an active part in shaping the financial world of the future.”\nGuests were able to see and hear for themselves that the bank’s business activities deliver benefits to society and in a sustainable fashion: the lighting concept in the atrium for the reception was “PositiveImpact”. In this vein, Cryan’s speech was followed by a film about Steiff, the traditional Swabian toymaker, which exemplified how the bank’s roots are woven into the very fabric of the German economy.\nIn his welcoming address, Harald Eisenach, Spokesman of Regional Management, drew attention to a shining example of the bank's corporate social responsibility: Deutsche Bank KunstHalle, to which guests had free admission for the duration of the reception. By moving the KunstHalle into the Prinzessinenpalais Unter den Linden in summer 2018 the bank will make its activities in Art, Culture and Sports accessible to a much wider audience.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}