{
    "url": "https://www.db.com/news/detail/20181105-deutsche-bank-launches-yunar-app?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 5, 2018",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "Deutsche Bank launches \"Yunar\" app",
    "body": "Yunar makes loyalty schemes easy to use – heart of the “mobile wallet” of tomorrow\nYunar brand has its own management, its own team and its own IT, but no bank balance sheet\nThe objective: faster expansion of the digital platform offering\nNew “Digital Ventures” unit within the Private & Commercial Bank\nDeutsche Bank is launching the Yunar app on November 6, 2018. Starting with a basic version as a free digital platform offering, it will make loyalty schemes easy to use. By adding other banking and non-banking services Yunar is intended to gradually become the mobile wallet in the customer’s pocket. Yunar will therefore be continually upgraded with new functions and products, taking into account what customers want and how they use the app from day to day.\nThe start-up behind the Yunar brand is a wholly owned subsidiary of Deutsche Bank, with its own management, its own IT and an initial staff of around 80 people. The new company does not require a banking balance sheet, as is the case with many fintechs. Subject to the approval of the relevant regulatory authorities, it will hold a so-called ZAG licence – authorising it to provide payment services. It aims to accelerate the launch of digital innovations which go beyond the traditional banking business.\nIn Germany Deutsche Bank’s Private & Commercial Bank has 20 million clients, of whom more than 10 million use the bank’s products and services via PC, tablet and smartphone. Yunar is part of the Private & Commercial Bank’s new “Digital Ventures” unit, where the offerings for new client groups and markets will be bundled in future. One of its tasks is to rapidly develop the bank’s digital platform.\nOn the launch of Yunar, Markus Pertlwieser, Chief Digital Officer (CDO) of Deutsche Bank’s Private & Commercial Bank and Head of the Digital Ventures business, said: “This app will give a further boost to the expansion of our platform offering. Fresh ideas that make life easier for banking clients will be implemented faster in future, regardless of whether we act on our own or together with partners.”\nThe Yunar brand name is derived from “yuna”, the Celtic word for desire.\nAt the same time, Yunar is also an allusion to the phrase “you know”. The brand name is thus intended to emphasise that Yunar knows what customers want and fulfils these desires.\nThe basic version of Yunar will enable users to manage their customer loyalty cards on their mobile phone. The app allows users to collect points for up to 200 loyalty schemes that are widely used in Germany, including Payback, DeutschlandCard, BahnBonus, Miles & More, Ikea, Douglas and Karstadt. For some of the schemes, the app will also be able to show previously collected points, which means users will no longer need to use their physical loyalty cards.\nYunar will therefore satisfy the key criteria of the platform economy from the very beginning: It is free, available everywhere and relevant to users’ daily lives.\nBanking services such as mobile payments or multibank aggregation or even non-banking services such as digital identification may be added, ultimately making it a mobile wallet. This would be the first time that customers have one-stop access to all services related to their loyalty schemes, payments and bank account. If in future all the data from popular loyalty schemes were to be linked to the user’s payment information, this would make the offering unique. Yunar could then suggest which loyalty schemes the user should consider or also provide advice on how points that have been collected could be used.\nBy starting with loyalty schemes the new app can tap straight into a market with millions of potential users. Three-quarters of the German population are members of a loyalty scheme, while the majority of them (73 percent) have cards from more than three loyalty schemes.\nMarkus Steiff, member of the Management Board of Yunar, said: “With Yunar we are truly relevant for customers in their daily lives. We are helping them to save money easily and conveniently and to be able to afford more. Yunar is smart, simple and convenient for users and a cornerstone of the bank’s platform business model.”\nWith Yunar, Deutsche Bank is initially targeting a digital savvy demographic which traditional banks now find it very difficult to turn into regular customers. The focus in the early years will be on rapidly growing the number of active users. From tomorrow Yunar will be made available to an initially limited number of users. The basic version will be continuously developed by incorporating user experience and feedback. In Q1 2019 the app will be made generally available in the iOS App store and the Google Play Store. The Yunar website will be launched on November 6.\nFor further information please contact:\nDeutsche Bank AG\nMedia contact\nChristoph Blumenthal\nTel.: +49 69 910 47048\nEmail: christoph.blumenthal@db.com\nHeinrich Frömsdorf\nTel.: +49 69 910 47680\nEmail: heinrich.froemsdorf@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}