{
    "url": "https://www.db.com/news/detail/20181102-deutsche-bank-results-of-2018-eba-stress-test?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 2, 2018",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Deutsche Bank: Results of 2018 EBA Stress Test",
    "body": "Deutsche Bank’s capital position was stronger in the EBA’s 2018 EU-wide stress test than in previous years. In the 2018 stress test, Deutsche Bank’s Common Equity Tier 1 (CET 1) ratio was 13.5% under the EBA’s ‘baseline’ scenario at the end of the stress horizon in 2020, up from 12.1% in the 2016 stress test. In the hypothetical ‘adverse’ scenario, the CET1 ratio would be 8.1%, up from 7.8%.\n“The stress test makes clear: Our risk profile is strong, but our profitability is not. This is exactly where our focus is now”, said James von Moltke, Chief Financial Officer. “Despite a more severe adverse scenario than two years ago, we show greater resilience across market, credit and operational risk. We have the liquidity and capital resources to support profitable growth.”\nThe stress test was carried out under a common methodology and applying a static balance sheet assumption as at 31 December 2017. It therefore does not take into account future business strategies and management actions. The following items collectively represent approximately 1% of capital ratio depletion in the ‘adverse’ scenario:\n\u009d— The stress test assumes that a material portion of the trading losses that arose in 2016 from the de-risking of the bank’s Non Core Operations Unit (NCOU) would recur in each year until 2020. This is despite the fact that NCOU was closed at the end of 2016 with over 90% of its de-risking completed;\n— A one-time loss on the partial sale of the bank’s retail operations in Poland, taken in the fourth quarter of 2017, is assumed to recur three times. In addition, the assets related to these operations and associated stress losses continue to contribute to the capital depletion;\n— Losses on certain risk hedging positions are not assumed to be offset by corresponding gains in the underlying positions being hedged. This increased market risk losses and contributed to capital depletion in the ‘adverse’ scenario.\nThe 2018 stress test found that at the end of the stress horizon in 2020, Deutsche Bank’s CRD 4 leverage ratio (fully loaded) would be 3.7% in the ‘baseline’ scenario and 2.6% in the ‘adverse’ scenario. This includes an impact of approximately 0.3% from the three above-mentioned factors impacting capital ratio depletion. The result of the stress test does also not reflect Deutsche Bank’s reduction of leverage exposures by approximately 90 billion euros during 2018 to date.\nAs at 30 September 2018, Deutsche Bank’s leverage ratio was 4.0% on a fully-loaded basis, up 0.2% from 31 December 2017, and 4.2% on a phase in basis. The bank has reaffirmed its goal of raising this ratio to 4.5% over time.\nFor further information please contact:\nDeutsche Bank AG   \nMedia Relations\nChristian Streckert\nPhone: +49 69 910 38079\nE-mail: christian.streckert@db.com\nInvestor Relations\n+49 800 910 8000 (Frankfurt)\n+44 20 7541 4100 (London)\n+1 212 250 0604 (New York)\ndb.ir@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}