{
    "url": "https://www.db.com/news/detail/20181220-the-urban-future-of-africa-and-how-it-matters-for-bank-business?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 20, 2018",
    "tags": [
        "Africa",
        "Corporate Citizenship",
        "Corporate products",
        "Sustainability"
    ],
    "title": "The urban future of Africa",
    "body": " Africa is the epicentre of global urbanisation and many of its cities will experience unprecedented economic growth in the coming decades. Today, 42 percent of Africans are urban dwellers, about 500 million people. In the next few decades this number will swell to over 1.4 billion. Nigeria’s cities alone will accommodate 189 million more people. Ethiopia is speeding from a predominantly rural economy to an urban one, with Addis Ababa growing at an annual rate of about 4 percent – twice the rate of Beijing or Jakarta.\nThis transition will undoubtedly result in considerable challenges including demand for employment, services and infrastructure. At the same time, it presents significant opportunities to enable structural transformation, if well planned, managed - and financed. How can better international investment, urban design and management help Africa’s continued urbanisation become a catalyst for productivity growth, rather than an extension of rural poverty?\nThe Urban Age\nThis is where Deutsche Bank's Urban Age project by Alfred Herrhausen Gesellschaft steps in. For 15 years it has conducted a worldwide investigation into the future of cities. It has been established as one the most authoritative and respected research, outreach and educational centres and networks in the urban field.\nThe 17th Urban Age conference in Addis Ababa in November brought together policymakers, urban experts from Africa and across the world to debate on the development of cities in rapidly urbanising countries: what are core challenges confronting city leaders, investors and civic institutions in Africa? How will governments mobilise international and domestic resources to fund expenditure, increase tax-collecting powers and boost revenues?\nHousing for all\nNational housing programmes in Mexico, South Africa, India, Pakistan and Singapore have delivered mass housing in recent decades. What lessons can be drawn for Africa cities rushing to deliver much-needed shelter?\n100,000 housing units are built annually in Nigeria; 700,000 are required. \"Affordable homes are not adequate. And adequate homes are not affordable,\" Gautam Bhan, Lead, Academics and Research, Indian Institute for Human Settlements, Bangalore, said at the conference. Housing, once considered a development asset, has largely become a speculative asset, and remains generally unaffordable in both the developing and developed world with 1.5 billion people living in inadequate housing in 2016 globally.\nAfrica’s urban housing deficit is accompanied by a huge infrastructure deficit. The continent lags behind the rest of the world in access to electricity, internet penetration and access to improved water, and has large road maintenance needs. West Africa has lower road density and road quality than other regions.\nIn Addis Ababa, the economic base and the revenue the city generates cannot provide sufficient infrastructure (transport, power, sewerage, water) and services (health, sanitation) to the growing population. The current infrastructure can serve approximately half of the current population, estimated at more than four million.\nSamih Sawiris, Chairman of Orascom Development Holding GA, said: \"Slums are on valuable land and often single storey. In Senegal we built up, freed up land for rentable buildings and housed everyone on the same land. Addis Ababa could do the same, as could many other cities.\"\nInfrastructure investments\nAs a continent, Africa’s infrastructure patterns have historically focused on connecting resources and commodities to global markets, rather than people and ideas. A potential that China identified early: Now the country is playing a critical – and controversial – role in creating a new generation of infrastructure in Africa with potentially transformative impact. Among other forms of investment, the growing superpower is replacing and extending some of the railways built by British, French and Portuguese colonial governments to connect places in Nigeria, Kenya and Ethiopia.\nIn the last two decades Africa has seen significant growth in infrastructure investment, with an increasing share of private sector finance relative to official development assistance, including growing investment by China. The introduction of modern railways in Ethiopia would have been impossible without the financial, technical and managerial support of other countries. While this initially included the EU, Brazil, Turkey and India, it is China which emerged as the most committed.\nLoans from Exim Bank of China covered 60 percent of the initial 400 million dollar financing requirements for the Addis LRT11 line and 70 percent of the initial costs of 3.4 billion dollars for the Addis–Djibouti line. By 2014, Ethiopia had become the second-largest recipient of Chinese credit in Africa after Angola, with loans totaling 12.2 billion dollars.\nFinancing urban futures\nThe annual financing requirement for infrastructure investment in Africa, excluding North Africa, is estimated at 93 billion dollars. With rapid urbanisation and growing cities, countries will need to simultaneously catch up with the backlog, invest for the growing population and spend on maintenance.\nAccording to the African Development Bank, two-thirds of the investments in urban infrastructure needed between now and 2050 have yet to be made, and extensive informal housing will require some form of upgrading. But can the grace of an incremental growth narrative be afforded to African cities? How will governments mobilise international and domestic resources to fund expenditure, increase tax-collecting powers and boost revenues?\nThere is a very narrow window of opportunity to help plan and design this future. The world’s infrastructure will more than double in the next 20 years. These investments will determine whether we have cities where we can move and breathe. Let's act.\n13 cities: four continents\nAlfred Herrhausen Gesellschaft’s Urban Age has held conferences in 13 cities across four continents to better understand the complex dynamics of contemporary urbanisation. Some of our achievements:\nA new bus rapid transit system in Johannesburg grew out of a presentation by the Mayor of Bogotá at the Urban Age conference in South Africa.\nThe new President of Mexico Enrique Pena Nieto acknowledged how important it was to coordinate metropolitan and regional government at the Mexico City Urban Age event.\nRahm Emanuel, the Mayor of Chicago, recognised that his economic policy was inspired by ideas generated at the Chicago Global Metro Summit.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}