{
    "url": "https://www.db.com/news/detail/20181211-deutsche-bank-capital-introduction-survey-confirms-alternative-ucits-strategies-are-standing-the-test-of-time?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "December 11, 2018",
    "tags": [
        "Capital markets",
        "Investment Banking"
    ],
    "title": "Deutsche Bank Capital Introduction Survey confirms alternative UCITS strategies are standing the test of time",
    "body": "Deutsche Bank today published its biennial Alternative UCITS Survey, with its findings suggesting that the alternative UCITS market is set for further growth. Over half of the responding alternative UCITS allocators are planning to increase their allocation through September 2019. Deutsche Bank estimates that these investors collectively will invest USD13.7bn in new capital to alternative UCITS, having already invested USD9.5bn in the first three quarters of 2018.\nThe Alternative UCITS survey, which complements the annual Deutsche Bank Alternative Investment Survey, was completed by 154 global hedge fund allocators with 114 of these already allocating to alternative UCITS. These 114 allocators collectively manage and/or advise USD600bn of hedge fund assets and USD150bn of alternative UCITS assets, representing 40% of the USD374bn overall assets of the alternative UCITS industry.\nMarlin Naidoo, Global Head of Capital Introduction & Hedge Fund Consulting commented: “We expect to see more alternative UCITS launches in 2019 in response to investor appetite. Furthermore our survey results show that demand for Asia dedicated strategies far outweighs supply, this should be a signal for fund managers focused on the region to consider launching an alternative UCITS version of their offshore hedge fund product(s).”\nMurray Wilson, Head of European Equities Distribution said: “UCITS will continue to be a key growth driver for the fund management industry. Firms looking to grow their alternatives business through capital raising in Europe should ensure they have a UCITS business plan in place and that they are working with the right partners to execute this.”\nOther highlights of Deutsche Bank’s 2018 Alternative UCITS Survey:\nMinimum fund AUM requirements are trending downwards…\nAlthough the percentage of UCITS allocators who have minimum AUM requirements has remained almost unchanged when compared to 2016, there is a clear downward shift in the magnitude of these requirements. The percentage of investors who require a minimum AUM of less than USD50m has increased to 24% from 15% in 2016. At the same time, the percentage of investors who require AUM of over USD50m has fallen from 43% to 35% over the same period\n…However, investors want to see longer track records\nThe proportion of allocators who require a track record of over 2 years has increased more than threefold to 26% from 8% two years ago.\nAsia alternative UCITS strategies increasingly popular but difficult to source\nAsia alternative UCITS strategies have seen a significant increase in popularity over the past two years. 25% of investors are planning to allocate to Asia, up from 15% in our 2016 survey. The percentage of investors reporting that they struggle to source Asia including Japan strategies has doubled in the past 2 years from 19% to 39%.\nESG is a focus\nAnother theme from this year’s survey is that 29% of respondents are looking to increase their allocation to Environmental Social and Governance (ESG) strategies within an alternative UCITS format. Furthermore, with 21% expecting to allocate to offshore funds of the same nature, ESG is the most sought after offshore strategy among the survey’s respondents.\nPerformance\nThe majority of respondents indicated that they were likely to increase their allocation, despite 62% stating that they felt their UCITS allocations had underperformed year to date.\nRisk Premia\nNearly half of responding investors currently allocate to alternative risk premia UCITS funds. Of these investors 59% expect to increase their allocation in the next twelve months, with almost a third expecting this increase to be over USD100m.\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\n  MEDIA CONTACTS\nRupert Trefgarne: +44(0)20 7541 5635; rupert.trefgarne@db.com\nOlayinka Fadahunsi: +1(212)250-8159; olayinka.fadahunsi@db.com\nMia Popplewell: +852 2203 7077; mia.popplewell@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}