{
    "url": "https://www.db.com/news/detail/20181210-us-economists-look-at-2019-and-beyond?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 10, 2018",
    "tags": [
        "Investment Banking",
        "Research"
    ],
    "title": "US economists look at 2019 and beyond",
    "body": "Citing Federal Reserve Chair Jerome Powell, who recently observed that the performance of the US economy is a “testament to the fact that we remain in extraordinary times”, Deutsche Bank’s team of US economists agree with this assessment as they issue their outlook for 2019 and beyond.\nLed by Peter Hooper, Global Head of Economics, the team contends that while risks to this “extraordinary” outlook remain, the bank expects the current expansion –which is set to become the longest on record next year – to continue for several years to come. Deutsche Bank does, however, forecast a few downward tweaks in growth, inflation and the Fed funds rate.\nThe bank’s 2019 growth forecast has edged lower by a tenth, primarily due to the front-loading of tighter financial conditions and some slowing in global growth momentum. A more substantial revision to Deutsche Bank’s outlook comes in 2020, where the team has lifted their forecast by half a percent to 1.8%, due to a gentler Fed hiking cycle in 2019 and a more supportive fiscal impulse. A first look at 2021 sees growth slowing further to 1.6%.\nPerhaps the most extraordinary feature of this expansion has been continued impressive labor market performance coupled with modest inflation pressures, said the note.\nBut this feature is not a permanent one. With the economy supported by solid consumer finances and some fiscal stimulus, the bank expects a strong labor market to continue in 2019, moving the unemployment rate to 3.4%, its lowest level since 1953. In this light, early signs that growth will slow is actually good news: the rate of expansion will eventually need to move below potential in order to allow the unemployment rate to drift higher and avoid a serious overheating of the economy further down the road. The forecast sees unemployment rising to 3.8% in 2020 and 4.3% in 2021.\nCore inflation is still expected to rise above the Fed's target in 2019, however the increase will be more modest than previously projected. Helping to offset some of the tailwind from a tight labor market in the near term will be recent softer inflation data, the lagged effects of the strength of the US dollar, and some downside risk from weaker health care inflation. Core PCE (Personal Consumption Expenditures) inflation is now expected to rise to 2.2% in 2019 and 2020, and moderate slightly in 2021.\nWith the labor market beyond full employment and inflation slightly above the Fed's target, we still expect the Fed to move to a restrictive stance in 2019, but the path to that point has changed, the note said.\nThe bank now anticipates three rate hikes in 2019 instead of four, with the Fed most likely taking a break from their gradual quarterly pace of tightening in Q3. That should be followed by one last rate increase in 2020, leaving our terminal rate for this cycle unchanged at 3.4%. Balance sheet unwind, which has been on autopilot to this point, could reach its endpoint in late-2019.\nTwo other factors that are tending to moderate growth are trade policy and housing. On trade, our economists expect that higher tariffs on imports from China will not go into effect until around the middle of next year, as the Administration has essentially called a “cease fire” on further measures while negotiations are underway for the next 90 days. They go on to say that “while the recent agreement to suspend any further measures is a modest positive, we believe the uncertainty will continue to weigh on business spending until a more concrete and long-lasting agreement is reached.” For this reason, the bank’s outlook on capital spending growth remains conservative. At the same time, the absence of any significant overinvestment in business capital also reduces the chances of a serious economic downturn any time soon.\nThe outlook for housing remains muted, thanks to rising mortgage rates, declining affordability, and various supply constraints in that market. At the same time, the absence of any significant overbuild of homes and the persistence of very low vacancy rates nationally say that the chances of a significant downturn in homebuilding – one of the normal drivers of recessions – are quite low.\nFor more information on Deutsche Bank Research, visit db.com.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}