{
    "url": "https://www.db.com/news/detail/20181203-deutsche-bank-pioneers-win-risk-magazine-s-quantitative-research-team-of-the-year-award?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 3, 2018",
    "tags": [
        "Awards",
        "Company",
        "Digitalisation",
        "Research"
    ],
    "title": "Deutsche Bank \"pioneers\" win Risk magazine's Quantitative Research Team of the Year award",
    "body": "A Deutsche Bank team adapting artificial intelligence (AI) techniques used in driverless cars to help investors pick stocks has been named Risk magazine’s Quantitative Research Team of the Year. Awarding the accolade for the second year running, Risk highlighted the team’s recently-launched a-DIG tool, which helps investors analyse intangible information about a specific company, such as press coverage, patent filings and court documents to gain a more complete picture of a stock.\na-DIG uses a machine learning technique called Natural Language Processing, which helps driverless cars read street signs etc., to “understand” and evaluate written content such as a news article - and calculate an investment score for investors to use alongside traditional financial analysis.\nOne portfolio manager told Risk that the tool – which has 1,000 users and covers 5,000 stocks – is “the most sophisticated use of artificial intelligence to extract meaning from documents that I’ve seen across the Street”. The tool also scores companies against United Nations Sustainable Development Goals – a set of targets for improving global health, education and sustainability that are increasingly factored into Environmental, Social and Governance (ESG) investment decisions.\nAndy Moniz, dbDIG Chief Data Scientist, likens using a-DIG to a new form of “mosaic investing”, the name used in the past to describe collecting information about companies from multiple sources. Complementing its work with AI, the team was praised for wider work including creating a unique database to understand how exchange-traded fund (ETF) flows affect stock prices. The Cross-Asset Quant team, led by Caio Natividade, was described by one client as “one of the best on the street” and “pioneers” by another.\nSpyros Mesomeris, Head of Quantitative and QIS Research, said: “We want to build on our strength in quantitative research across asset classes, but also to grow more broadly, particularly through leveraging the power of artificial intelligence and data science in other areas – in company research, macroeconomic research and fixed income research.” Summing up a successful year for the team, one money manager gave perhaps the highest compliment in investment research: “They produce research I can act on.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}