{
    "url": "https://www.db.com/news/detail/20210527-deutsche-bank-completes-successfully-two-tranche-2-5-billion-us-dollar-debt-issue?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 27, 2021",
    "tags": [
        "Capital markets"
    ],
    "title": "Deutsche Bank completes successfully two tranche 2.5 billion US dollar debt issue",
    "body": "Deutsche Bank has extended its track record of successful capital market activity in 2021 by issuing two tranches of US dollar-denominated debt. The Treasury Issuance team yesterday completed the issue of 1 billion dollars of 3-year senior preferred debt and 1.5 billion dollars of eleven-year senior non-preferred debt which is callable after ten years.\nRecord demand …\nThe bank saw high demand for these issuances, against a backdrop of our strong first-quarter financial performance, delivery on transformation, and increasing recognition from investors, analysts and rating agencies. Demand for the senior preferred instrument was 4 billion dollars, while for the senior non-preferred issuance demand was over 8 billion dollars, the bank’s highest ever order book for this class of instrument.\n… enables pricing at favourable rates\nStrong demand enabled the bank to issue at very favourable rates. The senior preferred instrument priced at only 60 basis points over US Treasuries. The senior non-preferred instrument priced at 148 basis points over Treasuries - an improvement of around 50% over our last issuance in the this class only eight months ago, which was issued at 287 basis points above Treasuries. We also continued to close the gap on our peers, and took advantage of more supportive US dollar market conditions, which currently offer a discount of roughly 20 basis points versus markets for euro-denominated debt.\nA high quality order book, including record demand from Asia\nThe order book showed both quantity and quality. The issuance attracted over 400 orders and over 280 different investors, the highest number for some years. This includes numerous new investors which reflects broad-based and widening demand for Deutsche Bank paper. Orders included over 700 million dollars of demand from Asian investors, the strongest-ever demand for Deutsche Bank US dollar issuance from the Asia-Pacific region.\nA string of successes in 2021\nThis issuance comes on the back of a string of successful capital raisings in 2021 to date. So far this year, the Treasury Issuance Team has carried out nine benchmark-size transactions, in three currencies. In total, the bank has raised over 11 billion euros, and attracted total demand of some 35 billion euros. We have already completed more than 70% of our full-year 2021 funding plan, boosting the bank’s capital strength and thereby supporting our ability to stand by clients in a still-uncertain economic environment.\nDixit Joshi, Group Treasurer, commented: “I am very pleased at the success of this issuance, which builds on our recent successful issues of Additional Tier 1 and Tier 2 capital and extends the progress we’ve made so far this year. This enables us to support clients with our capital and balance sheet strength, and brings bottom-line benefits for Deutsche Bank in the form of lower funding costs. Across the world, we’re seeing growing recognition in the capital markets for our progress in the transformation of Deutsche Bank. Our investors are key stakeholders and we’re grateful for their support.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 5
}