{
    "url": "https://www.db.com/news/detail/20210526-deutsche-bank-sustains-position-as-top-two-arranger-of-sovereign-supranational-and-agency-debt?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 26, 2021",
    "tags": [
        "Capital markets"
    ],
    "title": "Deutsche Bank sustains position as top two arranger of sovereign, supranational and agency debt",
    "body": "Deutsche Bank has significantly increased its market share in sovereign, supranational and agency (SSA) debt origination in 2021, arranging almost 7 percent of issuance, up from 4.6 percent year on year, and resulting in a five-place gain in the league table to second position. In supranational and agency debt origination alone, the bank has arranged more than any other bank, securing a 7 percent market share, up from 5.18 percent in the same period last year (source: Bond Radar).\nThe market has seen the equivalent of 619 billion US dollars of issuance across SSAs so far this year, just 7 percent up on last year but up 60 percent from 2019, demonstrating the fact funding programmes have remained elevated in the wake of the pandemic in order to fund Covid rescue plans. In addition, the EU and CADES (French government bonds) have contributed significantly to the supply over the past year compared to the first quarter of 2020 when they issued virtually zero.\nCommenting on the bank’s sustained growth in SSA market share, Panos Stergiou, Head of Institutional Clients Group FIC EMEA, Global Head of ICG Macro Sales and Head of the SSA Coverage Group, said: “The significant gains in market share reflect the teamwork and dedication across our SSA network within the bank. SSA clients are core to our strategy and, given the environment and high levels of activity, it is very pleasing and important Deutsche Bank can be a partner to our clients on issuance and also distribution.”\nDeutsche Bank has also displayed impressive gains in sovereign debt origination, where the bank has climbed to fifth position from 14th with a 6.4 percent market share. In April Deutsche Bank arranged a 6.5 billion euro dual tranche bond for the Republic of Austria, the second highest notional ever raised by the Republic in a single syndication. Later that month the bank was duration manager on a 3.5 billion euro dual tranche offering for the Republic of Italy, which was the first dollar-denominated bond offering from a European sovereign this year.\nNeal Ganatra, Head of DCM Syndicate SSA, said: \"Despite an abundance of issuance this year, investor demand has remained rife and issuers have seen little difficulty clearing extremely sizeable transactions in euros and dollars. As well as arranging a significant volume of ESG issuance for SSA clients, Deutsche Bank has also kept its focus on the more traditional landmark issuances allowing us to increase market share by almost 50 percent.”\nLast week Deutsche Bank emerged as the number one underwriter of EU social bonds after arranging a 14.137 billion euro dual tranche bond under the EU’s SURE programme. Earlier in the year the bank arranged a 14 billion euro dual tranche bond, the forth transaction in the EU’s programme.\nAchim Linsenmaier, Head of DCM Origination SSA, said: “We are seeing particular growth in ESG SSA issuance, with volumes so far this year at 187 billion US dollars, more than twice that of last year. As well as leading three of the EU’s seven SURE transactions, Deutsche Bank was proud to have led the 2 billion euro green bond from Societe du Grand Paris and the International Finance Facility for Immunisation Company’s (IFFim) 750 million US dollar vaccine bond, their second largest transaction ever.”\nOther bonds Deutsche Bank has issued for SSA clients so far this year include a 2.5 billion 10-year benchmark bond for Quebec, the issuer’s largest euro issuance to date which was met with a record orderbook in excess of 6.6 billion euros; and a 1.75 billion euro sustainable development bond for the International Development Agency, the issuer’s second euro transaction and first venture into the longer end of the euro curve.\nDominik Horn, Head of SSA and covered bonds trading, said: “Seeing Deutsche Bank climb these rankings at such speed is a tremendous achievement and the result of fantastic collaboration across the bank. Our traders are consistently there to provide liquidity to our clients, both issuers and investors, especially through periods of market turbulence. Clients know we are serious about our commitment to SSAs and I am confident we can continue our recent trajectory with this business.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 6
}