{
    "url": "https://www.db.com/news/detail/20210520-deutsche-bank-establishes-esg-centre-of-excellence-in-singapore?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Singapore, May 20, 2021",
    "tags": [
        "Asia-Pacific",
        "Sustainability"
    ],
    "title": "Deutsche Bank establishes ESG Centre of Excellence in Singapore",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today announced the establishment of an ESG Centre of Excellence (COE) in Singapore.\nThe ESG COE will work across all the business divisions of Deutsche Bank, focusing on execution of ESG transactions, new product development, and advisory services, including sharing of global best practices with Asian regulators and regional bodies such as ASEAN and APEC. It will also focus on innovation at the nexus of ESG and Fintech to develop new products addressing gaps in the ESG market, including impact monitoring, data management and payments to un-banked communities.\nThe ESG COE will house a sizable team with deep ESG expertise and work with coverage and product teams to implement the following activities and programs:\nCore Activity: ESG transactions across all business divisions, including Investment Bank, Corporate Bank, International Private Bank and Asset Management (DWS)\nESG Leadership Lecture Series in partnership with academic institutions\nESG Fellowship Program for graduate students at top global MBA programs\nESG Internship Program for undergraduate students at top global universities\nPartnership with research institutions and global think tanks on ESG research\nESG Policy Seminars for sovereign & sub-sovereign governments\nDeutsche Bank Head of ESG for Asia Pacific Kamran Khan said: “The transition of Asia towards sustainable practices requires ESG transaction models, products, solutions and regulatory measures which meet international standards while supporting on-the-ground realities in Asia. By establishing this ESG Centre of Excellence in Singapore, we aim to set standards for evidence-based, data-driven transactions which can substantiate ESG impact and support sustainable growth.”\nMAS Assistant Managing Director (Development and International) Gillian Tan said: “MAS strongly supports the establishment of Deutsche Bank’s Asia Pacific ESG Centre of Excellence in Singapore. It is a welcome addition to Singapore's growing sustainability and green finance ecosystem. The Centre of Excellence will leverage innovation to accelerate Asia’s transition to a sustainable future. The COE’s goal to facilitate industry knowledge transfer will help to deepen the pool of specialized talent and capabilities in Singapore.”\nDeutsche Bank Asia Pacific CEO Alexander von zur Muehlen added: “Establishing the ESG Centre of Excellence in Singapore provides a strategic and operational platform for Deutsche Bank to become the premier client-focused ESG bank in Asia Pacific. Our investment in building world-class in-house ESG expertise, complemented by our well-known structuring and placement capabilities, is delivering exponential growth in our ESG business.”\nSustainability is a core pillar in Deutsche Bank’s transformation strategy, and the bank is committed to supporting clients as they transition for the zero carbon economy. The bank has committed that by 2025 its total volume of sustainable financing and investments will be at least EUR 200bn, and that its operations will be powered entirely by renewable energy sources. Last month, the bank became a founding member of the new Net Zero Banking Alliance, committing to align the operational and attributable emissions from its portfolio with pathways to net-zero carbon by 2050 or sooner.\nIn Asia Pacific, the bank is breaking new ground by partnering with clients on a host of innovative and award-winning transactions, including the world’s first green hedge based on a specially designed green hedge framework, Asia’s first FX forward using ESG performance targets, and the first Panda Bond aligned with the UN Sustainable Development Goals.\nFor further information please contact:\nDeutsche Bank AG\nCommunications\nAmy Chang                                                 Sarah Stabler\nPhone: +852 2203 8434                             Phone: +65 6423 8413\nEmail: amy.chang@db.com                        Email: sarah.stabler@db.com",
    "number_of_ratings": 5,
    "rating": 3.4,
    "likes": 19
}