{
    "url": "https://www.db.com/news/detail/20210519-pandemic-prompts-private-banking-clients-to-turn-to-esg-for-positive-impact-and-risk-management-survey-finds?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 19, 2021",
    "tags": [
        "Sustainability"
    ],
    "title": "Pandemic prompts private-banking clients to turn to ESG",
    "body": "Private-banking clients are increasingly taking environmental, social and governance (ESG) factors such as biodiversity into account as the COVID-19 pandemic has raised their desire to invest in line with their values and to manage potential risks in their portfolios, according to a major survey by Deutsche Bank.\nThree quarters of the 2,130 clients surveyed around the world by the Chief Investment Office (CIO) of Deutsche Bank’s International Private Bank (IPB) said their investments should have a positive impact and 57 percent said the pandemic had contributed to that view.\nJust over half – 51 percent – said that investing based on ESG can help manage risk in their portfolios and 74 percent said the pandemic has highlighted the importance of managing risk.\nWhile biodiversity loss was highlighted by just 11 percent of respondents as the most important environmental factor, dwarfed by climate change, around half recognised the need to incorporate it into their investment decision-making due to its likely role in exacerbating ocean depletion and land degradation, and accelerating climate change.\n“ESG has become more and more important in investment decision-making,” Christian Nolting, Chief Investment Officer, wrote in a report on the survey and the role of biodiversity risk in investments. “Biodiversity underpins many environmental, social and governance systems and biodiversity loss is therefore likely to be an increasing focus of public and investor concern.”\nOther findings of the survey include that women were more likely to say their investments should have a positive impact and to focus on the social pillar of ESG; millennials tended to be more focused on ocean pollution than their older counterparts; and while 54 percent of small- and medium-sized enterprises regard climate change as the main ESG issue in their business only 26 percent have a dedicated ESG strategy.\nThe online survey of IPB clients aged 26 to 70 was conducted in April 2021. It included respondents from 10 countries or regions around the world: Belgium, Germany, Hong Kong, India, Italy, Singapore, Spain, Switzerland, the UK and the US.\nRead the full report, entitled: “Biodiversity loss: recognising economic and climate threats\"\nThe report was released a day after Deutsche Bank announced that it has become the first bank to join the Ocean Risk and Resilience Action Alliance (ORRAA) as a full member, creating a partnership dedicated to bringing financial expertise and innovation to protect the ocean and the communities that depend on it.\nThis Thursday, May 20, Deutsche Bank holds a Sustainability Deep Dive, a three-hour virtual and interactive event where senior managers will give details on the bank’s sustainability strategy.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 5
}