{
    "url": "https://www.db.com/news/detail/20210512-deutsche-bank-launches-new-fic-coverage-model?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 12, 2021",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank Launches New FIC Coverage Model",
    "body": "Deutsche Bank announces a new enhanced and dynamic coverage model for its Fixed Income & Currencies (FIC) Sales team, tailored to the changing behaviors and needs of institutional clients as fixed income markets evolve.\nThe new coverage model, which will initially be introduced in Europe for Rates and Credit flow products, provides clients with senior coverage access and expertise across two main coverage channels – Flow & Liquidity and Solutions.\nDeutsche Bank is striving to create a new and relevant model for the present but also put itself in a strong position to meet client needs in the years ahead as market liquidity access continues to evolve in sophistication, driven by technology, regulation and focus on cost and efficiency.\nThe new approach brings together more targeted expertise from our salesforce and will be delivered alongside the bank’s market leading technology, electronic trading capabilities and bespoke solutions framework, in order to create increased consistency of coverage, pricing and liquidity.\nThe more focused model aims to improve the overall client experience harnessing Deutsche’s powerful client analytics to anchor and lead client conversations by data, to differentiate the client offering versus other models.\nWe will focus the two channels on client needs and behavior. They will retool and refocus our sales force for the future accordingly:\nFlow Liquidity Sales will provide expert coverage through a new quantitative relationship management process, focused on multiple channel liquidity across voice and E, efficient content access and the workflow and efficiency goals of our clients. The aim will be a more systematic and process driven approach to coverage and market making. It will also dynamically manage the firm’s client perimeter.\nSolutions will work symbiotically alongside the flow liquidity salespeople and focus on client strategic advice and bespoke solutions & risk transfer.  \nPanos Stergiou - Global Head of ICG Macro Sales and Head of ICG Debt EMEA, commented:\n“Clients have evolved the way they trade flow fixed income products, especially in areas which are highly electronified. Our new coverage model recognises this shift, and enables us to deliver efficiently a high quality of service for these new client needs, at a time when some competitors have scaled back.  With the recent momentum in our FIC franchise at Deutsche Bank it feels like the right time to be forward looking and ambitious in the way we cover clients in FIC.”\nJames Davies – Global Head of ICG & CEO IB Americas added:\n“Liquidity focus and expertise moves hand in hand with our clients’ sustained demand for bespoke advice and support, driven by changes in the macro backdrop and regulation.  We have a legacy of deep expertise and IP to help create solutions for our franchise but economies of scale and market share are important in our core products and the lens that our clients view us through. With these changes we aim to evolve and further strengthen our client partnerships.”",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 22
}