{
    "url": "https://www.db.com/news/detail/20241218-deutsche-bank-helps-to-finance-global-power-generation-australia-s-renewable-energy-expansion?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "December 18, 2024",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank helps to finance Global Power Generation Australia's renewable energy expansion",
    "body": "Deutsche Bank has supported Global Power Generation Australia (GPG) on its 2.3 billion Australian dollar financing facility, to further invest in its renewable energy portfolio. Deutsche Bank has acted as Original Lender and Hedge Counterparty on the transaction.\nGPG was established in 2014 by Naturgy Energy Group and the Kuwait Investment Authority. Headquartered in Spain, it is an international developer and manager of power generation assets with principal activities across 8 countries.\nThis financing facility is structured around a portfolio of eight operating assets, six wind farms, one battery storage project and one solar-hybrid with storage, two photovoltaic plants under construction and one solar-plus-battery hybrid project under development. In total, GPG closes 2024 with 1 GW of projects in operation, in addition to 360 MW under construction and 510 MW ready for construction.\nRachel Chia, Deutsche Bank’s Head of Project Finance for Asia Pacific, said: “We are pleased to continue to extend our longstanding relationship with GPG in Asia Pacific, through playing a pivotal role this portfolio financing.\"\nThis milestone brings us close to 3.6GW of renewable energy projects financed in 2024 in Australia and demonstrates our commitment towards sustainable finance. \nRachel Chia\nThis transaction continues the bank’s strong trajectory in supporting sustainable financing solutions, marking the bank’s 24th renewable energy asset financed in Australia to-date. Deutsche Bank’s Corporate Bank provides a holistic suite of financing solutions spanning project finance, acquisition finance, corporate finance (and others) across the infrastructure and energy markets. Since 2019, the Corporate Bank has been active in project financings in Australia",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 1
}