{
    "url": "https://www.db.com/news/detail/20241212-marcus-chromik-appointed-as-chief-risk-officer-of-deutsche-bank?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "December 12, 2024",
    "tags": [
        "Personnel announcements"
    ],
    "title": "Marcus Chromik appointed as Chief Risk Officer of Deutsche Bank",
    "body": "Deutsche Bank’s Supervisory Board has appointed Marcus Chromik as Chief Risk Officer and Member of the Management Board, effective May 20, 2025. He will succeed Olivier Vigneron who recently informed the bank that he would not seek an extension of his contract, which expires on May 19, 2025. Over the past 20 years, Marcus Chromik has held management positions in finance and risk management functions, including eight years as Commerzbank’s Chief Risk Officer. Marcus Chromik will join Deutsche Bank’s Management Board on May 1 before taking over full responsibility for the Risk function when Vigneron leaves the bank.\nAlexander Wynaendts, Chairman of the Supervisory Board, said: “I would like to thank Olivier Vigneron for his many contributions and his commitment to steering the evolution of the bank’s Risk function since joining the Management Board in 2022. We wish him all the best for his future endeavours. At the same time, we are delighted to announce a risk manager as highly regarded as Marcus Chromik as Deutsche Bank’s incoming Chief Risk Officer.”\nChristian Sewing, Chief Executive Officer, said: “Marcus Chromik is a highly respected risk manager with a strong track record in executive positions and a reputation as a strong leader. His experience will help us to further strengthen our risk management capabilities at a time when the world economy is navigating a challenging environment. I very much look forward to working with him. I would also like to take the opportunity to thank Olivier Vigneron thoroughly for his achievements, dedication and partnership.”\nMarcus Chromik, who holds a PhD in nuclear physics, has spent more than 20 years in banking, starting at Postbank in 2004 where he held positions in Risk and capital markets. In 2009 he joined Commerzbank where he held senior management positions in risk management before being appointed Chief Risk Officer in 2016. In 2023 he decided not to renew his contract to pursue other interests. Most recently he was a non-executive member of UniCredit’s Board of Directors, a mandate he has stepped down from as he joins Deutsche Bank.\nMarcus Chromik said: “It is a great honour for me to join the Management Board of Deutsche Bank, one of the leading financial institutions in Europe and one of the very few truly global banks. I am looking forward to helping navigate the volatile and fast-changing economic environment that is expected in coming years.”",
    "number_of_ratings": 18,
    "rating": 3.0,
    "likes": 7
}