{
    "url": "https://www.db.com/news/detail/20200831-anna-herrhausen-appointed-head-of-art-culture-und-sports-at-deutsche-bank?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "August 31, 2020",
    "tags": [
        "Company"
    ],
    "title": "Anna Herrhausen appointed Head of Art, Culture & Sports at Deutsche Bank",
    "body": "Anna Herrhausen, Executive Director Alfred Herrhausen Gesellschaft, takes charge of Deutsche Bank’s Art, Culture & Sports department, embedded within the Communications and Corporate Social Responsibility function, with immediate effect. In this role she succeeds Anke Hallmann, Deputy Head of Communications and Corporate Social Responsibility, who took on responsibility for the department from Thorsten Strauß and had been its provisional head since the beginning of 2020.\nArt, Culture & Sports manages all Deutsche Bank’s sponsorship programmes and initiatives worldwide. These activities include its commitment to contemporary art, where the bank sets international standards – with its art collection, its global exhibition programmes and as a partner of respected art fairs such as Frieze in London, New York and Los Angeles. The department is also responsible for the bank’s long-term partnership with the Berliner Philharmoniker orchestra and the “PalaisPopulaire”, whose doors were opened in Berlin as the bank’s forum for art, culture & sports in September 2018.\nAnna Herrhausen has been Executive Director Alfred Herrhausen Gesellschaft since 2016. After working for McKinsey as a management consultant and for Allianz in the corporate social responsibility field, she joined Deutsche Bank’s Communications & Corporate Social Responsibility team in 2014. At the end of 2016 she took on the leadership of Alfred Herrhausen Gesellschaft.\nHer academic background comprises a Bachelor of Arts in Philosophy, Politics and Economics from Oxford University, a Master’s degree in International Affairs from Columbia University and a doctorate from the Free University of Berlin’s Faculty of International Relationships. Anna Herrhausen is a member of the European Council on Foreign Relations (ECFR) and sits on the Board of Trustees of the Hertie School of Governance.",
    "number_of_ratings": 2,
    "rating": 4.5,
    "likes": 6
}