{
    "url": "https://www.db.com/news/detail/20200826-applications-open-for-second-female-fintech-competition?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "August 26, 2020",
    "tags": [
        "Company",
        "Diversity",
        "Entrepreneurship",
        "Research"
    ],
    "title": "Applications open for second Female FinTech Competition",
    "body": "Deutsche Bank has joined forces with Atos, Google Cloud and TechQuartier to launch the second Female FinTech Competition.\nFinTechs with a female founder or female(s) in the top management groups are invited to enter the competition to pitch their business case. First prize is a place on Atos’ FinTech programme. Other winners will have the opportunity to access and benefit from Deutsche Bank and Google Innovation resources, including spending time in Deutsche Bank’s Innovation Lab and working with experts and coaches in the global Innovation Team.\nGil Perez, Global Head of the Strategy & Innovation Network at Deutsche Bank, is on the panel of judges and will meet with all of the finalists. “The Female FinTech competition is not only a wonderful opportunity to showcase technology talent, it is also a way for Deutsche Bank to engage and support a community of female founders and help foster innovation,” said Perez.\nJoining Perez on the judges panel are Annette Maier, Managing Director Google Cloud in Germany, as well as Ursula Morgenstern, Head of Central Europe at Atos.\nThe Atos global FinTech Programme includes the FinHub - a fast-track onboarding programme with access to Atos’ network of major financial services companies with legal and go-to-market support from Atos. It also includes access to Atos Financial Services Sandbox, through which Atos helps FinTechs develop their offerings by combining expertise and solutions to test, create and develop new services.\nWomen who are interested in coaching FinTech entrants are also encouraged to register on the competition site to share their industry and/or technical knowledge and experience.\nEntrants should register their interest in participating or coaching in the competition by September 23, 2020. Business cases must be submitted by September 30, 2020. Six successful teams will be shortlisted in early October and winners will be announced during the finals of the competition that will be held virtually on October 29, 2020.\n2019 Winner, Ms Sima Ohadi, Chief Behavioural Officer at Odonatech, a software solution to optimise investment advice, says: “We still have a gender gap in the finance industry, yet the future looks bright in part thanks to initiatives like the Atos Female Fintech. I participated as a cofounder of Odonatech in the Atos Fintech Competition last year, which helped me get to know some very ambitious and innovative women in this field.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}