{
    "url": "https://www.db.com/news/detail/20200819-deutsche-bank-named-best-corporate-trust-bank-in-apac-and-best-domestic-custodian-in-four-regional-markets?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "August 19, 2020",
    "tags": [
        "Awards",
        "Company",
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Deutsche Bank named Best Corporate Trust Bank in APAC and Best Domestic Custodian in four regional markets",
    "body": "The Asset Magazine has named Deutsche Bank “Best Corporate Trust Bank\" in Asia Pacific and “Best Domestic Custodian\" in four markets at their 2020 Sustainable Investing Institutional Investor, ETF and Asset Servicing Awards. These awards underscore the market-leading strength of the bank’s Corporate Banking business in the region.\nThe haul of eleven awards included Trust and Agency Services (TAS) scooping “Best Corporate Trust Mandate” and recognition of the bank’s industry-leading talent, with the bank’s Head of Market Advocacy for Securities Services, Boon-Hiong Chan winning the Market Advocacy Leadership award.\nBest Corporate Trust Bank\nThe best bank for Corporate Trust top spot recognises the bank’s expertise in providing a wide array of best-in-class trustee and agency services to corporates, and financial and non-financial institutions, to help them navigate the capital markets and meet the often complex needs of issuers.\nSecurities Services’ strong show included Best Domestic Custodian in Indonesia, Malaysia, Philippines and India; a double commendation for Deutsche Bank’s India franchise which also took home ”Best Fund Administrator”. Deutsche Bank continues to lead the market in India domestic custody, with Securities Services also nominated for a further four house awards to be announced in September.\nMandate of the Year\nTAS was named \"Best Corporate Trust Mandate” for their work as trustee of the China Merchants Group Real Estate Investment Trust (CMC REIT) established to primarily invest in commercial properties in China’s Greater Bay Area. This was the first REIT listed in Hong Kong for six years and the first ever with a central government state-owned enterprise background.\nThe Greater Bay Area is an economic development aimed at transforming nine of China’s mainland cities and two special administrative regions into a technology and innovation hub.\nIndustry-leading talent\nDavid Lynne, Head of Corporate Bank and FIC for APAC, said: “These awards are testimony to our truly market-leading offering in APAC, the strength of our current momentum in this region, and the outstanding service we continue to provide to our clients. This is all, of course, down to the unparalleled talent and dedication of our people, which is why we are also extremely proud to see Boon-Hiong Chan win the Market Advocacy Leadership award this year.”\nAwards won by Deutsche Bank at The Asset Triple A Sustainable Investing Institutional Investor, ETF, and Asset Servicing Awards 2020:\nBest in Corporate Trust\nBest Corporate Trust Mandate\nBest Fund Administrator – Retail Funds – India (eleven consecutive years)\nBest Fund Administrator – Retail Funds – Sri Lanka (six consecutive years)\nBest Domestic Custodian – India (eleven consecutive years)\nBest Domestic Custodian – Indonesia (two consecutive years)\nBest Domestic Custodian – Malaysia (three consecutive years)\nBest Domestic Custodian – Philippines (three consecutive years)\nBest Sub-custodian – Philippines\nMarket Advocacy Leadership Award – Boon-Hiong Chan\nDeutsche Bank also won Best Islamic Custodian for Malaysia, second year in a row, at The Asset Triple A Islamic Finance Awards 2020.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}