{
    "url": "https://www.db.com/news/detail/20200807-deutsche-bank-south-africa-receives-highest-recognition-for-transformation-and-diversity?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "August 7, 2020",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "Deutsche Bank South Africa receives highest recognition for transformation and diversity",
    "body": "In recognition of its support and commitment to transformation and diversity, Deutsche Bank South Africa has been recognised as a “Level one Contributor” – the highest status under the legislative framework of Broad-Based Black Economic Empowerment (B-BBEE).\nWith this achievement, Deutsche Bank South Africa stands out as the only bank among its international peers to have achieved this status.\nThe B-BBEE framework was initiated by the South African government to address the legacy of apartheid and promote equality across all citizens. Every year, companies in South Africa are measured and verified across five elements of empowerment: ownership, management control, skills development, enterprise and supplier development and finally socio-economic development.\nIn completing its level one status, Deutsche Bank South Africa crafted several internal and external initiatives across all facets of Empowerment. These included a comprehensive development programme for black staff over several months as well as hiring and developing black graduates as part of the Young Talent Programme. Deutsche Bank’s reach also extended beyond its immediate remit through the empowering of its small black-owned suppliers via continued supplier development programmes.\n“We are extremely proud of this achievement which acknowledges our global commitment to promote diversity and inclusion in all countries where we operate,” said Muneer Ismail, Chief Executive Officer and Chief Country Officer for Deutsche Bank South Africa. “For Deutsche Bank South Africa, transformation and diversity is a business imperative. Through transformation and the encouragement of more diverse views and thinking, we can deliver value to our people, our business and our clients.”\nOther major projects include:\nDeutsche Bank South Africa’s Entrepreneurship Centre\nLaunched in 2008, Deutsche Bank established the Entrepreneurship Centre to promote the emergence and development of black owned and managed financial services entities. Based at Deutsche Bank South Africa’s Sandton headquarters, the Centre provides aspiring black entrepreneurs in financial services with the necessary infrastructure to start and develop their businesses over a two to three year period.\nYes4Youth Programme\nSupported by Deutsche Bank for many years, the Yes4Youth programme provides unemployed black youth in South Africa with a supported, meaningful 12 months of work experience in the education sector. This year, the programme will provide training for 62 young adults to work in a range of exciting avenues including laboratory work, data gathering, and HIV and tuberculosis prevention in communities.\nDeutsche Bank South Africa Foundation\nDeutsche Bank South Africa Foundation has supported many non-profit organisations and programmes, primarily in education and social initiatives. Most of the foundation’s project partners beneficiaries are 100 percent black beneficiaries, including pre-school teachers and children. In 2020, 205 pre-school teachers are participating in accredited Early Childhood Development programmes. Indirectly over 15,000 children will benefit through the professional development of these practitioners where these children will receive quality care and learning they need to support their physical, emotional and cognitive development.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}