{
    "url": "https://www.db.com/news/detail/20230330-deutsche-bank-s-annual-general-meeting-2023-shareholders-to-vote-on-50-per-cent-higher-dividend?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, March 30, 2023",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank’s Annual General Meeting 2023 – shareholders to vote on 50% higher dividend",
    "body": "Management Board and Supervisory Board propose dividend of 0.30 euros per share, up from 0.20 euros per share in the previous year\nVirtual AGM 2023 will provide extensive opportunities for shareholder questions and contributions and will once again be publicly broadcast on the internet, including the general debate and results of voting\nAGM to vote on proposal to re-elect four shareholder representatives to the Supervisory Board\nSupervisory Board compensation to be slightly adjusted and simplified after ten years without substantial change\nArticles of Association to be amended to provide for the possibility of virtual AGMs for the next two years\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) will this year once again hold its Annual General Meeting in a virtual format. The entire AGM on May 17, 2023 will be broadcast live to the public on the bank’s website at https://agm.db.com. Shareholders who register on time can also participate online via the access-protected shareholder portal, where they can exercise their voting rights, make statements and ask related questions via video as provided by law.\n\"We’re really looking forward to a lively exchange with our shareholders,\" said Supervisory Board Chairman Alex Wynaendts. \"We consider a virtual Annual General Meeting to be a good and inclusive format, as shareholders from Germany and abroad can exercise their rights in full in an efficient way and without having to be physically present. He added: \"We are also pleased to be able to propose a 50 percent higher dividend for 2022 to our shareholders following the successful transformation of the bank since 2019.\"\n“I am delighted that the four Supervisory Board members whose term of office expires this year will stand for re-election. Mayree Clark, John Thain, Michele Trogni and Norbert Winkeljohann are proven experts in their respective areas and have earned a great deal of credit on our Supervisory Board over the past few years,” he concluded.\nThe Agenda, which comprises 11 items in total, was published in the German Federal Gazette (Bundesanzeiger) and on Deutsche Bank’s website (https://agm.db.com) on March 30, 2023.\nConsistent with the announcement made in February 2023, the Management Board and the Supervisory Board propose a cash dividend of 0.30 euros per share for the financial year 2022. This corresponds to an increase of 50 percent and is in line with the ambition to distribute around 8 billion euros of capital to shareholders for the financial years 2021 to 2025. From 2025 onwards, the Management Board aims to distribute a total of 50 percent of the net profit attributable to shareholders.\nThe shareholders will also vote on the Supervisory Board’s proposal to re-elect Mayree Clark, John Alexander Thain, Michele Trogni and Norbert Winkeljohann as shareholder representatives to the Supervisory Board. The regular appointment period for these four shareholder representatives ends at the close of this year's AGM. At least 30 percent of the shareholder representatives are women, which would continue to be the case following the election of the proposed candidates.\nAn amendment to the Articles of Association will also be proposed to the Annual General Meeting in order to simplify the compensation structure of the Supervisory Board. The currently applicable compensation of the Supervisory Board has not been substantially changed for ten years and has now been reviewed with the assistance of an independent compensation advisor. This review has shown amongst other things that the current compensation structure no longer adequately reflects the demands on a Supervisory Board member in the financial services sector. In addition, the compensation for committee memberships outweighs the basic compensation of each member.\nTherefore, in the future, for the purposes of determining Supervisory Board compensation, only three defined roles will be differentiated: the Chairperson of the Supervisory Board, the Deputy Chairperson and ordinary members. Each of these roles will be assigned a fixed annual basic compensation amount. This basic compensation will also generally cover participation in committees. Moreover, compensation is to be increased moderately to reflect the increase in duties and responsibilities.\nWith a view to future Annual General Meetings, from July 2022 the law allows for the permanent option of continuing to hold them virtually. However, authorisation of the Management Board in this context must be written into the Articles of Association. For this reason, it is proposed to amend Deutsche Bank's Articles of Association accordingly. This change will initially apply for two years.\nParticipation in the AGM\nThe AGM format this year provides the opportunity for Deutsche Bank shareholders to fully exercise their rights.\nRegistered shareholders can submit questions in advance via the shareholder portal until midnight (CEST) on May 13, 2023. Registration for the AGM is possible until midnight (CEST) on May 11, 2023.\nThe bank's responses will be published on the website at https://agm.db.com no later than midnight (CEST) on May 15, 2023, further improving transparency for shareholders.\nAs in the previous year, shareholders will again be able to make statements via audio and/or video during the AGM. In addition, shareholders have the right to ask follow-up questions as well as questions on new topics (in accordance with §131, section 1d and 1e of the German Stock Corporation Act) during the AGM by video.\nChairman Alexander Wynaendts’ and CEO Christian Sewing’s speeches will be published on the website at agm.db.com no later than midnight (CEST) on Tuesday, May 9, 2023.\nShareholders have the right to submit comments on the Agenda items in text form by means of electronic communication by no later than midnight (CEST) on Thursday, May 11, 2023. The company will make the statements available on the website at https://agm.db.com\nDetails on the expanded interactive options are included in the Invitation to the AGM, which can be downloaded from https://agm.db.com",
    "number_of_ratings": 22,
    "rating": 3.4,
    "likes": 19
}