{
    "url": "https://www.db.com/news/detail/20230330-deutsche-bank-named-world-s-best-bank-for-entrepreneurs-by-euromoney?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "March 30, 2023",
    "tags": [
        "Awards",
        "Wealth"
    ],
    "title": "Deutsche Bank named World’s Best Bank for Entrepreneurs by Euromoney",
    "body": "Deutsche Bank’s International Private Bank (IPB) won three industry leading awards overnight in London at the prestigious Euromoney Global Private Banking Awards 2023, where it was named:\nWorld’s Best Bank for Entrepreneurs\nBest Domestic Private Bank in Germany\nBest International Private Bank in Spain\nThe Euromoney Global Private Banking Awards are the pre-eminent awards for private banking and wealth management excellence and leadership.\nAwarded the global title of World’s Best Bank for Entrepreneurs, Euromoney lauded Deutsche Bank’s IPB for its Bank for Entrepreneurs ‘one bank’ offering, which has recorded early success in Spain and Italy. The IPB was recognised for sharpening its coverage of mid-cap corporates across Europe, the Middle East and in Asia Pacific by investing in the industry’s leading talent, and for outperforming peers on nearly all reported metrics while effectively managing its risk profile in some of the most volatile markets in recent history.\nThe business unit recorded a strong financial performance last year, attracting net new assets and net new loans while delivering sustainably profitable growth across both businesses - Bank for Entrepreneurs/ Wealth Management and Premium Banking.\nHead of International Private Bank, Claudio de Sanctis said: “Winning these three Euromoney awards recognises both IPB’s disciplined transformation and our market outperformance across the board, but especially in Germany and Spain. Being named the World’s Best Bank for Entrepreneurs is particularly gratifying, and recognises our global strength, innovative ‘one bank’ proposition and the valuable advice we provide entrepreneurs and their families. I extend my heartfelt congratulations to all the teams who have worked so hard to make this vision a reality for IPB, and thankyou to our clients for their continued trust and belief in us.”\nHead of Wealth Management Germany, Frank Schriever said: \"The award for best domestic private bank in Germany is a testament to the exceptionally strong performance of our team. Our clients have trusted our advice and risk management in times of high volatility and can continue to rely on us in a difficult market environment. The award is motivation for us to continue to do our best for our clients in the future.\"\nHead of Deutsche Bank Spain, Inigo Martos said: “Being awarded Spain’s Best International Private Bank reflects the successful transformation of Deutsche Bank in Spain. We honed our offering and creating flagship branches for our Premium Banking customers, launched the Bank for Entrepreneurs, and invested in growth by attracting the market’s leading bankers. As a result, we recorded significant gains in net new assets and net new loans. I extend my sincere congratulations to all our IPB team in Spain, and my deepest thanks to clients for their belief and continued trust in us.”",
    "number_of_ratings": 11,
    "rating": 4.6,
    "likes": 14
}