{
    "url": "https://www.db.com/news/detail/20230329-db-scoops-high-rankings-across-the-board-in-energy-risk-commodity-rankings?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "March 29, 2023",
    "tags": [
        "Investment Bank",
        "Awards"
    ],
    "title": "Deutsche Bank scoops high rankings across the board in Energy Risk Commodity Rankings",
    "body": "Deutsche Bank has scored #2 in Precious Metals and Precious Metals Research in this year’s Energy Risk Commodity rankings. Run by risk.net, the rankings polled more than 700 respondents for their top dealers and brokers on the overall quality of service, based on reliability, pricing, liquidity provision and speed of execution.\nDan Timosenko, Head of Precious Metals Trading said: “Last year we were ranked #1 by Euromoney based on the quantity of trades that we do, and it is encouraging to see that we also rank highly among customers when it comes to the quality of the service we provide highlighted by this survey-based award. It’s not a secret that technology and reliable market-making capabilities, especially through the most turbulent markets, is what makes us stand out. However, more recently, we are also seeing the hard work of our sales team come to fruition with many more customers engaging with us across the entire life cycle of metals: from producers, trading companies and refineries to consumers, asset managers and central banks. Our support teams also work tirelessly to launch new products. With so much enthusiasm and collaboration from front to back, we are looking forward to further strengthening our precious metals position.”\nMichael Hsueh, FX Strategist, commented: “We are encouraged by the strong showing in Energy Risk’s 2023 survey. I look forward to building upon that strength this year to drive client conversations and market flow to our business. The best way for Research to do that is to provide a solid framework for understanding price developments along with actionable ideas suited to the macro outlook.”\nDeutsche Bank’s global Precious Metals capabilities span more than 150 years and is a recognized market leader:\nTop 3 by volume in CME futures across all banks\nMember of SGE and LPPM\nNo 1 in Precious Metals in the global Euromoney FX Survey 2022 with 23% of OTC market\n\nIt has now been recognized for the first time in a number of categories across the Energy Risk Commodity Rankings 2023, ranking no 2 globally in the following categories:\nPrecious Metals (overall)\nGold\nSilver\nPlatinum/Palladium\nOTC Trading Platform\nResearch in Precious Metals \n\nThe Energy Risk Commodity Rankings survey was live between November 2, 2022 and January 5, 2023 and received valid responses from 708 individuals. The survey asked respondents to vote for their top three dealers and brokers in any markets in which they had been active over the previous year.",
    "number_of_ratings": 3,
    "rating": 5.0,
    "likes": 3
}