{
    "url": "https://www.db.com/news/detail/20230329-mumbai-gets-its-first-salon-run-by-transgender-persons?language_id=1",
    "language": "DE",
    "article_type": "Media Release Newsroom",
    "publish_date": "March 29, 2023",
    "tags": [
        "Asia-Pacific",
        "Corporate Citizenship"
    ],
    "title": "Mumbai gets its first salon run by transgender persons",
    "body": "In an attempt towards creating equitable livelihood opportunities, Deutsche Bank and Rotary Club of Bombay have partnered to set up Mumbai’s first salon that will be run by transgender persons. The partners have supported in setting-up of the ‘TransFormation Salon’ including the recruitment and training of staff and will provide initial support to the business, after which it will run by the Pride Business Network Foundation, as a for-profit enterprise.\nThe establishment, located in Prabhadevi, an up-scale locality of Mumbai, employs professionally trained beauticians, a majority of whom will be from the LGBTQIA+ community. The salon was inaugurated on March 25, 2023, by senior management from Deutsche Bank, Rotary Club of Bombay and Pride Business Network Foundation.\nThis initiative is in line with the shared vision and goals of Deutsche Bank and Rotary Club of Bombay to create equitable livelihood opportunities for all people. It is one of the many programmes run by these organisations to broaden the workforce through skilling and opportunity creation.\n “Diversity, Equity and Inclusion (DEI) are much more than corporate imperatives for us at Deutsche Bank. They are relevant to the people in our community as much as they are for our employees. As part of our Corporate Social Responsibility In The Community programme, the TransFormation Salon will serve as a platform to integrate members of the marginalised LGBTQIA+ community into mainstream society. This is a small but important step towards creating equitable opportunities,” said Kaushik Shaparia, CEO, Deutsche Bank Group, India.\n“Community Economic Development is one of the seven avenues of service of Rotary International and DEI is our focus area. Setting up of TransFormation Salon serves as the best intervention for Rotary Club of Bombay to support a sustainable livelihood programme for a community that needs to be offered an equitable opportunity in our society,” said Sandip Agarwalla, District Governor of Rotary International District 3141 and Vineet Bhatnagar, President of Rotary Club of Bombay, in a joint statement.",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 0
}