{
    "url": "https://www.db.com/news/detail/20230308-empowering-women-social-entrepreneurs-in-asia?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "March 8, 2023",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Empowering women social entrepreneurs in Asia Pacific",
    "body": "Deutsche Bank is committed to promoting social entrepreneurship and sustainability in Asia Pacific through its Corporate Social Responsibility Made for Good programme. In particular, the bank is supporting young women entrepreneurs across Asia to develop innovative ideas that can make a positive impact in their communities.\nSingapore International Foundation partnership\nDeutsche Bank, in partnership with the Singapore International Foundation’s (SIF) Young Social Entrepreneurs Global programme (YSE Global), is empowering women social entrepreneurs across Asia to make an impact and help other women. Through this partnership, the bank is providing grant funding to young social entrepreneurs who are working to address social challenges and build sustainable businesses.\nOne such entrepreneur is Huda Hamid, founder of Fempreneur Secrets, a Singapore-based online community that empowers women to start profitable businesses and create a global community of economically independent women through workshops, courses and mentorship. With the grant from the YSE Global programme supported by Deutsche Bank, Hamid was able to initiate and roll out her Rising Fempreneur Beneficiary Programme. The programme has supported over 40 beneficiaries directly with the content translated into various Southeast Asian languages. Fempreneur Secrets follows a 5-help-1 model, where for every five women who invest in their learning, one woman from low-income families and marginalised communities is supported to start a business. This creates a Fempreneur ecosystem where women support and empower one another through different stages of their business.\nAnother changemaker is Purvi Tanwani, co-founder of Anahat for Change, India. Anahat Unnati, the brand she co-founded, showcases products that are organically made “by the women, for the women” in India. With the grant funding, they were able to boost and promote sales of their products through their website and other marketplaces. \"The funding has also enabled us to hire experts from the field of digital media working full time to effectively promote the brand on social media. This has helped to increase the livelihood of women who are associated with the brand.\" - Purvi Tanwani, Co-founder of Anahat For Change\nAnahat for Change is a non-profit hybrid model working to create an enabling environment for young people, women, and girls in India. The organization provides livelihood options to women associated with Anahat Unnat, which employs women from the most marginalized backgrounds to make sustainable menstrual and baby care products in India.\nRiza Nisriinaa, co-founder of Mengayu, Indonesia, is also a social entrepreneur who received the grant funding through YSE Global. Mengayu aims to empower vulnerable women who are victims of domestic and dating violence, as well as those who have lost their jobs during the Covid-19 pandemic. It provides them with job training and safe working spaces to help them regain their confidence and become financially self-sufficient.\nThrough this partnership with the SIF, Deutsche Bank is making a significant impact on the lives of women social entrepreneurs across Asia. By providing grant funding, the bank is helping to support sustainable businesses that address social challenges and create economic opportunities for women. These social entrepreneurs are paving the way for a better future, where women are empowered to make a positive impact in their communities and beyond.\nDeutsche Bank’s Youth Venture Fund helps women entrepreneurs to create eco-friendly solutions\nDeutsche Bank is supporting 90 novel ventures created by young women entrepreneurs in India through its Youth Venture Fund. One of the entrepreneurs is 21-year-old Kusuma, who plans to launch a business that manufactures eco-friendly areca plates, bowls, and spoons to reduce plastic waste. Kusuma conducted market research and found potential buyers, and she aims to produce 14,000 to 16,000 areca products every month, sourcing raw materials directly from farmers. Deutsche Bank organised the first round of Pitch It!, a CSR event in partnership with Going to School, where Kusuma and other entrepreneurs presented their business plans and raised seed capital from the bank. This event will also take place in Mumbai in the coming months.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 5
}