{
    "url": "https://www.db.com/news/detail/20190430-deutsche-bank-presents-works-on-paper-and-a-live-performance-by-ruby-onyinyechi-amanze-at-frieze-new-york-may-1-5-2019?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 30, 2019",
    "tags": [
        "Art",
        "Company",
        "Corporate Citizenship",
        "Corporate products",
        "Wealth"
    ],
    "title": "Deutsche Bank presents works on paper and a live performance",
    "body": "Deutsche Bank is delighted to be Global Lead Partner of Frieze New York for the eighth consecutive year, presenting works on paper by Nigerian-born, Philadelphia- and New York-based artist ruby onyinyechi amanze in the Deutsche Bank Wealth Management Lounge.\nruby onyinyechi amanze, Holding Patterns [for when invisibility fails], 2018\nOur support of Frieze New York underlines our continued commitment to the US and to the arts and their positive impact – something that we believe reaches far beyond the walls of the fair.\nFabrizio Campelli, Global Head of Deutsche Bank Wealth Management.\nFrieze New York will be held on Randall’s Island Park from May 2-5, 2018, with Preview Day on Wednesday, May 1. This year features leading galleries from 26 countries and showcases an extraordinary cross-section of work, from today’s most exciting emerging artists to seminal figures of the 20th century.\n“Support of Frieze NY underscores Deutsche Bank’s 40 year commitment to encouraging new and noteworthy talents in art and culture from across the globe. We are delighted to feature the works on paper by Deutsche Bank Collection artist, ruby onyinyechi amanze, further highlighting the international focus of both our art program and the Frieze platform,” said Thorsten Strauss, Global Head of Deutsche Bank’s Art, Culture & Sports department.\nDeutsche Bank’s longstanding support of Frieze also includes Frieze London, Frieze Masters and the recently held inaugural edition of Frieze Los Angeles.\nruby onyinyechi amanze installation in the Deutsche Bank Wealth Management Lounge\nruby onyinyechi amanze, The Gap [and the beams of sun, special ordered on our behalf], 2017\nThe Deutsche Bank Wealth Management Lounge at Frieze New York will display a solo installation of recent works on paper by ruby onyinyechi amanze – who favors her name in lowercase. The US-based artist was selected for her extraordinary, mixed-media drawings of imaginary places and constructed spaces where a unique cast of characters float, dance, stretch, embrace or otherwise interact with nature and each other. Her large-scale dreamscapes evoke personal narratives about the elusiveness of home and notions of joy, hybridity and sensuality.\namanze pushes the traditional boundaries of two-dimensional drawing into the sculptural realm, often employing custom supports, colored glazing and shaped frames. Her practice also includes an appreciation of language, dance and performance. In collaboration with artist Wura-Natasha Ogunji, amanze will be staging twin: a performance + drawing, a three and a half hour performance where drawing becomes an improvisational action. Open to the public, the audience will watch as an artwork is created in real time by two women joined with one hand. The resulting drawing is a physical artifact and a testament of unity.\nWura-Natasha Ogunji and ruby onyinyechi amanze, Performance still from 2013 staging at the Museum of Contemporary African Diasporan Art (MoCADA), Brooklyn NY\nAbout Deutsche Bank Wealth Management\nWith client assets of approximately 300 billion euros (as at March 31, 2019), Deutsche Bank Wealth Management is one of the largest wealth managers worldwide. It offers wealthy clients a broad range of traditional and alternative investment solutions, as well as comprehensive advice on all aspects of Wealth Management.\nIts goal is to create lasting value as a trusted partner to wealthy individuals and entrepreneurs, family offices and foundations around the world. It aims to bring a unique perspective as both a European and a truly global institution; to offer bespoke solutions that others do not; to offer expert advice to its clients, their families and their business; and to connect them to a world-class capital markets institution.\nAbout Deutsche Bank Art, Culture & Sports\nArt, Culture & Sports is a bank-wide division that combines its expertise and international networks with the bank’s business initiatives around the globe. Through our longstanding programs and partnerships, we provide exclusive access to top artists, performers and athletes that provide first-rate, inspiring experiences for our clients and colleagues. In 2018, Deutsche Bank launched the PalaisPopulaire, a state-of-the-art cultural center in the heart of Berlin, featuring programmatic experiences with the brightest stars in contemporary art, culture and sports.\nAbout Frieze\nFrieze is the world’s leading platform for modern and contemporary art for scholars, connoisseurs, collectors and the general public alike. Frieze comprises three magazines—frieze, Frieze Masters Magazine and Frieze Week— and four international art fairs—Frieze London, Frieze Masters, Frieze New York and Frieze Los Angeles. In addition, Frieze organizes a program of special courses and lectures in London via Frieze Academy.\nFrieze was founded in 1991 by Matthew Slotover and Amanda Sharp, with the launch of frieze magazine, the leading international magazine for contemporary art and culture. In 2003, Sharp and Slotover launched Frieze London art fair, which takes place each October in The Regent’s Park, London. In 2012, they launched Frieze New York, which is held each May in Randall’s Island Park, and Frieze Masters, which coincides with Frieze London in October and is dedicated to art ranging from ancient to modern.\nIn 2018, Frieze announced the launch of Frieze Los Angeles, which took place from February 14 to 17, 2019 at Paramount Pictures Studios, Los Angeles. In 2016 Frieze entered into a strategic partnership with Endeavor (formerly WME | IMG), a global leader in sport, entertainment and fashion.\nPerformance details\nFriday, May 3: 12.30-4pm\nOn the grass outside the North Entrance of the fair on Randall’s Island",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 1
}