{
    "url": "https://www.db.com/news/detail/20190429-doing-business-in-our-own-name-in-manhattan?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 29, 2019",
    "tags": [
        "Company"
    ],
    "title": "\"Doing business in our own name\" in Manhattan",
    "body": "On April 30, 1979 Deutsche Bank opened its first branch in New York on the 49th and 50th floors of 9 West 57th Street with 76 employees. The entire Management Board, Supervisory Board Chairman Franz Heinrich Ulrich and the bank’s honorary chairman Hermann J. Abs were there for the opening ceremony.\n\nThe first 76 employees at the opening of the New York branch\nAlthough Deutsche Bank had been doing business in the US since 1872, this was the first time it had opened its own premises. For decades, it was deemed sufficient for agents to represent the bank and oversee its investments, for example in one of the large transcontinental railway companies. Even after the Second World War, the bank preferred to conduct its business in New York together with European partner banks.\nIn 1968 Deutsche Bank acquired stakes in two New York banks, European American Banking Corporation and European American Bank & Trust Company. Business activities in the US were split between these two entities due to the statutory separation of investment and commercial banking activities in America. The two banks worked primarily with European firms with operations in the US. And in 1971 Deutsche Bank made another investment, in UBS-DB Corporation, a joint venture with the Union Bank of Switzerland that focused on the securities and underwriting business. This venture was later renamed Deutsche Bank Capital Corporation.\n\nView of Central Park and the neighbouring building at 9 West 57th Street, home to the New York branch\nAfter opening the first post-war era foreign branch bearing its own name in London in 1976, Deutsche Bank then applied for a banking licence in New York. On July 14, 1978, the Banking Department of the State of New York granted its approval for the opening of a branch. The bank spent the following months looking for premises and hiring its first employees.\n\nCo-Spokesmen F. Wilhelm Christians (left) and Wilfried Guth with Management Board members Hilmar Kopper (left) and Herbert Zapp in the background at the opening of the New York branch\nAlthough the premises were not yet fully occupied at the end of April 1979 this did not dampen the celebratory mood. The Management Board joined branch managers Detlev Staecker and Hans J. Buhr for a meeting and then hosted 30 US journalists from publications such as The New York Times, Newsweek, Time magazine and The Wall Street Journal at Deutsche Bank’s first press conference in New York. Board Spokesman Wilfried Guth emphasised that the branch allows Deutsche Bank “to do business in our own name” and plugs a gap in its international network.\nBoard Spokesman Wilfried Guth at a press conference on the 50th floor of the New York branch\nFollowing the press conference the Management Board hosted a reception for over 900 guests in the ballroom of the Pierre Hotel on 5th Avenue.\nKey milestones in the development of the US business were the establishment of Deutsche Bank North America Holding in 1991 and the acquisition of Bankers Trust in 1999. Deutsche Bank shares have been listed on the New York Stock Exchange since October 2001. Deutsche Bank currently employs around 9,000 people in the US.\n\n\nA Deutsche Bank office in the 49th floor in 9 West 57th Street, with a window view overlooking Manhattan, the East River and Queens.\n\nMore information on the history of Deutsche Bank is available at historische.gesellschaft@db.com\nSupport the Historical Society and apply for membership.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 1
}