{
    "url": "https://www.db.com/news/detail/20190429-deutsche-bank-publishes-reductions-in-g-sib-indicators-for-2018?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 29, 2019",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank publishes reductions in G-SIB indicators for 2018",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today published the values of its Global Systemically Important Institution (G-SII) indicators, also known as Global Systemically Important Bank (G-SIB) indicators, as at 31 December 2018. This disclosure is in line with requirements for G-SIBs to disclose, on an annual basis, the values of indicators used to determine capital and future leverage buffer requirements.\nFor the year 2018, Deutsche Bank has announced year-on-year reductions in 10 out of 12 indicators. This was primarily driven by reductions in leverage, lower derivatives volumes, strategic adjustments in the bank’s business perimeter and general market developments.\nFor Deutsche Bank, the additional G-SIB capital buffer requirement is currently set at 2.0%. On this basis and assuming no change in 2017 market indicators, these reductions would result in a reduction in the bank’s G-SIB capital buffer from 2.0% to 1.5%. The overall capital requirements of Deutsche Bank would remain unchanged as the bank’s current buffer requirement of 2.0% as a Domestic Systemically Important Bank (D-SIB) would continue to apply.\nHowever, future leverage ratio requirements would be reduced from 4.0% to 3.75% as a consequence of the anticipated lower requirement in Deutsche Bank’s G-SIB buffer. The Financial Stability Board is expected to publish its updated G-SIB classifications in November 2019.\n“This reduction in our G-SIB indicators reflects disciplined execution of our strategy and our ongoing commitment to conservative balance sheet management.”\nJames von Moltke, Chief Financial Officer of Deutsche Bank\nFurther information on Deutsche Bank’s G-SIB indicators can be found on www.db.com/ir.\nDeutsche Bank AG\nMedia Relations  \nChristian Streckert\nPhone: +49 69 910 38079\nEmail: christian.streckert@db.com\nCharlie Olivier\nPhone: +44 20 754-57866\nEmail: charlie.olivier@db.com\nInvestor Relations\n+49 800 910-8000 (Frankfurt)\n+44 20 7541-4100 (London)\n+1 212 250-0604 (New York)\ndb.ir@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}