{
    "url": "https://www.db.com/news/detail/20190426-deutsche-bank-reports-net-income-of-201-million-euros-in-the-first-quarter-of-2019?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 26, 2019",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank reports net income of 201 million euros in the first quarter of 2019",
    "body": "Christian Sewing, Chief Executive Officer, said: “Our first-quarter results demonstrate the strength of our franchise and our continued progress in executing our plans in a very challenging market environment. We have made progress on key business drivers: growth in loans and deposits, a recovery in assets under management and market share improvements in corporate finance. Our continued cost discipline helped us to offset lower revenues and we are well on track to meet our 2019 cost target of 21.8 billion euros.”\nFirst quarter 2019 highlights\nNet income up 67% year-on-year to 201 million euros, after bank levy charges of 604 million euros\nRevenues down 9% year-on-year, down 5% ex-specific items1\nRevenues in Global Transaction Banking up 6%\nKey business indicators positive during the quarter\no Loan growth of 10 billion euros\no Net asset inflows of 10 billion euros, with assets under management up 70 billion euros in the quarter\nCost savings broadly offset lower revenues\nNoninterest expenses down 8% and adjusted costs2 down 7% - fifth consecutive quarterly reduction in adjusted costs2 ex-bank levies\nWell on track to meet 2019 adjusted cost2 target of 21.8 billion euros\nCommon Equity Tier 1 ratio rises to 13.7%\nManaging toward Return on Tangible Equity target of above 4% in 2019\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) reported group net income of 201 million euros for the first quarter of 2019, up 67% year-on-year. Profit before tax was 292 million euros, after bank levy charges of 604 million euros in respect of the full year 2019, taken in the first quarter. The effective tax rate for the quarter was 31%. In the prior year quarter, the effective tax rate of 72% was mainly impacted by non-tax deductible expenses, including litigation, and tax effects related to share based payments.\nRevenues: resilient in less market-sensitive businesses, lower in Sales & Trading\nNet revenues were 6.4 billion euros, down 9% year-on-year, or 5% if adjusted for specific items¹ which had a positive impact of 31 million euros in the quarter, versus a positive impact of 315 million euros in the prior year quarter.\nRevenues in less market-sensitive businesses, Global Transaction Banking (GTB), Private & Commercial Bank (PCB) and Asset Management, were resilient, down 2% but rising 1% excluding specific items1. GTB revenues were up 6% year-on-year to 975 million euros. Revenues in PCB were 2.5 billion euros, down 5% on a reported basis but stable if adjusted for specific items1. Revenues in Asset Management were 525 million euros, down 4% year-on-year, reflecting lower assets under management due to outflows in 2018 and market declines in the fourth quarter of 2018 which reversed in the first quarter.\nRevenues in the Corporate & Investment Bank (CIB), which includes GTB, were down 13% year-on-year or 10% if adjusted for specific items1. Revenues in Sales & Trading (Fixed Income) were down 19% to 1.5 billion euros while Sales & Trading (Equity) revenues were down 18% to 468 million euros, reflecting perimeter reductions during 2018 and challenging market conditions. Revenues in Origination and Advisory were down 5% but the business gained market share globally (source: Dealogic).\n¹ Specific revenue items in the current and prior year quarter were as follows:\nPositive indicators: volume growth in loans, deposits and assets under management\nLoan growth during the quarter was 10 billion euros, including 5 billion euros in CIB and 3 billion euros in PCB. Over the past twelve months, loan growth was 23 billion euros, or 28 billion euros if adjusted for exited businesses in PCB.\nAcross PCB and Asset Management, assets under management increased by 70 billion euros during the quarter, driven by net inflows of 10 billion euros, market performance and exchange rate movements. PCB’s assets under management increased by 29 billion euros in the quarter, of which 14 billion euros were in Wealth Management. PCB’s increase included approximately 8 billion euros of net inflows. Asset Management’s assets under management increased by 42 billion euros including net inflows of 2 billion euros, or 7 billion euros excluding cash products.\nCosts: sustained year-on-year reductions, 2019 target reaffirmed\nNoninterest expenses were 5.9 billion euros, down 8% year-on-year. Adjusted costs2 were also 5.9 billion euros, down 7%, which substantially offset a challenging revenue environment. Costs included 604 million euros in bank levies, which are incurred mainly in the first quarter of each year in respect of the full year, down by approximately 60 million euros versus the prior year quarter.\nThis reduction mainly reflects balance sheet reductions in recent years and a positive impact from the Postbank merger. Adjusted costs2 excluding bank levies were 5.3 billion euros in the quarter, as compared to 5.7 billion euros in the first quarter 2018, and were the fifth consecutive reduction in quarterly adjusted costs2 excluding bank levies.\nDeutsche Bank achieved year-on-year reductions in both compensation and non-compensation costs. Lower compensation and benefits expenses reflected reductions in the internal workforce, while savings across all major areas of non-compensation costs were driven by active management of consumption and vendor spending. Management reaffirmed its commitment to Deutsche Bank’s 2019 target for adjusted costs2 of 21.8 billion euros.\n(2) Noninterest expenses and adjusted costs in the current and prior year quarter were as follows:\nCredit quality remains strong\nProvision for credit losses was 140 million euros in the quarter, up 60% year-on-year. This development partly reflects lower net releases in CIB, driven mainly by releases in the CIB shipping portfolio in the prior year quarter, and a rise in PCB provisioning driven partly by model recalibrations. At 13 basis points of loans, provision for credit losses remains low by historical standards, reflecting the low risk profile of the bank’s portfolio.\nContinued capital and balance sheet strength\nDeutsche Bank’s CET 1 ratio strengthened to 13.7% in the quarter, an improvement of 18 basis points versus the end of the fourth quarter of 2018, despite absorbing the impact of 16 basis points relating to adoption of IFRS 16. The improvement was driven in part by a reduction in risk weighted assets (RWAs) of 3 billion euros, driven by reductions in market risk and operational risk RWAs which more than offset growth in credit risk RWAs.\nLiquidity, at 260 billion euros, remained comfortably in excess of regulatory requirements. The Liquidity Coverage Ratio (LCR) at the end of the quarter was 141%. At this level, the LCR is 41 percentage points above the required level of 100%, which is equivalent to a surplus of 68 billion euros.\nReturns to shareholders: targets reaffirmed\nPost-tax return on tangible equity (RoTE) was 1.3% in the quarter, versus 0.9% in the prior year quarter. Assuming an equal apportionment of bank levies paid in the first quarter across the four quarters of 2019, RoTE would have been 3.6% in the quarter. Deutsche Bank continues to manage toward a post-tax RoTE of over 4% for 2019, and toward further improving shareholder returns over time.\nGroup results at a glance\n\nN/M - Not meaningful\nCorporate & Investment Bank (CIB)\nNet revenues were 3.3 billion euros, down 13% year-on-year, or 10% if adjusted for the specific items set forth in the table on page 2.\nGlobal Transaction Banking revenues grew by 6% to 975 million euros, driven by higher net interest income, notably in Cash Management.\nRevenues in Sales & Trading (Fixed Income) were down 19%, and down 18% excluding a specific item consisting of a change in the valuation of an investment which impacted Rates. This development partly reflected business perimeter reductions in previous quarters and challenging market conditions. Revenues in FX and Credit were down slightly; growth in flow credit was offset by year-on-year declines in distressed debt versus a strong prior year quarter.\nRevenues in Sales & Trading (Equity) were down 18% at 468 million euros, reflecting challenging market conditions and perimeter adjustments in the prior year.\nRevenues in Origination & Advisory were 455 million euros, down 5% against a backdrop of lower industry fee pools. Significant growth in Advisory revenues was more than offset by declines in Equity and Debt Origination.\nNoninterest expenses were down 7% to 3.4 billion euros, and adjusted costs were reduced by 5%, reflecting continued cost discipline and the measures taken during 2018 to refocus the business. CIB’s first-quarter costs included 535 million euros in bank levies in respect of the full year 2019.\nCIB reported a loss before tax of 88 million euros in the quarter after the aforementioned bank levies. Assuming an equal apportionment of bank levies across the year, profit before tax would have been 313 million euros.\nFocused growth investments have included targeted hires in fixed income and debt origination and loan growth in GTB. Loans in CIB grew by 5 billion euros during the quarter and by 13 billion euros since the end of the prior year quarter.\nMarket share gains: In a difficult market environment, Deutsche Bank improved market share in corporate finance (source: Dealogic). Deutsche Bank was joint No. 1 in US IPOs and returned to a top-5 position in global leveraged debt capital markets (source: Dealogic). Deutsche Bank gained share in investment grade debt origination during the quarter and acted as bookrunner on 14 of the 20 largest transactions globally in the quarter (source: Dealogic).\nCorporate & Investment Bank results at a glance\nPrivate & Commercial Bank (PCB)\nNet revenues were 2.5 billion euros, down 5% year-on-year. Revenues were flat excluding the specific items set forth in the table on page 2, as growth in loan volumes offset the negative impact of continued deposit margin compression.\nIn the Private & Commercial Business (Germany), revenues were 1.7 billion euros, down by 7% on a reported basis and up 2% if adjusted for the non-recurrence of a specific item consisting of a 156 million euro gain on the sale of a property in the prior year quarter. Growth in business volumes offset deposit margin compression.\nThe Private & Commercial Business (International) generated revenues of 359 million euros, down 4% year-on-year. Growth in loan revenues and re-pricing measures were more than offset by the non-recurrence of a small asset sale in the prior year quarter and a change in the treatment of loan fees in Italy.\nWealth Management revenues were 427 million euros, stable year-on-year, and down 7% if adjusted for the specific item consisting of gains on workout activities relating to legacy Sal. Oppenheim positions. This reflects lower Assets under Management in the fourth quarter of 2018 against a backdrop of declining markets, and the non-recurrence of smaller divestitures in the prior year quarter.\nNoninterest expenses were 2.1 billion euros, down 5%, while adjusted costs were down by 4%, reflecting the partial disposal of Polish operations in 2018, further headcount reductions and continued cost discipline.\nProfit before tax was 287 million euros, down 11%, partly reflecting specific items set forth in the table on page 2. In addition, profit before tax was impacted by a year-on-year rise of 29 million euros in provision for credit losses to 117 million euros, partly driven by model recalibrations. Provisions remained at low levels at 17 basis points of loans, reflecting a low risk portfolio and rigorous underwriting standards. Post-tax return on tangible equity (RoTE) was 6.4% in the quarter.\nGrowth in business volumes: PCB’s assets under management increased by 29 billion euros, or 6%, to 502 billion euros during the quarter, of which Wealth Management contributed some 14 billion euros. PCB’s increase was driven in part by improved performance, and partly by net money inflows of 8 billion euros, including 6 billion euros in term deposits and 2 billion euros in investment products. Loan growth was 3 billion euros during the quarter. In the past twelve months, PCB achieved loan growth of 13 billion euros and deposit growth of 20 billion euros if adjusted for exited businesses.\nPrivate & Commercial Bank results at a glance\nAsset Management (AM)\nNet revenues were 525 million euros, down 4% versus the prior year quarter but up slightly on a challenging fourth quarter of 2018. The year-on-year decline was driven in part by lower management fees resulting from lower assets under management at the end of 2018, which related to outflows and market declines. These effects were partly offset by the non-recurrence of a one-time loss on the sale of a discontinued business in the first quarter of 2018.\nNoninterest expenses were 398 million euros, down 16%, with adjusted costs down 11% to 395 million euros, due to the non-recurrence of litigation expenses which impacted noninterest expenses in the prior year, management action to reduce infrastructure expenses and savings on professional fees.\nProfit before tax was 96 million euros, up 34% year-on-year, as cost reductions more than offset both the decline in revenues and the impact of 31 million euros of non-controlling interests following the IPO of DWS in the first quarter of 2018. Adjusted for non-controlling interests, profit before tax would have risen by 77%.\nAssets under management increased by 42 billion euros, or 6%, to 706 billion euros during the quarter. This increase was driven by market performance, exchange rate movements and net new money inflows of 2 billion euros, or 7 billion euros excluding cash products, in key asset classes including Passive, Alternatives, and flagship funds, Top Dividende and Concept Kaldemorgen. Some 3 billion euros of inflows were contributed by DWS’s strategic alliances with Nippon Life, Zurich, DVAG and Generali.\nSustained commitment to responsible investing. DWS was named “Responsible Investor of the Year” for the second year in a row by Insurance Asset Risk. The US Xtrackers business launched the largest Environmental, Social and Governance (ESG) Exchange-Traded Fund to come to market, developed in collaboration with Ilmarinen, the Finnish pension insurance company.\nAsset Management results at a glance\nCorporate & Other (C&O)\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nChristian Streckert Charlie Olivier\nPhone: +49 69 910 38079 Phone: +44 20 754-57866\nE-mail: christian.streckert@db.com E-mail: charlie.olivier@db.com\nInvestor Relations\n+49 800 910-8000 (Frankfurt)\n+44 20 7541-4100 (London)\n+1 212 250-0604 (New York)\ndb.ir@db.com\nAn analyst call to discuss first-quarter 2019 financial results will take place today, Friday, 26 April 2019, at 10.00 CEST. This conference call will be broadcast via internet: www.db.com/quarterly-results \nA Fixed Income investor call will take place on Monday, 29 April 2019, at 15.00 CEST. This conference call will be broadcast via internet.\nThe Earnings Report, the Financial Data Supplement (FDS), the presentation and the audio-webcast for the analyst conference call are available at: www.db.com/quarterly-results \nThe Deutsche Bank Pillar 3 Report Q1 2019 is available at: www.db.com/regulatory-reporting \nThis document contains non-IFRS financial measures. For a reconciliation to directly comparable figures under IFRS, to the extent not provided herein, please refer to the Financial Data Supplement.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}