{
    "url": "https://www.db.com/news/detail/20190425-mr-deutsche-bank-and-commerzbank-discontinue-discussions?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 25, 2019",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Deutsche Bank and Commerzbank discontinue discussions",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) and Commerzbank decided today to discontinue their discussions concerning a combination of their businesses. After careful analysis it became apparent that such a combination would not be in the interests of either bank’s shareholders or other stakeholders.\n“It made sense to evaluate this option for domestic consolidation in Germany. However, we were always clear: we needed to be convinced that any potential combination would generate higher and more sustainable returns for shareholders and allow us to enhance our value proposition to clients,” said Christian Sewing, CEO of Deutsche Bank.\n“After thorough analysis, we have concluded that this transaction would not have created sufficient benefits to offset the additional execution risks, restructuring costs and capital requirements associated with such a large-scale integration. I would like to thank Martin Zielke and everyone involved for the constructive discussions over the past few weeks.”\nDeutsche Bank will continue to review all alternatives to improve long-term profitability and shareholder returns.\nFor the first quarter of 2019, Deutsche Bank expects to report income before income taxes of approximately 290 million euros and net income of approximately 200 million euros, after booking full-year 2019 bank levies of around 600 million euros in the quarter. Total revenues are expected to be 6.4 billion euros, including 3.3 billion euros in the Corporate & Investment Bank.\nTotal noninterest expenses and adjusted costs (1)  are each expected to be 5.9 billion euros, in both cases including the aforementioned bank levies. The Common Equity Tier 1 ratio at the end of the quarter is expected to rise to approximately 13.7%, from 13.6% at the end of the previous quarter.\nDeutsche Bank achieved loan and deposit growth in the Private & Commercial Bank as well as loan growth in the Corporate & Investment Bank. Wealth Management and Asset Management recorded positive net inflows.\nChristian Sewing: “Our preliminary results demonstrate the strength of our franchise and our continued progress in executing our plans in a very challenging market environment. We have made progress on key business drivers: growth in loans and deposits, a recovery in assets under management and market share improvements in corporate finance. Our continued cost discipline helped us to offset lower revenues, and we are well on track to meet our 2019 cost target of 21.8 billion euros.”\nDeutsche Bank will report first quarter results on April 26, 2019, as scheduled.\n(1) Adjusted costs are noninterest expenses excluding impairment of goodwill and other intangible assets, litigation, and restructuring and severance.\n\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nChristian Streckert\nPhone: +49 69 910 38079\nEmail: christian.streckert@db.com\n\nTim-Oliver Ambrosius\nTel. +49 69 910-42648\nEmail: tim-oliver.ambrosius@db.com\nInvestor Relations\n+49 800 910 8000 (Frankfurt)\n+44 20 7541 4100 (London)\n+1 212 250 0604 (New York)\ndb.ir@db.com\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\n\nForward-Looking Statements\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on the plans, estimates and projections currently available to the management of Deutsche Bank.\nForward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update any of them in light of new information or future events. By their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which Deutsche Bank derives a substantial portion of its revenues and in which the bank holds a substantial portion of its assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of strategic initiatives of the bank, the reliability of the bank’s risk management policies, procedures and methods, and other risks referenced in the bank’s filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in the bank’s SEC Form 20-F of 22 March 2019 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}