{
    "url": "https://www.db.com/news/detail/20190424-sportswear-brands-have-grown-significantly-what-is-behind-this-optimism?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 24, 2019",
    "tags": [
        "Research"
    ],
    "title": "Sportswear brands have grown significantly – what is behind this optimism?",
    "body": "Podzept is a podcast which addresses the current issues driving the world of economics and finance. Listen to Podzept here.\nOver the past 12 months, sportswear brands have grown significantly and on average sector share prices are up 30 percent despite a background of general nervousness in equity markets. We interview Jaina Mistry to find out what is behind this optimism, whether it is still warranted when there are so many concerns about global growth.\nHow big is the sportswear market today?\nThe sportswear market was worth 323 billion US dollars in 2017 and represents about 18 percent of the global apparel and footwear market. It sounds like a large number but the way we dress is changing, and we are all (probably) participating in this trend. Do you consider your choice of trainers to be a fashion statement? Is your style becoming more casual? Even if you are still strictly suited-and-booted, this is the general direction of travel. The trend is called athleisure - it’s where sportswear meets fashion and it’s becoming more widespread. Investors can take advantage of this trend by understanding the market and which brands are best positioned within it.\nHow much growth is left?\nThe market has been growing fast but there is still more to come. We forecast 6.8 percent growth in 2019. Spending on sportswear is most strongly established in the US, where the average person spends over 300 dollars per year. But it’s relatively underpenetrated in emerging markets - China and India are massive opportunities for sportswear brands. In China, the average spend per person is less than 25 dollars per person and in India it is only 5 dollars per person. China will be crucial to driving growth in the short-to-medium term, while India is a longer-term opportunity.\nWhat will drive growth in these markets?\nThere are three main growth drivers: 1) wealth creation and an emerging middle class population; 2) increased health awareness and sports participation; and 3) fashion merging with sportswear.\nHow can brands take advantage of this attractive market?\nIt’s no doubt a competitive sector and the quality of marketing is a key driver of growth. This includes sponsoring the right athletes and celebrities, having a strong social media presence and effective story-telling skills. Some brands spend more on marketing than they make in operating profit. Product innovation is also crucial to competitiveness - this includes technology and product design.\nIs the industry undergoing any changes at this point in time?\nArguably the biggest disruptor is the shift towards retail. This means selling directly to the consumer as opposed to through a third-party such as JD Sports or Footlocker. Retail is far more complex; it requires investment in people, stores, digital, warehousing and logistics – but it comes with huge rewards. These include better a understanding of the consumer and better control over product presentation and pricing. This can mean better quality growth and higher profit margins.\nThis article focuses on ‘Global Sporting Goods: Portland trailblazer’, a report co-authored by Jaina Mistry, DB Research European Sporting Goods Analyst, and Paul Trussell, US Apparel & Food Retail Analyst.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}