{
    "url": "https://www.db.com/news/detail/20190417-cio-insights-establishing-a-new-altitude?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 17, 2019",
    "tags": [
        "Corporate products",
        "Investment Banking",
        "Research",
        "Wealth"
    ],
    "title": "Establishing a new altitude – investing beyond the peaks",
    "body": "Political uncertainty in Europe and rising wages are among factors further weakening corporate earnings growth expectations ahead of Q2 results, according to Deutsche Bank Wealth Management (WM).\nIn its latest “CIO Insights” update, Christian Nolting, Chief Investment Officer for Deutsche Bank WM, says “earnings growth expectations are already being revised down around the world and we expect that there is further to go here.”\n“Equities – Earnings ease” is one of Nolting’s six key investment themes for 2019, which he analyses and updates in the report.\nConcerns around Brexit and Italy as well as a potential escalation in global trade tensions (most notably affecting German exporters) mean “further gains in European equities are likely to be limited,” Nolting says. “Moreover, despite recent downgrades, European earnings expectations still look too high and could be subject to further downward revisions.”\nIn the US, the CIO team believes the trend for higher wages without an accompanying rise in inflation means companies lose a degree of pricing power to pass on higher costs to consumers. This limits potential future gains in revenues, “which in turn might help explain the recent reduction in corporate earnings forecasts.”\nFrom a global standpoint, equity market gains in Q1 were “a reaction to the overselling in Q4 2018 rather than the beginning of a new trend.” In fact, Nolting concludes, we expect equity returns over the next 12 months to be modest.\nThe six key investment themes for 2019 in light of economic and market developments so far can be summarised as follows:\n“Economy – Growth deceleration”\n“Capital markets – Vigilant on volatility”\n“Fixed income – (U.S.) yields on the return”\n“Equities – Earnings ease”\n“FX and commodities: U.S. dollar and oil centre-stage”\n“Tech transition”\nIn the publication, Nolting and his team look how market gains can coexist with an outlook of slowing economic expansion and easing earnings growth, and whether the promise of continued accommodative monetary policy can remain credible. Portfolios may need to be realigned when appropriate to reflect problems ahead: “use rallies to reassess”.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}