{
    "url": "https://www.db.com/news/detail/20230317-deutsche-bank-reports-continued-delivery-of-transformation-in-2022-and-clear-targets-for-2025?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, March 17, 2023",
    "tags": [
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank reports continued delivery of transformation in 2022 and clear targets for 2025",
    "body": "Annual Report: highest profit since 2007 with delivery on transformation goals\n2022 profit before tax up 65% year on year to € 5.6 billion\nCost/income ratio of 75%, down from 85% in 2021\n2022 net income more than doubles year on year to € 5.7 billion\nPost-tax return on average tangible shareholders’ equity (RoTE)¹ of 9.4% with post-tax return on average shareholders’ equity (RoE)¹ of 8.4%\nCommon Equity Tier 1 (CET1) capital ratio of 13.4% with leverage ratio of 4.6%\nProposed dividend of € 0.30 per share, up from € 0.20 in 2021\nTotal compensation up 3% year on year to € 10.2 billion\nFixed Pay up 4% to € 7.7 billion\nPerformance-based variable compensation essentially unchanged at € 2.1 billion\nStrategy and financial targets through 2025 reaffirmed\nGlobal Hausbank strategy as a platform for sustainable growth\nConfirmation of 2025 financial targets and capital objectives, including ~ € 8 billion of capital distribution in respect of the financial years 2021-2025¹\nNon-Financial Report: ESG target delivered with reinforced net zero goals\n2022 sustainable financing and investment volumes of € 215 billion cumulatively since 2020 ex-DWS, ahead of target\nNet zero targets for high-emission sectors for 2030 and 2050\nFinanced emissions down 4% in 2022\nDirect greenhouse gas emissions down 19% in 2022 and by ~80% in past decade\nProgress against diversity objectives in 2022\n20% of Management Board and 30% of Supervisory Board posts held by women, in line with target\nManaging Director, Director and Vice President roles held by women rises to 31% in 2022, with a target of 35% by 2025 \n\n“Our 2022 Annual Report underlines how far we have come in transforming Deutsche Bank,” said Christian Sewing, Chief Executive Officer. “We delivered our best financial results for fifteen years, with strength across all four core businesses. We also proved our resilience thanks to solid capital, a well-diversified and high-quality balance sheet, strong liquidity and tight risk discipline. We are well equipped to help clients navigate challenging conditions and set Deutsche Bank on a course for sustainable growth and returns to shareholders.”\nHe added: “Our 2022 Non-Financial Report reflects our commitment to building a more sustainable Deutsche Bank, creating a diverse and inclusive workplace for our people, further reinforcing our control environment, and contributing to the communities we serve around the globe.”\nDeutsche Bank’s (XETRA: DBKGn.DE / NYSE: DB) 2022 audited results, published today in the Annual Report, confirm financial and strategic achievements of the bank’s transformation since 2019. There were no divergences from the bank’s unaudited results published at the Annual Media Conference on 2 February 2023.\n2022: delivering on transformation with significant profit growth\nDeutsche Bank’s 2022 Annual Report confirms progress on all dimensions of the bank’s transformation program, launched in 2019, and the benefits of this transformation for the bank’s 2022 financial performance:\nProfit before tax up 65% year on year to € 5.6 billion, the highest since 2007\nNet revenues grew 7% year on year to € 27.2 billion\nNoninterest expenses were reduced by 5% to € 20.4 billion, with adjusted costs ex-transformation charges and bank levies of € 19.0 billion, flat year on year or down 3% on an FX-adjusted basis\nThe cost/income ratio improved to 75%, down from 85% in 2021\nProvision for credit losses was 25 basis points of average loans, in line with guidance\nNet income, at € 5.7 billion, was more than double over 2021\nPost-tax RoTE1 rose from 3.8% to 9.4%\nDiluted earnings per share were € 2.37, up from € 0.93 in 2021\nCapital and leverage remained strong and delivered in line with longstanding objectives:\nThe CET1 capital ratio was 13.4%, and has remained in line with the bank’s commitment of above 12.5% since mid-2019\nLeverage ratio was 4.6%, in line with the target of ~4.5%\nReturn of capital to shareholders, with a proposed dividend to € 0.30 per share for 2022, up 50% over 2021\nThe Capital Release Unit fulfilled its de-risking and cost reduction mandate by year-end and was capital accretive during the period 2019-2022  \nGlobal Hausbank positioning as a platform for sustainable growth through 2025\nDeutsche Bank’s Global Hausbank positioning, reaffirmed in 2022, aims to enable sustainable growth. This positioning enables Deutsche Bank to respond to key trends in the current operating environment. These include macro-economic and geopolitical uncertainties, the rising importance of sustainability, and continued rapid evolution of technology.\nDeutsche Bank also reaffirmed its financial targets for 2025:\nPost-tax RoTE1 of greater than 10%\nCompound annual revenue growth of 3.5%-4.5% from 2021 to 2025\nA cost/income ratio of below 62.5%, with enhanced operating leverage through cost discipline enabling self-funded investments and over € 2 billion in additional cost efficiency measures between 2022 and 2025\nThe bank’s capital objectives for 2025 include:\nMaintaining a CET1 capital ratio of approximately 13%\nA total payout ratio of 50% from 2025 onwards, with a cumulative payout of around € 8 billion in respect of the years 2021-2025\nCompensation: rewarding performance in an uncertain operating environment\nTotal compensation awarded to Deutsche Bank employees in respect of 2022 was € 10.2 billion, up 3% compared to € 9.9 billion in 2021.\nFixed pay was € 7.7 billion, up 4% year on year. This reflected higher levels of inflation during the year and a 2.4% rise in Group headcount during 2022 due to business growth, the internalization of external staff and investments in the technology and control functions\nVariable compensation was € 2.1 billion, essentially unchanged year on year. This development reflected the recognition of successful transformation efforts and business performance, counterbalanced by due consideration of uncertainties in the outlook for the global economy together with prudent capital planning\nThe Management Board, comprising ten members on a full-year equivalent basis, received total compensation for 2022 of € 67.7 million, up 5% compared to 2021. Management Board compensation is set by the Supervisory Board and reflects 2022’s strong financial performance and attainment of strategic objectives, including delivery on the goals and financial targets of the bank’s transformation agenda and ESG-related objectives. Variable compensation for Management Board members includes both short-term and long-term awards with payouts deferred over several years.\nDetails of Management Board compensation, including the basis for calculation of short-term and long-term awards for individual Management Board members, are set out in pages 412-448 of the Annual Report.  \nNon-Financial Report\nDeutsche Bank’s 2022 Non-Financial Report, also published today, outlines the bank’s role in the transition to a sustainable and climate-neutral economy; governance and operations; technology, data and innovation; and people and corporate social responsibility activities.\nSignificant progress on sustainability in 2022\nSustainable finance volumes exceed target: volumes in sustainable financing and investment ex-DWS, cumulative since the beginning of 2020&sup3, reached € 215 billion at the end of 2022, ahead of the bank’s accelerated target of € 200 billion, including € 58 billion in 2022. The bank re-affirmed its target for a cumulative € 500 billion in these volumes by the end of 2025.\nNet zero targets for financed emissions in carbon-intensive industries: Deutsche Bank published net zero targets for financed emissions in four carbon-intensive sectors which account for 44% of financed emissions in its corporate loan book: upstream oil & gas; power generation; automotive (light duty vehicles), and steel. In 2022, the bank achieved reductions in financed emissions in all four sectors and announced plans to publish targets in at least four additional sectors during 2023 at its recent Sustainability Deep Dive.\nCoal financing further reduced and policy further tightened: Deutsche Bank has financed no new thermal coal mines, nor the expansion of existing mines, since 2016. The bank further reduced coal financing in 2022; corporate loans outstanding decreased by a further 18% to € 231 million, or 0.09% of the corporate loan book. As stated at the bank’s Sustainability Deep Dive of March 2nd, the bank further tightened its thermal coal policy. From May 2023 transition plans will become mandatory for companies seeking financing for which thermal coal accounts for 30% of revenues, down from 50% previously, and for any company producing more than 10 million metric tonnes of coal per year or generating more than 10 gigawatts of electricity from thermal coal.\nStrengthened governance: in 2022, Deutsche Bank created a Chief Sustainability Office, reporting to the Chief Executive Officer, and launched a Net Zero Forum, comprising senior representatives from business, the Chief Risk Office and the Chief Sustainability Office, to assess new transactions with a potential impact on the bank’s financed emissions or net zero targets. As stated in its recent Sustainability Deep Dive, from 2026 the bank expects at least 90% of high-emission clients engaging in new lending transactions to have published net zero commitments in place.\nFurther progress on in-house ecology: as a founding member of the Net Zero Banking Alliance, Deutsche Bank’s target is to be net-zero in its own operations by 2050. In 2022 the bank made further progress on reducing the carbon footprint of its own operations:\nDirect greenhouse gas emissions were down 19% year on year. In the past decade, the bank has reduced greenhouse gas emissions by approximately 80%\nTotal energy consumption was reduced by 13% in 2022. Deutsche Bank remains on track to meet its goal of a 20% reduction between 2019 and 2025\n96% of the bank’s electricity was derived from renewable sources in 2022, more than 10 percentage points ahead of its 2022 interim target   \nContinuing to reinforce the control environment\nAs communicated at its Annual Media Conference, by the end of 2022 the bank delivered on its commitment of a cumulative spend of € 4 billion on its control environment since 2019. Deutsche Bank also invested further in its anti-financial crime capabilities in 2022. The bank’s Anti-Financial Crime (AFC) function executed on its strategy to augment its resources during the year, boosting its strength to 1,932 staff on a full-time equivalent basis, up by more than 300 over 2021.\nContinuing to invest in talent and diversity\nKey people indices remain at high levels: in Deutsche Bank’s 2022 People Survey, the Commitment Index was 69% and the Enablement Index remained steady at 73%.\nInvesting in talent: Deutsche Bank continued to invest in talent during 2022, hiring 1,278 graduates and vocational trainees and invested € 33.5 million in employee training.\nSupporting diversity, equity and inclusion: with staff members from 157 different nationalities and representation in 58 countries worldwide, diversity is core to Deutsche Bank. The bank’s commitment to gender diversity was reflected in several developments during 2022:\nWomen accounted for 20% of the Management Board, 30% of the Supervisory Board and 46% of all staff\nProgress toward the bank’s ’35 by 25’ commitment, which aims for at least 35% of Managing Director, Director and Vice President roles to be held by women by 2025. 30.7% of these roles were held by women in 2022, up from 29.9% in 2021 and meeting the bank’s interim target for 2022\n42% of all Director Acceleration Program participants and 50% of Vice President Acceleration Program participants were women\nLesbian, Gay, Bisexual, Queer and Intersex (LGBTQI) inclusion: Deutsche Bank underlined its position as an industry leader on LGBTQI rights in 2022. The bank was awarded the maximum score of 100 in the Human Rights Campaign’s annual Corporate Equality Index for the 19th consecutive year and won prestigious awards: the Human Rights Campaign Foundation’s Best Places to Work for LGBTQ Equality and Yahoo Finance’s OUTstanding LGBT+ Role Model Lists.\nMore key figures and statements related to the bank’s people agenda are voluntarily published in the annual\nPDF\nHuman Capital Report. Deutsche Bank is fulfilling the ISO norm for Human Capital Reporting (ISO 30414) for the third consecutive time.\nContinued commitment to Corporate Social Responsibility\nIn 2022, Deutsche Bank’s Corporate Social Responsibility (CSR), art, culture and sport projects reached more than 3.3 million people worldwide. Total investments were € 55.1 million, up from € 52.1 million in 2021.\nSupport for Ukraine: The bank donated € 1 million to support relief efforts in Ukraine and launched a fundraising drive which raised more than € 500,000 in addition from employees. Donations went to Red Cross organisations and the International Medical Corps. The Deutsche Bank Foundation supported the charity CARE Deutschland, enabling children who fled Ukraine to attend school classes quickly. The bank joined forces with JobAidUkraine to match job vacancies with refugees seeking employment.\nFurther key programs during the year included:\nBorn to Be, Deutsche Bank’s youth engagement program, which comprises 128 education projects across 27 countries. The program, which has positively impacted the lives of 5.7 million children and young people since 2014, seeks to empower young people by fostering skills and improving access to education and employment opportunities\nMade for Good, the bank’s enterprise program, which helps social and creative enterprises gain advice, support, better access to networks and funding. The program has supported some 27,000 social enterprises since 2016\nIn the communities where Deutsche Bank does business, the bank supports projects which deliver welfare and support to people experiencing homelessness and promotes housing and essential infrastructure. The bank supported 117 projects in 27 countries in 2022 and reached over 5.4 million people since 2015\nHow We Live, an environmental impact program, launched in 2022. Employee volunteers planted more than 108,000 trees in 2022, and over 26,000 people and 64 schools were reached with environmental awareness and training initiatives\nPromoting financial literacy: Deutsche Bank employees continued to contribute to financial education in schools across Germany. At year-end 2022, more than 1,000 employees were registered as contributors to this effort (compared to a target of 700), and visited nearly 600 schools and held 1,072 workshops during the year\nSignificant increase in employee volunteering: around 18,700 employees, or 22% of total staff, participated in the bank’s volunteer programs, up from 18% of staff in 2021. Employees donated nearly 190,000 hours of their time, up from 133,000 hours in 2021. Direct employee donations to charitable causes, and matching donations by the bank, raised € 8.4 million for charitable causes during the year, up from € 7.4 million in 2021.\nOther financial and regulatory reports\nToday Deutsche Bank published its 2022 Pillar 3 Report and Annual Financial Statements of Deutsche Bank AG under German accounting rules (HGB). In addition, the Annual Report on Form-20-F will be made available today.\n¹ For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ on pp 17-25 of the fourth quarter 2022 Financial Data Supplement\n² Subject to achievement of financial plans and requisite approvals\n³ Cumulative ESG volumes include sustainable financing (flow) and investments (stock) in the Corporate Bank, Investment Bank and Private Bank from January 1, 2020 to date, as set forth in Deutsche Bank’s Sustainability Deep Dive of May 20, 2021. Products in scope include capital market issuance (bookrunner share only), sustainable financing and period-end assets under management. Cumulative volumes and targets do not include ESG assets under management within DWS, which are reported separately by DWS.\n  Final and audited results at a glance\n  Availability\nAll reports can be downloaded from https://www.db.com/ir/en/annual-reports.htm. The Annual Report on Form 20-F, which will be submitted to the US Securities and Exchange Commission today, will also be made available following submission (English only) on the website: https://www.db.com/ir/en/sec-filings-for-financial-results.htm. The Financial Data Supplement can be downloaded from Quarterly Results - Deutsche Bank (db.com)",
    "number_of_ratings": 18,
    "rating": 4.3,
    "likes": 57
}