{
    "url": "https://www.db.com/news/detail/20230308-deutsche-bank-celebrates-150-years-in-the-uk?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 14, 2023",
    "tags": [
        "Europe"
    ],
    "title": "Deutsche Bank celebrates 150 years in the UK",
    "body": "Deutsche Bank celebrates its 150th anniversary in the UK on March 8, 2023, marking a significant milestone in the bank's history.\nThe bank's UK journey began in 1873 with the opening of its London Agency, which was its first European foreign branch. Today, Deutsche Bank employs more than 7,000 employees in the UK from a diverse range of backgrounds. It is one of the largest employers in the City of London.\nFabrizio Campelli, Global Head of Deutsche Bank’s Corporate Bank and Investment Bank and management board member responsible for the UK, said: “We want to grow our UK franchise. After a highly successful three-year transformation, Deutsche Bank is stable, secure and back in growth mode, with the UK playing a key role in our future.”\nTiina Lee, Deutsche Bank UK CEO, said: \"Our success in the UK is driven by the strength of our core businesses. We are a trusted adviser and lender to many companies and financial institutions, supporting some of the most important strategic transactions in the UK. Our aim is to help UK companies connect with the world and vice versa, and our global reach and business mix makes us a natural partner in this endeavour.\"\nTo celebrate the bank’s historic milestone, Deutsche Bank UK has unveiled a brand-new film, \"150 Years of connecting the UK\", which showcases the bank's deep commitment to the UK, its clients, employees and communities. It is available on the bank's dedicated microsite, which also contains information on the Deutsche Bank’s landmark deals and its contributions to the UK's net-zero objective.\nLater this year, many of the bank’s London-based staff will start moving into the new headquarters at 21 Moorfields, one of the largest new buildings in the City of London, equivalent to half the area of the O2 arena. The flagship building will help reshape and bring the bank's future workplace to life and offer an outstanding client experience.",
    "number_of_ratings": 29,
    "rating": 4.4,
    "likes": 19
}