{
    "url": "https://www.db.com/news/detail/20230313-deutsche-bank-finances-pepperl-fuchs-s-sustainable-factory-in-vietnam?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 13, 2023",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank finances Pepperl+Fuchs's sustainable factory in Vietnam",
    "body": "Pepperl+Fuchs today announced the inauguration of a new sustainable manufacturing facility in Vietnam, which has been financed with a USD 15m green loan from Deutsche Bank. The loan and associated advisory services from Deutsche Bank allowed the German industrial sensor manufacturer to meet international green building standards and establish a model for seamlessly extending its global sustainability commitments to its operations in Asia. The facility produces industrial sensors for factory automation technologies including sensors, signal transmission devices and printed circuit board assembly and significantly expands the company’s production capacity in Vietnam.\nThe new manufacturing facility has obtained a LEED Gold certification. LEED (Leadership in Energy and Environmental Design) is a green building certification program developed by the US Green Building Council. It is a globally recognized benchmark for sustainability in real estate. Building projects earn points for addressing carbon, energy, water, waste, transportation materials, health, and indoor environment quality to achieve corresponding levels of certification; gold certification is the second highest level.\nPepperl+Fuchs Executive Vice President Global Finance, Andreas Bouche said: “We are proud to begin our ESG financing journey in Asia Pacific. Four of the eight countries globally where we operate manufacturing facilities are in this region, and the opportunity to help set a strong standard for responsible manufacturing in these developing economies is great.\nDeutsche Bank has been a reliable partner in this journey; we are glad to have benefitted from their valuable advice and practical ESG expertise in Asia Pacific. \nAndreas Bouche\nPepperl+Fuchs Regional Director Finance Asia Pacific, Carmen Tai said: “We are happy to embark on Pepperl+Fuchs’ sustainability journey with Deutsche Bank in Asia Pacific through this new Vietnam manufacturing facility. As one of the key manufacturing sites in the Group’s global footprint, this new Vietnam factory shows our commitment to sustainable growth, and we look forward to continuing this journey in the Asia Pacific region. \nDeutsche Bank Head of German, Austrian and Swiss MNCs in APAC Bernd Starke said: “We are delighted to have supported Pepperl+Fuchs with the financing to support construction of this LEED Gold certified factory. By opting to strive for the highest standards in environmentally friendly, socially responsible manufacturing, Pepperl+Fuchs have made clear that they take sustainability in their worldwide operations seriously.”\nThis transaction exemplifies Deutsche Bank’s Global Hausbank strategy – we are committed to helping our clients in all regions and on all products, including support to companies like Pepperl+Fuchs in meeting their global sustainability standards in APAC.\nDeutsche Bank Head of ESG for Asia Pacific Kamran Khan\nDeutsche Bank Chief Country Officer for Vietnam Huynh Buu Quang said: “Vietnam is playing an increasingly prevalent role in global manufacturing supply chains. Together with our clients, we are proud to help bring sustainable manufacturing benchmarks that are in line with international standards to Vietnam.”",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 7
}