{
    "url": "https://www.db.com/news/detail/20230302-deutsche-bank-announces-additional-measures-to-reinforce-net-zero-commitment?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, March 2, 2023",
    "tags": [
        "Strategy",
        "Sustainability"
    ],
    "title": "Deutsche Bank announces additional measures to reinforce net zero commitment",
    "body": "Sustainable Finance target:\nDeutsche Bank aims for € 500 billion in cumulative ESG financing and investment volumes¹ (ex-DWS) from early 2020 to the end of 2025, after outperformance against initial volume target of € 200 billion by 2022\nNew ambitions in businesses by end of 2025:\nCorporate Bank: supply chain financing solutions to support € 5 billion sustainability-linked working capital financing commitment\nInvestment Bank: € 3 billion in ESG financing in developing economies and emerging markets\nPrivate Bank Germany: € 7-10 billion financing for energy-efficient homes\nReductions in financed CO2 emissions and fossil fuel financing during 2022:\nFinancing of oil and gas sector declined by more than 20% last year, thermal coal sector by around 18%\n~5% reduction in financed emissions of corporate loan book\nYear-on-year reductions in all sectors with published net zero targets\nFinanced emissions in the oil & gas sector (Scope 3) reduced by 28.9%\n Policies & Commitments:\nNet zero pathways in at least four additional sectors planned for 2023\nReinforced and further specified policy for thermal coal\nAt least 90% of high emitting clients in the most carbon intensive sectors engaging in new corporate lending transactions to have a net zero commitment in place from 2026 onwards\nActive participation in initiatives and alliances, e.g. as Co-Lead for the Industry Sector workstream of Net Zero Banking Alliance (NZBA)\n People & Own Operations:\n79% reduction in own CO2 emissions (Scope 1 and 2 and business trips) in the past 10 years\nFocus on Scope 3 emissions reinforced by vendor management going forward\nBank-wide ESG learning program launched\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today presents its path to a more sustainable Global Hausbank at its 2nd Sustainability Deep Dive. This includes a number of measures to support clients on their path to realign their business model towards more sustainability. The bank also reaffirms its commitment to net zero CO2 emissions by 2050. “Despite the present political and economic challenges, we have no time to lose regarding the sustainable transformation of our society,” said Christian Sewing, Chief Executive Officer. “We want to support our clients as a strong partner on their path to a more climate friendly economy. Given our progress in sustainability, we are confident that we can achieve our € 500 billion target in cumulative ESG financing and investment volumes also in a volatile environment.”\nCloser partnerships with clients in the fight against climate change\nThe bank aims to contribute to the fight against climate change by engaging deeply with its corporate, institutional, and private clients. Last autumn, Deutsche Bank announced net zero pathways for four CO2-intensive sectors. The bank now intends that at least 90% of its high emitting clients in the most carbon intensive sectors that engage in new corporate lending transactions shall have a net zero commitment in place from 2026 onwards. At present, this figure is around 50%. “We want to encourage our clients around the world to join us in tackling this necessary transformation,\" says Christian Sewing.\nIn addition to the net zero targets already defined for the carbon-intensive sectors of oil & gas (upstream), power generation, steel and automotive, the bank aims to publish net zero pathways for at least four more sectors in 2023, aiming to reduce the emissions that the bank indirectly finances in its lending business.\nSewing also reaffirms the bank’s position that it is vital to support clients in their efforts to become more sustainable and to end individual client relationships only in exceptional cases: \"At Deutsche Bank we are convinced that parting with a client after a transition dialogue can only ever be a last resort. In most cases we can contribute more to reducing greenhouse gas emissions by working with our clients. But in cases where we saw no willingness on the part of a client to embark on a credible transition, we would not shy away from exiting a relationship.\"\nAdditional financing announced for energy-efficient homes in Germany\nDeutsche Bank plans to expand its support to private clients in its German home market as they contribute to climate protection. By 2025, the Private Bank Germany aims at providing between € 7 billion and € 10 billion in financing means for energy-efficient home construction and renovation. The aim is to substantially increase the range of retail services in this area available to clients. \"Climate commitments and energy efficiency requirements make construction and renovation in Germany increasingly complex projects,\" says Sewing. \"As a bank, we play an important role here. Today, homeowners already need more sophisticated advice and a network of energy experts, craftsmen and banks. Only by doing this can Germany achieve its climate targets by 2045.\"\n1.5 degrees Celsius target: annual investment of $ 1.4 trillion required by 2030\nBased on a model developed jointly with Bain & Company, the planned net-zero measures of companies and households worldwide will require significant investments. According to this model, an additional investment volume of $ 1.4 trillion per year will be required, by the end of 2030, to meet the target of limiting global warming to 1.5 degrees Celsius by 2050. According to the model additional annual revenue potential for banks is more than $ 40 billion worldwide. While most of these revenues will arise in Europe and America by 2030, the growth potential thereafter is likely to be increasingly concentrated in Asia. \"For us, sustainability is both a matter of responsibility and opportunity,\" says Jörg Eigendorf, Chief Sustainability Officer of Deutsche Bank. \"As a bank in the center of Europe with a strong presence in the US and in Asia, for example with our ESG Center of Excellence in Singapore, we are well positioned for this transformation both globally as well as in many local markets.\"\n€ 500 billion volume target by the end of 2025: additional details on financing initiatives\nFrom the beginning of 2020 to the end of 2022, Deutsche Bank exceeded its target of € 200 billion in sustainable financing and investments by € 15 billion, even after bringing this target forward by three years. Deutsche Bank’s target is to enable a total of € 500 billion in sustainable financing and investments¹ by the end of 2025. Based on in-house model calculations, the bank estimates that revenues from the ESG business will increase from around € 800 million in 2022 to approximately € 1.4 billion per year by the end of 2025.\nTo meet the € 500 billion volume target by year-end 2025, Deutsche Bank intends to implement several measures. These include the conversion of traditional supply chain financing of international companies to a supply chain financing linked to environmental and social criteria. These solutions will support the bank’s € 5 billion sustainability-linked working capital financing commitment by the end of 2025. In addition, the Investment Bank plans to provide at least € 3 billion in ESG financing in developing economies and emerging markets by the end of 2025. The planned additional financing for energy-efficient construction and renovation in Germany will also contribute to the overall volume target.\nApproximately 5% carbon footprint reduction in corporate loans\nDeutsche Bank was able to reduce its carbon footprint in corporate loans by around 5% in 2022, with a total of 56.7 million tons of CO2 equivalent in financed emissions (Scope 1 and 2) for committed loans. Reductions of financed emissions or emission intensities in all sectors with net zero targets were achieved. The emissions financed in the oil and gas sector were reduced by 28.9% year on year in 2022. In addition to a reduction in loans, this figure is also based on the internationally customary assessment method, which uses the Enterprise Value including Cash (EVIC) for calculation.\nMoreover, Deutsche Bank published how it reduces its Scope 1 and 2 emissions plus emissions from business trips. Since 2012, emissions from its own operations have been reduced by a total of approximately 273,000 tons of CO2 or 79%. Going forward, the bank will be increasingly focused on reducing Scope 3 emissions, reinforced by vendor management.\nFossil energies: updated thermal coal policy tightens criteria\nDeutsche Bank has recently updated its thermal coal policy and tightened criteria used to determine the scope of its policy:\nThe revenue threshold according to which a corporate client is regarded to be a thermal coal company has been lowered from a revenue dependency of 50% to 30% in the future.\nNew absolute thermal coal production thresholds of 10 megatons per year for thermal coal production and 10 gigawatts for thermal coal power capacity are introduced.\nFor clients in scope of the updated policy, the following guidelines will apply:\nFor clients to access baseline funding, the bank requires credible diversification plans from companies in scope of the updated thermal coal policy. Existing clients are required to present such plans in 2025, while for new clients such plans are a precondition for any lending.\nIn this context, the bank has defined criteria for the evaluation of transition plans for phasing out of thermal coal. Phase-out from thermal coal is expected for companies in OECD countries by 2030 and for companies in non-OECD countries by 2040. At the same time, the bank reaffirms its commitment to end financing for thermal coal companies with a thermal coal revenue dependency of more than 50% which have no credible plans to reduce this dependency to below 50% by 2025 in OECD countries or below 30% by 2030 in non-OECD countries.\nState-Owned-Enterprises in Just Energy Transition Partnership (JETP) countries will be allowed to have trajectories for phase out from thermal coal business which are aligned with the country’s commitments under the JETP program. \nThe update builds up on the policy in force since 2016, which rules out financing of projects related to new thermal coal mines or material expansion of existing thermal coal mines. In addition, the policy already prohibits the financing of the construction of new coal-fired power plants and the extension of existing coal-fired power plants. The update of the policy will be effective as of May 2023.\nAs of the end of 2022, outstanding corporate loans in the thermal coal mining sector amounted to € 231 million – a decrease of € 52 million or around 18% year on year. These loans account for 0.09% of the bank's corporate loan book and 0.04% of the total loan book in 2022.\nOil & Gas: reductions in lending in 2022\nHaving updated its thermal coal policy, the bank plans to update its oil & gas policy. In the oil and gas sector, outstanding loans amounted to € 6.5 billion at the end of 2022, a decrease of more than 20% from 2021 and accounting to approximately 1.3% of the bank’s total loan book.\nFurther disclosures will be included in the bank's Non-Financial Report which will be published on March 17, 2023.\n2nd Sustainability Deep Dive\nToday Deutsche Bank hosts its second Sustainability Deep Dive from 1 p.m. to 4.30 p.m. CET. At this virtual event, Christian Sewing, Chief Executive Officer, Jörg Eigendorf, Chief Sustainability Officer, and other senior executives will report on the progress on the bank’s sustainability strategy and provide insights into ESG processes. This event can be followed live on the bank’s website.\n\n\n¹ Sustainable financing and investment activities as defined in DB’s Sustainable Finance Framework and related documents, which are published on our website.",
    "number_of_ratings": 4,
    "rating": 2.0,
    "likes": 10
}