{
    "url": "https://www.db.com/news/detail/20220630-deutsche-bank-awards-for-creative-entrepreneurs-announces-2022-winners?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "June 30, 2022",
    "tags": [
        "Corporate Citizenship",
        "Diversity",
        "Entrepreneurship"
    ],
    "title": "Deutsche Bank Awards for Creative Entrepreneurs announces 2022 winners",
    "body": "The Deutsche Bank Awards for Creative Entrepreneurs (DBACE), in collaboration with MeWe360, has announced its 2022 winners. Selected for their commitment to driving positive social impact through creative enterprise, the five 18–30 year-old winning entrepreneurs and ventures are:\nChamiah Dewey, founder of Chamiah Dewey Fashion, the UK’s first clothing brand for people with dwarfism, offering stylish, timeless pieces, made using eco-conscious fabrics. Awarded 15,000 pounds funding.\nAndrew Shaw & Ryan Gauge, co-directors of Convenience Gallery, an arts organisation based in Birkenhead working with contemporary artists and the local community to build innovative and challenging art projects. Awarded 10,000 pounds.\nJem Collins, founder of Journo Resources, a social enterprise that helps underrepresented people into the journalism industry, with free-to-access tools, resources and support. Awarded 10,000 pounds.\nSabella Ibáñez, Alice Moxley & Jason Thompson, co-founders of Pivot, a social enterprise that empowers people experiencing homelessness to Pivot their lives through making and craftsmanship. Awarded 15,000 pounds.\nTumisha Balogun, Shian James & Alvin Owusu Fordwuo, co-founders of TAG Agency, a youth culture & marketing agency that transforms young lives through the power of culture, community and storytelling. Awarded 10,000 pounds.\nIn addition to the 60,000 pound collective prize fund, the five winners will also receive 100,000 pounds of bespoke mentorship to develop their vision and leadership skills via the MeWe360 Incubator. The mentor programme will provide tailored business and leadership training, 12 months of business support through MeWe360’s roster of mentors and Deutsche Bank professionals, access to a host of leading industry contacts and peer-to-peer support.\nIn addition to the winners, five strong DBACE 2022 runners-up will also receive DBACE business support bursaries, benefiting from MeWe360’s guidance and industry mentoring.\nFocussed on reaching ambitious individuals from all backgrounds, four years ago DBACE partnered with MeWe360, a non-profit that champions and supports entrepreneurs in the arts and creative industries. MeWe360 have worked with DBACE to ensure the awards are open and accessible to all with applicants from across visual arts, design, fashion, architecture and performing arts.\nThis year nine finalists pitched their business models to a set of illustrious judges at the Royal Society of Arts, Manufactures and Commerce. Judged on four criteria - social impact, business model, value add, and founder and leadership potential - the judges included: Kevin Osborne, Founder and CEO, MeWe360; Jackie Davidson MBE, Founder, JD Management; and John Newbigin OBE, co-founder and Chair of Creative England; and Bola Awoniyi, Co-Founder of Black Ballad and DBACE 2019 winner.\nJudge and Global Head of Brand Communications & Corporate Social Responsibility at Deutsche Bank Lareena Hilton\nsaid:\n“DBACE sits at the heart of Deutsche Bank’s social responsibility within our Made for Good social enterprise pillar and we are proud to celebrate these five young business leaders. As a judge I saw how the winners have consistently demonstrated a commitment to driving change and tackling some of the biggest challenges facing our society.\n\"The creative industries remain one of the hardest hit from the pandemic yet these entrepreneurs today demonstrate the talent that is at the forefront of the UK’s recovery. They have presented ideas and businesses that offer exciting new opportunities and ways to create a better future.”\nCommenting on the winners Kevin Osborne added:\n“This has been one of the strongest selection of applicants I’ve seen in the four years MeWe360 have been supporting DBACE. I’m looking forward to working with each of the five winners throughout the year as we provide them invaluable hands-on support, networking and tailored mentor programmes alongside the significant financial investment.\n\"As a judge it is incredible to see each of the applicants and watch these amazing young creative entrepreneurs pitch to us each year. It is also incredible to see our winners develop throughout the year and grow sustainable businesses that will lead the UK’s creative sectors.”\nSince 1993, Deutsche Bank has through DBACE overseen the launch and growth of over 230 creative ventures, supporting the work of the business leaders of tomorrow and celebrating those on a mission to tackle some of today’s most significant issues. One of the UK’s longest running creative enterprise programmes, the awards are open UK-wide and aim to cultivate young talent, providing them with start-up capital, bespoke business support and expert mentors.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 2
}