{
    "url": "https://www.db.com/news/detail/20220623-deutsche-bank-partners-with-oram-rentbrella-and-mad-to-celebrate-lgbtiq-pride-month-in-new-york?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "June 23, 2022",
    "tags": [
        "Diversity"
    ],
    "title": "Deutsche Bank Partners With ORAM, RentBrella, and MAD to Celebrate LGBTIQ Pride Month In New York",
    "body": "Deutsche Bank today announced partnerships with ORAM – Organization for Refuge, Asylum and Migration, RentBrella, and the Museum of Arts and Design (MAD) in celebration of LGBTIQ Pride Month in New York with an over-arching theme of Celebrating Queer Spaces.\n“Given Deutsche Bank’s diverse global platform, we have a responsibility to support and foster LGBTIQ inclusivity while investing in the many local communities which we are part of,” said James Davies, Head of Investment Bank Americas, Institutional Client Group, and senior sponsor of dbPride in the Americas.\nArjun Nagarkatti, Head of the International Private Bank for the Americas and an ORAM board member added: “These partnerships further our values of inclusion and sustainability by creating space to be out, proud, and visible, as well as, space to raise the voices of more marginalized voices like refugees and the trans community.”\nDeutsche Bank, ORAM, and RentBrella will partner to present “Protecting LGBTIQ Refugees – rain or shine” at the NYC Pride March on Sunday, June 26. This Deutsche Bank-led partnership will feature representatives from each organization dancing with sustainable umbrellas, provided by Rentbrella, symbolizing ORAM’s work protecting LGBTIQ refugees.\nThe NYC Pride March has been a key component of Deutsche Bank’s celebration of Pride in New York since 2016 and has always featured a non-profit partner to create more visibility for their work. Past partners include Athlete Ally, The New York City Anti-Violence Project, and the Leslie-Lohman Museum of Art.\nAdditionally, Deutsche Bank has partnered with its neighbor MAD to commission a work celebrating queer spaces by Houston-based, interdisciplinary artists Nick Vaughan & Jake Margolin. The work, to be unveiled on Tuesday, June 28, from 8:30 to 11:00pm EDT via projection onto the museum’s façade, may be viewed by the public in the Columbus Circle area near Deutsche Bank Center.\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nAbout the Organization for Refuge, Asylum and Migration (ORAM)\nORAM protects and empowers LGBTIQ asylum seekers and refugees globally, creating sustainability and systematic change. Founded in 2008, ORAM is one of the first international nongovernmental organizations to advocate for and assist people fleeing persecution based on their sexual orientation and/or gender identity and expression (SOGIE) and has since become a thought-leader in LGBTIQ migration. To learn more about ORAM’s other work, visit www.oramrefugee.org and @ORAMRefugee on Facebook, Twitter, Instagram, and LinkedIn.\nAbout RentBrella\nRentbrella makes sharing possible through technology, care and a sustainable outlook. Today, the main tools for this are the umbrellas; the organization has over 500 stations in the main areas of São Paulo, New York City and London. This operation saves up to 39 tons of CO2, 59,500 liters of water and 16 tons of trash every rainy day. The company is currently expanding to new markets to bring people freedom and a secure way to move around the city.\nAbout The Museum of Arts and Design\nThe Museum of Arts and Design (MAD) champions contemporary makers across creative fields and presents the work of artists, designers, and artisans who apply the highest level of ingenuity and skill. Since the Museum's founding in 1956 by philanthropist and visionary Aileen Osborn Webb, MAD has celebrated all facets of making and the creative processes by which materials are transformed, from traditional techniques to cutting-edge technologies. Today, the Museum's curatorial program builds upon a rich history of exhibitions that emphasize a cross-disciplinary approach to art and design, and reveals the workmanship behind the objects and environments that shape our everyday lives. MAD provides an international platform for practitioners who are influencing the direction of cultural production and driving twenty-first-century innovation, and fosters a participatory setting for visitors to have direct encounters with skilled making and compelling works of art and design. For more information, visit madmuseum.org.\nFor further information, please contact:\nDeutsche Bank\nDylan Riddle\ndylan.riddle@db.com\n+1 (212) 250-4982\nORAM\nKatie Miller\nkatiem@oramrefugee.org\n+1 (240) 507-6921\nRentBrella\nNathalia Fragoso\nNathalia.fragoso@rentbrella.com\n+55 11 97171 9504\nMuseum of Arts and Design\nWendi Parson\nwendi.parson@madmuseum.org\n+1 (212) 299-7749",
    "number_of_ratings": 15,
    "rating": 4.4,
    "likes": 3
}