{
    "url": "https://www.db.com/news/detail/20220615-deutsche-bank-helps-huaneng-leasing-with-sustainable-trade-finance-aligned-to-china-s-common-ground-taxonomy?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "June 15, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank helps Huaneng Leasing with sustainable trade finance aligned to China’s Common Ground Taxonomy",
    "body": "Deutsche Bank announced that it has helped Huaneng Tiancheng Financial Leasing Co., Ltd (“Huaneng Leasing”) launch a 3-year CNY187 million account receivable financing facility.\nThe deal marks Deutsche Bank’s first sustainable trade finance transaction aligned to the Common Ground Taxonomy (CGT), with the Use of Proceeds to finance Huaneng Leasing’s direct leasing for two wind power development projects in China. This transaction falls under Scenario 1 outlined in the CGT with clear overlaps between EU and China green taxonomies that can be considered comparable within the scope/for the purpose of the CGT  . The transaction also aligns to UN Sustainable Development Goals 7 and 9, related to Renewable Energy and Infrastructure development.\n“Huaneng Leasing has been a long-standing client of Deutsche Bank China, with a clear commitment to providing comprehensive financial services that support clean energy development. We are honored to act as the lender in financing Huaneng Leasing and these important clean energy projects. The transaction demonstrates how we support our clients’ sustainability transition by harmonizing the varying green finance standards between different markets”, said Peter Qiu, President of Deutsche Bank China. “Leveraging our expertise and experience in ESG and green finance framework design, Deutsche Bank is uniquely well positioned to help clients in China to achieve their ESG targets.” \nUpon completion, total green electricity capacity of the two wind power projects would reach 100MW altogether, generating 270m kWh green electricity per year which shall reduce over 0.226m tCO2e. of GHG per year.\nThe underlying wind farm projects have also been partially financed by senior debts from Asian Development Bank (ADB) under the multilateral institution’s Green Financing Platform, following ADB’s Environmental and Social Management System (“ESMS”) requirements.\n“Successful execution of ESG transactions in China which meet global ESG standards is critical for bridging the remaining gaps between Chinese ESG   standards and international ESG taxonomies,” said Kamran Khan, Head of ESG for Asia Pacific at Deutsche Bank.  “This is important for Asia and the global ESG market because China’s green finance market is one of the largest in the world.  This Huaneng Leasing transaction exemplifies Deutsche Bank’s focus on executing world-class, benchmark-setting ESG transactions in Asia.”     \nDeutsche Bank had committed to facilitate 200 billion Euros in sustainable financing and investment by the end of 2025 but has now become more ambitious, bringing the target forward to year end 2022, after the bank already reached 157 billion Euros by the end of 2021.\nJinyan Wang, Vice President of Tiancheng Financial Leasing said: \"With the vision of being a strong practitioner and the best performer in the industrial finance sector, we are devoted to the consistent innovation and development of a comprehensive financial service model for the clean energy industry. Riding on the trend of narrowing gaps between China’s green finance rules and international standards, we continue to promote the integration of our green finance practices with domestic and foreign green finance standards. We are also deeply involved in building the green leasing system, proactively participating in the leading green finance standards systems globally, and exploring opportunities in sustainable development and ESG. Together with partners such as Deutsche Bank, Tiancheng Leasing will continue promoting the sustainable development of the clean energy industry by closely integrating industry expertise with innovative financial products. ”\nInternational investors have been sensitive to differences in standards and approaches to green financing in global markets, and have sought more clarity and a unified approach. In order to address this need, the Common Ground Taxonomy- (CGT) was published by the International Sustainable Finance Platform (IPSF) Taxonomy Working Group Co-chaired by the EU and China in November 2021. The CGT is a key milestone in providing clarity about the commonality and differences between the EU’s and China’s green taxonomies. It is expected to play a pivotal role in increasing comparability of sustainable finance taxonomies and definitions of green and/or sustainable activities globally.\nFor further information, please contact:\nDeutsche Bank AG\nMedia Relations\nFlora Tian\nTel. +86 10 5969 8617\nEmail flora.tian@db.com\n ",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 35
}