{
    "url": "https://www.db.com/news/detail/20220601-changes-to-deutsche-bank-s-group-management-committee?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "June 1, 2022",
    "tags": [
        "Company",
        "Personnel announcements",
        "Strategy"
    ],
    "title": "Changes to Deutsche Bank’s Group Man­age­ment Com­mit­tee",
    "body": "Stefan Hoops to assume responsibility for Asset Management\nDavid Lynne to lead Corporate Bank\nAsoka Woehrmann leaves DWS Executive Board at the end of DWS’ Annual General Meeting on 9 June\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today announced changes to its Group Management Committee after Asoka Woehrmann announced his resignation, in agreement with the company, as Chief Executive Officer of DWS Group. Stefan Hoops will take responsibility for Asset Management at Group level. In addition, Hoops will become Chief Executive Officer of DWS Group with effect from 10 June 2022.\n“Asoka Woehrmann has played a major role in the success of our Asset Management in recent years,” said Karl von Rohr, President of Deutsche Bank and Chairman of the Supervisory Board of DWS. \"Under his leadership, DWS has expanded its market position and performed well in a recently challenging environment. We would like to thank him for this as well as for his contribution in previous positions, including in the private banking business in Germany.\"\nVon Rohr continued: “With Stefan Hoops, we are able to appoint a proven capital markets specialist to lead DWS, who brings the necessary strategic foresight, expertise in digitalisation and leadership skills for this role.\"\nHoops’ previous responsibility for the Corporate Bank will be assumed by David Lynne, currently Head of the Corporate Bank in Asia Pacific and responsible for the Fixed Income and Currencies business in the region. As part of the move, Lynne also becomes a member of the Group Management Committee. Being from Britain, he joined Deutsche Bank in 1995 and has held senior positions in the capital markets business in Singapore before focusing on his Corporate Bank role in the past few years. He will be supported in his new position by Jan-Philipp Gillmann, currently Head of Corporate Bank EMEA (ex UK and Germany), who will assume additional responsibility for the Corporate Bank Germany. Furthermore, he will take on global responsibility for client coverage across the Corporate Bank.\nFabrizio Campelli, responsible for the Corporate Bank and the Investment Bank on the Management Board, said: “I would like to thank Stefan Hoops for his commitment and successful work. The Corporate Bank will continue its successful course under the leadership of David Lynne, not least in the growth region of Asia. At the same time we will strengthen our home market positioning: Jan-Philipp Gillmann will closely link our German business with our global client coverage from Frankfurt.”\nChristian Sewing, Deutsche Bank’s CEO, added: “I also want to thank Asoka for his impressive work and performance for DWS and Deutsche Bank. Asset Management is and remains an important part of our business model. We are convinced that DWS will continue its success story under Stefan Hoops’ leadership. In recent years, he has taken important strategic decisions in the Corporate Bank. The division is well positioned in a difficult market environment and well on track to achieve its targets. I am convinced that we will continue on this path and grow further in coming years under David Lynne’s leadership, both in Germany and globally.\"",
    "number_of_ratings": 8,
    "rating": 2.4,
    "likes": 12
}