{
    "url": "https://www.db.com/news/detail/20231019-deutsche-bank-publishes-initial-transition-plan-and-further-net-zero-targets-for-high-emitting-sectors?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, October 19, 2023",
    "tags": [
        "Sustainability"
    ],
    "title": "Deutsche Bank publishes initial Transition Plan and further net-zero targets for high-emitting sectors",
    "body": "New net-zero targets for high-emitting industries in corporate loan portfolio (Scope 3, Category 15):\nAdditional net-zero targets for the coal mining, cement and shipping sectors\nAs of year-end 2022, 55% of total financed emissions of the corporate loan portfolio are covered by net-zero pathways\nPublished financed emissions figures totaling 34.4 million tonnes of CO2 equivalent per year (MtCO2e/y), covering ~60% of total loan exposure\nSupply chain emissions (Scope 3, Category 1-14):\n80% of total vendor spend expected to submit greenhouse gas emissions to the Carbon Disclosure Project (CDP) by 2025\nOwn operations emissions (Scope 1 and 2):\nRaised ambition to reduce total energy consumption from 20% to 30% by 2025 compared to 2019 baseline, following outperformance against original targets from 2019-2022\nEnhanced focus on nature and biodiversity\nCreation of Nature Advisory Panel to explore potential risk indicators\nDeutsche Bank today published its initial Transition Plan as well as net-zero pathways for three additional carbon-intensive industries in the bank’s corporate loan portfolio. Today’s publication marks two further milestones in Deutsche Bank’s Net-Zero Banking Alliance (NZBA) commitments since joining the NZBA in Spring 2021.\nThe Transition Plan consolidates Deutsche Bank’s definitions, methodologies, targets and achievements on its path to net-zero by 2050 in a single publication. This Plan focuses on three dimensions of decarbonization: the bank’s own operations (Scope 1 and 2); supply chain (Scope 3, category 1-14); and financing provided to clients (Scope 3, category 15).\nWith today’s publication of additional sectoral targets for Coal Mining, Cement and Shipping, 55% of the financed emissions in Deutsche Bank’s € 107 billion corporate loan portfolio are now covered by net-zero pathways. Published financed emissions figures totalling 34.4 MtCO2e/y now cover approximately 60% of the bank’s total loan exposure of € 489 billion as of 31 December 2022.\n“We are committed to playing our part in fighting climate change, and we want to document transparently where we stand on our path to net-zero,” said Christian Sewing, Chief Executive Officer. “We are convinced that it is imperative for a global bank headquartered in Europe to position itself as a sustainability leader if it is to have lasting success in serving its clients. Decoupling economic growth from CO2 emissions and the extensive use of natural resources will be decisive as our planet’s ecosystem comes close to tipping points.”\nJörg Eigendorf, Chief Sustainability Officer, added: “Our Transition Plan sets out what clients and the public can expect from us as we scope out our role in decarbonizing the economy.  As the economy progresses toward net-zero, regulations, reporting standards, and the role of the banking industry will evolve. This will allow us to continuously refine our own Transition Plan.\"\nPathways to net-zero in Deutsche Bank’s corporate loan portfolio\nThe Transition Plan outlines phase 2 of the bank’s programme of net-zero pathways in carbon-intensive industry sectors financed through the bank’s € 107 billion corporate loan book, which accounted for financed emissions (Scope 3, category 15) of 30.5 million tonnes of CO2e/y in 2022.\nThe additional targets for the three sectors are:\nCoal Mining: 49% reduction in Scope 3 financed emissions by 2030, and 97% reduction by 2050\nCement: 29% reduction in Scope 1 and 2 physical emission intensity by 2030 and 98% reduction by 2050\nShipping: scope 1 scoring of 0% achieved by 2030 and 2050 based on the Poseidon Principles Portfolio Level Alignment Score\nFor the aviation sector, publication of the bank’s net-zero target is expected after the publication of an alternative net-zero-aligned decarbonization pathway by the Rocky Mountain Institute in Basalt (Colorado, USA), which is expected in January 2024. The bank will adopt a physical emissions intensity approach and a well-to-wake gCO2e/Revenue-Tonne-Kilometer metric.\nThe Transition Plan also documents the progress made during 2022 on its phase 1 net-zero pathways for financed emissions in the Oil & Gas, Automotive, Power Generation and Steel industries. The bank reduced financed emissions in all four phase 1 sectors in 2022, as set out in its\nPDF\n2022 Non-Financial Report.\nClient engagement and new business monitoring\nThe Transition Plan sets out Deutsche Bank’s three-pronged approach to implementation. This includes financing the development and scale-up of clean energy technologies; engaging with high-emitting clients to support and finance their transition; and steadily phasing out business with not-to-abate industries such as thermal coal, and with clients not willing to align to the bank’s transition pathway. \nSince its creation in November 2022, Deutsche Bank’s Net-Zero Forum reviewed 41 transactions in carbon-intensive industries. The Net-Zero Forum assesses incremental and renewed transactions for in-scope sectors above the threshold of € 25 million and which would lead to an increase of more than 1% in the sectoral financed emissions metric and/or the net-zero target metric for target sectors.\nThe document also summarizes Deutsche Bank’s strategy in Residential Real Estate, which was published in a white paper in May 2023. Of the bank’s € 175 billion European residential real estate portfolio, 90% comprises residential mortgages in Germany. In addition, to partner with clients that wish to reduce the emissions of their properties, the bank aims to leverage its presence in the German market and works closely on decarbonization pathways with corporate clients in ‘upstream’ industries. These provide energy and materials to the residential real estate sector such as cement, steel, and domestic utilities as set out above. The bank also aims to engage with public and private bodies to determine methodologies and priorities to support the reduction of emissions from residential real estate.\nDecarbonizing Deutsche Bank’s own operations\nThe Transition Plan also sets out Deutsche Bank’s progress and targets in de-carbonizing its own operations (Scope 1 and 2 emissions), which have been cut by 64%, or more than 95,000 tonnes of CO2e/y, since 2019. The bank has reduced Scope 1 emissions by 50%, or 25,000 tonnes of CO2e/y, and Scope 2 emissions by 70%, more than 70,000 tonnes of CO2e/y, through a series of measures including reducing its real estate footprint, cutting energy usage by 13% in 2022, and sourcing more energy from renewables. 96% of Deutsche Bank’s total electricity usage now comes from renewable energy, with a target of 100% by 2025. The bank is well ahead of its 2030 net-zero target of reducing its own emissions by 46%, enabling it to raise its ambition to reduce total energy consumption from 20% to 30% by 2025 compared to its 2019 baseline.\nDecarbonizing Deutsche Bank’s supply chain\nDeutsche Bank has also made progress in decarbonizing its supply chain (Scope 3, category 1-14 emissions), where around three quarters of emissions arise from purchased goods and services. The bank has cut emissions by around 290,000 tonnes of CO2e/y, or 15%, between 2019 and 2022, and is on track to meet its target of 46% reduction by 2030. The Transition Plan explains the bank’s 4-phase approach for dealing with external vendors and outlines its CDP Supply Chain Programme and the sustainability clauses in the bank’s Supplier Code of Conduct.\nEnabling transition\nDeutsche Bank’s net-zero transition is supported by enabling structures, processes and frameworks. These include:\nGovernance structures, centrally and within each business and region, and the integration of sustainability targets into the bank’s Key Deliverables\nA transition and climate risk management framework which is designed to enable the bank to identify, monitor and manage downside risks, preserve capital, and support portfolio rebalancing in order to fund the bank’s net-zero transition\nDeutsche Bank’s\nPDF\nSustainable Finance Framework, \nPDF\nEnvironmental and Social Policy Framework and \nPDF\nGreen Financing Framework\nFinancial planning, steering and reporting, including the bank’s product-driven, client-driven and impact-driven reporting and links between performance against sustainability targets and executive compensation\nData and technology, including the bank’s approach to the quality and availability of source data incorporation into the bank’s core systems\nExternal engagement, including Deutsche Bank’s engagement with regulators as well as governmental or policymaking bodies or its membership in industry initiatives, global climate forums and other bodies \nBroadening the scope of Deutsche Bank’s net-zero strategy\nThe document also sets out Deutsche Bank’s ambitions to broaden the scope of its net-zero strategy for achieving net-zero by 2050. This includes:\nExpanding decarbonization efforts in financed emissions in the corporate loan portfolio, including setting net-zero targets in additional industry sectors according to the guidelines of the Net-Zero Banking Alliance, of which Deutsche Bank is a Founder Member\nReporting and, as the next step, reducing facilitated emissions relating to capital market activities, which the bank carries out on behalf of clients\nSupporting nature and biodiversity: on October 10, 2023, Deutsche Bank announced the formation of a Nature Advisory Panel, designed to assess nature-related risks\nContributing to a socially just transition, including support for efforts to mitigate the impact of the transition to a lower-carbon economy on developing nations\nExpanding the bank’s offering in ESG assets under management, notably for private clients\nDeutsche Bank’s Transition Plan is available for download on the bank’s website together with additional \nPDF\ngraphics and information.",
    "number_of_ratings": 6,
    "rating": 4.8,
    "likes": 12
}