{
    "url": "https://www.db.com/news/detail/20231013-deutsche-bank-and-germany-sailgp-team-announce-three-year-partnership?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main / Cádiz / Hamburg, October 13, 2023",
    "tags": [
        "Sports"
    ],
    "title": "Deutsche Bank and Germany SailGP Team announce three-year partnership",
    "body": "Deutsche Bank Wealth Management is the first global partner of the Germany SailGP Team\nSponsorship builds on Deutsche Bank's history of promoting competitive sports and talented athletes\nDeutsche Bank is committed to raise awareness of the importance and vulnerability of the oceans and the cooperation with the Germany SailGP Team fits perfectly into these relevant efforts\nDeutsche Bank Wealth Management and the Germany SailGP Team announced a three-year sponsorship deal making it the sailing team’s first global partner.\nThe partnership provides a new platform for Deutsche Bank to engage with its current and future client base. Furthermore, the collaboration fits seamlessly into the bank’s efforts that aim at forming alliances to protect the oceans while building on Deutsche Bank’s history of promoting competitive sports and talented athletes.\nFor the Germany SailGP Team, it underlines their ambition to be involved in environmental protection and act as a role model for younger generations and offers a great opportunity to build on this ambition.\nTim Krieglstein, CEO of the Germany SailGP Team, said: “We are very pleased to have Deutsche Bank as a partner who is committed to positive change and to protecting the oceans for future generations. The partnership at this early stage gives us the opportunity to jointly drive processes and develop actions that our sustainability strategy can include.”\nJulian Thurston, Head of Strategy, Marketing & Global Client Management for the Private Bank said: “We’re proud to be the global partner of the Germany SailGP Team in their journey as part of the world's most exciting sail racing league and help empower innovation and sustainability in sail sport. At Deutsche Bank, the blue economy represents a crucial part not only of our sustainability strategy but also our business ambitions as a Global Hausbank for families and entrepreneurs.”\nThe combined goal is to take the sport and its sustainability ambitions to new levels by educating people, bringing fans closer to the action and delivering world-class experiences to clients worldwide. In addition, joining forces at an early stage gives the Germany SailGP Team and Deutsche Bank the unique opportunity not only to support existing projects, but also to develop pioneering strategies in the field of sustainability together and to move in a common direction.\nAs part of the sponsorship agreement, the racing boat and apparel carries Deutsche Bank’s logo. Furthermore, the bank will also enjoy a range of sponsor benefits, including marketing and social media rights. Both parties have agreed not to disclose the precise sponsorship costs.\nCompeting for speed and sustainability\nIn addition to sporting success, the individual SailGP Teams are also evaluated in terms of their impact on the environment. This includes the drastic reduction of waste, electricity consumption, travel activities and the measurement of CO2 emissions caused by flights to the races, for example. Furthermore, the athletes want to act as role models who have a positive impact on society. For this purpose, the sailors will work together with purpose partners and drive existing projects further with their support to contribute to a more sustainable future and sport.\nDeutsche Bank’s blue economy commitment\nIn 2019, Deutsche Bank’s Chief Investment Office identified the oceans as a strategic macroeconomic risk and enabler, and in 2021 became the first bank to partner with the Ocean Risk and Resilience Action Alliance (ORRAA) as a full member to build its knowledge and network, including those in ocean research and conservation in close collaboration with its Chief Investment Office. Launched in October 2022, the Deutsche Bank Ocean Resilience Philanthropy Fund aims to quickly deploy unrestricted funds in response to the great challenge of ocean degradation. \nFor further information:\nGermany SailGP Team\nAndrea Hoeppner und Eva Puschmann\nHoeppner Sport- und Markenkommunikation GmbH\nsailgp@hoeppner-kommunikation.de\nPhone: +49 40 271 636 30 \nDeutsche Bank Media Relations\nCommunications Private Bank Germany\nJulia Yesil\nEmail: julia.yesil@db.com \nCommunications Private Bank International\nMelissa van Anraad\nEmail: melissa.van-anraad@db.com",
    "number_of_ratings": 5,
    "rating": 5.0,
    "likes": 13
}