{
    "url": "https://www.db.com/news/detail/20190308-millennial-workforce-changes-equation-for-gender-diversity?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 8, 2019",
    "tags": [
        "Careers",
        "Company",
        "Diversity"
    ],
    "title": "Millennial workforce changes equation for gender diversity",
    "body": "As millennials become increasingly influential in the workplace, many themes that have historically been seen as “women’s issues” are now also issues for attracting and retaining talent from across the gender spectrum, according to a Deutsche Bank-supported research report published today by the UK’s Women’s Network Forum (WNF), co-written by Deutsche Bank's Michelle Owen (pictured).\nParental leave, corporate returners and flexible working were among the concerns raised by both female and male participants aged 16 to 35 surveyed in focus groups for the report. The WNF, chaired by HRH The Countess of Wessex, is a group of cross-industry leaders with the goal of improving gender balance and equality.\nEntitled “Fuelling gender diversity”, the report was released to coincide with International Women’s Day on March 8. It explores attitudes on careers, parenthood and networking and examines how the expectations of the next generation workforce can help drive change.\nIt features case studies and examples of best practice from partner companies of the WNF and was co-written by Michelle Owen, a Managing Director at Deutsche Bank Wealth Management and Dr Eliza Filby, an historian of contemporary values and generations.\nOwen, who represents Deutsche Bank as a member of the WNF, said: “With the latest World Economic Forum gender gap report quoting another 202 years to achieve gender parity at work, it is clear that something has to change. The needs and expectations of next generation men and women are converging. Companies that want the pick of future talent – regardless of gender – will need to solve for career paths that support diversity, flexibility, family and life journeys.”\nTo discover the key trends and more about the research, download the full report on the right of this page.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}