{
    "url": "https://www.db.com/news/detail/20190308-how-five-iconic-women-helped-shape-history-joan-clarke?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 8, 2019",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "Joan Clarke – Cryptanalyst and numismatist",
    "body": "If it’s a good idea, go ahead and do it. It’s easier to ask forgiveness than it is to get permission.\nGrace Murray Hopper\nThis quote from Grace Murray Hopper, a pioneer of computer programming, embodies the proactive and resilient attitude of female icons throughout history.\nOften battling prejudice and established social norms, these icons have shaped the world we live in. In this series, Deutsche Bank employees take a look at five of these pioneers, their mark on history and how their work has influenced the modern world.\nJoan Clarke (1917–1996) – Cryptanalyst and numismatist\nNot one for the spotlight, Joan Clarke was hurtled into the public’s conscience following the release of the film ‘The Imitation Game’, which told the story of the codebreakers at Bletchley Park during World War II.\nPortrayed by actress Keira Knightley, the movie brought into focus Clarke’s pioneering work on the Enigma project to decrypt Nazi Germany communications. The Germans strongly believed that the Enigma code was unbreakable.\nClarke was an exceptional mathematician.\nShe earned a double first degree in maths from Newham College, Cambridge, but was denied a full degree as Cambridge did not admit women to “full membership of the body academic” until 1948.\nFor her codebreaking expertise during the war she was appointed a Member of the British Empire (MBE).\nAre there signs of this influence at Deutsche Bank today?\nSunila Shivpuri – Chief Security Officer, Asia Pacific\n“While Joan Clarke used her codebreaking skills to help defend her country during wartime, codebreakers in the present day sometimes pursue more criminal objectives. As technology provides many opportunities for clients to access the services they need anytime, anywhere, and through a variety of channels, cyber attacks on businesses are increasing in scale, speed and sophistication.\nTo protect the bank’s information assets, we take a multi-layered defence approach, building information security controls into every layer of technology, including data, devices, and applications. In addition to preventative controls like threat operations, data leakage prevention, vulnerability management, and continuous staff awareness programmes, we also prioritise detection, backed by a robust response process. Our dedicated Cyber Incident and Response Centers in Germany, Singapore, and the US are set up to provide 24/7 coverage.”",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 2
}