{
    "url": "https://www.db.com/news/detail/20190308-how-five-iconic-women-helped-shape-history-paula-modersohn-becker?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 8, 2019",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "Paula Modersohn-Becker – Artist",
    "body": "“If it’s a good idea, go ahead and do it. It’s easier to ask forgiveness than it is to get permission.” This quote from Grace Murray Hopper, a pioneer of computer programming, embodies the proactive and resilient attitude of female icons throughout history. Often battling prejudice and established social norms, these icons have shaped the world we live in. In this series, Deutsche Bank employees take a look at five of these pioneers, their mark on history and how their work has influenced the modern world.\nPaula Modersohn-Becker (1876-1907) – Artist\nPaula Modersohn-Becker was an important representative of early expressionism. Her contributions to early 20th century art paved the way for future female artists to explore themes of femininity in their work. “I feel that the time is soon coming when I no longer have to be ashamed and remain silent, but when I feel with pride that I am a painter”.\nShe is also credited with helping to introduce post-impressionist styles into German art having been influenced by the work of Gauguin and Cezanne in her studies in Paris. Her brief career was cut tragically short when she died of a postpartum embolism at the age of 31.\nAs well as having work included in the Deutsche Bank Collection and her own museum dedicated to her in Bremen, Germany, Modersohn-Becker’s work can be seen in numerous museums around the world, including: MOMA, New York; Städel Museum, Frankfurt; KunstMuseum, Basel; Fine Arts Museum, San Francisco and Art Institute of Chicago.\nAre there signs of this influence at Deutsche Bank today?\nMary Findlay – Deutsche Bank Art, Culture & Sports\n“Deutsche Bank began collecting art in 1979 and its focus has always been on supporting upcoming and emerging artists whose works are showcased in our buildings around the world.\nFour decades later, the collection has become one of the most substantial corporate art collections in the world and includes works by more than 670 female artists from over 40 countries.\nOne of these artists is Modersohn-Becker, who was an inspiration to so many women artists who followed in her footsteps and struggled to get their voices heard.\nIn 2018 in our client lounges at Frieze Art Fair in London, Deutsche Bank partnered with Tracey Emin to celebrate the centenary of women gaining the right to vote in the UK. Emin curated an exhibition of influential female artists from our collection (including Modersohn-Becker) as well as asking all the living female artists from our collection to donate unique postcard-sized artworks to be sold for charities supporting vulnerable women.\nThe response was amazing: a grand total of 150,000 pounds was raised – an achievement the Art, Culture & Sports team at Deutsche Bank is very proud of.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 3
}