{
    "url": "https://www.db.com/news/detail/20190308-how-five-iconic-women-helped-shape-history-anna-j-schwartz?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 8, 2019",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "How five iconic women helped shape history: Anna J. Schwartz",
    "body": "“If it’s a good idea, go ahead and do it. It’s easier to ask forgiveness than it is to get permission.” This quote from Grace Murray Hopper, a pioneer of computer programming, embodies the proactive and resilient attitude of female icons throughout history. Often battling prejudice and established social norms, these icons have shaped the world we live in. In this series, Deutsche Bank employees take a look at five of these pioneers, their mark on history and how their work has influenced the modern world.\nAnna J. Schwartz (1915–2012) – Economist\nIn the years following the 2008 financial crisis, unconventional monetary policy was the preferred tool by central banks to stimulate the economy. With near zero and negative interest rates, financial markets were flooded with liquidity through quantitative easing measures. This tactic was unprecedented.\nAgainst this backdrop, Anna Schwartz’s seminal joint work with Milton Friedman, ‘A Monetary History of the United States’, was thrust back into the limelight. The book, published in 1963, explored the role of money supply in the US economy and shed new light on the causes of the Great Depression. Rather than a failure of the free-market system, Friedman & Schwartz believed the Federal Reserve’s strategy of tightening monetary policy via interest rate hikes while neglecting the problems of the US banking sector through the 1930s plunged the economy into an extended depression. Schwartz advocated for predictability in the value of currency with only steady expansions and contractions of money supply to promote steady growth and avoid speculative excess and collapse. As the most recent financial crisis took hold, Schwartz was vocal in her belief that banks needed to shed toxic assets but was ultimately critical of Fed Chair Bernanke’s response.\n  Are there signs of this influence at Deutsche Bank today?\nHailey Orr – Capital Markets Strategist, Corporate & Investment Bank\n“Historically low interest rates, sovereign debt crisis, unconventional central bank policy, tighter financial regulation, rising nationalism, Brexit, tax reform, trade policy shifts, US-China relations, and digital disruption. These are just a few of the topics that have shaped the global economy since the financial crisis. Taking its lead from Friedman & Schwartz, the unprecedented monetary stimulus broke into unchartered territory and resulted in even greater client demand for our insights. Specifically, our investment banking clients were looking for straight-forward analysis that cut through the wealth of opinion and data. They wanted it applied to their day-to-day decision making. The world was changing rapidly; at the height of the turmoil, almost every day it seemed, and clients were looking to us for guidance.\nI work on a team that creates customised analytical content for Deutsche Bank’s investment banking corporate clients. We work closely with internal and external experts to ensure our analysis is as relevant and timely as possible.”\n  More iconic women",
    "number_of_ratings": 1,
    "rating": 4.0,
    "likes": 2
}