{
    "url": "https://www.db.com/news/detail/20190308-how-five-iconic-women-helped-shape-history-clara-brown?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 8, 2019",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "Clara Brown – Entrepreneur and humanist",
    "body": "“If it’s a good idea, go ahead and do it. It’s easier to ask forgiveness than it is to get permission.”\nThis quote from Grace Murray Hopper, a pioneer of computer programming, embodies the proactive and resilient attitude of female icons throughout history. Often battling prejudice and established social norms, these icons have shaped the world we live in. In this series, Deutsche Bank employees take a look at five of these pioneers, their mark on history and how their work has influenced the modern world.\nClara Brown (1803–1885) – Entrepreneur and humanist\nClara Brown was a former slave who became a black pioneer and established a successful laundry business during the Colorado Gold Rush, the boom in mining that started in July 1858 and continued until February 1861.\nBrown was a ferocious worker, and when she moved onto Central City she not only ran a laundry business for gold miners but also cooked and cleaned to earn extra money. This earned her the nickname “Aunt Clara”.\nBrown helped establish the first Sunday school in Denver and spent her entire life searching for her daughter. They were finally reunited a year before Brown’s death.\nBrown was also a shrewd investor, ploughing her savings into real estate and mines. It is said that she generated 10,000 US dollars in savings – an enormous amount for one person at that time.\nAre there signs of this influence at Deutsche Bank today?\nSilke Thomas – Robo Advisory, Private & Commercial Bank\n“In Clara Brown’s time, it was common for women to depend on men to invest their money for them. It is now acceptable for anyone to invest, regardless of gender and financial situation. While this is great for the democratisation of finance, widening the reach can have negative consequences.\nIt is up to financial institutions to ensure individuals are aware of the risks and take every possible step to invest prudently.\nAt Deutsche Bank, we continually look at how technology can help everyone invest and grow their wealth.\nFor instance, we introduced ROBIN in our retail bank. ROBIN is our robo advisor that uses Deutsche Bank’s own algorithms in combination with the market opinions of Ulrich Stephan, the bank’s Chief Investment Officer for private and commercial clients. In many countries, the issue is now time and how complex financial considerations can be.\nROBIN is convenient, flexible and transparent; clients can invest 24/7 based on Exchange Traded Funds (ETFs). We want more people to take advantage of Deutsche Bank’s investment expertise using manageable sums of money.",
    "number_of_ratings": 3,
    "rating": 1.3,
    "likes": 6
}