{
    "url": "https://www.db.com/news/detail/20190308-how-five-iconic-women-helped-shape-history-ada-lovelace?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 8, 2019",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "Ada Lovelace – Mathematician and writer",
    "body": "“If it’s a good idea, go ahead and do it. It’s easier to ask forgiveness than it is to get permission.”\nThis quote from Grace Murray Hopper, a pioneer of computer programming, embodies the proactive and resilient attitude of female icons throughout history. Often battling prejudice and established social norms, these icons have shaped the world we live in. In this series, Deutsche Bank employees take a look at five of these pioneers, their mark on history and how their work has influenced the modern world.\nAda Lovelace (1815-1852) – Mathematician and writer\nOften regarded as the first computer programmer, Ada Lovelace wrote the first algorithm intended to be carried out by a machine.\nShe accomplished this feat while working with Charles Babbage, sometimes referred to as the “father of the computer”, on a mechanical computer called the ‘Analytical Engine’.\nIt was designed to create mathematical tables quickly and accurately and is considered the first computer in the world, although it existed only on paper and was never built.\nSome of Lovelace’s views were particularly visionary, including the potential of computers to be used as a collaborative tool or control factory processes.\nA day is named after her on the second Tuesday of October to raise the profile of women in science, technology, engineering, and maths (STEM).\n  Are there signs of this influence at Deutsche Bank today?\nMartina Koehler – Berlin Innovation Lab\n “Ada Lovelace is a well-known figure in the thriving Berlin innovation ecosystem. Not only does she have a technology festival named after her in the city, there is also an Ada Summer Camp by Grace Accelerator dedicated to female entrepreneurship.\nDeutsche Bank has taken part in both efforts, which support gender diversity and STEM skills. We are proud that 40% of our latest technology graduate class are female and overall 36% of our entire class have STEM degrees.\nLovelace’s vision for what could be possible is an inspiration for our work within the Innovation Labs. We are excited by emerging technologies and how they can solve existing bank challenges.\nWe have interacted with over 3,000 start-ups and delivered solutions in areas as diverse as trading, compliance, retail, wealth management and operations.\nWe also want to build an innovation culture within Deutsche Bank so we can nurture the forward-thinking spirit Lovelace became famous for.”",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 6
}