{
    "url": "https://www.db.com/news/detail/20190307-the-future-of-commuting?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 7, 2019",
    "tags": [
        "Company",
        "Research",
        "Sustainability"
    ],
    "title": "The future of commuting",
    "body": "Commuting into town in the morning, then leaving again in the evening – every single day: although many people now also work from home, most workers still do their jobs in the office and at the company headquarters. They often live in the suburbs or rural locations because of the numerous housing shortages in city centres and high rents. The upshot of this is even longer journeys for commuters. Last year no fewer than 376,000 people travelled to Frankfurt am Main for work every day, an increase of 14,000 on the previous year, according to the German Federal Labour Agency.\nThe Berlin market researcher Dalia surveyed nearly 43,000 people in February 2017 in 52 countries about their lifestyles. One thing they were asked about was how long it takes them to travel to work. The finding: Israel ranked number one with the longest commute. Commuters there require an average of 1 hour 37 minutes per day for their car, bus or train journey. The second longest journey time – 96 minutes – is taken by commuters in the United Arab Emirates. In Hong Kong and India it takes an average of 90 minutes, although the distance travelled to work is much shorter. Cars move very slowly there during the rush hour.\nGermans take an average of 60 minutes per day to get to work and are thus arrive nine minutes faster than the global average. The Japanese are the quickest: they take an average of 39 minutes, which is partly due to the efficient local transport network and their willingness to travel in very full trains during the rush hour.\nMr Heymann, how can we spend less of our valuable time on commuting?\nHeymann: There are lots of options. We could reduce commuting traffic, if more people were to work from home. Local public transport would be more effective if it were to receive more investment. And more people would of course prefer to live closer to their workplace in cities, if there were more housing and the rents were lower.\nIs the shortage of housing in conurbations the main reasons why many of us “commute until we drop”?\nHeymann: Population growth in urban centres has skyrocketed in recent years. This has led to shortages and rising prices in city-centre housing markets. Other people are tied to one particular location because of family obligations or simply want to live in the countryside. Not everyone wants to move house just because they have changed job.\nThe environmental impact of cars is far worse than that of buses and trains. Nothwithstanding this, a mere 16 percent of Germans use public transport. Is this going to change in the near future?\nHeymann: In Germany in particular our travel routines are quite rigid. Once someone has switched to travelling by car they are highly unlikely to swap back to the train. Time is a big factor in this respect: the further away from the workplace that someone lives, the more time they generally save commuting by car rather than by public transport. Convenience also counts: using your own car provides flexibility, even if you occasionally get stuck in a traffic jam. A number of changes have occurred in city centres over recent years, though. Young people in particular are increasingly deciding not to get their own car, instead preferring to use public transport or travel by bike.\nWill more people work from home in future?\nHeymann: There is still a lot that needs to be done for this to become more established. Firstly, higher-speed internet has to be made available in rural areas, and secondly, the mind-set among managers in particular has to change. Some bosses still think that staff working at home don’t do a “proper job”. This misconception has to be dispelled. PersonalIy, I think that working from home offers a great deal of potential, especially as a means of easing the burden on our local transport services and reducing the environmental impact. Making this a reality thus still requires a lot of action from companies. The environmental benefits support not only making improvements to the technical infrastructure but also considering tax breaks.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}