{
    "url": "https://www.db.com/news/detail/20190307-get-started-make-a-change-be-a-success?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 7, 2019",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "Get started. Make a change. Be a success",
    "body": "A promising career, financial independence, self-confidence. Sounds great, but how do you cope if you suddenly lose them all? That is the fate of a number of women who graduated in foreign countries and years later came to live in Germany: either because they were forced to leave their home country or chose to for personal reasons. For them, finding a suitable job is more of an uphill battle than people think. Migrant women often find their qualifications are not recognised in Germany, and they may have taken an extended career break in order to learn German. They have very few contacts and know very little about the German labour market and the legislation that governs it. Becoming self-employed is supposedly also a bridge too far for them.\nThe City of Frankfurt recognised that these women require a great deal of assistance to enter the skilled labour market as quickly as possible and therefore joined forces with the beramí association to launch a mentoring programme.\nDeutsche Bank has been supporting the programme since 2007. It has already enabled 38 bank employees to become volunteer mentors and pair up with 38 women with migrant backgrounds. One year long they provide support and advice to their mentees, many of whom are economists or lawyers, improving their job applications, helping them to gain a better understanding of German corporate culture, initiate contacts, get to grips with administrative procedures, get the most out of the workshops organised by beramí and, most importantly, not to give up.\n“Being a mentor is my way of proactively helping women who have come to Germany and want to advance their careers here. Unfortunately lots of people prefer to talk about it but do nothing,” says Susanne Müller, IT management expert and Managing Director of DB Management Support GmbH, who is one of the current mentors. “My mentee has Bachelors and Masters degrees in technology, which means we're both active in the same professional segment. Her dedication and passion are infectious, and I’m delighted that she found a job in our business so quickly.” Müller also values the regular opportunities to share experiences with other beramí mentors. “All this makes me feel that I’m making a positive impact.”\nMüller is one of around 18,000 colleagues worldwide who volunteered nearly 210,000 hours of their time last year in Deutsche Bank’s “Plus You” programmes and whose personal commitment has made a positive impact on society.\nFor information about this and other programmes visit db.com/society",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 1
}