{
    "url": "https://www.db.com/news/detail/20190305-from-rag-pickers-to-entrepreneurs?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 5, 2019",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "From rag pickers to entrepreneurs",
    "body": "March 8 marks the International Women's Day – celebrating women's achievements while calling for a more gender-balanced world. Deutsche Bank is proud to support initiatives that are having a positive impact on girls’ and women’s lives around the world. We’ll be introducing you to just some of them in the run up to International Women’s Day.\nDaxa ben Bharvada was a second generation ‘rag picker’ in Ahmedabad, India. At age 10, she joined her mother in wading through mountains of waste and muck at dumps in search of materials they could resell.\nAfter 16 years, Daxa was earning less than two euros a month to help support her family.\n“Waste collectors are the poorest of the poor,” said Reema Nanavaty, Director at the Self Employed Women’s Association (SEWA). “They spend 18 hours a day at the dump searching for waste to sell to earn a living. The conditions are worse than most of us can imagine.”\nSEWA is an organisation of poor, self-employed women who help themselves and other disadvantaged women achieve their goals of self-reliance through self-employment.\nLast year Deutsche Bank’s Made for Good programme – which supports businesses that drive positive societal change – provided funding for a recycling facility run by a training cooperative called ‘Gitanjali’. This facility provides training for 200 women on how to make stationery from recycled waste materials, run a small, independent stationery business and manage their finances, while the cooperative employs 60 local women who are also its shareholders.\n“Stories like Daxa’s are common across India,” said Ruchi Khemka, Head of Corporate Social Responsibility, India. “Our Made for Good programme focuses on building up women because when you empower women, you effect positive change in whole communities. By helping women achieve financial stability and independence and teaching them entrepreneurship, we’re helping to break the cycle of poverty.”\nLast year, Daxa took part in the training at the recycling facility. Now she no longer spends her days picking through the waste for less than two euros a month; instead, she runs her own business selling stationery and earns 65 euros a month – a sum that might seem small for many but which has allowed Daxa to leave the dump, support her family and become completely self-sufficient.\n\nFor further information visit Made for Good",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}