{
    "url": "https://www.db.com/news/detail/20190304-deutsche-bank-appointed-primary-cash-and-liquidity-management-bank-by-general-mills-in-asia-pacific?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 4, 2019",
    "tags": [
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Deutsche Bank appointed primary cash and liquidity management bank by General Mills in Asia Pacific",
    "body": "Deutsche Bank today announced that it has been awarded a cash and liquidity management mandate by General Mills across Hong Kong, India, Japan, Korea, Malaysia, Singapore, Taiwan and Thailand.\nDeutsche Bank will provide cash and liquidity management services to General Mills, including payables and receivables, automated cross-currency cash sweeping and ERP integration.\nThis is the second transaction banking mandate awarded to Deutsche Bank by General Mills. In November 2017, Deutsche Bank was mandated as the sole provider for the company’s global financial supply chain program.\nGeneral Mills, Inc. is an American multinational manufacturer and marketer of branded consumer foods sold through retail stores. The company markets many well-known North American brands, including Betty Crocker, Yoplait, Häagen-Dazs\nand Cheerios. Its brand portfolio includes many other leading U.S. brands and numerous category leaders around the world.\nKaushik Shaparia, Global Head of Subsidiary Coverage at Deutsche Bank, said: “General Mills and Deutsche Bank have enjoyed a strong long-standing relationship and we are delighted to be chosen as their primary cash and liquidity management bank in APAC. With our best-in-class client service and strong track record with many multinationals, we believe that General Mills will reap many benefits from this partnership.”\nChristopher Emslie, Asia Regional Treasurer at General Mills, said: “We were particularly impressed by Deutsche Bank’s platform and its ability to integrate seamlessly into our ERP systems, as well as the cost savings and efficiencies that we will be able to produce. We look forward to our new partnership in Asia as we start our treasury journey together.”\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the\nAmericas and Asia Pacific.\nLegal notice\nThis press release has been approved and/or communicated by Deutsche Bank AG or by its subsidiaries and/or affiliates (“DB”). Deutsche Bank AG is authorised under German Banking Law (competent authority: BaFin - Federal Financial Supervisory Authority) and by the Prudential Regulation Authority and subject to limited regulation by the Financial Conduct Authority and Prudential Regulation Authority.\nDetails about the extent of our authorisation and regulation by the Prudential Regulation Authority, and regulation by the Financial Conduct Authority are available from us on request.\nSecurities and investment banking activities in the United States are performed by Deutsche Bank Securities Inc., member NYSE, NASD and SIPC, and its brokerdealer affiliates. Lending and other commercial banking activities in the United States are performed by Deutsche Bank AG, and its banking affiliates.\nCopyright © Deutsche Bank AG",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}