{
    "url": "https://www.db.com/news/detail/20190425-end-of-discussions-with-commerzbank-message-from-christian-sewing-to-deutsche-bank-staff?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 25, 2019",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "End of discussions with Commerzbank: message from Christian Sewing to Deutsche Bank staff",
    "body": "Dear Colleagues,\nA few weeks ago we started talks with Commerzbank to consider a combination of our two banks. We have consistently said that we want to play an active role in the consolidation of the European banking sector. For that reason, we decided to evaluate this option thoroughly.\nOur discussions with Commerzbank were very intense and took place in a constructive and mutually respectful atmosphere. However, we have now decided not to pursue this possibility further. How did we reach this conclusion?\nWe were always clear that we needed to be convinced that any potential combination would generate higher and more sustainable returns for shareholders and allow us to enhance our value proposition to clients.\nAfter thorough analysis, we have concluded that this transaction would not have created sufficient benefits to offset the additional execution risks, restructuring costs and capital requirements associated with such a large-scale integration.\nAnd as our preliminary first quarter results demonstrate, we are moving in the right direction under our own steam. In a very difficult financial market environment, we grew net income by more than 65 percent year-on-year to approximately 200 million euros. This is after booking full-year 2019 bank levies of around 600 million euros in the quarter. If the bank levies were distributed evenly over the four quarters of the year, we would have achieved a post-tax return on tangible equity of around 3.6 percent in the first quarter, close to our 2019 target of above 4 percent.\nIn particular, I was delighted to see positive indicators in several key businesses – a few examples:\nWe achieved loan and deposit growth in our Private & Commercial Bank as well as loan growth in the Corporate & Investment Bank.\nWe captured positive net inflows in both our Wealth Management and our Asset Management businesses.\nOur corporate finance business grew market share in the US, Germany and EMEA in the first quarter, according to Dealogic.\nFurthermore, we continued to deliver on our cost targets. We reduced adjusted costs by around 7 percent compared to the prior-year period – excluding the bank levies we reduced costs for the fifth consecutive quarter. We’re well on track to achieve our 2019 cost target of 21.8 billion euros.\nWe have the financial strength to exploit revenue opportunities as they arise. Based on our preliminary results our Common Equity Tier 1 (CET 1) ratio improved to approximately 13.7 percent in the quarter, one of the highest ratios among our global peers.\nThe detailed numbers will follow tomorrow. However, we can already say that the broad picture is better than many observers would have deemed possible after the weak start to the year. Nevertheless, as any management team should, we will continue to review all alternatives to improve long-term profitability and shareholder returns.\nOur achievements reflect the relentless commitment, discipline and sheer hard work you have shown. I want to thank you for that on behalf of the Management Board.\nOur priority now must be to maintain this effort and to continue to focus fully on our clients. Market conditions improved towards the end of the first quarter. Let’s capture and sustain that momentum in the quarters ahead.\nBest wishes,\nChristian Sewing",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}