{
    "url": "https://www.db.com/news/detail/20190416-9-things-you-need-to-know-about-asean?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 16, 2019",
    "tags": [
        "Corporate products",
        "Digitalisation",
        "Investment Banking",
        "Research"
    ],
    "title": "Nine things you need to know about ASEAN",
    "body": "The Association of South-East Nations (ASEAN) continues to establish itself as low-cost manufacturing hub for the rest of the world, attracting investment from foreign businesses and strengthening two-way trade and investment flow between Asia and the EU. Member states have made good progress in increasing their economic co-operation, driving digitalisation and reducing trade barriers, to create an enlarged market with higher economies of scale.\nOf the ten ASEAN member countries Brunei, Cambodia, Indonesia, Laos, Malaysia, Myanmar, Philippines, Singapore, Thailand, and Vietnam), Deutsche Bank has fully-fledged branch operations in six of them, enabling the bank’s Global Transaction Bank (GTB) to support its clients’ Cash, Trade, Lending and Securities Services needs across these markets. ASEAN’s revenue contribution to GTB is similar to that of India and Greater China.\nNine facts should know about ASEAN:\nTaken as a single entity, ASEAN represents the world’s third largest market after China and India and the world's third largest labour force with 630 million people (or nine percent of the World's population). Half of its population is under 30 years old.\nASEAN is expected to become the world’s fourth largest economy by 2030 (current GDP at USD 2.7 trillion).\nASEAN has dramatically outpaced the rest of the world on growth in GDP per capita since the late 1970s with average annual real gains of more than five percent. The IMF foresees this high growth rate to continue at least until 2023.\nIn the year 2000, 14 percent of the ASEAN’s population was below the international poverty line but by 2013, that share had fallen to just three percent.\nASEAN is the world’s third largest recipient\nPDF\nof foreign direct investment (FDI).\n99 percent of the intra-ASEAN trade tariffs have\nPDF\nalready been eliminated. ASEAN members are working on a data governance framework to facilitate easier flow of data on trade and commerce.\nGross exports from ASEAN are expected to hit USD 1 trillion in 2020. In 2017, Vietnam recorded the largest advance of 19 percent followed by the Philippines at 18 percent (according to WTO).\nASEAN’s payment landscape is leapfrogging from being one of the worlds’ most cash and paper-based to the most advanced, with instant payments based on an e-payment system called ‘any ID’ already being rolled out in four markets.\nASEAN has an estimated 330 million internet users.\nWant to know more about how digitalisation is supporting ASEAN trade? Global Head, Market Advocacy for GTB, Boon-Hiong Chan explains it here.",
    "number_of_ratings": 3,
    "rating": 4.0,
    "likes": 3
}