{
    "url": "https://www.db.com/news/detail/20190415-deutsche-bank-becomes-first-bank-to-offer-rmb-fx-via-its-worldwide-branch-network-using-hong-kong-as-the-central-hub?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 15, 2019",
    "tags": [
        "Investment Banking",
        "Research"
    ],
    "title": "Deutsche Bank becomes first bank to offer RMB FX via its worldwide branch network using Hong Kong as the central hub",
    "body": "PBOC approves Deutsche Bank’s pioneering approach to offering RMB FX spot and hedge solutions through any branch worldwide with Deutsche Bank Hong Kong as the centralized RMB hub.\nThe People’s Bank of China (PBOC) has given Deutsche Bank the green light to use the Hong Kong branch as the central hub to offer cross border Renminbi (RMB) spot and FX derivatives through any of the bank’s branches worldwide.\nWinning this approval makes China FX and hedge solutions much more accessible for Deutsche Bank’s corporate clients, especially in Europe and the U.S. The first-of-its kind solution allows clients of any Deutsche Bank branch in the world to trade onshore USD / CNY spot and hedging solutions.\nThe new branch-wide FX transaction model uses a centralised hub and spoke approach which Deutsche Bank pioneered and developed in consultation with PBOC. Hong Kong and Shanghai are RMB transaction hubs, connecting to other Deutsche Bank branches around the world.\nAsia Pacific Head of Fixed Income and Currencies and Global Transaction Banking David Lynne said: “In awarding Deutsche Bank this approval PBOC recognises our global network, our connectivity with European and U.S. corporate clients, and our expertise in Asia local markets, which all combine to support the continued internationalisation of the RMB.”\n“Over the past ten years, the volume of offshore RMB transactions has grown 40 per cent annually, driven largely by trade. Being able to trade at onshore rates directly from anywhere in the world is a significant milestone. It also enables Deutsche Bank to actively promote the RMB as an international product and continue to build-out global and intra-asia RMB corridors to support trade and investment.”\nThe solution means Deutsche Bank clients can now access the onshore Chinese Yuan (otherwise known as Renminbi) rate in addition to offshore rates (known as CNH) for RMB FX conversion. The benefit to clients is it provides the potential to lower RMB FX transaction costs, as well as not having to set up an offshore RMB account in Hong Kong or Shanghai.\nThe solution allows Deutsche Bank to serve clients who are both buying onshore RMB and repatriating currency out of China, provided the client has a real underlying transaction to support the FX transaction.\nFor example, a corporate client in Frankfurt which manufactures in China can buy USDCNY spot or a hedge solution via their local Frankfurt Deutsche Bank branch to pay onshore suppliers, instead of setting up an account in Hong Kong or Shanghai with the necessary transaction documentation. Similarly, a Japanese multinational with operations in China needing to repatriate dividends can book the onshore USDCNY transaction via Deutsche Bank’s Tokyo branch.\nHead of Greater China, Asia Local Markets Jerry Li said: “With corporate clients better able to access the RMB globally for trade settlements, this is a major step for the RMB to become a global trade currency.”\nFor further information please contact:\nDeutsche Bank AG\nMedia Contact\n\nSarah Stabler\nPhone: +65 6423 8413\nEmail: sarah.stabler@db.com\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}