{
    "url": "https://www.db.com/news/detail/20190405-deutsche-bank-at-vatican-audience-united-against-the-criminalisation-of-same-sex-acts?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "April 5, 2019",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank at Vatican audience: united against the criminalisation of same-sex acts",
    "body": "Today, April 5, 2019, the Vatican hosted a private audience to discuss LGBTIQ discrimination. Management Board Member Karl von Rohr was also in Rome for the audience with Cardinal Pietro Parolin, Secretary of State. Von Rohr was representing Deutsche Bank as part of a delegation from Open For Business, a coalition of global companies that presents and promotes the business and economic case for LGBTIQ rights, and which Deutsche Bank joined in January 2018.\nAccording to research presented today at a press conference at the Vatican, 70 countries currently criminalise same-sex acts, and six even impose the death penalty. The report clearly shows that criminalising consensual, same-sex acts leads to discrimination and human rights abuse. The research report can be found here.\nAfter the press conference, Karl von Rohr, President and Member of the Management Board said: “We have a responsibility to both business and society to work with influential platforms that advocate a more inclusive and just world. Deutsche Bank is committed to advancing LGBTIQ rights around the world. We are grateful for the Vatican hosting us to discuss this topic and look forward to continue partnering with other companies, civil society organizations and governments to advance this important human rights issue.”\nDeutsche Bank operates worldwide in about 60 countries. We have a diverse workforce that includes 146 nationalities. And the bank has a clear position on encouraging diversity, and supports LGBTIQ rights worldwide.\nJust yesterday our bank reacted on new laws against homosexuality by Brunei: Deutsche Bank has removed the Dorchester Collection hotel group from its list of suppliers in support of lesbian, gay, bisexual, transgender, inter and queer (LGBTIQ) rights.\nCompanies function better when they are open, inclusive and welcoming to everyone. Open For Business’s research shows that this is equally true for entire economies – LGBTIQ-inclusive countries are more competitive, more productive, healthier and enjoy a better reputation globally. Deutsche Bank reflects this in its purpose: to enable societal progress and economic growth by creating positive impact for our clients, our people, our investors and our communities.\nCardinal Pietro Parolin welcomed the conversation and made a clear statement condemning all forms of violence against all persons around the world. He signaled his intention to look for common ground with the audience to collectively move forward with the conversation. This represents an important new level of dialogue with the Vatican across a broad base of stakeholders, which consisted of parliamentarians, judges, human right advocates and business leaders.\nThe business leaders in attendance applauded the statement given its alignment with their companies’ values and dedication to LGBTIQ inclusion. Alongside Deutsche Bank, Open for Business members Accenture, Brunswick Group, EY, IBM, Microsoft, Linklaters and Virgin Atlantic took part in the audience.\nThis initiative follows Deutsche Bank’s co-founding the Partnership for Global LGBTIQ Equality in January 2019 which is supported by the Office of the United Nations High Commissioner for Human Rights and includes a global call for companies to implement the UN Standards of Conduct to tackle LGBTIQ discrimination in the workplace by 2020. Deutsche Bank was among the first 15 companies to sign up to these standards.\nDeutsche Bank sponsored Open For Business’s recent research report on how companies can use their channels of influence to advocate for equality. For more information on Open For Business, please visit open-for-business.org",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 1
}