{
    "url": "https://www.db.com/news/detail/20190404-deutsche-bank-provides-project-finance-administration-to-back-norwegian-wind-farms?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "April 4, 2019",
    "tags": [
        "Corporate products",
        "Research",
        "Sustainability"
    ],
    "title": "Deutsche Bank provides project finance administration to back Norwegian wind farms",
    "body": "Deutsche Bank has taken on a mandate as financing agent and security agent to help finance the construction and operation of wind farms Skinansfjellet and Gravdal in South-West Norway.\nThe onshore wind farms form part of the Bjerkreim Cluster, purchased by German asset manager Luxcara, one of Europe’s leading asset managers for renewable energy investments. Consisting of three separate wind farms, their 70 turbines are expected to deliver an output of 294 MW.\nAs in previous financing solutions for wind park acquisitions Gode Wind 1 and Meerwind, Deutsche Bank’s Global Transaction Banking will act in numerous capacities to support the project financing via the issuance of project bonds.\nThe financing solution, amounting to a lower three-digit million euro amount, is backed by a long-term corporate power purchase agreements (PPA). The transaction was closed as a project bond in the form of privately placed German registered notes (Namensschuldverschreibungen) and subscribed to by MEAG, the asset manager of insurers Munich Re and ERGO, the Austrian insurance group UNIQA and another European institutional investor. Deutsche Bank was chosen to provide all the necessary project agency functions in support of the bond financings.\nThe transaction follows the successful financing of the 155.4 MW Eikeland-Steinsland wind farm of the Bjerkreim Cluster in July 2018, similarly supported by a PPA, for which Deutsche Bank was also selected as financing agent and security agent to the project bonds placed with MEAG. Project agency services form a critical part of Deutsche Bank’s focused support to the wider infrastructure and energy market, as an independent party to borrowers and investors for bank, bond and other hybrid debt instruments.\nAbout Global Transaction Banking\nGlobal Transaction Banking provides commercial banking products and services for both corporates and financial institutions worldwide, including domestic and cross-border payments, cash management, risk mitigation and international trade finance as well as trust, agency, depositary, custody and related services.\n  For further information please contact:\nDeutsche Bank AG\nMedia Contact\nFrank Hartmann\nTel.: +49 69 910 42744\nEmail: Frank.Hartmann@db.com",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 1
}