{
    "url": "https://www.db.com/news/detail/20231207-deutsche-bank-increases-investment-in-indonesia-to-support-growth?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "December 20, 2023",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank increases investment in Indonesia to support growth",
    "body": "Deutsche Bank has today announced an increase that doubles its total local capital to IDR 10 trillion (€600 million) for its business in Indonesia.  The additional investment will support the bank’s growth in the country and allow it to undertake more activity for clients. This is Deutsche Bank’s third capital increase in Asia Pacific this year, further to previous investments in Vietnam and South Korea. \nDeutsche Bank has a 54-year history in Indonesia, which is a key market in the bank’s ASEAN network. The business plays an increasingly important role in the success of Deutsche Bank’s regional franchise, given its strong performance and fast-growing client base.\nThe bank provides a range of corporate banking solutions to multinational companies, large local corporates and financial institutions in Indonesia. These services include cash management, FX, custody and trade finance. It also offers investment banking services, including fixed income and currencies.\nDeutsche Bank CEO of Asia-Pacific, Europe, Middle East & Africa (EMEA) and Germany and Member of the Management Board, Alexander von zur Muehlen said: “We continue to invest in Asia Pacific and expand in markets that are becoming increasingly strategic for our clients. We see long-term opportunity in Indonesia, which has one of the fastest growing economies in Asia. Its well-established strength in resources is nicely complemented by its focus on emerging industries like technology and EV manufacturing. These factors, along with the country’s structural reform and economic transformation, position it strongly.\"\n We are confident in Indonesia’s future and will continue to grow here with our clients.\nAlexander von zur Muehlen\nDeutsche Bank Chief Country Officer for Indonesia, Siantoro Goeyardi said: “We have deep roots in Jakarta and Indonesia and are proud of the strong business that we have built over the past 54 years. This additional capital is recognition of our success to date and ongoing potential. It underscores the importance of Indonesia, which is the cornerstone of the ASEAN region, to Deutsche Bank globally and our clients. We look forward to further cementing our position in the country.”\nDeutsche Bank Indonesia received a range of industry awards last year, including Asiamoney’s ‘Best Corporate Bank’, Refinitiv’s ‘Best FX Market Maker’ and The Asset’s ‘Best Islamic Custodian’, recognising its comprehensive suite of solutions.\nFor further information, please contact:\nDeutsche Bank AG                                       \nMedia Relations                                           \nKate Fields\nPhone: +852 2203 5094\nEmail: kate.fields@db.com\n ",
    "number_of_ratings": 8,
    "rating": 5.0,
    "likes": 9
}