{
    "url": "https://www.db.com/news/detail/20231211-deutsche-bank-strengthens-shariah-custody-offering-in-southeast-asia?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "December 11, 2023",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank strengthens Shariah custody offering in Southeast Asia",
    "body": "Deutsche Bank has partnered with CIMB, one of Malaysia’s largest banks, to provide Shariah custody (the servicing of funds that are compliant with Shariah law) to clients in Malaysia. In addition, the bank has been appointed by CIMB to support its foreign custody services with its CustodyOne product.\nThe partnership involves Deutsche Bank complementing its existing Shariah custody function with CIMB’s, to offer clients in Malaysia regulatory compliant services (in line with guideline changes made by the Securities Commission in late 2022). The majority of targeted clients are fund managers governed by the Securities Commission’s guidelines for Shariah capital markets products.\nAlso in Southeast Asia, Deutsche Bank has launched new Shariah compliant custody capabilities in Singapore, which will complement its CustodyOne offering, making global access simple for clients. As a global bank with a strong presence in Singapore, Deutsche Bank is focused on meeting the growing demand for Shariah custody, particularly as domestic clients are expanding their operations across ASEAN.\nDeutsche Bank’s Head of Securities Services for ASEAN, Samir Dhamankar said: “We are pleased to partner with CIMB Islamic, being one of the top banking institutions in the ASEAN region as well as a cornerstone of the Malaysian banking landscape. Together, we can offer our clients market-leading Shariah custody that meets industry standards and fulfils regulatory requirements in Malaysia. We are committed to the ASEAN region and helping our clients grow in this unique and increasingly important segment.”\nAhmad Shahriman Mohd Shariff, Chief Executive Officer of CIMB Islamic added, “CIMB Islamic remains at the forefront of offering attractive propositions to cater to the growing demand for Shariah compliant products and services. We are pleased to partner with Deutsche Bank to strengthen their Shariah services and deliver on our long-term growth objectives of advancing Islamic finance, in line with Bank Negara Malaysia’s Financial Sector Blueprint.”\nCIMB Group’s Co-Chief Executive Officer of Group Commercial and Transaction Banking, Lawrence Loh said, “As a leading financial intermediary, we continuously foster strategic partnerships that prioritise the needs of our valued customers. This partnership augurs that drive, and we are pleased to collaborate with Deutsche Bank, not only to support their clients in Malaysia, but to expand our foreign custody services in over 100 markets.”\nShariah funds globally held $105 billion in assets under management as of the end of Q2 2023 and Malaysia held the largest share of this total with 27%. Southeast Asia accounts for 80% of Asia Pacific’s total Shariah banking assets and market growth is forecasted at 8% over the next two years. Malaysia and Indonesia are the most dominant markets for Shariah banking in Asia Pacific.\n(From left) Anand Rengarajan, Global Head of Sales & Head of Asia, Pacific, Securities Services, Deutsche Bank; Sylvia Beh, CEO, Deutsche Trustees Malaysia Berhad; Margaux Blumenfeld, Head of APAC Coverage, Non-Bank Financial Institutions & Head of Securities Services Sales, South Asia, Deutsche Bank; Richard Lim, Head of Securities Services Malaysia, Deutsche Bank (Malaysia) Berhad; Datin Ezreen Eliza Zulkiplee, Head of Securities Services and CEO of CIMB Commerce Trustee Berhad & CIMB Islamic Trustee Berhad; Lawrence Loh, Co-CEO, Group Commercial & Transaction Banking, CIMB and Ahmad Shahriman Shariff, CEO, CIMB Islamic at a recent signing ceremony.",
    "number_of_ratings": 4,
    "rating": 5.0,
    "likes": 3
}