{
    "url": "https://www.db.com/news/detail/20231208-sandp-upgrades-deutsche-bank-s-credit-ratings?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "Frankfurt am Main, December 8, 2023",
    "tags": [
        "Company"
    ],
    "title": "S&P upgrades Deutsche Bank’s credit ratings",
    "body": "S&P Global Ratings, the leading rating agency, today upgraded Deutsche Bank’s (XETRA: DBKGn.DB / NYSE: DB) credit ratings – the third successive upgrade of Deutsche Bank’s credit ratings by a leading rating agency during 2023.\nS&P raises its long- and short-term credit ratings on Deutsche Bank AG to 'A/A-1' from 'A-/A-2', outlook stable, and its long-term resolution counterparty rating to 'A+' from 'A'. S&P’s long-term issue ratings on senior preferred, senior nonpreferred, Tier 2, and additional Tier 1 debt are all upgraded by one notch.\nExplaining the rationale for this move, S&P highlighted Deutsche Bank’s progress in “growing its franchise, strengthening its earnings, and maintaining solid capital and liquidity profiles,” adding: “The stable outlook reflects our expectation that the bank will maintain its disciplined strategic execution and improve its performance toward its 2025 targets.”\n“We are delighted to see further recognition for Deutsche Bank’s strength and progress from a key stakeholder,” said Christian Sewing, Chief Executive Officer. “This upgrade reflects the hard work of our people to transform Deutsche Bank into a focused, profitable and resilient Global Hausbank. We are determined to build on this progress by growing our franchise, supporting clients through uncertain times, and boosting returns to shareholders.”\nJames von Moltke, Chief Financial Officer, added: “Deutsche Bank has built key strengths: a focused and well-balanced business model delivering earnings and franchise growth, a high-quality loan portfolio, capital strength and a solid liquidity and funding base. It is very encouraging to see our strength and resilience recognised, once again, by S&P.”\nS&P upgrades Deutsche Bank: key success factors\nReaping the benefits of successful transformation: S&P comments: “The rating action reflects Deutsche Bank's strengthened performance and resilience. The 2019-2022 transformation program established a more focused and profitable bank, and management is now focused on delivering franchise growth and operating leverage.” S&P adds: “We also see structural improvements, including more disciplined strategic execution and a stronger focus on cost efficiency.”\nA high-quality loan portfolio: S&P notes: “Deutsche Bank's lending is diversified by sector and well-collateralized, and has performed solidly despite tepid economic growth, particularly in its home market of Germany.” The agency adds that, even in a hypothetical stress scenario, an impact on the loan book would be unlikely to impact the bank’s capital base.\nSolid liquidity and funding: in S&P’s view, Deutsche Bank’s “132% liquidity coverage ratio and 121% net stable funding ratio as of Sept. 30, 2023, were consistent with internal targets.” S&P adds: “We view positively that 71% of the deposit base came from the bank's home market and, excluding bank deposits, 39% of the deposit base was insured.”\nResilience in the face of market turbulence: S&P also notes that Deutsche Bank demonstrated strong balance sheet management in the face of market turbulence earlier in 2023: “Deutsche Bank's liquidity position was tested in March 2023 following short-selling of its shares and it navigated this short-lived stress well, in our view.”\nA strong capital base provides scope for expanded and accelerated distributions to shareholders: S&P comments: “We think Deutsche Bank has supportive capitalization. Its regulatory metrics and guidance surprised on the upside in the third quarter of 2023.” Furthermore, the agency notes: “The common equity Tier 1 ratio improved to 13.9% and management indicated that it will potentially free up about €3 billion more capital than it previously planned. As a result, it looks likely to raise its €8 billion target for shareholder distributions in 2021-2025.”\nDeutsche Bank’s ratings with leading agencies, including today’s upgrades, are as follows:",
    "number_of_ratings": 42,
    "rating": 4.7,
    "likes": 44
}