{
    "url": "https://www.db.com/news/detail/20231212-deutsche-bank-s-second-panda-bond-issuance-on-china-s-interbank-bond-market?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "December 6, 2023",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank’s second Panda Bond issuance on China’s Interbank Bond Market",
    "body": "Deutsche Bank announced today that it has issued its second Panda Bond, raising a total of 1 billion yuan (141 million US dollars) via 3-year Senior Preferred notes. The net proceeds will be used for Deutsche Bank’s general business activities and development.\nIt’s the first panda bond launched by a German issuer after the 3rd China-Germany High-Level Financial Dialogue. Following the bank’s successful debut of an onshore renminbi bond worth 1 billion yuan (around 143 million US dollars*) in January 2023, this is also the second issuance from the bank which adhered to the pre-approved program by the People’s Bank of China (the “PBOC”). The program allows Deutsche Bank to issue renminbi bonds in an aggregate principal amount of up to 8 billion yuan (1.13 billion US dollars) periodically in up to two years, upon approval from China’s interbank bond market (CIBM).\nRose Zhu, China Chief Country Officer said: “The second issuance of our own Panda Bond underscores our confidence in China’s growth potential and our strong commitment to continuously developing our business here.” she added,\nAs a European bank actively driving yuan internationalisation, we will continue to engage global investors to capture attractive opportunities  onshore and broaden global connectivity with China’s capital market, as it further develops and opens up.\nRose Zhu\nChina has made continuous progress with improving its regulatory framework for Panda Bonds. As a result, issuance of panda bonds in the first eleven months of 2023 reached a record high of 139 billion yuan (20 billion US dollars), up more than 60% from last year. \nRenminbi is also gaining ground as a global funding currency after it became the second most used currency in international trade finance in September 2023.\nSamuel Fischer, Head of China Onshore Debt Capital Markets said: “Attracted by a stable funding environment and the cost advantages that the China onshore market offers, we’ve seen higher demand and an increasingly diverse pool of investors and issuers accessing China’s debt capital market through Panda Bonds. We expect the momentum of renminbi financing to remain strong in the near-to-medium term. As a leading institution in China’s debt capital markets, we are fully committed to contributing to renminbi internationalisation and will continue to support foreign issuers with financing their business development in China.”\nDeutsche Bank China is fully licensed as lead underwriter in the CIBM which allows the bank to provide debt issuance solutions to both local and foreign issuers, and better play a role in connecting China with global markets.\nIn 2023, Deutsche Bank China has completed 28 bond issuances for both domestic and international clients to date, including 5 panda bond issuances on CIBM so far, with the total value exceeding 25 billion yuan (3.4 billion US dollars). Since 2020, the bank has been the top international bank for bonds registered with National Association of Financial Markets Institutional Investors (NAFMII), which is the local bond market regulator overseeing corporate and SSA issuers.\n*Note: Various US dollars figures in this article are converted based on time of the transactions.\nFor further information, please contact:\nDeutsche Bank China\nMedia Relations\nFlora Tian\nPhone: +86 10 5969 8617\nE-mail: flora.tian@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}