{
    "url": "https://www.db.com/news/detail/20170504-from-cheap-dates-to-weekend-breaks?language_id=1",
    "language": "EN",
    "article_type": "Research",
    "publish_date": "May 4, 2017",
    "tags": [
        "Investment Banking"
    ],
    "title": "From cheap dates to weekend breaks",
    "body": "Deutsche Bank Research published its sixth annual report of global prices, giving a unique insight into how the cost of comparable goods and services varies around the world.\nThe most controversial finding is likely to be that Wellington in New Zealand has the highest quality of life of the 47 cities. This is based on a number of factors including purchasing power, healthcare and climate. It is closely followed by Edinburgh and Vienna.\nIn contrast, global “megacities” have relatively low rankings in the quality of life index due to high living costs, crime, pollution and commuting time, with Tokyo at 27, New York at 28 and London at 33.\nThe report notes that “this is highly subjective and one person’s long commute may be another person’s chance to catch-up on Netflix”, adding that megacity inhabitants may be willing to sacrifice quality of life short term if they aspire to further their careers.\nZurich is the most expensive place to have dinner, see a film, take a taxi or combine these on a cheap date, with Tokyo and Oslo next on the list of the priciest places for courtship. However, Zurich also has the highest average salaries, followed by US cities and Sydney. People living in Jakarta, Manila or Rio could potentially increase their salary tenfold by moving to the Swiss city. London has slipped out of the top 10 cities for salaries following the depreciation of sterling after the Brexit vote.\nThe top 10 most expensive regions for goods and services are dominated by European cities, in particular those in Switzerland and across the Nordics.\nMilan has become the number one most expensive place for a weekend getaway, followed by Copenhagen and Zurich.\nWhile US cities have become more expensive over the last five years since the report was first published due to a strong dollar bull run, global brands continue to be cheaper in the US than across other developed markets.\nRents are highest in San Francisco, followed by Hong Kong, New York, London and Zurich.\nMeanwhile, the so-called “bad habits index” of beer and cigarettes is led by Australia, New Zealand and Singapore, while it is cheapest to indulge in the Czech Republic and South Africa.\nResearchers collected the data by surveying prices on the internet as well as by using crowdsourcing techniques.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}