{
    "url": "https://www.db.com/news/detail/20170630-the-problem-with-fx-money-supermarkets?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 30, 2017",
    "tags": [
        "Investment Banking"
    ],
    "title": "The problem with FX Money Supermarkets",
    "body": "Summer holidays are approaching - should you buy your flight on a price comparison website? According to the UK’s Competition Market Authority (CMA) which is mid-way through a year-long study of digital comparison tools , over 90% of price comparison users said they were happy with the results.\nBut, as the CMA hinted in its update earlier this year, the websites aren’t as transparent as they could be. It’s not always easy for consumers to be sure they are getting the best price, or how and why one deal is cheaper than another. Are we getting a genuine bargain or does a low upfront price come at the expense of worse service in areas like flight punctuality?\nIt’s a topic of growing interest in the foreign exchange market where more than 75% of trades are now executed electronically, many through aggregators which work in much the same way as price comparison websites.\nUnpicking the true value provided by FX aggregators isn’t easy, partly because trades are executed so quickly (often in thousandths of a second) and partly because aggregators tend to only display dealers’ prices and not when or how the dealers execute the trades.\nAs long as they receive a good price, most FX market participants are happy to accept a degree of ignorance about aggregators. But studies of aggregators by Deutsche Bank in collaboration with a range of different clients and using game theory techniques indicate that closer examination of the economics of aggregators may be worthwhile.\nIn the first study, the bank’s FX team looked at how the rates on FX deals were impacted by the number of dealers included in an aggregator. To use the flight analogy, should you search across all airlines or just the top five that provide non-stop flights?\nIn another study the bank looked at how prices were impacted by the type of dealer included in the pool: whether the dealers used an “externalising” model for FX trading i.e. they offered prices but were not risk-takers, offsetting positions in public markets almost instantly after executing a trade, or “internalisers” that warehoused risk and matched off trades done by different clients.\nThe results were quite surprising. You might think that the more dealers on the aggregator, the narrower the spread that a client would pay and the more liquidity that would be available. In fact, the studies showed that the more dealers a client included – over a certain number - the more likely it was that the dealer whose quote “won” the deal would end up losing money on the transaction – a kind of “winner’s curse” because they submitted too tight pricing in order to win the deal. The study found that this often led to that dealer subsequently – to protect itself against possible future losses - offering less competitive rates than they might ordinarily offer and reducing liquidity, thereby resulting in a worse result for clients over time.\nAnother finding was that the market price for FX tended to move much more after a deal had been done with an aggregator that included externalisers than one done with an aggregator where only internalising dealers were participating, particularly when deals were being done simultaneously with multiple dealers, an approach known in the industry as a “stack sweep”.\nFor a client that trades infrequently, this may not matter but for companies that need to trade or hedge FX, moves in the market can result in dealers becoming more conservative on the price they are willing to offer via an aggregator – and the amount of liquidity they are willing to provide - which could mean increased execution costs on future deals.\nA second result of the inclusion of externalising firms in aggregators is that it appears to encourage dealers that usually internalise their FX business to switch to externalising in order to win business. In game theory, this is known as a “prisoner’s dilemma” where two rational individuals choose to take actions that are against their mutual interests. In the traditional example, this involves two accomplices in crime choosing to give information to their jailor in the hope of a shorter jail sentence even though the average outcome would be better if they stayed silent. Here by switching from internalising to externalising dealers increase the probability that the trade will move prices and end up being loss-making for the dealer.\nThese findings have reinforced the view - that in the field of FX at least – that consumers and clients need to look carefully and systematically at the impact aggregators are having on the overall execution cost of their foreign exchange trades.\nIt does seem that it’s not enough to just look at the price being offered on a particular FX trade – customers also need to look at how deals may impact future pricing, the composition of the pool and other factors such as the timing of trades.\nInvesting in transaction cost analysis tools may be the quickest way to get a handle on these issues – alternatively, the largest users may choose, like Deutsche Bank – to do their own analysis.\nAggregators clearly have an important role to play in multiple markets – bringing transparency and ease of use – but it’s time we all understood the impact they have on the broader industry so we all make better informed choices whether it’s flights or EURUSD that we’re buying.\nRoel Oomen is the global co-head of electronic FX spot trading at Deutsche Bank",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}