{
    "url": "https://www.db.com/news/detail/20170628-deutsche-bank-wealth-management-appoints-michael-morley-to-lead-uk-business?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 28, 2017",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank Wealth Management appoints Michael Morley to lead UK business",
    "body": "Deutsche Bank Wealth Management announced today that it has appointed Michael Morley, the former Chief Executive of Coutts & Co, to lead and build its UK business, one of the first of around 100 front-office hires planned for this year in high-potential.\nMorley was CEO of Coutts, the UK’s largest private bank, from 2009 to May 2016 and spent seven years as Chairman of the Board of Royal Bank of Scotland International before stepping down in January this year. He is a Member of the Board of the British Bankers Association and Chair of its Private Banking and Wealth Management Advisory Panel, and a Board Member of the Personal Investment Management and Financial Advice Association (PIMFA).\nFabrizio Campelli, the London-based Global Head of Deutsche Bank Wealth Management, said: “The UK is at the heart of the significant investments we are making in serving Deutsche Bank Wealth Management clients and Michael’s unparalleled experience as an executive and as a standard-bearer in the industry here make him the ideal leader for this new phase in our growth strategy. This is just the start.”\nMorley will join Deutsche Bank Wealth Management in July, working in the newly opened headquarters in the Zig Zag Building, in London’s Victoria. He will report to Peter Hinder, Head of Deutsche Bank Wealth Management Europe, Middle East and Africa (EMEA).\nAfter seven years running the UK's most famous private bank, I am excited to be joining Deutsche Bank Wealth Management to lead and build its business in the UK. I have no doubt that London will continue to prosper as an important convening centre for international private client capital. As a global firm Deutsche is clearly in an excellent position to realise a wide range of UK-based opportunities.\nMichael Morley\nPeter Hinder said: “The UK has among the highest number of ultra-high net worth individuals in the world, many of whom have international backgrounds and are looking for the kind of alternative global perspective that Deutsche Bank Wealth Management can offer them. Michael’s appointment is extremely timely, given the changes for our clients implied by Brexit and the need to maintain and build bridges to Europe and the world.”\nDeutsche Bank Wealth Management, the wealth management unit of Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB), announced earlier this month that it plans to hire around 100 new client-facing employees in high-growth markets this year and to invest an additional EUR 65m in new client-focused digital technology over the next 18 months.\nWe see huge potential to build out what we offer to UK clients as a uniquely European and truly global institution that is able to provide seamless expert advice to our clients, their families and their businesses, as well as to innovate with bespoke solutions and connect them to one of the world’s leading capital-markets institutions.\nFabrizio Campelli\nBefore joining Coutts, Morley spent eight years with Merrill Lynch as Managing Director for UK Private Banking and Director of Private Wealth Services for Europe and the Middle East. He had previously spent five years as Head of International Private Banking at Barclays Wealth and CEO of Barclays Switzerland.\nA graduate of Cambridge University, he holds a number of advisory positions including as a Board Director of Walpole British Luxury, a founding member of the China Advisory Council of the Judge Business School of Cambridge University, and an Honorary Board Member of the Royal Opera House, Covent Garden.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}