{
    "url": "https://www.db.com/news/detail/20170626-deutsche-bank-names-borislav-ivanov-as-chief-country-officer-for-russia?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 26, 2017",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank names Borislav Ivanov as CCO for Russia",
    "body": "Deutsche Bank is pleased to announce the appointment of Borislav Ivanov as Chief Country Officer for Deutsche Bank in Russia. Ivanov will also take on the role of Chairman of the Board, subject to regulatory approval. He will report to Peter Tils, CEO for Central and Eastern Europe, and to Satvinder Singh, Head of Global Securities Services & Head of Global Transactional Banking EMEA (ex Germany).\nBorislav Ivanov takes over from Annett Viehweg who has successfully managed the restructuring of Deutsche Bank in Russia in line with the bank’s global strategy, and further developed and strengthened its commercial banking platform.\nIvanov has more than 17 years of experience working with Deutsche Bank in Central and Eastern Europe. Most recently he held the position of CEO and Chairman of the Board of Deutsche Bank in Ukraine, starting in 2014. During this time, the bank significantly increased its country revenue and profitability.\nPrior to this, he was Head of the Deutsche Bank Representative Office in Sofia, Bulgaria, where he successfully developed and executed the bank’s market entry strategy, driving large corporate deals and establishing Deutsche Bank as the preferred transaction partner for local banks. Ivanov holds a diploma in Business Administration of the Free University of Berlin. He is fluent in Russian, English, German and Bulgarian.\n\nWe would like to thank Annett Viehweg for her extremely important contribution to Deutsche Bank in Russia. At the same time, we are delighted to welcome Borislav Ivanov, who brings an exceptional track record for Deutsche Bank in the region. His regional insight, combined with extensive global transaction banking experience, will enable him to take Deutsche Bank to the next level in Russia.\nPeter Tils, CEO Central and Eastern Europe of Deutsche Bank\nRussia is and will continue to be one of the most attractive and significant markets for Deutsche Bank in Europe. The bank is committed to continuing to develop its presence in the market. Deutsche Bank has more than 1,200 full-time employees in the country. The bank focuses on growth opportunities for the local global transaction banking business with Russian and international clients, while the investment banking business will continue to be managed from global hubs.\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nDis­claimer \nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 20 March 2017 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}