{
    "url": "https://www.db.com/news/detail/20170622-deutsche-bank-sets-up-corporate-finance-advisory-services-for-small-and-medium-sized-companies?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 22, 2017",
    "tags": [
        "Capital markets",
        "Company",
        "Corporate products",
        "Investment Banking",
        "Private products"
    ],
    "title": "Corporate finance services for small and medium-sized companies",
    "body": "Small and medium-sized companies (SMEs) have a growing need for advisory services in particular on mergers and acquisitions (M&A), the capital market business with a focus on financing via bonded loans (Debt Capital Markets, DCM) and on structured finance\nDeutsche Bank to invest more in its business with the German Mittelstand\nAround 50 specialists for the advisory and financing business (Corporate Finance) in the Private & Commercial Bank\nManagement team with considerable experience working with commercial clients and in global investment banking\nDeutsche Bank is setting up a dedicated advisory service for the capital market business in Germany aimed at its small and medium-sized commercial clients. Around 50 specialists from the Private & Commercial Bank will advise companies in future on mergers and acquisitions, and on capital market solutions with a focus on financing via bonded loans and structured finance schemes.\nThe existing industry expert teams at the Commercial Bank will also be part of the new department. The capital market experts work closely with the client advisors in the regions in Germany. At the same time, they can benefit from the Corporate & Investment Bank’s global network. The new department will also work closely with Deutsche Bank’s Wealth Management business.\nFor years now, there have been growing calls from our small and medium-sized commercial clients for capital market instruments and mergers and acquisitions advisory services. Now is the right time to add this important area of expertise to our Commercial Bank.\nStefan Bender, Head of Commercial Clients Germany for the Private & Commercial Bank\n“With the new “Corporate Finance für den Mittelstand” department we’re bringing together the bank’s capital market expertise for our corporate clients. We want to further consolidate our market position when it comes to capital market advisory services for SMEs,” added Bender.\n“With Oliver Bortz, who’s been involved with Deutsche Bank’s German commercial client business since 1990 and who also worked for the investment bank in New York and London, we’ve found the ideal man to lead a very experienced management team.”\nRalf-Georg Mittler (M&A), Bernd Rolinck (Industry Expert Teams), Sebastian Ottmann (DCM), Steffen Rapp (Transaction Bank / Structured Financing) and Markus Reichenbach (Wealth Management) make up the rest of the management team.\nThe number of company disposals is rising, mainly as a result of changes in ownership at family-run companies. According to calculations carried out by the IfM Bonn, around 135,000 family-run companies were or will be handed down to the next generation between 2014 and 2018.\nThis often results in changes to the shareholder structure and the arrival of new shareholders. Consequently, there is also rising demand for company purchases or sales advisory – something that was previously provided by an SME team from. the Corporate & Investment Bank, which will transfer to the new department of the Private & Commercial Bank and will be expanded.\nThe Private & Commercial Bank and the Corporate & Investment Bank will work together closely in the process. The bank is bundling its knowledge and resources and will therefore be able to offer its SME clients the same high-quality advice as well as the international network of the global investment bank. The aim is to build on Deutsche Bank’s strong position among German SMEs.\nCompany acquisitions often require financing and the experts for structured finance will be able to address these needs, arranging consortium loans where a number of banks provide financing together. Unlike traditional loans, consortium loans have long loan periods, usually up to seven years. Last year, 153 transactions, each with a volume of up to 300 million euros, were carried out in the relevant segment in Germany.\nAccording to the research firm Dealogic, Deutsche Bank’s share of the market was around 18 percent.\nCapital market solutions in the form of bonded loans are another alternative means of financing for SMEs. Bonded loans are corporate loans secured by institutional investors such as insurance companies, pension funds or banks. For many small and medium-sized companies, bonded loans are an attractive, complementary form of financing which allows among other things a more varied outside capital basis and thus a first step onto the wider capital market. In 2016, a total of 129 loans totalling roughly 26 billion euros were issued.\nGermany is Europe’s largest market for private placements of this kind. Thomson Reuters calculated that in 2016 Deutsche Bank had a market share of around 24 percent in this segment in Germany, Austria and Switzerland – with companies generating annual turnovers of up to 1.5 billion euros. With access to investors throughout the world, Deutsche Bank is able to provide financial instruments on attractive terms.\n“With the new department, our small and medium-sized commercial clients in Germany can expect the top-quality advice and access to the world’s capital markets that only a global investment bank can offer,” said Bender.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}