{
    "url": "https://www.db.com/news/detail/20170616-makoto-kuwahara-discusses-inclusive-leadership-and-diversity-with-nikkei-japan?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 16, 2017",
    "tags": [
        "Company",
        "Diversity"
    ],
    "title": "Makoto Kuwahara discusses inclusive leadership and diversity with Nikkei Japan",
    "body": "Nihon Keizai Shimbun (Nikkei), the biggest Economic and Financial Daily in Japan published a column from Japan chief country officer Makoto Kuwahara in its morning edition.\nThe column -- 私見卓見 (personal & distinguished view) -- runs opinions of experts from various industries, academics and business leaders. Kuwahara cites the importance of being inclusive as business leaders and recognising differences to create a climate of innovation and excellence in the organisation.\nRecently Kuwahara also accepted the first Catalyst Distinction award for actively promoting women’s advancement and diversity and inclusion initiatives at the workplace.\nRead the full column below (English text translated from Japanese):\nCompanies are expanding the concept of diversity to focus on differences in culture, age, gender and values. At Deutsche Bank Group (DBG), which has a workforce of around 100,000 employees drawn from over 140 nationalities, the organisation itself is rich in diversity.\nMany companies are pursuing diversity, but isn’t this amounting to nothing more than just setting numerical targets for headcounts and ratios of women? We believe that simply ushering in a variety of people is insufficient.\nWhat is important is the idea of inclusion - including various people by respecting their differences and individuality. It becomes possible to create new values only when both diversity and inclusion are being promoted.\nFor example, even if maternity and childcare leave systems are in place, there might be an atmosphere that makes it difficult for employees to utilise them, or perhaps employees are unable to get their companies to willingly accept that they are sexual minorities. If this is the case, it means that diverse individualities are not being accepted.\nIn order to become an innovative and flexible organisation, the organisation must be composed of human resources that possess diverse backgrounds, and it requires a prevailing culture in which those individualities and abilities are manifested to the utmost. To promote this, knowledgeable management personnel, who have the authority to make decisions must personally step up and influence the overall corporate culture. When executives are operating in this way, it also empowers employees to act in ways that are \"true to themselves.\"\nAround the world, unforeseen events that were not readily conceivable in the past are occurring one after another in a short space of time. This current period of uncertainty is the time when leadership that is able to promote an inclusive way of thinking or \"inclusive leadership\" is absolutely needed. This is because being fixated on one idea delays the pace of progress and reform, making it impossible to keep up with the changing times.\nThe individualities and innovative opinions of employees cannot be fully utilised under the old style of leadership in which everything is decided via a top-down approach. It is vital that this concept of “inclusive leadership” is disseminated at various levels of management.\nThe benchmark for evaluating human resources must also change. Companies should bring up people who are capable of respecting differences and flexibly accepting various ways of thinking. Supporting and highly regarding individuals who contribute to a corporate culture that promotes flexible thinking is what inclusive leadership is all about.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}