{
    "url": "https://www.db.com/news/detail/20170608-born-to-be-jacksonville-ambassadors-host-financial-literacy-programme-for-high-school-students?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 8, 2017",
    "tags": [
        "Corporate Citizenship",
        "Education",
        "Employee engagement"
    ],
    "title": "Born to Be: Jacksonville Ambassadors host Financial Literacy programme for high school students",
    "body": "The Deutsche Bank Jacksonville Ambassadors, a cross-divisional group of employees who collaborate to foster a greater sense of partnership across the site and within the community, hosted 45 students from William M. Raines High School for “Finance and Jobs.” The event was the final module in the “Financial Literacy 2017” series sponsored by the bank over the past two weeks.\n\nDuring their visit to Deutsche Bank on May 25, the 11th and 12th graders met with business lines and divisions to learn how to apply a college degree to a career in financial services.\n\nThe visit to the bank followed the first module on May 18 when the Ambassadors visited Raines High School and engaged the students in “Finance and Society”, which covered personal banking, debt and building credit, and the basics of investing. On May 22, the Ambassadors escorted the students to the University of North Florida (UNF) for a “Finance and Economics” presentation hosted by faculty and administration who covered several topics including a “Countdown to College”, a UNF degree road map and a tour of the campus.\nPart of Born to Be, the bank’s global youth engagement programme, “Financial Literacy 2017” was developed through Deutsche Bank’s partnership with the Jacksonville Public Education Fund and the Jacksonville Jaguars, the local NFL team, in support of the 2017 EDDY Awards recognising the Duval County (Florida) Teacher of the Year.\nLeslie Slover, Regional Head of Jacksonville and Cary, had the opportunity to get to know award finalist Michael Bostic-Jones and, after seeing his classroom, was impressed with his commitment to the students.\n\nStudents received a Certificate of Completion at the end of the programme at Deutsche Bank\n“In our conversations, Michael mentioned he would like his students to learn more about financial literacy,” said Slover. “I thought this was a perfect fit for Deutsche Bank and a great opportunity for us to continue to give back to the students of Jacksonville. We are so fortunate this year to have our Ambassador programme which ran with this and turned it into something that will leave a lasting impression on all involved.”\n“We wanted to provide the students with more than just basic financial literacy by making this a memorable experience that would have a lasting impact on the students with regards to picking a college major and a future career,” added Melissa Richtel on behalf of the Jacksonville Ambassadors. “Through our partnership with UNF and our bank colleagues, we were able to show the students not only how to obtain a college degree but how to apply that degree in an entry level position at a bank.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}