{
    "url": "https://www.db.com/news/detail/20170608-deutsche-bank-responded-to-congressional-request?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 8, 2017",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Deutsche Bank responded to Congressional request",
    "body": "Dear Representatives Waters, Kildee, Moore, Green and Perlmutter:\nWe write in further response to your letter dated May 23, 2017 to our client, Deutsche Bank AG (the “Bank”), regarding its reported banking relationship with the President of the United States and his family, as well as publicly reported allegations concerning certain equity trading in the Bank’s London and Moscow offices. Your letter requests certain non-public information from the Bank with respect to these matters.\nFederal law requires that financial institutions such as Deutsche Bank maintain the privacy of their customers and the confidentiality of information relating to those customers. This is true even if the individual is a government official or well-known person, and even in circumstances where the individual has made some disclosure regarding their relationship with their banking institution, such as by recording a mortgage, filing a personal financial disclosure form or making public comments. Such actions do not relieve the financial institution of its obligations to maintain the confidentiality of any non-public information.\nSo, while we seek to cooperate, we must obey the law.\nIndeed, U.S. federal law provides for the imposition of various penalties to ensure that financial institutions comply with these restrictions and narrowly defines the circumstances under which financial institutions may disclose such information and to whom it may be disclosed. These laws include procedures for such information to be disclosed to certain federal governmental bodies for law enforcement or regulatory purposes or in connection with duly-authorized investigations, including as authorized under the Rules of the Congress, by congressional committees and subcommittees.\nAccordingly, Deutsche Bank, like other financial institutions, is not permitted to disclose details related to its customers. This includes information on accounts, loans, or other transactions that individuals may have or may have had with Deutsche Bank and information regarding any internal reviews Deutsche Bank may have conducted with respect to any accounts, loans or other transactions. Similarly, the Bank’s dealings with its regulators and other governmental authorities are subject to legal restrictions designed to ensure the confidentiality of the regulatory or legal process and to protect other legal rights and obligations.\nWe hope that you will understand Deutsche Bank’s need to respect the boundaries that Congress and the courts have set in an effort to protect confidential information.\nWith respect to the questions you ask regarding Deutsche Bank’s controls, the Bank has stated that it has taken steps to enhance its control environment, including by increasing staff and through improvements in processes and procedures. This includes a review of Deutsche Bank’s know-your-client and client on-boarding procedures across the Bank. Deutsche Bank remains committed to strengthening its policies and procedures in this area, and to working with its regulators and appropriate authorities to address any concerns regarding the effectiveness of the Bank’s control systems.\nDeutsche Bank has publicly announced the resolution of certain recent investigations regarding equity trades in the Bank’s Moscow and London offices. Thus, Deutsche Bank in January 2017 entered into settlements with the New York Department of Financial Services (“DFS”) and the U.K. Financial Conduct Authority with respect to the equity trades matter and, last month, resolved the same matter with the Federal Reserve.\nFor your convenience, copies of the publicly available resolution documents are attached to this letter. Deutsche Bank continues to cooperate with law enforcement authorities with respect to these matters.\nIndeed, the DFS Consent Order acknowledges Deutsche Bank’s cooperation and remediation efforts, specifically noting the Bank’s “timely self-report[ing].” Handling matters such as those raised in your letter in compliance with applicable legal standards is and will remain a priority for the Bank.\nIf you have any further questions, please feel free to direct them to the undersigned.\nSincerely,\nSteven R. Ross\nLeslie B. Kiernan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}