{
    "url": "https://www.db.com/news/detail/20170607-deutsche-asset-management-report-the-gathering-forces-of-esg-investing?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 7, 2017",
    "tags": [
        "Sustainability"
    ],
    "title": "Deutsche Asset Management report: the gathering forces of ESG investing",
    "body": "With Germany’s attempts to keep climate change on the political agenda for the G20 (Group of 20), a new report from Deutsche Asset Management (Deutsche AM) examines the value of investing in environmental, social and governance (ESG) issues.\nThe second Sustainable Finance report is particularly timely in the bank’s home market of Germany, as the country is currently President of the G20 and as the city of Bonn prepares to host the 23rd Conference of the Parties (COP 23) at the UN Convention on Climate Change in November.\nMichael Lewis. Head of ESG Thematic Research, Deutsche AM, said: “ESG investing is gathering momentum. Our report shows how it has moved on from risk management and downside protection towards more positive motivations for ESG investing.”\nThe Sustainable Finance report features five main articles, examining key trends including:\nThe growth of ESG assets and how the regulatory environment is affecting ESG investing.\nMeasures to address climate risk – examining physical and regulatory risks arising from climate change and how the low carbon transition is a major investment opportunity.\nUS renewable energy sector – highly relevant for investors’ search for yield.\nSustainable real estate – one of the asset classes with the strongest reasons for, and benefits from, incorporating sustainability.\nMicrofinance sector and investment diversification. Deutsche AM celebrates 20 years of supporting microfinance investment vehicles.\nDeutsche AM has long recognised the importance of ESG within its investment approach and was among the early signatories to the UN supported Principles for Responsible Investment (PRI) in 2008. At the end of 2016, Deutsche AM had 9.9 billion euros of ESG assets under management.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}