{
    "url": "https://www.db.com/news/detail/20170531-china-development-bank-and-deutsche-bank-sign-3-billion-us-dollar-cooperation-agreement?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "May 31, 2017",
    "tags": [
        "Corporate products",
        "Investment Banking",
        "Research"
    ],
    "title": "China Development Bank and Deutsche Bank sign 3 billion US dollar cooperation agreement",
    "body": "Deutsche Bank (XETRA: DBKGn.DE / NYSE:DB) China Development Bank (CDB) and Deutsche Bank signed a Memorandum of Understanding at a ceremony in Berlin. The two parties expressed their interest in promoting the renminbi’s (RMB) internationalization and in financing economic cooperation between China, Germany and other Belt & Road Initiative (B&R) countries.\nThe Belt & Road Initiative is a development strategy proposed by Chinese President Xi Jinping. It focuses on cooperation between Eurasian countries, primarily China, the land-based Silk Road Economic Belt and the oceangoing Maritime Silk Road. Many Chinese state leaders, including Premier Li Keqiang who is currently visiting Germany, have promoted this policy initiative across the world over the past several years.\nThe future\nAs part of the Memorandum of Understanding, CDB and Deutsche Bank agreed to work together over the next five years with an aim of supporting projects worth 3 billion US dollars.\nCDB and Deutsche Bank also agreed to establish a joint team in order to cooperate on projects that promote the B&R Initiative. Subject to applicable laws and regulations, CDB and Deutsche Bank will finance projects that are beneficial to clients of both banks, including through joint lending and project finance.\nGarth Ritchie, Head of Deutsche Bank’s Corporate & Investment Bank, said: “We are pleased to work with China Development Bank in support of the Belt & Road Initiative. Expanding infrastructure links between China and Europe is a positive opportunity for the people and economies of both.”\nWerner Steinmüller, Deutsche Bank Asia Pacific CEO, added: “Deutsche Bank is proud of its unique and long-standing role in connecting the Chinese and European economies. We are confident that the depth of our network and experience in Europe will provide a critical anchor to this important China-led policy initiative.”\nContact\nDeutsche Bank AG\nMedia Contact\nFrank Hartmann\nPhone: +49 69 910 42744\nE-mail: frank.hartmann@db.com\nChristian Streckert\nPhone: +49 69 910 38079\nE-mail: christian.streckert@db.com\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nForward looking statements\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 20 March 2017 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from https://www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}