{
    "url": "https://www.db.com/news/detail/20170523-deutsche-bank-signs-accreditation-master-agreement-with-green-climate-fund?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "May 23, 2017",
    "tags": [
        "Africa",
        "Sustainability"
    ],
    "title": "Deutsche Bank signs Accreditation Master Agreement with Green Climate Fund",
    "body": "Deutsche Bank today signed an Accreditation Master Agreement (AMA) with the Green Climate Fund (GCF), enabling the bank to receive and use GCF capital and raise further funds from private sector investors to support action on climate change. The agreement was signed in London by Nicolas Moreau, Head of Deutsche Asset Management and member of the Management Board of Deutsche Bank AG, and Executive Director of the GCF’s Secretariat, Howard Bamsey.\n“We are pleased to sign this agreement in order to work with GCF to mobilise private sector capital and increase contributions to climate financing for adaptation and greenhouse gas mitigation measures in developing countries,” said Moreau.\nThe Green Climate Fund works through a wide range of Accredited Entities to channel its resources to projects and programmes. Deutsche Bank is the second commercial bank to sign an Accreditation Master Agreement with GCF.\n“This signature marks a milestone for GCF as it unlocks the broad international expertise of Deutsche Bank in directing private investment flows toward climate action,” said Howard Bamsey. “It follows from GCF’s recognition of the essential role of the private sector in filling climate finance gaps.”\nAt the signing in London (l-r): Michael Hoelter and Nicolas Moreau (Deutsche AM), together with Howard Bamsey (GCF)\nThe GCF has already approved the first funding proposal from Deutsche Bank at its 14th meeting in Songdo, South Korea, in October 2016. The Universal Green Energy Access Programme combines capital from the GCF with private sector investment to finance renewable electricity access for nearly half a million people and small and medium sized enterprises in cooperation with local banks in Africa. The GCF’s anchor investment of USD 78.4 million allows Sustainable Investments, the group within Deutsche Asset Management that manages environmental and social assets, to raise a total of USD 300 million in capital.\nThe proposal has been endorsed by the Governments of Benin, Kenya, Namibia, Nigeria and Tanzania, which is where the program will initially focus investments in the first three years. The signing of the Accreditation Master Agreement marks a major step towards implementation of this programme.\n\nFor further information please contact:\nDeutsche Bank AG\nPress & Media Relations\nTim Oliver Ambrosius\nPhone: +49 (0)69 910-42648\nE-Mail: tim-oliver.ambrosius@db.com\nDeutsche Asset Management\nPress & Media Relations\nNick Bone\nPhone: +44 (0) 207 547 2603\nE-Mail: nick.bone@db.com\n\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement. Such factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission. Such factors are described in detail in our SEC Form 20-F of 11 March 2016 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.\nAbout Green Climate Fund\nThe Green Climate Fund mission is to expand collective human action to respond to climate change. The Fund aims to mobilize funding at scale to invest in low-emission and climate-resilient development in emerging economies and frontier markets. GCF provides loans, equity, guarantees, and grants to private sector corporations in developing countries. Supported by close to 200 governments, the Fund is the largest dedicated international climate fund. GCF is mandated to fully engage with private sector investors, developers, entrepreneurs, corporations, and small and medium sized enterprises in all developing countries.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}