{
    "url": "https://www.db.com/news/detail/20170508-allianz-axel-springer-daimler-deutsche-bank-with-postbank-core-and-here-to-launch-joint-platform-for-online-registration-e-identity-and-data-services?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "May 8, 2017",
    "tags": [
        "Corporate products",
        "Digitalisation",
        "Private products",
        "Research"
    ],
    "title": "Allianz, Axel Springer, Daimler, Deutsche Bank with Postbank, Core, and Here to launch joint platform for online registration, e-identity and data services",
    "body": "Leading German and European companies have stated their intention to cooperate more closely to establish a joint, pan-industry platform for online registration, e-identity and data services. The aim is to make online registration simpler and more secure for clients. The participating companies have signed a corresponding declaration of intent. The initiative was set up by Allianz, Axel Springer, Daimler and Deutsche Bank with Postbank as well as the technology think-tank Core, and Here Technologies, the location services provider.\nAt the heart of this new, standard access procedure for online activities is a so-called master key. Clients can use this key for registration and identification purposes across a number of industries. It is not only more convenient, but also more secure and aims to guarantee the highest standards in data security and data protection. Not only does the platform comply with EU data protection reforms, it also adheres to the provisions of the eIDAS regulation, which governs trust services for the electronic identification (eID) function.\nWhat is more, the platform is designed to be open and compatible with ongoing projects managed by authorities under the German government and German federal states, even at local government level, for example, for citizen portals. Additional functions may follow, for instance, digital access to public authorities (e-government). Moreover, developing digital payment services and digital financial services is also possible on the platform.\nInstead of focusing on individual integration solutions, the initiators are keen to use a common infrastructure, which will allow networking across businesses, as well as broader market coverage in keeping with Industry 4.0. The initiators are looking to gain more partners from a number of different sectors in the short term, including aviation companies, e-commerce agents, retailers and telecommunications companies. Preliminary negotiations are already under way with several companies that have shown interest in the platform. Among others, talks with Deutsche Telekom about joining the project have commenced recently.\nThe idea behind the cooperation is to provide a competitive, European response to the platform economy’s main players.\nThe initiative is in an ongoing dialogue with a number of federal ministries – notably the Federal Ministry for Economic Affairs and Energy welcomes the initiative. The Fraunhofer Institute for Open Communication Systems (FOKUS), the European School of Management and Technology (ESMT) are also lending scientific support to the project.\nManfred Knof, CEO of Allianz Deutschland, also on behalf of Allianz SE, says: “As insurers, it has always been crucial for us to be able to handle our clients’ data in a trustworthy manner. This initiative gives us the opportunity to apply the highest level of security standards to the digital financial services that we offer our clients.”\nMathias Döpfner, CEO of Axel Springer SE, says: “Experience has shown that user-friendly online registration models are a key factor for the success of any digital publishers’ products. By entering into this cooperation with leading companies in the financial sector, the automotive industry and other businesses, we aspire to lead the way across Europe.”\nKlaus Entenmann, Management Board Chairman of Daimler Financial Services, says: “The platform we are designing will provide significant additional benefits for our online clients. This not only applies to our traditional financing and leasing business, but also to our mobility concepts, which is one of our strongest-growing business areas.”\nWe Europeans must at last fully play out our strengths in digitalisation. The time is ripe for a platform initiative of this kind. It will increase legal certainty for clients and boost the European digital economy’s growth.\nChristian Sewing, Deputy CEO of Deutsche Bank\nFrank Strauss, CEO of Postbank, says: “In the digital era more than ever, banks have a key role and are responsible for supporting their clients as they make their way into the digital future. That is why Postbank – one of the first online banks – is happy to join this pioneering initiative in order to ensure that its 14 million clients can place their trust in a secure and reliable digital world.”\nHolger Friedrich, Managing Director at Core, says: “The highest standards in data protection and security, combined with technological expertise are the future prerequisites for individuals and companies alike to be able to decide how their personal data are used. This initiative is a milestone on the path towards a secure digital framework established on the foundation of European values.”\nEdzard Overbeek, CEO of Here Technologies, says: “New digital products, services and solutions are rapidly changing the way we live, move and interact with each other, and it is vital that we can access them in a user-friendly and secure way. As we enter the age of autonomy, a digital master key will be especially useful for people seeking easy access to different modes of transportation. We look forward to enabling the benefits of this initiative for participants through our growing Open Location Platform.\"\nIn the coming weeks, the initiators will finalise the details of their collaboration and set a launch date for the platform, before submitting their plan to the competition authorities for regulatory approval.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}