{
    "url": "https://www.db.com/news/detail/20220829-helping-autistic-youth-find-their-voice-through-music?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "Singapore, August 29, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Helping autistic youth find their voice through music",
    "body": "Growing up, eighteen-year-old Danish who is autistic struggled with social skills and confidence. At age ten, he joined Deutsche Bank’s CSR Born to Be Music Programme with the Singapore Chinese Orchestra (SCO) for children with an aptitude for music. Through this programme, run at a school for children with special needs called the Rainbow Centre, Danish discovered joy in music. He learnt to play the Guzheng, a traditional Chinese plucked-string instrument. After years of dedication, practice and mentorship from SCO musicians, Danish played with the 85-piece orchestra to an audience of 800 at our Dream Beyond concert last week. \nIn this video, Danish and his mother explain how learning music has changed his life.\nDeutsche Bank’s Dream Beyond concerts\nDeutsche Bank’s ‘Dream Beyond’ concert showcases the talents of young people with disabilities, giving them a chance to grow, achieve and develop as people through music. Danish and two other Rainbow Centre students sponsored by Deutsche Bank, Daniel and Gene, performed at the bank’s 8th concert over the weekend to an audience which included staff, members of the community, clients, charity partners and beneficiaries. This annual concert, and the musical training that readies the young musicians for their moment in the spotlight, continues to give young people with special needs an avenue for self-expression through music. The training helps them to focus, relax and gives their confidence a huge boost.\nOver the years, the programme’s students have achieved remarkable things. Danish and Daniel will take part in internships in retail and hospitality this year after graduating from the Rainbow Centre. They both plan to further their studies in skills-based schools for older special needs youths. Gene will graduate from the Rainbow Center next year.\nPartnership with True Colors Symphony – Hong Kong\nDeutsche Bank also supports a Born to Be music scholarship programme with True Colors Symphony (TCS) in Hong Kong. TCS provide financial assistance and musical training to disadvantaged and special needs individuals like award-winning and visually impaired violinist, Ding Yijie, who performed as a special guest at the concert. Yijie is the only blind violin student studying at the Hong Kong Academy for Performing Arts.\n ",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 8
}