{
    "url": "https://www.db.com/news/detail/20220825-deutsche-bank-wins-best-emerging-market-trading-platform-for-second-year-running?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Singapore, August 25, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank wins Best Emerging Market Trading Platform for second year running",
    "body": "Deutsche Bank’s leading market making capabilities and unique emerging market (EM) offerings were recognised for the second consecutive year at the FX Markets Asia Awards, with the bank winning Best EM Trading Platform.\nThe award is given to the platform that offers best-in-class EM services for clients, focusing on high liquidity, cost efficiencies, innovative solutions as well as breadth of services.\nAs a key market maker across 14 locations in Asia Pacific, Deutsche Bank provides liquidity in large sizes and long tenors, in multiple asset classes and markets. The bank is a leading primary dealer for Asian government bonds with one of the largest market shares across onshore markets.\nDeutsche Bank’s unique platform also seamlessly connects onshore and offshore markets, giving corporate and institutional clients access to emerging markets in Asia and the rest of the world.\nAshok Das, Head of Global Emerging Markets, Asia said, “We continue to develop and implement unique and innovative solutions in this ever-changing market backdrop, where clients are increasingly looking to manage risks while accessing deep liquidity.\"\nThis award is testament to our commitment to innovation, the strength of our platform, extensive onshore Asian presence and ultimately, how we respond to industry needs.\nAshok Das\nDeutsche Bank’s key EM platform, Workflow Solutions, addresses workflow challenges including collections, payments, funding and foreign exchange into and across markets with capital restrictions.\nThe success of Workflow Solutions in Asia has led Deutsche Bank to extend the offering to major emerging markets globally, including Central and Eastern Europe, Middle East and Africa and Latin America.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 3
}