{
    "url": "https://www.db.com/news/detail/20220813-deutsche-bank-mourns-anshu-jain?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "August 13, 2022",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank mourns Anshu Jain",
    "body": "Deutsche Bank mourns the death of its former Co-CEO Anshu Jain, who passed away in the early hours of Saturday at the age of 59 after a long, serious illness.\nJain played a crucial role in the development of Deutsche Bank and was instrumental in building the company’s global capital markets business. He was appointed to Deutsche Bank's Management Board in 2009 and was responsible for the Corporate and Investment Bank division from 2010. From 2012 to 2015, he was Co-CEO.\nAlexander Wynaendts, Chairman of the Supervisory Board of Deutsche Bank, paid tribute to these achievements. \"Anshu Jain played a defining role in expanding Deutsche Bank's position in our global business with companies and institutional investors. Today, this is of strategic importance not just for Deutsche Bank, but for Europe as a financial centre,\" he said.\nChristian Sewing, CEO, recalled: \"Anyone who worked with Anshu experienced a passionate leader of intellectual brilliance. His energy and loyalty to the bank left a great impression on many of us.  Our thoughts and sympathies go out to his wife, his children and his mother. We will honour his memory.\"\nJain’s contribution to Deutsche Bank and the industry was recognised with numerous awards worldwide. For example, TERI Technical University in New Delhi awarded him an honorary doctorate and the London Business School made him an Honorary Fellow. In 2010 and 2012, he received the Lifetime Achievement Award from Risk magazine, in 2012 he was named Global Indian of the Year by the Economic Times of India, and in 2014 he was honoured by the Jewish Museum of New York. Besides his contributions to the bank, he supported animal welfare projects in his native India and in South Africa.",
    "number_of_ratings": 75,
    "rating": 4.2,
    "likes": 70
}