{
    "url": "https://www.db.com/news/detail/20230428-deutsche-bank-announces-public-tender-offer-for-six-series-of-its-senior-non-preferred-bonds?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, April 28, 2023",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank announces public tender offer for six series of its senior non-preferred bonds",
    "body": "NOT FOR DISTRIBUTION IN OR INTO OR TO ANY PERSON LOCATED OR RESIDENT IN THE UNITED STATES, ITS TERRITORIES AND POSSESSIONS (INCLUDING PUERTO RICO, THE U.S. VIRGIN ISLANDS, GUAM, AMERICAN SAMOA, WAKE ISLAND AND THE NORTHERN MARIANA ISLANDS), ANY STATE OF THE UNITED STATES OR THE DISTRICT OF COLUMBIA OR IN OR INTO ANY OTHER JURISDICTION WHERE IT IS UNLAWFUL TO DISTRIBUTE THIS ANNOUNCEMENT.\nDeutsche Bank Aktiengesellschaft (XETRA: DBKGn.DE/NYSE: DB) announces a tender offer for six series of its senior non-preferred bonds. The maximum acceptance amount for the tender offer is 1.0 billion euros in aggregate principal amount, as further set out in the Tender Offer Memorandum referred to below. The rationale for the tender offer is to proactively manage Deutsche Bank’s debt maturity profile and to provide liquidity to current bond holders.\nThe tender offer encompasses the following six series of Euro-denominated non-preferred bonds issued by Deutsche Bank from 2015 to 2021:\nCoupon  Currency Call Date Maturity Date Amount Outstanding ISIN\n1.125% EUR - March 2025 EUR 884m DE000DB7XJP9\n1.000% EUR November 2024 November 2025 EUR 1,420m DE000DL19VR6\n2.625% EUR - February 2026 EUR 684m DE000DL19US6\n1.375% EUR September 2025 September 2026 EUR 735m DE000DL19VP0\n1.625% EUR - January 2027 EUR 1,475m DE000DL19U23\n0.750% EUR February 2026 February 2027 EUR 1,197m DE000DL19VT2\nThe tender offer will expire at 5.00 p.m. (CEST) on Tuesday, 9 May 2023.\nInformation is available on Deutsche Bank’s Investor Relations website under https://www.db.com/ir or by contacting +49 800 910-8000.\nNo offer or invitation to acquire any bonds is being made pursuant to this announcement. The tender offer is being made pursuant to a Tender Offer Memorandum dated 28 April 2023 (the “Tender Offer Memorandum”) and is subject to restrictions in certain jurisdictions, as fully described in the Tender Offer Memorandum. The distribution of this announcement and the Tender Offer Memorandum may be restricted by law in certain jurisdictions. Persons into whose possession this announcement and/or the Tender Offer Memorandum comes are required to inform themselves about, and to observe, any such restrictions.\nRequests for the Tender Offer Memorandum relating to the tender offer may be directed to the Tender Agent: Kroll Issuer Services Limited (phone: +44 20 7704 0880, attention: Owen Morris / Jacek Kusion; email: db@is.kroll.com)",
    "number_of_ratings": 5,
    "rating": 3.4,
    "likes": 1
}