{
    "url": "https://www.db.com/news/detail/20230427-a-message-from-christian-sewing-on-q1-results-2023?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 27, 2023",
    "tags": [
        "Financial Results",
        "Strategy"
    ],
    "title": "A message from Christian Sewing on Q1 results 2023",
    "body": "Dear Colleagues,\nSince we completed our transformation at the end of last year, we have entered a new phase of our Global Hausbank strategy. Our results for the first quarter, which we published today, underline just how well we are doing with it. In a period that was again marked by high volatility and by negative headlines surrounding the banking sector, you did not allow yourselves to become unsettled, but have once again achieved a great result. This is reflected in the best start to the year in a long time. We generated 7.7 billion euros in revenues, the highest in a quarter since 2016, and the pre-tax profit of 1.9 billion euros was the best result since 2013. Our post-tax-return on tangible equity would be 10 percent if the annual bank levies were booked pro rata across the year, and thus already at the level of our target for 2025. We owe this to a business mix that is more balanced than it has been for a long time: around two thirds of our revenues and earnings come from our more stable businesses.\nThese are figures we can be proud of – and I am particularly pleased because they underpin what some people had tried to cast doubt on during the market turmoil in March: the stability and resilience of our bank. Today, we have sent a clear signal of how strong Deutsche Bank is. This becomes even clearer when you look at those indicators that are usually less in the spotlight. At the end of March, our Common Equity Tier 1 (CET1) ratio stood at 13.6 percent, comfortably exceeding our target of 13 percent. Our Liquidity Coverage Ratio (LCR) was stable at 143 percent, and our loan book continues to prove robust in a difficult economic environment. In view of our increasing profitability and very solid capitalisation, we have now initiated a dialogue with the regulatory authorities on share buybacks in the second half of the year.\nWe have worked hard to achieve this stability. It is the foundation for the success story we have been writing since the beginning of our transformation. We are convinced that it also allows us to make even faster progress on the path we have chosen and to exploit even more systematically the opportunities that are available to us.\nTo achieve this, we have today announced a range of strategic adjustments that will further sharpen our focus. In this context, there are also changes to the composition and distribution of responsibilities of the Management Board, as already reported last night. And the bank takes this opportunity to also adjust the management structures in some places to reflect our current priorities.\nLet's start with the changes to the Management Board: we already announced last week that Karl von Rohr would not be renewing his contract, which expires at the end of October. In addition, Christiana Riley, our CEO for the Americas, has also decided to take up a new position outside Deutsche Bank and to resign her mandate with effect from the end of the Annual General Meeting on May 17.\nLike Karl, Christiana played an important role in the transformation of our bank in recent years. After starting in the strategy department in Frankfurt in 2006 and later taking over its management as well as providing decisive impetus as CFO of the Corporate & Investment Bank, Christiana was appointed to the Management Board in 2020 and took over responsibility for our Americas business from New York. In this role, she intensified the dialogue with our clients and, in particular, American regulators, and aligned the US business more closely with the headquarters and our other regions. I would also like to highlight her great and exemplary commitment to diversity, equity and inclusion, both in the US and beyond.\nIt is testimony to our bank and the strength of our management team that Karl’s and Christiana’s responsibilities can be passed on to excellent successors from within our own ranks.\nKarl's many responsibilities will be handed over in an orderly process by the end of October at the latest:\nClaudio de Sanctis, currently Head of the International Private Bank (IPB), will move up to the Management Board and assume responsibility for the Private Bank. In recent years, he has successfully repositioned IPB by revising our advisory approach, making the organisation more efficient and systematically strengthening our business in growth markets. In doing so, he also provided important impetus for the transformation of the business with private clients in the various regions and segments. The IPB's successes contribute to strengthening our stable businesses as planned. Looking ahead, the entire Private Bank will benefit from his extensive experience and his leadership, together with Lars Stoy as head of our Private Bank in the German home market.\nJames von Moltke will be responsible for Asset Management on the Management Board, in addition to his existing duties. As Chief Financial Officer and President of the Management Board, James is one of the architects of our transformation and, together with his teams, one of the guarantors of our success. In the future, Asset Management, which essentially consists of our stake in DWS, will also benefit from his proven leadership.\nKarl's responsibility for the regions Germany and Europe, Middle East and Africa (EMEA, ex UK & Ireland) will be transferred to Alexander von zur Mühlen. With offices in Frankfurt and Asia, he will ensure that the bank's businesses are positioned to serve our clients holistically, both in the home market as well as in other regions. In addition, he will intensify the dialogue especially with globally active major clients and other interest groups across the regions. In line with this, he will continue to represent Asia-Pacific on the Management Board and build on his successful work there.\nStefan Simon will take over responsibility for the Americas region as of the Annual General Meeting on May 17. The special structure of the US market requires not only focus on business as well as clients and investors. It also requires a significant degree of coordination and dialogue with the local regulatory authorities, who place high demands on us in terms of our risk management capabilities and especially in the space of Anti-Financial Crime & Compliance. This provides fundamental links and synergies to Stefan's role as Chief Administrative Officer (CAO) and his responsibility for global relationships with regulators as well as legal, governance, compliance and financial crime protection. Stefan will be tasked to establish a state-of-the-art risk and controls culture which is embedded in growing business lines.\nAs of June 1, the responsibilities of Rebecca Short on the Management Board will expand. Having delivered material improvements in how we govern and execute major change initiatives, Rebecca will now lead the next phase of the bank’s transformation as Chief Operating Officer. She will manage group-wide costs, deliver structural transformation and enable the bank to continue to meet its critical regulatory commitments. As the central connection between our business and infrastructure functions, Group COO will re-engineer internal processes for efficiency. To ensure we have an enabled and effective workforce to support the bank’s goals, her remit will include Human Resources and Global Real Estate, both under the continued leadership of Michael Ilgner.\nThis focus on costs and efficiency remains fundamental in view of the ongoing challenges created by inflation.\nThis brings me to the strategic adjustments we announced today, which include additional cost measures. New opportunities are opening up here, in particular through the use of innovative technologies such as artificial intelligence, but also through further optimisation of our organisational and sales structures. We intend to exploit these opportunities even more resolutely in the future, and therefore expect to be able to achieve 2.5 billion euros in operational efficiencies, instead of the previously planned 2 billion euros.\nWe still intend to reinvest a significant part of the savings in our business in order to lay the foundation for even stronger growth. The past quarters have shown that our clients want to do more business with us in all areas. We also need to take advantage of the market opportunities that have arisen in the first quarter. We want to make this possible through additional investments – on the one hand in technology, for example in the Corporate Bank, and on the other hand, in additional client advisors, for example in the International Private Bank and in the Origination & Advisory business of our Investment Bank. We have already announced the first targeted hirings in recent weeks. The potential is huge, and we are confident that we can increase our revenues by more than previously planned through 2025.\nHowever, it is also important that we grow profitably. Our investors expect our return on tangible equity (RoTE) to rise clearly above 10 percent in the medium term. That is also our aspiration – and we are, not least due to the successful first quarter, convinced that we have the potential to achieve it. However, this requires us to pay even closer attention to how we deploy our capital. In the future, therefore, the focus in all our business areas will be on activities that require less capital input and offer above-average returns. These include particularly those fields where we can create added value for our clients with our exceptional advisory capacities.\nOur aim is to release 15-20 billion euros in risk-weighted assets in this way over the next two years, which we can reinvest in capital-accretive businesses and distribute to our shareholders, which improves our returns.\nIn today’s Quarterly Check-In, James von Moltke and I will provide more details and answer your questions on our results, the strategic adjustments and personnel changes, but also on other topics that are on your minds. This time we will start at 2 p.m. CET, so that even more of you can participate worldwide, \nI’d like to close by saying thank you. Thanks to all of you for your tremendous commitment and dedication to Deutsche Bank. My special thanks to Christiana and Karl, for all they have done for our bank over the past years and decades, and for their great and enriching collaboration. And I would also like to thank Alex, Claudio, James, Rebecca and Stefan, and I am pleased that they are taking on even more responsibility for our bank.  \nWe are a strong bank, and we still have a full agenda of initiatives and measure to make us even stronger. We have set ourselves ambitious goals and want to be a European market leader by 2025. Together we can achieve this – that’s my firm belief. I look forward to our onward journey!\nBest wishes,\nChristian Sewing",
    "number_of_ratings": 41,
    "rating": 4.5,
    "likes": 22
}