{
    "url": "https://www.db.com/news/detail/20230427-deutsche-bank-reports-on-the-first-quarter-results-of-2023?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 27, 2023",
    "tags": [
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank reports € 1.9 billion profit before tax in the first quarter of 2023",
    "body": "Profit before tax up 12% year on year to € 1.9 billion, highest quarter since 2013\nNet profit up 8% to € 1.3 billion\nPost-tax return on average tangible shareholders’ equity (RoTE)¹ of 8.3% with post-tax return on average shareholders’ equity (RoE) of 7.4%\nCost/income ratio of 71%, down from 73% in prior year quarter\nNet revenues grow 5% to € 7.7 billion\nHighest quarter since 2016, despite business exits during transformation\nIn line with bank’s revenue growth objectives through 2025\nNet inflows of € 12 billion across the Private Bank and Asset Management\nNoninterest expenses up 1% year on year to € 5.5 billion\nAdjusted costs flat year on year at € 5.4 billion, with investments in business growth, technology and controls offset by lower bank levies\nAdditional efficiency measures underway in front office and infrastructure\nCapital, risk and liquidity metrics in line with objectives\nCommon Equity Tier 1 (CET1) capital ratio rose to 13.6%, from 13.4% in the previous quarter\nLeverage ratio of 4.6%, in line with previous and prior year quarter\nProvision for credit losses of € 372 million, 30 basis points (bps) of average loans; 2023 guidance range of 25-30 bps of average loans reaffirmed\nLiquidity coverage ratio rises to 143%, a surplus of € 63 billion\nNet Stable Funding Ratio rises to 120%, a surplus of € 100 billion\nInitiatives to accelerate Global Hausbank strategy announced\nOperational efficiency: incremental savings ambition raised from € 2.0 billion to € 2.5 billion through additional measures\nCapital efficiency: € 15-20 billion of RWA reductions in lower-yielding portfolios and from optimization, driving returns and shareholder distributions\nRevenue growth: targeted investments in technology, coverage footprint and advisory-focused businesses to tap additional revenue potential\nOur first quarter results demonstrate the relevance of our Global Hausbank strategy to our clients and underscore that we are well on track to meeting or exceeding our 2025 targets. We aim to accelerate execution of our strategy through a number of measures announced today: raising our ambitions for operational efficiency, boosting capital efficiency to drive returns and support shareholder distributions, and seizing opportunities to outperform on our revenue growth targets. Strong organic capital generation enables us to re-affirm our commitment to distributions and we are preparing to conduct further share buybacks later this year.\nChristian Sewing, Chief Executive Officer\nDeutsche Bank (XETRA: DBGn.DB / NYSE: DB) today announced profit before tax of € 1.9 billion for the first quarter of 2023, up 12% year on year. Post-tax profit was up 8% to € 1.3 billion.\nPost-tax return on average tangible shareholders’ equity (RoTE)1 was 8.3%, up from 8.1% in the prior year quarter. Post-tax return on average shareholders’ equity was 7.4% in the quarter, up from 7.2% in the first quarter of 2022. Diluted earnings per share were € 0.61, up from € 0.55 in the prior year quarter. The cost/income ratio improved to 71%, from 73% in the first quarter of 2022.\nDeutsche Bank’s results include annual bank levies of € 473 million, recognized in the first quarter. Assuming an equal distribution of the annual bank levy across the four quarters of 2023 and a three-month pro rata (three twelfths) share in the first quarter, profit before tax would have been € 2.2 billion and post-tax profit would have been € 1.6 billion in the quarter. Post-tax RoTE1 would have been 10.0% and the cost/income ratio would have been 67%, reflecting substantial progress towards the bank’s 2025 targets for post-tax RoTE1 of above 10% and a cost/income ratio below 62.5%.\n“In the first quarter, we again proved the strength and resilience of Deutsche Bank in challenging conditions,” said James von Moltke, Chief Financial Officer. “We have delivered well-balanced earnings and growth momentum across four complementary businesses, attracted inflows into investment products and demonstrated balance sheet strength. Our capital and liquidity ratios were stable or improved during the quarter, each significantly ahead of regulatory requirements, and we benefited from the resilience of our funding base, anchored by our strong and well-diversified deposit base.”\nThe bank’s businesses contributed as follows to the bank’s key target ratios:\nCorporate Bank: post-tax RoTE1 of 18.3% and cost/income ratio of 55%\nInvestment Bank: post-tax RoTE1 of 8.5% and cost/income ratio of 67%\nPrivate Bank: post-tax RoTE1 of 5.3% and cost/income ratio of 78%\nAsset Management: post-tax RoTE1 of 13.6% and cost/income ratio of 74%\nRevenue growth in challenging conditions\nNet revenues were € 7.7 billion, up 5% over the prior year quarter and the highest quarterly net revenues since 2016, despite business exits as part of the bank’s transformation programme and challenging conditions in financial markets during the quarter. This compares to the bank’s target for compound annual revenue growth of between 3.5% and 4.5% through 2025. In the businesses, net revenues were as follows:\nCorporate Bank net revenues were € 2.0 billion, up 35% year on year, the highest quarterly revenues since the launch of Deutsche Bank’s transformation programme, reflecting significant year-on-year growth across all regions and businesses. Growth was driven by year-on-year growth of 71% in net interest income and continued pricing discipline. Fee income rose 1% year on year. Revenues in Corporate Treasury Services grew by 32%, Institutional Client Services revenues rose 28% and Business Banking revenues were up 59%\nInvestment Bank net revenues were € 2.7 billion, down 19% from the very strong first quarter of 2022. Fixed Income & Currencies (FIC) revenues declined by 17%, partly reflecting a significant contribution from episodic items in the prior year quarter which did not recur. Rates revenues were higher than the strong prior year quarter, while Credit Trading revenues were lower, reflecting the non-recurrence of a concentrated distressed position in the prior year quarter, partly offset by growth in flow credit revenues. Financing revenues were lower, impacted by the non-recurrence of other episodic revenue events in the prior year. Foreign Exchange revenues were significantly lower, reflecting heightened interest rate volatility and market dislocation during March. Origination & Advisory revenues were down 31%, reflecting lower industry fee pools and lower issuance activity against the backdrop of continued macro-economic and geo-political uncertainties. Advisory revenues were lower, although by less than industry average (source: Dealogic) \nPrivate Bank net revenues were € 2.4 billion, up 10% year on year, driven by strong net interest income. Revenues in the Private Bank Germany were up 14% year on year, while the International Private Bank grew revenues by 3%. Net inflows were € 6 billion during the quarter, driven by inflows into investment products. Assets under management grew by € 13 billion to € 531 billion during the quarter, more than reversing the decline of the previous quarter, driven by net inflows into investment products and rising market levels\nAsset Management net revenues were € 589 million, down 14% compared to the prior year quarter. This primarily reflected an 8% decline in management fees to € 571 million, largely due to market-driven declines in assets under management during 2022. Performance and transaction fees declined 58% to € 11 million. Net inflows were € 6 billion, or € 9 billion ex-Cash, compared to net outflows of € 2 billion in the previous quarter. Assets under management grew by € 19 billion to € 841 billion at the end of the first quarter, reflecting positive net inflows and rising market levels\nNoninterest expenses essentially flat year on year\nNoninterest expenses were € 5.5 billion in the quarter, up 1% compared to the prior year quarter and including annual bank levies of € 473 million. Adjusted costs were € 5.4 billion, flat year on year, while adjusted costs ex-bank levies1 were up 5% to € 4.9 billion. This development reflects investments in business growth, technology and controls in line with the bank’s strategy.\nThe bank is currently implementing additional efficiency measures across the front office and infrastructure. These include strict limitations on hiring in non-client-facing areas, focused reductions in management layers, streamlining the mortgage platform and further downsizing of the technology centre in Russia. \nCredit provisions: year on year growth reflects macroeconomic developments\nProvision for credit losses was € 372 million in the quarter, up from € 292 million in the first quarter of 2022 and 30 basis points of average loans. The year-on-year development included a rise in provision for credit losses in the Private Bank to € 267 million, up from € 101 million in the prior year quarter, driven by a small number of idiosyncratic events in the International Private Bank, while the quality of the overall portfolio remained solid. Provision for non-performing (Stage 3) loans was € 397 million, up from € 114 million in the prior year quarter. These were partly offset by net releases of performing (Stage 1 and 2) loans of € 26 million, reflecting a modest improvement in the economic outlook since year end 2022 and lower levels of provisioning in the Corporate Bank.\nFor the full year 2023, provision for credit losses is expected to remain within the previously communicated range of 25-30 basis points of average loans.\nCapital and liquidity in line with goals and capital distribution plans reaffirmed\nThe Common Equity Tier 1 (CET1) capital ratio strengthened to 13.6% at quarter end, ahead of the bank’s ambition of around 13%, up from 13.4% in the previous quarter and the highest level for eight quarters. Strong organic capital generation through higher profitability more than offset the impact of deductions for common share dividends and equity compensation. Risk weighted assets were € 360 billion at the end of the quarter, unchanged from the previous quarter and down slightly from € 364 billion at the end of the prior year quarter.  \nThe Leverage ratio was 4.6% at the end of the first quarter, essentially unchanged from the end of the previous quarter. At 4.6%, the leverage ratio was also consistent with the prior year quarter which excluded certain central bank cash balances in accordance with EU regulation then in effect; including these balances, the leverage ratio at the end of the prior year quarter would have been 4.3%. Leverage exposure was € 1,238 billion at quarter end, essentially unchanged from the end of the previous quarter.\nThe Liquidity Coverage Ratio strengthened to 143% at the end of the quarter, from 142% at the end of the previous quarter, above the regulatory requirement of 100% and a surplus of € 63 billion. Liquidity reserves were € 241 billion, compared to € 256 billion at the end of the previous quarter, including High Quality Liquid Assets of € 208 billion. The Net Stable Funding Ratio was 120%, at the high end of the bank’s target range of 115-120%, with a surplus of € 100 billion above required levels.\nFor Deutsche Bank’s Annual General Meeting on 17 May, the Management Board and the Supervisory Board have formally proposed payment of a cash dividend of € 0.30 per share in respect of 2022, up 50% from 2021. This reflects the bank’s commitment to its capital distribution ambitions as set out in the Global Hausbank strategy announced in March 2022.\nDeutsche Bank remains fully committed to further capital distributions in 2023. Given the bank’s strong first quarter performance and further improved capital ratios, management has initiated a dialogue with supervisors to enable 2023 share repurchases and currently expects to commence buybacks in the second half of 2023.\nAccelerating the Global Hausbank strategy\nDeutsche Bank also announced additional measures aimed at accelerating execution of its Global Hausbank strategy. These include:\nOperational efficiency: targeting additional efficiency measures to raise the bank’s ambition for incremental cost savings from € 2.0 to € 2.5 billion. Specific measures include workforce reductions in non-client facing staff; further streamlining the mortgage platform; optimization of the retail distribution network; and improved operations by automating processes\nCapital efficiency: reducing € 15-20 billion in risk weighed assets by 2025 from lower-yielding portfolios and from optimization with minimal revenue impact, enabling redeployment and distributions to shareholders and thereby improving RoTE1. Specific measures include reducing mortgage originations and sub-hurdle lending; reducing balance sheet intensity through increased securitization; optimized hedging; and enhanced risk models and processes\nRevenue growth: aiming to outperform on previously communicated revenue targets through platform growth in capital-light businesses. Specific measures include investments in technology, selective hiring and additional growth initiatives in the Corporate Bank and Investment Bank; investments in digital and direct sales and accelerated hiring in Wealth Management in the Private Bank; and in Asset Management, the expansion of Passive and Alternatives together with strategic partnerships and product innovations\nSustainable Finance: further progress across businesses\nEnvironmental, Social and Governance (ESG)-related financing and investment volumes ex-DWS² were € 22 billion in the quarter, bringing the cumulative total since January 1, 2020 to € 238 billion. In the first quarter, Deutsche Bank’s businesses contributed as follows:\nCorporate Bank: € 3 billion in sustainable financing, raising the business’ cumulative total since January 1, 2020 to € 43 billion\nInvestment Bank: € 14 billion, comprising € 4 billion in sustainable financing and € 9 billion in capital market issuance, for a cumulative total of € 142 billion\nPrivate Bank: € 5 billion growth in ESG assets under management and € 1 billion in ESG new client lending, raising the Private Bank’s cumulative total to € 53 billion\nSustainability remains one of Deutsche Bank’s strategic priorities and the bank demonstrated this by hosting its second Sustainability Deep Dive on March 2, 2023. CEO Christian Sewing and the senior management provided an update on the business strategies as well as on its policies and commitments. This included a tightened thermal coal policy as well as the ambition to encourage corporate clients to commit to net zero. Further details on this event are available here.\nGroup results at a glance\n¹ For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ on pp 15-20 of the first quarter 2023 Financial Data Supplement and “Non-GAAP financial measures” on pp. 50-55 of the first quarter 2023 Earnings Report, respectively\n² Cumulative ESG volumes include sustainable financing (flow) and investments (stock) in the Corporate Bank, Investment Bank and Private Bank from January 1, 2020 to date, as set forth in Deutsche Bank’s Sustainability Deep Dive of May 20, 2021. Products in scope include capital market issuance (bookrunner share only), sustainable financing and period-end assets under management. Cumulative volumes and targets do not include ESG assets under management within DWS, which are reported separately by DWS.\nFurther details on first quarter performance in Deutsche Bank’s businesses are available in the First Quarter 2023 Earnings Report.\nAnalyst call\nAn analyst call to discuss first-quarter 2023 financial results will take place at 11:00 CEST today. An Earnings Report, Financial Data Supplement (FDS), presentation and audio webcast for the analyst conference call are available at: www.db.com/quarterly-results\nA fixed income investor call will take place on April 28, 2023, at 15:00 CEST. This conference call will be transmitted via internet: www.db.com/quarterly-results\nRead the \nPDF\nfull media release as PDF document.",
    "number_of_ratings": 18,
    "rating": 4.6,
    "likes": 27
}