{
    "url": "https://www.db.com/news/detail/20210113-deutsche-bank-indonesia-named-best-primary-dealer?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 13, 2021",
    "tags": [
        "Awards",
        "Capital markets",
        "Company"
    ],
    "title": "Deutsche Bank Indonesia Named Best Primary Dealer",
    "body": "Deutsche Bank (XETRA: DBKGn.DB / NYSE: DB) Indonesia was named Best Primary Dealer for local currency government bonds by the Ministry of Finance for the second year running, and the only foreign bank to be awarded the title.   \nThe award recognises the bank’s market-making expertise for government bonds traded in the local currency, Indonesian Rupiah.\nDeutsche Bank Chief Country Officer Siantoro Goeyardi said, “Winning this title for the second year running cements Deutsche Bank’s position as the leading foreign bank for market-making local currency government bonds. It underscores the strength of our Indonesia platform which is a critical part of our global emerging markets franchise.”\nFor over 50 years, Deutsche Bank has built strong local relationships with government, corporates and institutions in Indonesia, and actively supports the development of Indonesia’s capital markets.\nA stronger Rupiah and supportive rates are expected to draw emerging markets investors back to Indonesia this year. Deutsche Bank strategists believe Indonesia offers one of the better volatility-adjusted carry propositions in emerging markets.\nThe Indonesian Rupiah is forecast to strengthen at least through the first half of this year, along with other Asia currencies against an improving macro backdrop of vaccine roll-out, US fiscal stimulus and low rates.\nIndonesian foreign currency bonds are among the most traded Emerging Markets debt assets globally, and valuations are forecast to benefit this year as investor capital returns to the region in search of yield.\n“Indonesia remains one of the most attractive destinations for Emerging Markets investors allocating capital to Asia,” Goeyardi said.\nLast week the Ministry of Finance of the Republic of Indonesia raised USD 3 billion and EUR 1 billion with foreign investors in a 4-tranche sovereign issuance. The transaction effectively reopened South East Asia’s G3 bond market.\nThe latest Best Primary Dealer accolade from the Ministry of Finance reflects the bank’s market making expertise, and deep connectivity both onshore and offshore.\nHead of Indonesia Local Markets, Francis Soetopo said: “We are very proud to once again receive this accolade. It is testimony to the key role we continue to play in supporting the liquidity and depth of the local currency government bond market.”   ",
    "number_of_ratings": 2,
    "rating": 1.0,
    "likes": 32
}