{
    "url": "https://www.db.com/news/detail/20210112-deutsche-bank-esg-advisory-s-2021-outlook?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 12, 2021",
    "tags": [
        "Capital markets",
        "Sustainability"
    ],
    "title": "Deutsche Bank ESG Advisory’s 2021 Outlook",
    "body": "Deutsche Bank’s ESG Advisory team, part of the Investment Bank, explain five Capital Markets ESG trends that will affect investor behaviour in 2021.\n1. Which ESG investment strategies will prevail?\nRegulation and impact of pandemic accelerates investors’ understanding of ESG risk\nThe pandemic has made clearer to investors the financially material impact of non-financial risks. As such, there is an increased focus on managing the material financial risks stemming from ESG factors, particularly climate change. If anything, 2020 has taught us non-financial threats impacting the economy and society can be managed by concentrating capital to fund solutions, such as funding the development of vaccines in record time.\nAs such, we expect to see more investors commit to aligning their portfolios and capital with the goals of the Paris Agreement, putting three ESG investment strategies in the spotlight for 2021, including:\nESG integration, where investors assess companies on specific ESG risks that could impact their business value;\nESG engagement, where investors engage with companies to influence their response to ESG risks; and\nThematic investing, where investors seek companies which are capitalising on the shift to a low-carbon economy through ‘solutions’ oriented products, driven by the adoption of the EU taxonomy.\n2. Credibility in the race to a net carbon neutral world: what are investors looking for?\nInvestors are looking to direct capital towards companies that demonstrate credible transition strategies and the ability to deliver against commitments\nAs the world focuses on achieving net-carbon neutrality by the middle of the century companies face mounting pressure to align their business models to a decarbonisation pathway in line with the Paris Agreement. Investors expect corporate transition strategies to (a) be science based and externally verified (b) be executable and reliant on reduction of the company’s biggest emission source rather than offsetting and (c) demonstrate progress against commitments and track record of execution.\nThe International Capital Markets Association’s (ICMA) transition bond principles, the Climate Bond Initiative’s (CBI) white paper on financing credible transitions, and energy transition principles developed by oil & gas majors each align with these investor expectations. This provides market participants with much needed clarity on how the financing market can credibly support the transition to a net-carbon neutral world.\n3. Upswing of global regulation\nAs regulators globally move to keep up with the exponential growth of ESG in finance, companies will face fragmented disclosure obligations and differences in how investors use ESG data\n2020 saw countries like Japan, China, South Korea, Hong Kong, and UK all set net carbon neutrality objectives, in addition to Europe’s commitment. To help meet these objectives, governments are looking to the private sector to channel capital in alignment with their goals. Some (EU, Japan, Canada) have set up some form of national task forces to help regulate and incentivise ESG in the financial sector.\nWith Brexit, we expect the implementation of the UK’s green policy agenda to create differing rules in the UK, albeit with the same objective of net carbon neutrality by 2050. While the US is notably missing from this list, Joe Biden’s upcoming presidency is expected to impact the US ESG policy agenda, particularly through agencies such as the SEC, Federal Reserve and others, who will endeavour to establish rules around climate stress testing & disclosure.\nAs such, we expect to see ESG data become increasingly relevant in capital allocation, and corporates may face fragmented disclosure regulations as different countries adopt their own rules for material ESG disclosure. We also expect to see the beginnings of ESG integration in prudential regulation, although it will take time to progress and make its impact felt in capital allocation to the real economy.\n4. The search for consistency: will there be a single ESG reporting standard?\nImplementation of a single standard to drive capital allocation is challenging in the short-term, and will require buy-in from stakeholders and a double materiality approach\nGiven the growth of both ESG integration and thematic investing, there is a need for a reporting standard that has a dual approach, i.e. measures the impact of ESG risks on business performance and measures the impact of ESG initiatives on people and planet.\nReporting standards today are incredibly fragmented and inconsistent. Major private standard-setters include: the Global reporting Initiative (GRI), the Sustainability Accounting Standards Board (SASB), the Task Force on Climate-Related Financial Disclosures (TCFD), and the International Integrated Reporting Council (IIRC), to name a few. The merger of SASB and IIRC as well as collaboration efforts among other institutions is a positive development in the effort to simplify and develop consensus in the market.\nAny reporting standard that prevails will need the support of investors and the two existing giants, SASB and GRI. The IFRS, which is assessing demand for global sustainability standards and whether it might contribute to their development, may be able to fill this gap, but buy-in around consistency is still some time away.\n5. The Financing Market\nESG will further entrench itself into global investment-grade bond markets, driven by the growth of social and sustainability-linked bonds, and diversify to high-yield markets\nESG has morphed into a megatrend in the fixed income market, particularly within investment grade bonds. Its relevance has grown such that it has begun to impact regular capital flow to companies’ that investors perceive to carry greater ESG risk. Most notably, the financing market including green, social and sustainable bonds, that has grown more than 900 percent by volume of issuance (source: Bloomberg) over the last 5 years.\nThis unprecedented growth is expected to persist and will be driven by these three factors:\nDiversification of ESG financing to newer markets, particularly high yield debt;\nGrowth of sustainability-linked bonds, particularly in light of the ECB accepting these as collateral;\nIncrease in demand for social bonds that saw a 75 fold increase in 2020 due to the impact of the pandemic\nWe also expect to see ESG ratings increase in relevance to investors, and investors to firmly link their assessment of an issuer’s green bond to its corporate sustainability strategy.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 35
}