{
    "url": "https://www.db.com/news/detail/20210111-deutsche-bank-closes-financing-and-hedging-deal-for-largest-offshore-wind-manda-transaction-in-asia-pacific?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 11, 2021",
    "tags": [
        "Corporate products",
        "Sustainability"
    ],
    "title": "Deutsche Bank signs financing and hedging deal for largest offshore wind M&A transaction in Asia Pacific",
    "body": "Deutsche Bank has signed another landmark transaction in the Asia Pacific renewable energy sector, helping arrange the 2.68 billion US dollar acquisition financing for a 50 percent stake in the “Greater Changhua 1 Offshore Wind Farm” in Taiwan by Caisse de dépôt et placement du Québec (CDPQ) and Cathay PE. It is the largest offshore wind M&A transaction ever announced in Asia Pacific, and the second-largest offshore wind M&A transaction for an asset globally. Danish power company and leading global developer of offshore wind farms, Ørsted, will retain a 50 percent share ownership in the wind farm.  \nThis is the first time that Ørsted’s partnership model, previously used for European offshore wind financings, has been used for an offshore wind financing in Asia Pacific. The transaction comprises the acquisition, construction and operation of a 605 megawatt offshore wind farm in the Taiwan Strait, developed by Ørsted. Ørsted will manage full construction of the project as EPC contractor using Siemens Gamesa’s wind turbines, and provide long term operation and maintenance services.\nThe project is expected to complete in 2022 and will benefit from a 20-year fixed-price Power Purchase Agreement with state-owned Taiwan Power Company, supplying green power to over 650,000 Taiwanese households.\nDeutsche Bank acted as mandated lead arranger and sole hedge arranger for the financing of the transaction. The bank also acted as sole rates hedging coordinator for the transaction and exclusively arranged pre-financial close rates hedging for Ørsted. This is the third time we have been able to support our clients with innovative hedging solutions in the Taiwan offshore wind sector, with previous transactions winning numerous industry awards.\n“The transaction is testament to the team’s ability to deliver a multi-jurisdictional suite of products across Global Credit Trading, Global Emerging Markets, Asia and Structured Trade & Export Finance with the support of the coverage, product and sales teams in Europe and Asia. It is our third large-scale project financing transaction in Taiwan’s offshore wind sector, evidencing our strength in the region, the sector and in our ESG credentials in Asia Pacific,” said Cynthia Chan, Chief Executive Officer and Head of Corporate & Investment Bank, Taiwan.\nDeutsche Bank also supported Ørsted in opening Taiwan’s green bond market, when they issued the first ever Taiwan Green Bond by a foreign corporate in 2019.",
    "number_of_ratings": 1,
    "rating": 4.0,
    "likes": 16
}