{
    "url": "https://www.db.com/news/detail/20210107-deutsche-bank-and-singapore-fintech-stacs-announce-collaboration-for-digital-assets-proof-of-concept?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "January 7, 2021",
    "tags": [
        "Asia-Pacific",
        "Digital banking & services",
        "Digitalisation",
        "Private products"
    ],
    "title": "Deutsche Bank and Singapore fintech STACS announce collaboration for digital assets proof-of-concept",
    "body": "Deutsche Bank Securities Services and Hashstacs Pte Ltd (“STACS”) today announced their collaboration to jointly explore a proof-of-concept related to the technological and practical feasibility of digital assets interoperability, liquidity, cross-border connectivity, and smart contract templates, including the support of sustainability-themed digital bonds.\nSTACS, in collaboration with Deutsche Bank Securities Services, was awarded the Proof-of-Concept (“POC”) grant on 29 October 2020, which provides funding support for experimentation, development and dissemination of nascent innovative technologies in the financial services sector. The POC grant is part of the Financial Sector Technology and Innovation (\"FSTI”) scheme under the Financial Sector Development Fund administered by Monetary Authority of Singapore (“MAS”).\nSTACS is a leading Singapore-headquartered fintech development company providing transformative technology to the financial services sector. STACS is focused on capital markets use cases, such as the trade lifecycle management of bonds, Environmental, Social, and Governance (\"ESG\") fintech, structured products and exchange-traded derivatives (“ETDs”).\nJeslyn Tan, Global Head of Product Management, Securities Services at Deutsche Bank, said: “As the sponsor of the project, we are proud to partner with STACS on the MAS FSTI funding scheme. Investors will increasingly need to custodize their digital assets, ensure settlement finality, and have confidence in their safekeeping and security with the support of a bank’s institutional infrastructure. As a result, we see a clear place for an integrated platform that can service cross-border issuer-investor needs in Singapore and around the world.”\nBenjamin Soh, Managing Director at STACS, said: “We are thrilled to collaborate with Deutsche Bank on this transformative technological project, and further the expansion of our work in green fintech and ESG. We hope that our technology will be the infrastructure rails that empower global markets connectivity and sustainability. More broadly, we hope to support Singapore’s position as a world’s financial network and hub for innovation and technological transformation.”\n\nFor further information, please contact:\nDeutsche Bank AG Media Relations\nKarène Dufour\nPhone: +852 2203 7846 \nSTACS\nGrace Lim, Marketing Manager\nPhone: +65 8511 7770",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 9
}