{
    "url": "https://www.db.com/news/detail/20210105-deutsche-bank-facilitates-margin-trading-and-securities-borrowing-transaction-for-offshore-investor-under-the-new-qfii-rqfii-scheme?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "January 5, 2021",
    "tags": [
        "Capital markets",
        "Private products"
    ],
    "title": "Deutsche Bank facilitates margin trading and securities borrowing transaction",
    "body": "On December 29, Deutsche Bank (China) Co., Ltd. (“Deutsche Bank China”) successfully facilitated a margin trading and securities borrowing transaction under the new measures for the administration of domestic securities and futures investments by Qualified Foreign Institutional Investors and RMB Qualified Foreign Institutional Investors (“The new rules”). Following the announcement of the new rules by China Securities Regulatory Commission on November 1, 2020, China Securities Depository and Clearing Corporation Limited officially opened the application and registration channel for margin securities accounts on December 28, 2020.\nDeutsche Bank China supported a qualified foreign investor as its China onshore custodian bank with a full suite of custody services including account opening, asset custody, cash transfer and regulatory reporting, and helped in completing a smooth transaction on the first trading day of margin trading and securities borrowing under the new rules.\nTony Chao, Head of Securities Services Greater China and Head of Securities Services Sales in North Asia at Deutsche Bank, said: “The opening of margin trading and securities borrowing through the QFII/RQFII scheme expands the investment product scope and increases the diversification of investment strategies available to foreign investors. It also helps in improving fund efficiency, providing investors with greater flexibility to investment strategies and portfolio execution.”\n“It is our great pleasure to facilitate margin trading and securities borrowing for our client on the first trading day under the new rules. After recently receiving our China domestic fund custody license, this transaction is another testimony of our strong capabilities in securities services with a well-aligned offering for local and cross-border business.”\nStanley Song, Head of Deutsche Bank Securities Services China, added: “Against the backdrop of China’s continuous and steady market opening, foreign investors are increasingly looking for China market investments. As one of the leading global custodian banks, we will continue to leverage our global expertise and deep understanding of the local market to provide relevant and efficient services to our clients and help them to seize the rising opportunities in the China market.”\nCustodian services\nToday, Deutsche Bank offers custodian services in more than 70 major markets globally, including 12 markets with dedicated teams in the Asia Pacific region. Supported by a dedicated custody unit equipped with local expertise and global standards, Deutsche Bank China is a major foreign custodian bank for Qualified Foreign Institutional Investors (QFII), Renminbi Qualified Foreign Institutional Investors (RQFII), and Qualified Domestic Institutional Investors (QDII). Deutsche Bank has also received a domestic fund custody license recently, and is also one of the most active foreign settlement agents in the China Interbank Bond Market (CIBM).\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\n\nFor further information, please contact:\nDeutsche Bank AG\nMedia Relations\nKarène Dufour\nPhone: +852 2203 7846\nE-mail: karene.dufour@db.com \nThis press release has been approved and/or communicated by Deutsche Bank AG or by its subsidiaries and/or affiliates (“DB”). Deutsche Bank AG is authorized under German Banking Law (competent authority: BaFin - Federal Financial Supervisory Authority) and by the Prudential Regulation Authority and subject to limited regulation by the Financial Conduct Authority and Prudential Regulation Authority.\nDetails about the extent of our authorization and regulation by the Prudential Regulation Authority, and regulation by the Financial Conduct Authority are available from us on request. Securities and investment banking activities in the United States are performed by Deutsche Bank Securities Inc., member NYSE, NASD and SIPC, and its broker-dealer affiliates. Lending and other commercial banking activities in the United States are performed by Deutsche Bank AG, and its banking affiliates.\nCopyright © Deutsche Bank AG",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 5
}