{
    "url": "https://www.db.com/news/detail/20210105-deutsche-bank-prague-celebrates-its-30th-anniversary?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 5, 2021",
    "tags": [
        "Company",
        "History"
    ],
    "title": "Deutsche Bank Prague celebrates its 30th anniversary",
    "body": "From the first student demonstrations on November 17, 1989 that marked the beginning of the Velvet or Silent Revolution in Czechoslovakia, through to the fall of the Communist Regime, the conversion to a parliamentary republic, and up to today’s successful Czech Republic, Deutsche Bank has supported the country’s development, built up its presence in Prague and served its clients mainly in the Czech Republic but also in Slovakia.\nThirty years have passed since Deutsche Bank opened its Representative Office in Prague in 1990. This was followed in 1994 by a branch serving mainly corporate clients.\nDuring this time, and while the Czech Republic has turned itself around and caught up with Western Europe, Deutsche Bank has successfully grown its business there.\nEconomic growth in the Czech Republic has benefited from investments largely from German companies but also from other European and global companies. Many of these companies had a business relationship with Deutsche Bank in Germany or other countries and their subsidiaries continue to be Deutsche Bank Prague’s clients still today.\nDuring the same period, an increasing number of Czech companies or conglomerates of Czech origin have evolved into European players, outgrowing the Czech Republic and turning to neighbouring countries such as Poland and Slovakia, but also Germany and other Western European countries to invest in. In collaboration with the Investment Banking colleagues in London and Frankfurt, Deutsche Bank Prague has helped these companies grow, too.\nThe Czech Republic and Slovakia are likely to benefit from regionalisation trends accelerated by the Covid pandemic. The branch in Prague is looking forward to supporting Deutsche Bank’s corporate clients as they make new investments. Deutsche Bank Prague also offers cash management, trade finance and lending, foreign exchange and securities services to its clients\nDagmar Linder, Chief Country Officer Czech Republic and Branch Manager in Prague, says: “I am proud at how well the colleagues [at Deutsche Bank Prague] served our clients over the years as well as this year where clients did not notice that we mostly worked from home. The Covid virus unfortunately also prevented a larger celebration at the occasion of the originally planned concert of the Berliner Philharmoniker orchestra in Prague. But we connected with our clients through a virtual conference at the end of November to at least celebrate a bit.”\nAlso congratulating Deutsche Bank Prague on its 30th anniversary is Joerg Bongartz, CEO Northern and Eastern Europe: “Deutsche Bank is proud to have supported its clients and the economy in the Czech Republic for now 30 years. I also want to thank the colleagues of Deutsche Bank Prague for their excellent work over many years, their dedication and loyalty. Deutsche Bank Prague always ranks at the top of client satisfaction surveys. Well done!”\nDaniel Schmand, Corporate Bank Head EMEA (excl. Germany & UKI), added: Deutsche Bank Prague is a cornerstone of the strategy of the Corporate Bank for Central Europe. Our corporate clients want to be served by us not only at their headquarters but also want to use us for their subsidiaries. Thank you to the colleagues who served at Deutsche Bank Prague over the last 30 years!\nIvana Toufarová, Trade Finance & Lending – Trade Finance Operations Czech Republic\nIvana celebrates her 30th anniversary at Deutsche Bank same as DB Czech Republic, the pictures show the offices she has worked at:\nI joined DB on 1 Sept 1990 as „Auszubildende“ and have been with DB since its beginning in the Czech Republic with a short stop in DB Germany. During these 30 years I met a lot of good friends. After so many years I can say, that DB is my second family.\nPhoto competition organised by Deutsche Bank Prague Sports club during the corona crisis in Spring: home made masks.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}