{
    "url": "https://www.db.com/news/detail/20210224-deutsche-bank-and-mastercard-intensify-their-collaboration-in-the-payments-space?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "February 24, 2021",
    "tags": [
        "Corporate products",
        "Private products"
    ],
    "title": "Deutsche Bank and Mastercard intensify their collaboration in the payments space",
    "body": "Joint development of innovative digital payment solutions for companies\nPromising business segment: digital global payments clearing posts annual revenue growth of six percent, while number of transactions climbs 11 percent\nDeutsche Bank and Mastercard are expanding their partnership to jointly develop innovations in the area of digital payments for business clients, thereby enabling companies to offer their products and services to new customer demographics, to develop digital business models and to expand sales channels in Germany and beyond.\nThese include digital platforms where firms can offer their products directly to consumers, for which they require an efficient payment management system for mobile and digital payments as well as a seamless integration of payment flows into their financial and accounting systems.\n“The coronavirus pandemic has triggered exponential growth in corporates’ demand for digital payment solutions. Payments is the key interface between banks and their clients”, said Ole Matthiessen, Global Head of Cash Management at Deutsche Bank. “Worldwide only very few banks cover the entire spectrum of the payments area. This starts with card issuance and merchant acceptance and extends to cover payments clearing in the domestic and foreign markets as well as additional services such as currency hedging, cash flow forecasting or even fraud management services.”\n“We are combining our technological expertise with the offering and the global presence of Deutsche Bank. This is a great opportunity to create new solutions for the complex issues pertaining to payments”, says Peter Bakenecker, Divisional President Germany and Switzerland at  Mastercard. “We have been collaborating for many years already and want to deepen our joint endeavours. The timing is ideal given current market developments, the imminent pandemic-induced shifts in global payments and companies’ accelerated digital transformation.”\nPayments is a high growth segment \nWith the coronavirus pandemic acting as a catalyst, payments is currently one of the fastest growing businesses in the banking industry, with revenues projected to grow by six percent per year until 2023 (source: McKinsey) and the number of transactions forecast to rise by 11 percent per year over the same period (source: Capgemini).\nAs one of the world’s leading banks in euro payments clearing and one of the main clearers of US dollar payments outside the US, Deutsche Bank is already among the biggest payment clearers worldwide.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 7
}