{
    "url": "https://www.db.com/news/detail/20210223-deutsche-bank-and-sace-support-two-critical-infrastructure-projects-in-ghana?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Milan, Dubai, February 23, 2021",
    "tags": [
        "Africa",
        "Corporate products",
        "Digital banking & services",
        "Sustainability"
    ],
    "title": "Deutsche Bank and SACE support two critical infrastructure projects in Ghana",
    "body": "Deutsche Bank is proud to announce the closing of two lending facilities with the Republic of Ghana. The 150 million euro financing agreements, guaranteed by the Italian Export Credit Agency SACE, will fund the construction and equipment of two major infrastructure projects to be led by two Italian contractors relying on the expertise and technical excellence of over forty Italian SME suppliers.\nThe projects: the Keta Water Supply Rehabilitation and Expansion Project and the New Takoradi Market, are part of the Ghanaian government’s extensive infrastructure development programme designed to strengthen economic growth and create job opportunities, while assuring better living conditions for a rapidly growing population.\nSince 2011, Deutsche Bank has arranged over 2 billion euros of financing across 20 transactions to support critical infrastructure development in Ghana.\nWerner Schmidt, Global Head of Structured Trade Export Finance (STEF) at Deutsche Bank said: “Deutsche Bank has a longstanding presence in Africa and we are proud to be a leading export finance partner for Ghana. We remain committed to supporting infrastructure projects that have a positive impact on communities and which contribute to long-term economic growth.”\n“We are proud to be part of these two major projects, which, thanks to the expertise and supplies of many Italian SMEs, will have a positive impact on local communities,” said Dario Liguti, Chief Underwriting Officer of SACE. “Africa and Ghana in particular represent an important ground for these type of projects and we are very pleased to have once again contributed to the success of “Made in Italy” in a complex environment, in which the role of a risk mitigator and business facilitator that SACE can play is decisive”.\nDeutsche Bank and SACE have a well-established track record of working together to support major infrastructure projects across Ghana.\nIn 2018, the two organisations supported a 45.6 million euro contract for the construction of the University of Environment and Sustainable Development in Somanya, in the Eastern Region. The newly established university, commissioned in August 2020, is set to create 2,400 jobs in Ghana and will have a material impact on the national economy, supporting social development in a country that sources 20 percent of its GDP from the agricultural sector.\nIn 2019, Deutsche Bank and SACE also arranged the financing of another important infrastructure contract for the modernisation of four hospitals in the eastern region of the country for 45 million euros. \nTransaction Details:\nThe Keta Water Supply Rehabilitation and Expansion Project\nCommissioned by state-owned Ghana Water Company Limited, the aim of the project is to improve water and sanitation conditions in the Southern Volta Region, where the existing water supply system is often limited to pumping water from local boreholes and is unable to meet the increasing demand of a surging population.\nThe project will involve the rehabilitation of the existing Keta Water Treatment Plant in Agordome to restore production to its full capacity of 7,200 cubic meters per day. It will also fund the construction of a new water treatment facility in the city with a capacity of 35,000 cubic meters per day. Upon completion, both plants together with the transmission pipeline, a booster station and reservoirs, will collectively be able meet the current and future water requirements of over 400,000 residents in the communities of Keta, Anloga and the Tongu districts until 2030.\nConstruction work is being carried out by Lesico Infrastructures Srl, the Italian subsidiary of leading Israeli construction company Lesico Group, with 16 Italian SMEs involved in the project supply chain.\nBluebird Finance & Projects has been involved as a financial advisor of Lesico Group and AKA Ausfuhrkredit-Gesellschaft mbH has joined the transaction as a co-lender.\nThe New Takoradi Market Project\nBuilt in 1960 and significantly expanded in the 1970s, the Takoradi market covers an area of around one square km in one of Takoradi’s most densely populated and visited areas and is the largest commercial facility in the Western Region of Ghana. The market has had a significant impact on the development of the city, greatly enhancing the trade of goods and services.\nOver the years, the market has become congested and unsafe for increasing numbers of traders and visitors. As the population continues to grow, existing structures have fallen into ruin and security and sanitation facilities have become inadequate.\nThe redevelopment of the market will create a well-organised, modern and safe facility, able to attract more visitors and ease congestion in and around the area.\nThe new market will include over 2,400 stores, restaurants and food courts, bulk breaking areas, waste separation docks, administrative offices and public facilities, including a police station, a fire station, a post office and a medical clinic.\nThe construction has been assigned to Contracta Costruzioni Italia, the Italian subsidiary of the leading Brazilian construction group Contracta Engenharia, with 25 Italian SMEs involved in the project supply chain.\n  For further information, please contact:\nDeutsche Bank AG Media Relations\nValerio Mancino                                            Mohanad Nahas\nPhone: +39 0240243218                              Phone: +971(4) 3611-754\nMobile: +39 3356522130                              Mobile: +971 50 5445 836\nEmail: valerio.mancino@db.com                  Email: mohanad.nahas@db.com \nSACE\nSACE Media Relations                                 SACE Office in Ghana (Accra)\nPhone: +39 06 6736888                               Phone: +39 800269264\nEmail: ufficiostampa@sace.it                       Email: info@sacesimest.it \nAbout Deutsche Bank in Africa\nSince opening a representative office in Cairo in 1959, Deutsche Bank has strongly contributed to financing the development of infrastructure across the African continent. The bank uses its expertise in structuring and arranging financing to help countries access the traditional global capital markets and other alternative pools of liquidity.\nDeutsche Bank has well over 200 staff providing banking services to our clients on the African continent. We have teams situated in our branch in Johannesburg, South Africa and representative offices in Lagos, Nigeria and Cairo, Egypt. In addition there are a number of coverage bankers and product specialists based in our regional hub for the Middle East & Africa, Dubai and other global hubs including Frankfurt, London and Geneva (amongst others), that provide banking services to clients and individuals domiciled on the continent. \nLast year, for the second year in a row, Deutsche Bank has been named Best Foreign Investment Bank in Africa at the EMEA Finance Magazine’s African Banking Awards in its 2020 cycle. Furthermore, in recognition of its integral role in supporting the African economy, the jury also named Deutsche Bank the Best Foreign Investment Bank in Angola, Côte d’Ivoire, Gabon and Niger.\nAbout SACE\nSACE is the Italian financial insurance company specialized in supporting the growth and development of businesses and the national economy through a wide range of tools and solutions to improve competitiveness in Italy and worldwide. For over forty years, SACE has been the partner of reference for Italian companies exporting to and expanding in foreign markets. SACE also cooperates with the banking system, providing financial guarantees to facilitate companies’ access to credit; this role has been reinforced by the extraordinary measures introduced by the so-called Liquidity Decree. With a portfolio of insured transactions and guaranteed investments for 134 billion euros, SACE serves over 23 thousand companies, especially SMEs, supporting their growth in Italy and in around 200 foreign markets, with a diversified range of insurance and financial products and services.\nDisclaimers and disclosures\nDeutsche Bank AG, Dubai (DIFC) Branch is a branch of Deutsche Bank AG located and registered in the Dubai International Financial Centre (DIFC) in the Emirate of Dubai, United Arab Emirates, with registered no. 00062. Principal place of business in the DIFC: Dubai International Financial Centre, Gate Village, Building 5, PO Box 504902, Dubai, United Arab Emirates. Deutsche Bank AG, Dubai (DIFC) Branch is regulated by the Dubai Financial Services Authority (“DFSA”) and is authorized to provide Financial Services to Professional Clients only, as defined by the DFSA.\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement. Such factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission. Such factors are described in detail in our SEC Form 20-F of 20 March 2020 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 1,
    "rating": 3.0,
    "likes": 35
}