{
    "url": "https://www.db.com/news/detail/20210210-china-s-road-to-green-recovery?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 10, 2021",
    "tags": [
        "Capital markets",
        "Research"
    ],
    "title": "China’s road to green recovery",
    "body": "China’s rapidly evolving green finance system over the past few years was underpinned by coordinated macroeconomic policy, regulatory, institutional and technological developments. Deutsche Bank’s Macro Strategist for China, Linan Liu looks at the key aspects of China’s green finance system and what China could do to develop its green finance infrastructure to the point where it can support the country’s transition to a green economy.\nGreen Finance: The China approach\nThere are now over 130 green investment funds that collectively manage assets worth 69 billion renminbi. In addition, 22 local government-sponsored green industrial funds have been launched with assets worth over 46 billion renminbi.\nChina’s green bond issuance grew from 240 billion renminbi in 2016 to 386 billion in 2019, its green bond market the world’s largest by annual gross supply in 2019; there are 1.2 trillion renminbi outstanding green bonds currently in the market. The issuance of green asset-backed securities exploded by 350 percent to over 50 billion renminbi. Furthermore, green stocks have emerged as green enterprises tapped into China’s equity market for financing. Other new products such as green insurance, green trust, green PPP, and green leasing products have started to develop.\nThe next step\nSurging demand for green finance and rising appetite for ESG and green investments means the following aspects deserve greater policy attention in order to develop a more robust green finance system in China.\n1.     Strengthen monetary, fiscal and regulatory incentives for green investment -\n Create dedicated green medium to long term liquidity facilities for commercial banks to obtain direct liquidity support from the central bank, collateralised by eligible green loans and bonds. Second, relax capital requirement on green loans: Lowering the risk weighting will release capital which will allow commercial banks to deploy more resources to green lending.\n2.     Develop a comprehensive green finance structure to support China’s medium to long-term “dual circulation” growth strategy:\nIncentivise small and medium banks to join large banks in providing green credits, particularly to green private business and green small and medium enterprises.\nBetter align green investment interests with long-term investors such as domestic insurance companies and pension funds by promoting responsible investment and incorporating ESG investment into performance assessment of insurance companies.\nThird, a missing piece in China’s green finance market is the carbon emission trading market. It is likely China will launch such a new market before 2025. \n3.     Improve secondary market liquidity of green finance products.\nChina’s green finance market is largely for primary financing and most existing green products (loans and bonds) are not tradable in the secondary market, restricting the ability of effective risk pricing and risk management on green investment and limiting potential investment inflows. Potential solutions include securitization of green loans and favourable terms of repo eligibilities of green bonds. \n4.     Implement mandatory environmental ESG disclosure requirements for the financial services sector.\nThe EU has already moved ahead by enacting the Disclosure Regulation which required sustainability-related disclosures in the financial service sector as at the end of 2019 and is expected to apply the new regulation in April 2021. It is likely China will adopt international practice and apply similar mandatory ESG disclosure requirement in its financial services sector over the next five years. \n5.     Integrate China’s green finance into the global green finance market.\nChina is expected to gradually integrate its green finance market with the global market in taxonomy, financial and regulatory incentives, and green products specifications.\nThe above information does not constitute the provision of investment, legal or tax advice. Any views expressed reflect the current views of the author, which do not necessarily correspond to the opinions of Deutsche Bank AG or its affiliates. Opinions expressed may change without notice and may differ from views set out in other materials, including research, published by Deutsche Bank.\nDeutsche Bank may engage in securities transactions, on a proprietary basis or otherwise, in a manner inconsistent with the view taken in this research report.\nThe risk of loss in futures trading and options, foreign or domestic, can be substantial. As a result of the high degree of leverage obtainable in futures and options trading, losses may be incurred that are greater than the amount of funds initially deposited.\nThe above information is provided for informational purposes only and without any obligation, whether contractual or otherwise. No warranty or representation is made as to the correctness, completeness and accuracy of the information given or the assessments made.\nIn the U.S. this report is approved and/or distributed by Deutsche Bank Securities Inc., a member of FINRA. In Germany this information is approved and/or communicated by Deutsche Bank AG Frankfurt, licensed to carry on banking business and to provide financial services under the supervision of the European Central Bank (ECB) and the German Federal Financial Supervisory Authority (BaFin). In the United Kingdom this information is approved and/or communicated by Deutsche Bank AG, London Branch, a member of the London Stock Exchange, authorized by UK’s Prudential Regulation Authority (PRA) and subject to limited regulation by the UK’s Financial Conduct Authority (FCA) (under number 150018) and by the PRA. This information is distributed in Hong Kong by Deutsche Bank AG, Hong Kong Branch, in Korea by Deutsche Securities Korea Co. and in Singapore by Deutsche Bank AG, Singapore Branch. In Japan this information is approved and/or distributed by Deutsche Securities Limited, Tokyo Branch. In Australia, retail clients should obtain a copy of a Product Disclosure Statement (PDS) relating to any financial product referred to in this report and consider the PDS before making any decision about whether to acquire the product.\nThis report may not be reproduced, distributed or published by any person for any purpose without Deutsche Bank’s prior written consent. Please cite source when quoting.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 4
}