{
    "url": "https://www.db.com/news/detail/20210209-deutsche-bank-supports-uzbek-banks-global-loan-markets-debut?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 9, 2021",
    "tags": [
        "Capital markets"
    ],
    "title": "Deutsche Bank supports Uzbek banks’ global loan markets debut",
    "body": "Deutsche Bank has recently closed two transactions in Uzbekistan, acting as Initial Mandated Lead Arranger for Xalq Bank’s inaugural 102.5 million US dollar syndicated loan facility [JW1] and sole bilateral lender for Asaka Bank’s 90 million US dollar loan.\nBoth transactions were firsts for financial institutions (FI) headquartered in Uzbekistan. They were also firsts for Deutsche Bank and are testament to the efforts of country management and the Global Emerging Markets (GEM) business, part of the Investment Bank (IB), to deepen the bank’s already strong ties to FI clients in the country. \nRecent political and market friendly reforms have put Uzbekistan firmly on the radar of the international investor community, including a number of Deutsche Bank’s own institutional clients.\nThe bank’s GEM team have taken advantage of this trend by advising on multiple transactions as a result of these reforms and the general positive outlook for the region, despite obvious challenges posed by the ongoing COVID-19 pandemic.\nThe bank’s teams across businesses are confident of winning repeat mandates with sovereign, corporate and additional FI clients this year.\nClaire Coustar, Head of CEEMEA Client Coverage & EM Structuring for Global Emerging Markets at Deutsche Bank, said, “Deutsche Bank has a proud history of conducting business in Uzbekistan and the Central Asian region. Most recently, the bank has leveraged its global footprint and market-leading EM platform to provide bespoke solutions for clients that in many cases are accessing international capital markets for the first time.”    \n“Together with country management and our colleagues across businesses, we look forward to bringing the best of our bank’s international business solutions to support our Uzbekistan clients and those in the broader Central Asian region.”         \nDeutsche Bank has been active in Uzbekistan since 1993, providing export credit agency-backed financing, correspondent banking, trade finance and liquidity management solutions to local financial institutions, as well as closely working with the country’s central bank.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 7
}