{
    "url": "https://www.db.com/news/detail/20210205-deutsche-bank-soars-to-no-1-spot-as-arranger-of-sovereign-supranational-and-agency-debt?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 5, 2021",
    "tags": [
        "Capital markets"
    ],
    "title": "Deutsche Bank soars to No. 1 spot as arranger of sovereign, supranational and agency debt",
    "body": "Deutsche Bank has climbed to the top of the league table for Sovereign, Supranational and Agency (SSA) debt issuance in what has been the busiest month for the market ever. The bank has been mandated as lead arranger on 82 billion US dollars of debt issuance for SSA clients so far this year, underwriting 18.9 billion US dollars, up nearly fourfold year on year. It has climbed up from seventh position at the end of 2020 and from eleventh position year on year (source: Bond Radar).\nJanuary is historically a busy month for SSA issuers as they typically frontload their annual issuance. The market is particularly buoyant this year as issuers looks to raise capital to fund furlough schemes and other Covid rescue plans. Investor demand has been fuelled by excessive cash balances that need to be put to work, resulting in all deals being multiple times oversubscribed. The secondary performance has also been very robust due to the vast order books that have been placed.\nPanayiotis Stergiou, Head of Institutional Clients Group (ICG) FIC EMEA, Global Head of ICG Macro Sales and Head of the SSA Coverage Group, said: “Reaching the No. 1 spot after what has been the busiest month in the SSA market ever, and at a time where the financing of government support has never been more vital, is a true testament to the dedication, coordination and diligence of the work undertaken by the whole franchise. Whilst Deutsche Bank’s SSA business has gone from strength to strength, we have maintained a strong commitment to ESG and we are proud to have been a part of over 22.5 billion US dollars of ESG-specific SSA issuance in January.”\nDeutsche Bank has been a lead manager of many of the largest transactions so far this year, including a 14 billion euro dual tranche social bond from the EU. This was the fourth instalment of financial support to EU member states under the SURE (Support to mitigate Unemployment Risk in an Emergency) programme. The issue consisted of two social bonds: a 10 billion euro 7-year bond and a 4 billion euro tap, due in November 2050, making it the largest 30-year bond outstanding from a supranational. The proceeds from this and the other three issuances under the SURE programme will be disbursed to EU member states in the form of loans to help them cover the costs of short-time work schemes, protecting millions of people from unemployment .\nThe Republic of France issued a 7 billion euro 50-year offering, with Deutsche Bank as joint lead manager. The transaction attracted over 75 billion euros in demand from investors at final terms. This was the sovereign’s first 50-year benchmark since 2016. Another stand-out sovereign issuance was the 6.5 billion pound bond from the United Kingdom. Anchored by its core domestic investor base, the deal was highly successful and was 8.7 times oversubscribed, allowing the UK to price at the tighter end of the guidance.\nNeal Ganatra, Head of Debt Capital Markets (DCM) Syndicate SSA, said: “The start of the year has been a busy one, and one full of many noteworthy achievements for the team. We acted as both Billing and Delivery(B&D) and Duration Manager for the UK Debt Management Office, and maintained our involvement on the EU’s SURE programme. Whilst our month was full of many landmark transactions, we kept a keen eye on the more bespoke work, including leading the market’s longest ESTR linked bond for EIB, and the longest bond for a central European sovereign with Slovenia’s 60 year transaction.”\nNRW (federal state Nordrhein-Westfalen, Germany) issued a 2 billion euro 100-year bond, making it the third consecutive year the issuer was able to print a century bond in the first quarter of the year. Despite offering a yield of less than one percent, the strong investor demand allowed NRW to print its biggest 100-year bond ever.\nAchim Linsenmaier, Head of DCM Origination SSA, said: “SSA issuance volumes and demand from all types of investors have been remarkably high in January. It is even more noteworthy that Deutsche Bank has increased its market share in such a busy and highly competitive market. This is a great team effort across all areas of the bank involved, including the ICG, trading, DCM and Syndicate.”\nOther bonds Deutsche Bank has issued for SSA clients so far this year include a 4 billion US dollar 10-year global sustainable development bond for the Inter-American Development Bank, a 3.5 billion euro 10-year bond for the Hellenic Republic, and a 1 billion euro 7-year ESTR and a 1 billion pound 7-year SONIA for the EIB.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 11
}