{
    "url": "https://www.db.com/news/detail/20210202-deutsche-bank-named-bank-risk-manager-of-the-year?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 2, 2021",
    "tags": [
        "Awards",
        "Company"
    ],
    "title": "Deutsche Bank named ‘Bank Risk Manager of the Year’",
    "body": "Risk.net has named Deutsche Bank as its 'Bank Risk Manager of the Year', one of the publication’s most prestigious accolades, when announcing the winners of its 2021 awards. \nDeutsche Bank last won the Bank Risk Manager award in 2014. This year, Risk.net said that the bank had a powerful story to tell around its response to the pandemic, in tandem with ongoing transformation efforts and innovations that are clearly helping to enhance risk management capabilities and organisational resilience.\nRisk.net commented: “the bank entered 2020 with a conservatively positioned loan book and market risk-weighted assets near historic lows, allowing it to redeploy resources and capitalise efficiently on opportunities thrown up by the market turmoil wrought by the pandemic,” adding: “The bank has emerged from the Covid crisis with far lower expected credit losses costs than almost all of its peers.”\nThe publication also noted a key milestone in Deutsche Bank’s market risk management: “Arguably as important was a less visible change to the bank’s risk architecture: namely, its 2019 switch to the full revaluation historical simulation methodology for its market risk VAR calculations”.\n“This is an outstanding achievement,” said Stuart Lewis, Chief Risk Officer. “This award recognises our strength across risk disciplines, and reflects years of hard work by the CRO team to strengthen our risk frameworks.” He added: “It’s particularly gratifying to win this prestigious accolade after a year of unique challenges for us, our clients, and the wider economy. Congratulations to everyone in the CRO team!”\nRisk.net is the financial industry’s leading specialist publication, with a particular focus on risk management, derivatives and complex finance.\nRisk.net’s report on Deutsche Bank’s award for download",
    "number_of_ratings": 2,
    "rating": 1.5,
    "likes": 11
}