{
    "url": "https://www.db.com/news/detail/20230222-deutsche-bank-invests-in-australian-paytech-datamesh?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "February 22, 2023",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank invests in Australian paytech DataMesh",
    "body": "Deutsche Bank has acquired a strategic stake in Australian paytech DataMesh Group to accelerate the buildup and service offering of the bank’s merchant solutions business across Asia Pacific. Deutsche Bank and DataMesh did not disclose financial terms of the transaction.\nWith DataMesh’s Unify payment orchestration layer, Deutsche Bank can operate seamlessly with individual acquirers in different countries, enabling merchants to accept payments through online methods within individually regulated currency zones. DataMesh consolidates the payment data cross border and enables Deutsche Bank clients to centrally control their payments across these currency borders and different jurisdictions. The APAC region combines more than 10 currencies and more than 40 different payment methods.\nDataMesh is the perfect fit for Deutsche Bank’s Merchant Solutions APAC initiative. Its revolutionary payment orchestration layer enables us to offer a comprehensive payment solution for our clients, who demand a global one-stop shop for their payment acceptance in various countries and regions.\nOle Matthiessen, Global Head of Cash Management and Head of Corporate Bank APAC. \n“With its investment in DataMesh, Deutsche Bank underpins its ambitions in the region. In a first step, Deutsche Bank is launching the solution in India. Over the course of 2023, the bank will be able to offer online payment acceptance in five more markets (Australia, South Korea, Thailand, Indonesia and Vietnam) as part of its broader international rollout of the strategy” added Matthiessen.\nMark Nagy CEO of DataMesh said: “DataMesh assists banks to significantly enhance their merchant solutions capabilities. Given Deutsche Bank’s position as a true ‘Global Hausbank’, they are perfect partner to enable DataMesh’s international expansion plans. We are delighted to also welcome Deutsche Bank as a shareholder.”\nThe APAC region accounts for over half of global payments revenues and the strong growth is expected to continue in the coming years. The variety of local currencies and payment methods creates opportunities for payment solutions to capture untapped potential and underserved populations (The 2022 McKinsey Global Payments Report).\nFor further information please contact:\nDeutsche Bank AG                                     \nMedia Relations                                          \nHeinrich Froemsdorf\nemail: heinrich.froemsdorf@db.com\nMia Popplewell\nemail: mia.popplewell@db.com",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 6
}