{
    "url": "https://www.db.com/news/detail/20230216-deutsche-bank-named-in-stonewall-s-top-100-list?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 16, 2023",
    "tags": [
        "Awards",
        "Diversity"
    ],
    "title": "Deutsche Bank named in Stonewall’s Top 100 list",
    "body": "Today, Stonewall, Europe’s largest charity for lesbian, gay, bi, trans and queer rights, launched its Top 100 Employers List. Deutsche Bank has been recognised for its work on supporting LGBTQ+ staff to be themselves at work, with a silver award for the second year running and this year, was also ranked amongst the Stonewall Top 100 Employers 2023.\nDeutsche Bank has undertaken significant strides towards creating an inclusive working environment, including focusing on inter­sec­tio­na­li­ty as well as marginalised and / or under-represented LGBT+ groups, and continued support of the Trans and non-binary community through the partnership with Trans in the City. We also sponsored the 2022 Trans Ally awards with members of senior management attending the award ceremony to help increase awareness of trans issues. We recognise the importance of gender identity and last year, introduced a technical enhancement which provides staff the ability to add Pronouns in the internal Group Directory.\nOur dbPride Employee Resource Group exists to foster an environment that encourages our employees to bring their whole selves to work and aims to provide a supportive network and foster a positive working environment.\nStonewall’s Top 100 Employers List 2023 is the UK’s leading ranking of employers from public, private and third sectors on how inclusive their workplaces are. Creating inclusive environments makes the workplace safer and better for everyone – not just LGBTQ+ people.\nFabrizio Campelli, Head of the Corporate Bank and Investment Bank and Co-Executive Sponsor of dbPride commented: “This is a great recognition of our efforts across the bank and demonstrates our commitment to becoming a fully inclusive and accepting workplace where everyone is free and comfortable to bring their whole selves to work – with no exceptions.”\nRebecca Short, Chief Transformation Officer, member of the Management Board and Co-Executive Sponsor of dbPride commented, “It's really important to create a workplace where diverse views are encouraged and people can be themselves. This acknowledgment of our progress is a great achievement for the bank and our Employee Resource Group, dbPride.”\nTiina Lee, Chief Executive Officer, UKI commented: “A fantastic achievement which underlines all of the outstanding work dbPride do for the LGBTQ+ community and helping the UKI to build a more inclusive workforce.”",
    "number_of_ratings": 8,
    "rating": 3.9,
    "likes": 8
}