{
    "url": "https://www.db.com/news/detail/20230215-helping-children-with-cancer-in-india-continue-education?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "Mumbai, February 15, 2023",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Helping children with cancer in India continue education",
    "body": "Deutsche Bank inaugurated the renovated CanShala in Mumbai on February 15, International Childhood Cancer Day. CanShala, which is run by the bank’s NGO partner, CanKids KidsCan, provides formal education to children undergoing cancer treatment. This ensures they do not fall back on their education while undergoing treatment for their illness, and move to the next academic grade when they return home.\nSradha Mohapatra, a fourteen-year-old girl from Bhadrak, Odisha, is a beneficiary from the CanShala. She was in her ninth grade when she was detected with blood cancer. Her family's financial situation left them unsure how they would afford her treatment. Fortunately, they were referred to the Tata Memorial Hospital, where Sradha began her treatment, fully funded by Deutsche Bank.\nAs part of her treatment, Sradha was given the opportunity to enroll in CanShala, where she has found a supportive community and a safe space to learn and grow. She attends classes regularly and is currently in the first stage of her treatment. For Sradha, CanShala is not just a school, it's her home.\nI learn new topics and concepts every day. I understand that I am not alone, and there are other kids who are like me.\nSradha Mohapatra, CanShala\nOnce she completes her treatment, she will return to her regular school and move to the next academic grade.\nIn 2021, amidst the Covid pandemic, Deutsche Bank began backing CanShala as part of its CSR Born to Be initiative. The bank took on the task of renovating the school to enhance the learning environment, enabling in-person classes to be conducted. CanShala will also offer extra-curricular activities such as music, yoga, computers, sports, and arts & crafts to promote a comprehensive development programme.\nOver the past eight years, Deutsche Bank has been working to provide timely cancer treatment and holistic post-treatment care to children with cancer belonging to marginalised communities. Through this collaboration and the partnership with Tata Memorial Hospital, the bank has assisted more than 25,000 children who are affected by cancer. In addition, the bank's employees in India are eager volunteers who contribute by celebrating birthdays and festivals with the children, providing basic education in math and language, and shaving their heads to increase awareness and funding for childhood cancer.",
    "number_of_ratings": 4,
    "rating": 4.0,
    "likes": 6
}