{
    "url": "https://www.db.com/news/detail/20230202-a-message-from-christian-sewing-on-our-full-year-results-2022?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 2, 2023",
    "tags": [
        "Financial Results",
        "Strategy"
    ],
    "title": "A message from Christian Sewing on our full-year results 2022",
    "body": "Dear Colleagues,\n\n1,305 days ago, on July 8, 2019, we presented a new strategy for our bank. We called this strategy \"Compete to Win\" to make it clear what we were about: making Deutsche Bank more competitive again after many difficult years. To get there, we embarked on an ambitious transformation that has demanded a lot from all of us in recent years.\n\nToday, we are taking stock of this transformation and the results could hardly be more encouraging: we have achieved the key goals we set ourselves three and a half years ago. Our bank is now more profitable, more efficient, better diversified, more robust and less risky than it was then – and therefore in a strong position to not only survive in global competition but to be on the offensive.\n\nLast year's results, which we published this morning, are impressive proof of this strength; we ended 2022 with a pre-tax profit of 5.6 billion euros. This is an increase of 65 percent over the previous year and the highest result in 15 years. Our post-tax return on tangible equity rose to 9.4 percent. This is higher than our target of 8 percent which is partly due to a one-off effect from the revaluation of our US deferred tax assets, reflecting the improved profitability of our US franchise.\n\nFirst of all, however, we owe the significantly better annual result to our operational progress. We increased revenues by 7 percent to 27.2 billion euros on the back of increased client business. At the same time, we have further reduced costs by 5 percent to 20.4 billion euros. The cost-income ratio, which is our key efficiency indicator, fell from 85 to 75 percent for the full year.\n\nThese are very good figures, and even more impressive when we consider the conditions under which we have achieved them. 2022 was marked by a terrible war in Ukraine, severe market turbulence, concerns about an energy shortage in Europe and inflation the likes of which we have not seen for decades.\n\nIn this uncertain environment, we underlined what distinguishes our bank in particular. Thanks to the high quality of our loan book and our first-class risk management, we were able to keep loan loss provisions well contained, as expected. And even as we have supported our clients with credit and liquidity in these times, we have maintained a strong balance sheet, keeping our CET1 ratio almost continuously above 13 percent throughout our transformation.\n\nAbove all, our business model, which is based on four strong pillars, has proven itself in this difficult time exactly in the way we intended when we embarked on the reorganisation of our divisions in 2019. While in recent years, when the markets were doing well and interest rates were low, our Investment Bank and Asset Management divisions had excelled with high growth rates, in 2022 the Corporate Bank and the Private Bank were the most important growth drivers with revenue increases of 23 and 11 percent respectively. Both divisions also achieved record profits.\n\nHowever, this should not diminish the performance of the Investment Bank and Asset Management. The Investment Bank's continued success in Fixed Income and Currencies more than compensated for the standstill in Origination & Advisory last year, and revenues increased by 4 percent. In Asset Management, revenues fell by 4 percent. In view of the simultaneous slump of almost all major markets, however, this performance is still remarkable.\n\n2022 was not only a successful year for our Core Bank. I would also like to highlight the performance of our Capital Release Unit. Its team has again made outstanding progress in reducing risks and costs and has made a crucial contribution to our transformation over the past three and a half years. The unit has now essentially achieved its mandate. While it continues to unwind its remaining positions under Richard Stewart's leadership we will now cease separate reporting on the unit.\n\nI don't want to go any deeper into our results here. There is ample opportunity for that elsewhere today. We will explain the annual figures and our track record since 2019 in detail at 09:30 CET at our Annual Media Conference, where we will also answer journalists' questions. You can follow the event via internet.\n\nIn addition, I hope that many of you will join us today at 16:00 CET for the premiere of our Quarterly Check-In, when James von Moltke and I will explain the most important results and key figures. We will also discuss other important trends and topics in our bank and our environment and take a look at what lies ahead. And of course, we look forward to hearing your questions.\n\nOur next major goal remains unchanged: with our Global Hausbank strategy, which we presented in March last year, we continue to be on the right track to achieve a post-tax return on tangible equity above 10 percent by 2025. In 2023, we want to take the next step in this direction and further increase our pre-tax profit; we expect our revenues to increase again, and our credit loss provisions to remain stable in light of an improving economic outlook. And our aspiration is to keep expenses flat on 2022, even if that requires us to become even more ambitious on costs in an inflationary environment.\n\nOverall, we have to assume that times will remain turbulent and challenging. And we know that we still have to improve in some areas, including in our controls. But with our outstanding team, I have no doubt that we will master the challenges again this year. You have all achieved great things in the past three and a half years, and with your expertise, discipline and commitment, you have also left your mark in 2022. The Management Board and the Group Management Committee are hugely grateful to you. We are proud of what we have created together. And you should be, too.\n\nBest wishes,\n\nChristian Sewing",
    "number_of_ratings": 9,
    "rating": 4.6,
    "likes": 11
}