{
    "url": "https://www.db.com/news/detail/20230202-full-year-results-2022?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "February 2, 2023",
    "tags": [
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank reports 2022 profit before tax of € 5.6 billion",
    "body": "Profit before tax rises 65% to € 5.6 billion, the highest for 15 years\nNet revenues grow 7% year on year to € 27.2 billion\nNoninterest expenses reduced by 5% to € 20.4 billion\nCost/income ratio of 75%, down from 85% in 2021\nAdjusted costs ex-transformation charges and bank levies¹ of € 19.0 billion, flat to 2021, down 3% year on year if adjusted for FX movements\nProvision for credit losses of € 1.2 billion, 25 basis points of average loans\nNet profit more than doubles year on year to € 5.7 billion, also highest since 2007\n€ 1.4 billion tax benefit from a deferred tax asset valuation adjustment driven by strong US performance\nProposed dividend of € 0.30 per share, up 50% over 2021\nDelivery on key financial targets for 2022\nPost-tax return on average tangible shareholders’ equity (RoTE)¹ of 9.4% with post-tax return on average shareholders’ equity (RoE)¹ of 8.4%\nCore Bank post-tax RoTE¹ of 11.3% with RoE¹ of 10.0%\nCommon Equity Tier 1 (CET1) capital ratio of 13.4%\nLeverage ratio of 4.6%\nCore Bank profit before tax rises 37% year on year to € 6.5 billion\nNet revenues rise 7% to € 27.2 billion\nNoninterest expenses down 3% to € 19.5 billion\nCapital Release Unit delivers continued de-risking and cost reduction during 2022\nLeverage exposure reduced by 43% year on year to € 22 billion\nNoninterest expenses down 36% to € 922 million\nFourth-quarter 2022 profit before tax rises more than ninefold to € 775 million, up from € 82 million in the prior year quarter\nNet profit of € 2.0 billion including tax benefit in the US\nPost-tax RoTE¹ of 13.1% with post-tax RoE¹ of 11.7%\nNet revenues of € 6.3 billion, up 7% year on year\nNoninterest expenses of € 5.2 billion, down 7% year on year\nAdjusted costs ex-transformation charges and bank levies¹ down 2% to € 4.8 billion, down 4% if adjusted for FX movements\n“Over the past three and a half years we have successfully transformed Deutsche Bank,” said Christian Sewing, Chief Executive Officer. “By refocusing our business around core strengths we have become significantly more profitable, better balanced and more cost-efficient. In 2022, we demonstrated this by delivering our best results for fifteen years. Thanks to disciplined execution of our strategy, we have been able to support our clients through highly challenging conditions, proving our resilience with strong risk discipline and sound capital management. As a result, we are well-equipped to deliver sustainable growth and returns to shareholders in the years ahead.”\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) today announced its highest annual profit, both before and after tax, since 2007.\nProfit before tax was € 5.6 billion in 2022, up 65% over 2021. This reflected 7% growth in net revenues with a 5% year-on-year reduction in noninterest expenses, resulting in a cost/income ratio of 75%, down from 85% in 2021.\nNet profit was € 5.7 billion in 2022, more than double the prior year. This includes a positive year-end deferred tax asset valuation adjustment of € 1.4 billion, compared to € 274 million in the prior year, which reflected continued strong performance in the bank’s US operations. Excluding the impact of this adjustment, the effective tax rate would have been 24% for 2022.\nPost-tax return on average tangible shareholders’ equity (RoTE)¹ was 9.4%, up from 3.8% in 2021. Post-tax RoE¹ was 8.4%, up from 3.4% in the prior year. Diluted earnings per share were € 2.37, up from € 0.93 in 2021, and management intends to recommend a dividend of € 0.30 per share for 2022, up from € 0.20 per share for 2021, to the 2023 Annual General Meeting.\nIn the fourth quarter of 2022, profit before tax was € 775 million, up more than ninefold from € 82 million in the fourth quarter of 2021, reflecting 7% year-on-year growth in net revenues with a 7% year-on-year reduction in noninterest expenses. The quarter was positively impacted by a gain of approximately € 310 million on the sale of Deutsche Bank Financial Advisors in Italy. Net profit was € 2.0 billion, up from € 315 million in the fourth quarter of 2021, and reflects the aforementioned positive tax impact. Excluding this benefit, the effective tax rate would have been 29% for the quarter. Fourth-quarter post-tax RoTE¹ was 13.1%, up from 1.1% in the prior year quarter, and post-tax RoE¹ was 11.7%.\nHaving fulfilled its de-risking and cost reduction mandate from 2019 through end-2022, the Capital Release Unit will cease to be reported as a separate segment with effect from the first quarter of 2023. Its remaining portfolio, resources and employees will be reported within the Corporate & Other (C&O) segment.\n“Our 2022 results demonstrate the benefits of Deutsche Bank’s transformation efforts”, said James von Moltke, Chief Financial Officer. “We have delivered revenue growth in our core businesses and continued cost reductions. Our risk provisions are in line with guidance despite challenging conditions during the year. Focused de-risking of our balance sheet has contributed to our solid capital ratio and the completion of the Capital Release Unit journey marks a major milestone in our transformation execution. All of this demonstrates good momentum on the path towards our 2025 objectives.”\nCore Bank: profit before tax rises 37% to € 6.5 billion\nIn the Core Bank, which excludes the Capital Release Unit, profit before tax was € 6.5 billion, up 37% year on year and the highest since the Core Bank’s formation in 2019. Profit growth was driven by 7% growth in net revenues to € 27.2 billion and a reduction in noninterest expenses of 3%, or 5% if adjusted for FX movements, despite an increase in bank levies of approximately € 200 million compared with 2021. Post-tax RoTE¹ was 11.3% in 2022, up from 6.4% in 2021, in line with a target of above 9%. The Core Bank’s cost/income ratio improved to 71%, from 79% in 2021.\nGrowth and diversification of Core Bank earnings\nThe contribution of core businesses to Core Bank profit before tax was as follows:\nCorporate Bank: € 2.1 billion, more than double the 2021 level of € 1.0 billion, with post-tax RoTE¹ of 12.5% and a cost/income ratio of 62%\nInvestment Bank: € 3.5 billion, down 6%, with post-tax RoTE¹ of 9.2% and a cost/income ratio of 62%\nPrivate Bank: € 2.0 billion, up by more than fivefold from € 355 million in 2021, with post-tax RoTE¹ of 10.6% and a cost/income ratio of 72%\nAsset Management: € 598 million, down 27% year on year, with post-tax RoTE¹ of 17.1% and a cost/income ratio of 70%\nIn the fourth quarter, Core Bank profit before tax was € 971 million, more than double the level of the fourth quarter of 2021. This development reflects a 7% rise in net revenues and a 4% reduction in noninterest expenses. The Core Bank’s post-tax RoTE¹ rose to 14.9%, from 3.4% in the prior year quarter, while the cost/income ratio was 79%, down from 88% in the prior year quarter.\nCapital Release Unit: capital accretion through de-risking and cost reduction\nThe Capital Release Unit delivered further de-risking and cost reduction in 2022. By year-end, leverage exposure was reduced to € 22 billion, down 43% from the end of 2021 and down 91% since the creation of the Capital Release Unit in mid-2019. Risk Weighted Assets (RWA) were € 24 billion, down by 13% year on year and by 63% since the Capital Release Unit’s creation, or down 83% excluding Operational Risk RWA. As at year-end 2022, RWA of € 24 billion included € 19 billion of Operational Risk RWA.\nThe Capital Release Unit’s loss before tax was € 932 million, a reduction of 32% from a loss of before tax € 1.4 billion in 2021. This improvement was predominantly driven by a 36% year-on-year reduction in noninterest expenses to € 922 million. Adjusted costs ex-transformation charges¹ were € 781 million, in line with guidance of approximately € 800 million, for 2022. The Capital Release Unit’s full-year adjusted costs have been reduced by 77%, or approximately € 2.5 billion, from pre-transformation (2018) levels.\nIn the fourth quarter, the Capital Release Unit reported a loss before tax of € 197 million, down 44% from the prior year quarter. This improvement was largely driven by a 49% year-on-year reduction in noninterest expenses.\nThe net positive impact of the Capital Release Unit on Deutsche Bank’s CET1 ratio was approximately 45 basis points from the beginning of 2019 to year-end 2022, as the cumulative benefit of RWA reduction exceeded the negative impact of the Capital Release Unit’s losses over this period. The net positive impact of leverage exposure reduction by the Capital Release Unit over the same period also contributed approximately 55 basis points to Deutsche Bank’s leverage ratio.\nNet revenues: significant progress in ‘stable revenue’ businesses in 2022\nNet revenues were € 27.2 billion in 2022, up 7% year on year, and € 6.3 billion, up 7%, in the fourth quarter. In both the full year and fourth quarter of 2022, revenues were the highest since 2016, despite business perimeter reductions as part of the bank’s transformation launched in 2019. Revenue development in the core businesses was as follows:\nCorporate Bank net revenues were € 6.3 billion in 2022, up 23% year on year, with 39% growth in net interest income and 7% growth in commission and fee income, driven by higher interest rates, strong operating performance, business growth and favorable FX movements. All business areas contributed to revenue growth, with Corporate Treasury Services up 24%, Institutional Client Services up 22% and Business Banking up 19%. Deposits grew by 7%, or € 18 billion, during the year while average loans gross of allowances were up 7%, or € 9 billion, in 2022. In the fourth quarter, net revenues were € 1.8 billion, the highest for any quarter since the creation of the Corporate Bank in 2019, and up 30% over the fourth quarter of 2021, with Corporate Treasury Services up 26%, Institutional Client Services up 28% and Business Banking up 51%.\nInvestment Bank net revenues were € 10.0 billion in 2022, up 4% over 2021. Revenues in Fixed Income & Currencies (FIC) were € 8.9 billion, up 26% year on year and the highest for a decade. Revenues in Rates, Emerging Markets and Foreign Exchange were significantly higher due to heightened market activity, growth in client flows and disciplined risk management, while Financing revenues were higher, primarily driven by increased net interest income. This growth more than offset lower Credit Trading revenues which partly reflected the non-recurrence of a concentrated distressed position in 2021. Origination & Advisory Revenues were € 1.0 billion euros, down 62% year on year, reflecting lower industry fee pools and mark to market losses in Leveraged Debt Capital Markets, while Advisory revenues were essentially flat, outperforming a lower industry fee pool. Deutsche Bank returned to the no 1 ranking in German M&A (source: Dealogic). In the fourth quarter, net revenues were € 1.7 billion, down 12% year on year. FIC revenues grew 27% to € 1.5 billion, the highest fourth quarter for more than ten years. This was more than offset by a 71% year-on-year decline in Origination & Advisory revenues.\nPrivate Bank net revenues were € 9.2 billion, up 11% year on year. Revenues were up 6% if adjusted for specific items, predominantly the aforementioned gain on sale in Italy, and the reduced impact of forgone revenues relating to the German Federal Court of Justice (BGH) ruling on pricing agreements in April 2021. Growth was driven by higher interest rates, FX movements and higher business volumes. New business volumes were € 41 billion in 2022 and comprised net inflows into assets under management, including deposits and investment products, of € 30 billion, and net new client loans of € 11 billion. Net revenues in the Private Bank Germany were € 5.3 billion, up 6% year on year, and by 4% if adjusted for the impact of the BGH ruling. Net revenues in the International Private Bank were € 3.8 billion, up 19% year on year, and up 9% if adjusted for the gain on sale in Italy and other specific items which consisted of Sal. Oppenheim workout activities. In the fourth quarter, Private Bank net revenues were € 2.5 billion, up 23% over the fourth quarter of 2021, and up 10% if adjusted for specific items and the BGH ruling impact, while net inflows into assets under management were € 5 billion. Revenues in the Private Bank Germany were € 1.4 billion, up 7%, while revenues in the International Private Bank were € 1.2 billion, up 49% year on year, and up 10% if adjusted for the gain on sale in Italy and other specific items.\nAsset Management net revenues were € 2.6 billion, down 4% year on year. Management fees rose 4%, reflecting higher fees in Alternatives which were partly offset by negative market impacts on revenues from Active and Passive products. Growth in management fees and a positive impact from FX movements were more than offset by a significant year-on-year decline in performance fees, partly reflecting the non-recurrence of a large performance fee on a Multi-Asset fund recorded in the fourth quarter of 2021. Assets under management were € 821 billion at year-end 2022, down 11% from the end of the prior year, predominantly driven by market depreciation; net outflows of € 20 billion were more than offset by a positive FX impact of € 22 billion during the year. In the fourth quarter, net revenues were € 609 million, down 23% year on year, largely driven by significantly lower performance fees, reflecting the aforementioned non-recurrence of a large performance fee. Fourth-quarter assets under management declined by € 12 billion, including net outflows of € 2 billion.\nContinued reductions in noninterest expenses\nNoninterest expenses were € 20.4 billion, down 5% year on year. This partly reflected a significant decline in transformation charges as Deutsche Bank completed the transformation initiatives announced in 2019. This more than offset a year-on-year rise in bank levies of 38%, or approximately € 200 million. Adjusted costs ex-transformation charges and bank levies¹ were € 19.0 billion, essentially flat compared to the prior year, and down 3% if adjusted for FX movements. A 3% rise in compensation and benefits expenses was offset by lower non-compensation expenses, including lower IT and professional services expenses, reflecting the bank’s continued cost reduction efforts, with reductions in costs from outsourced operations and occupancy-related expenditure.\nWithin the transformation period, adjusted costs ex-transformation charges and bank levies¹ have been reduced by more than € 3 billion compared to € 22.1 billion in 2018. This reflected a reduction of around € 1.0 billion in compensation and benefits due to changes in workforce size and composition; a reduction of around € 0.5 billion in IT spending, despite cumulative expenditure of around € 15 billion during transformation; a reduction of approximately € 0.5 billion in professional services costs; and a reduction of more than € 1.0 billion in other items including building costs, operational tax and insurance expenses, and travel and marketing expenses.\nIn the fourth quarter, noninterest expenses were € 5.2 billion, down 7% from the fourth quarter of 2021. Noninterest expenses in the quarter included an impairment of intangibles of € 68 million relating to a historic acquisition in Asset Management. Noninterest expenses also reflect settlements and other developments in certain litigation and regulatory enforcement matters, including ongoing regulatory discussions to resolve matters concerning adherence to prior orders and settlements related to sanctions and embargoes and AML compliance, and remedial agreements and obligations related to risk management issues. Adjusted costs ex-transformation charges and bank levies¹ were € 4.8 billion, down 2%, and down 4% if adjusted for FX movements. Compensation and benefits expenses were essentially stable year on year, although lower if adjusted for FX movements, while IT expenses, professional services and other expenses were all lower compared to the prior year quarter.\nThe workforce was 84,930 full-time equivalents (FTEs) at the end of 2022, up by 374 FTEs during the fourth quarter. This increase predominantly reflects continued internalization of external staff which added 455 FTEs in the quarter.\nCredit provisions remain contained in a more challenging credit environment\nProvision for credit losses was € 1.2 billion in 2022, up from € 515 million in 2021. The year-on-year development reflected more challenging macro-economic conditions during most of 2022 against the backdrop of the war in Ukraine, while 2021 benefited from economic recovery following the easing of COVID-19 restrictions. Provisions were 25 basis points of average loans, in line with guidance provided in March 2022. Provision for non-performing loans (Stage 3) was € 1.0 billion, spread across regions and segments. Provision for performing loans (Stage 1 and 2) was € 204 million and was driven by deteriorating macro-economic forecasts through most of the year.\nIn the fourth quarter, provision for credit losses was € 351 million, up from € 254 million in the prior year quarter, comprising Stage 3 provisions of € 390 million and a net release of Stage 1 and 2 provisions of € 39 million. Provisions in the quarter benefited from the release of an overlay from previous periods and stabilizing macro-economic forecasts towards the end of the quarter. The year-on-year increase was driven by certain individual situations and did not reflect broader trends across the portfolio.\nSustained, significant reduction in Russia Exposure during 2022\nDeutsche Bank significantly reduced its Russian credit exposure during 2022. Gross loan exposure was reduced by 42% to € 806 million while net loan exposure was cut by 36% to € 379 million. Additional contingent risk was reduced by 90% to € 154 million. This comprised undrawn commitments of € 78 million, down from € 1.0 billion at the end of 2021 and largely mitigated by contractual drawdown protection and parental guarantees for multinational corporates, and guarantees of € 76 million, down 86% during 2022 after significant roll-offs during the year. Deutsche Bank remains committed to further exposure reductions.\nCapital, leverage and liquidity: in line with goals\nThe CET1 ratio was 13.4% at the end of the fourth quarter of 2022, up from 13.3% at the end of the third quarter. This development reflected the positive capital impact of fourth-quarter earnings, largely offset by regulatory deductions for deferred tax assets, dividends and Additional Tier 1 (AT1) coupons. A small positive impact from FX movements was more than offset by the impact of RWA changes, primarily higher market risk RWA. The CET1 ratio has remained above the bank’s target minimum of 12.5% since the launch of transformation in the second quarter of 2019.\nThe Leverage ratio was 4.6% in the fourth quarter, in line with the bank’s target, and up from 4.3% in the third quarter. The quarter-on-quarter development reflected the positive impacts of FX movements, lower leverage exposure driven by seasonally lower trading activity, and the rise in Tier 1 capital driven by fourth-quarter earnings and an AT1 capital issuance in November, partly offset by the aforementioned regulatory deductions.\nLiquidity reserves were € 256 billion at the end of the fourth quarter, down slightly from € 262 billion at the end of the third quarter, including High Quality Liquid Assets of € 219 billion. The Liquidity Coverage Ratio was 142%, above the regulatory requirement of 100% and a surplus of € 64 billion. The Net Stable Funding Ratio was 119%, at the upper end of the bank’s target range of 115-120% and implying a surplus of € 98 billion above required levels.\n2025 goals reaffirmed\nDeutsche Bank reaffirmed its financial targets and capital objectives for 2025. The bank aims for a post-tax RoTE¹ of above 10%, compound annual revenue growth of between 3.5% and 4.5% from 2021, and a cost/income ratio of below 62.5%. The bank further aims for a CET1 ratio of around 13% in 2025, reaffirms its target for a payout ratio of 50% from 2025 onwards and aims for € 8 billion in capital distributions to shareholders in respect of the financial years 2021 through 2025.\nSustainable Finance: cumulative volumes ahead of target\nESG-related financing and investment volumes² in the fourth quarter were € 18 billion. This brought the cumulative total since January 1, 2020, to € 215 billion for the Deutsche Bank Group ex-DWS, up from € 157 billion at the end of 2021. This exceeds the bank’s year-end 2022 target for a cumulative total of € 200 billion, despite a challenging environment in 2022. Volumes in 2022 included a net negative adjustment due to the new MiFID regulation introduced in August 2022, as certain assets under management were reclassified from the Sustainable Finance Disclosure Reporting (SFDR) methodology.\nTotal volumes by business, during the fourth quarter and cumulative since January 1, 2020, were as follows:\nCorporate Bank: € 5 billion in sustainable financing, bringing the Corporate Bank’s cumulative total to € 40 billion\nInvestment Bank: € 13 billion in sustainable financing and capital market issuance, for a cumulative total of € 128 billion\nPrivate Bank: volumes of € 1 billion during the quarter. The Private Bank’s cumulative total at year end was € 48 billion, comprising € 10 billion in loans and € 37 billion in ESG investments.\nOn March 2, 2023, Deutsche Bank will host its second Sustainability Deep Dive. Christian Sewing, Chief Executive Officer, Jörg Eigendorf, Chief Sustainability Officer and other senior executives will provide updates on the bank’s strategy, progress and outlook.\nGroup results at a glance\n¹ For a description of this and other non-GAAP financial measures, see ‘Use of non-GAAP financial measures’ on pp 17-25 of the fourth quarter 2022 Financial Data Supplement\n² Cumulative ESG volumes include sustainable financing (flow) and investments (stock) in the Corporate Bank, Investment Bank and Private Bank from January 1, 2020 to date, as set forth in Deutsche Bank’s Sustainability Deep Dive of May 20, 2021. Products in scope include capital market issuance (bookrunner share only), sustainable financing and period-end assets under management. Cumulative volumes and targets do not include ESG assets under management within DWS, which are reported separately by DWS.\nPDF\nRead the full media release as PDF document\nThe figures in this release are preliminary and unaudited. The Annual Report 2022 and Form 20-F are scheduled to be published on March 17, 2023.",
    "number_of_ratings": 19,
    "rating": 3.8,
    "likes": 54
}