{
    "url": "https://www.db.com/news/detail/20180131-getting-together-for-the-future-of-food?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 31, 2018",
    "tags": [
        "Company",
        "Diversity",
        "Investment Banking",
        "Sustainability"
    ],
    "title": "Getting together for the future of food",
    "body": "Building a more resilient and sustainable food system – and the role that governments, businesses and other stakeholders must play – was the theme of a roundtable discussion hosted at the Zig Zag building in London on Tuesday by Nicolas Moreau, Head of Deutsche Asset Management and Member of the Management Board.\nThe Zig Zag event followed a reception earlier in the day at Clarence House, hosted by HRH The Prince of Wales, who is patron of the Crop Trust, to help raise awareness of the importance of crop diversity and the need and urgency to safeguard it for future generations.\nMoreau is a champion of Food Forever, an initiative of the Global Crop Diversity Trust launched in Stockholm last June, which aims to ensure the conservation and availability of crop diversity for food security worldwide.\nFrom left: Nicolas Moreau; Ameenah Gurib-Fakim, President of the Republic of Mauritius; Marie Haga, Executive Director of Crop Trust; and Thani bin Ahmed Al Zeyoudi, Minister of Climate Change and Environment, Government of the UAE\nIn welcoming to the Zig Zag building some 60 government officials, business leaders, academics and food industry representatives, Moreau stressed the importance of working together for food biodiversity.\nNicolas Moreau welcomes guests to the event\n“This is a topic that is very close to my heart and is a focus at Deutsche AM and also throughout my career,” he said. “Leading by example means that we must bring this cause into the modern corporate and financial boardrooms and to bring the public and private sectors together.”\nTwo panel discussions were held during the event: “The challenges our food systems are facing and what role food biodiversity can play” and “Ways to transform and diversify our food systems for improved human and planetary health”.\nMore than 60 guests attended the roundtable discussion at the Zig Zag building\nGuests included, among others: Michael Gove MP, Department for Environment, Food and Rural Affairs, UK; Thani Al Zeyoudi, Ministry of Climate Change and Environment, UAE and Manuel Pulgar Vidal, Leader of Climate and Energy Practice, World Wildlife Fund for Nature.\nMichael Gove, UK Secretary of State for Environment, Food and Rural Affairs\nThe Crop Trust is the only international organisation devoted solely to ensuring the conservation and availability of crop diversity worldwide. Its work supports the implementation of the United Nations’ Sustainable Development Goals, specifically SDG Target 2.5, which recognises the importance of agricultural biodiversity. To this end, the Crop Trust is working to build and fund a global system of seed banks, therefore conserving the huge diversity of major agricultural food crops and promoting their use, forever.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}