{
    "url": "https://www.db.com/news/detail/20180125-launch-of-new-sustainability-index?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "January 25, 2018",
    "tags": [
        "Sustainability"
    ],
    "title": "Launch of new sustainability index",
    "body": "Deutsche Bank in conjunction with Solactive today announced the launch of the Solactive Sustainability Index Europe, which is designed to track the performance of environmentally and socially responsible European companies. The index is based on the data-driven platform Arabesque S-Ray®, the first tool of its kind that uses machine-learning and algorithm-based technology to rate companies on the principles of the United Nations Global Compact: Human Rights, Labour Rights, the Environment, and Anti-Corruption (GC Score).\nThe Solactive Sustainability Index Europe was established in response to investors’ growing appetite for incorporating environmental, social and governance (ESG) factors in their investment strategies. The index strategy seeks to achieve a lower volatility than the Solactive Europe 675 Index benchmark and a comparable dividend yield. It also includes specific dividend-yield filters and weighs the components based on volatility optimisation.\nThe launch of the Solactive Sustainability Index Europe enables us to provide customised solutions for our clients and meet the growing global demand for sustainability investment products.\nSabine Roeder, Head of Global Investment Solutions Germany at Deutsche Bank\nArabesque S-Ray® is a proprietary tool developed by Arabesque that analyses the sustainability performance of the world’s largest listed corporations using machine-learning and data scores. The algorithm-based technology systematically combines over 500 environmental, social and governance (ESG) metrics with news signals from over 50,000 sources. Solactive then applies financial screens, such as liquidity and dividend-yield filters, to get to the final index composition.\nTimo Pfeiffer, Head of Research at Solactive, commented: “The Solactive Sustainability Index Europe allows investors to gain access to ESG-compliant companies, while minimising the overall portfolio risk, achieved thanks to volatility optimisation. We are thus combining two of the most sought-after concepts in capital markets with a clear value-add for investors. We look forward to continuing to work with our clients and partners to expand the Solactive ESG offering.”\nAndreas Feiner, Head of ESG Research at Arabesque, said: “More than ever before, investors are asking for greater transparency around the sustainability of the companies they invest in. We are delighted to be partnering with Solactive to integrate Arabesque S-Ray®, our ESG data aggregator tool, into its new sustainability index.”\nInstitutional investors such as asset managers, pension funds and foundations, and increasingly private banks, are incorporating environmental, social, and governance (ESG) investing into their strategies. The Solactive Sustainable Index Europe is calculated as Gross Total Return, Net Total Return, and Price Return index. The index is published in EUR. The composition is readjusted annually.\n  About Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nAbout Solactive\nSolactive AG is an innovative index provider that focuses on the development, calculation and distribution of tailor-made indices across all asset classes. As at October 2017, Solactive AG served approximately 350 clients in Europe, America and Asia, with approximately USD 100 billion invested in products linked to indices calculated by the company globally, primarily via 250 exchange-traded funds from a number of well-known providers. Solactive AG was established in 2007 and is headquartered in Frankfurt.\nSolactive.com\nAbout Arabesque\nArabesque is a specialist ESG Quant fund manager that uses self-learning quantitative models and big data to assess the performance and sustainability of globally listed companies. Its investment technology processes over 100 billion data points to select an investment universe of equities, integrating environmental, social, and governance (ESG) information with quantitative strategies. Arabesque is regulated by the FCA in London.\nArabesque.com\n  MEDIA CONTACTS\nDeutsche Bank: Aurelie Leonard: +44(0207)54-14209; aurelie.leonard@db.com\nSolactive: Lucia Pitteri: +49 (69) 719 160 311; pitteri@solactive.com\nArabesque: Ciaran McCale: +44 (0)7956 175 100; ciaran.McCale@arabesque.com\n\n\nDisclaimer\nThe information in this document does not constitute tax, legal or investment advice and is not intended as a recommendation for buying or selling securities. Solactive AG and all other companies mentioned in this document are not responsible for the consequences of reliance upon any opinion or statement contained herein or for any omission.\n  Solactive AG, Guiollettstr. 54, 60325 Frankfurt am Main, Germany. Registered Office: Frankfurt am Main, Registration Court: Amtsgericht Frankfurt am Main, HRB: 79986, USt-IdNr.: DE 255 598 976. Management Board: Steffen Scheuble, Christian Grabbe and Christian Vollmuth, Head of Supervisory Board: Dr. Felix Mühlhäuser.\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement. Such factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission. Such factors are described in detail in our SEC Form 20-F of 11 March 2016 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}