{
    "url": "https://www.db.com/news/detail/20180125-deutsche-bank-partners-with-united-nations-development-programme-in-virtual-career-lab?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 25, 2018",
    "tags": [
        "Sustainability"
    ],
    "title": "Deutsche Bank partners with United Nations Development Programme in Virtual Career Lab",
    "body": "To launch an ongoing collaboration, Deutsche Bank partnered with the United Nations Development Programme (UNDP) to deliver a ‘Virtual Career Lab’ aimed at deepening employee engagement among the UNDP’s vast network.\nPresent in about 170 countries and territories, UNDP works to eradicate poverty through policy building, skills training and partnerships to drive and sustain progress.\nReaching about 170 UNDP employees in 50 country offices Claudia Coppenolle, Head of Digital Market Management, Global Transaction Banking, and teammate Carolina Pusterla shared lessons on how to create and sustain a fully inclusive workplace.\nCoppenolle discussed her professional journey and work as a mentor and spokesperson on issues such as diversity and inclusion in the technology sector. She highlighted key strategies implemented by Deutsche Bank to promote diversity including its values and beliefs, recent #PositiveImpact campaign, training and programs such as the bank’s reverse mentoring program.\nThese all help managers to foster an inclusive workplace, thereby transforming and improving institutional culture. Coppenolle stressed, however, that it is not only the institutional set-up and programs implemented by the organisation that will drive change: “Being inclusive starts with each of you. You can’t rely on others to sort things out for you if you yourself are not role-modelling the change you want to see.”\nDuring the well-attended session, Pusterla also shared insights on the tools she leveraged to help her transition from the public to the private sector following a 10-year career in non-profits She urged employees to get involved in programs that encourage meeting other colleagues across business units. She noted: “If networking opportunities do not exist formally, create them! Today’s digital age enables easy touch points through webinars, community chat rooms and meet up groups. These platforms are key to learning about different areas in an organisation and potentially uncovering a new area of interest or way of thinking about that tough project.”\nCommenting on the importance of partnership and the driver for developing programs such as the Deutsche Bank partnership, Mariam Kakkar, Chief, Talent Development Unit, Human Resources, UNDP, said: “Attracting, retaining and motivating high quality people – women, men and colleagues with other gender identities – and creating an enabling ecosystem for all of them to realise their full potential is critical for high-performing organisations such as Deutsche Bank and UNDP.”\nA follow up event is planned in New York later this year.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}