{
    "url": "https://www.db.com/news/detail/20180118-john-cryan-speech-at-the-new-year-reception-2018-in-berlin?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 18, 2018",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "John Cryan: Speech at the New Year Reception 2018 in Berlin",
    "body": "Ladies and gentlemen, friends and business partners of Deutsche Bank, guests from the political arena; welcome and please accept my best wishes for the New Year!\nBeing here in Berlin is always a great pleasure for me. At the moment however, the world sees this city primarily as the backdrop to an unusual quest. The quest for a government that will rule the most important country in Europe.\nMy job takes me all over the world and I can assure you, everyone is talking about Germany right now. Virtually every client I meet outside Germany wants to know what’s going to happen next with the German government. So this evening I would be grateful for any relevant pointers as to the answers I should give.\nThat’s not the only reason why we’re delighted to be welcoming numerous members of parliament and ministerial representatives today. I am also looking forward to exchanging views with you, as are my Management Board colleagues present here today: Kim Hammonds, Sylvie Matherat, Marcus Schenck, Christian Sewing and Karl von Rohr.\nPolitical challenges in Germany and Europe\nPolitical uncertainty or the unpredictability of politics is the number one topic worldwide at the moment. Last year it had no impact on the economy or the financial markets. One year ago we had prepared ourselves for an apparently explosive mix: the major unknown called Brexit, fears that right-wing extremists in Europe would achieve electoral success, a new president in the White House – all this stoked concerns that we were poised for major turmoil.\nIn fact, markets have proved to be just as robust as the economy worldwide. And if the economic indicators are to be believed, sentiment in Germany is currently at a 30-year high. Never since reunification have we been so close to achieving full employment.\nHowever, this year, too, there is no shortage of major risks:\nIn the Middle East old and new conflicts are raging.\nIn Europe the era of ultra-cheap money is coming to an end.\nAnd now, of all times, Germany has allowed a political vacuum to develop.\nThe country is still coping relatively well with the protracted efforts to form a government. Sooner or later, however, too many political question marks will prompt companies to postpone their long-term investments. That’s why the success of the exploratory talks between the prospective coalition partners last week constitutes a good and important signal. The reactions during the past few days show that the next grand coalition is by no means a done deal. But I do hope the discussions will now continue constructively and soon lead to the formation of a stable government.\nAfter all, major tasks await in the near term, especially in the international arena. Tasks that require a strong Germany.\nAs a Briton, I certainly can’t be suspected of being idealistic about Europe. But especially as a Briton I say: we need a strong European Union. And there can only be a strong EU if Germany plays a leading role in shaping it – especially now.\nThe feared wave of victories for anti-European sentiment failed to materialise last year, so it is now all the more important that pro-Europeans address the questions many people are asking: what does Europe do for me? And what is going to happen to it? The European project will only receive the long-term backing it requires once European policymakers find clear answers to these fundamental questions.\nThat is precisely why I welcome the initiative of France’s President. With his guest speech shortly after the federal election, he triggered an impetus for reform that has not been seen in Europe for a long time. Not every single one of his proposals will find support: a majority of voters in the northern member states will probably continue to reject an increase in financial transfers in Europe - and while a European asylum authority would be desirable, it will be virtually impossible to introduce in the short term.\nHowever, by dismissing this grand idea out of hand we would be missing a major opportunity. This also means that Germany has to respond soon to the French President’s proposal. Otherwise the agenda will be set elsewhere. We see forces in Eastern Europe that have a very different understanding of Europe's role.\nI am very glad to see that Europe is an important issue in the exploratory talks document. I think there are two key principles that could once again make Europe a model – and perhaps for Britain, too:\nFirstly: together – and this is actually self-evident – we are a stronger political and economic force than when we act alone. This is has never been more true. We are witnessing less cooperation and more confrontation between the major economic blocs: what kind of a negotiating position are we going to have in the world if we in Europe do not to stand together?\nSecondly: a strong Europe has to start taking the principle of subsidiarity seriously once again. Decision-making needs to be as local as possible, conducted where people live - at the municipal, provincial and national levels. This is something that Brussels has to respect. Not doing so will only cause voters to continue to turn their back on Europe.\nBy contrast, key solutions are important in the few areas where they would strengthen Europe as a whole. This applies to security policy as well as to monetary policy and thus necessarily to financial market policy. And this applies to many other economic issues – not least digitalisation.\nI really can’t stress this enough: we urgently need to catch up in terms of digitalisation. Europe’s economic and political future rests on us doing so.\nOne simple example illustrates this: the five most valuable companies in the world are all from the digital economy – and they are all based in the US: tech giants Facebook, Apple, Amazon, Microsoft and Google.\nEurope, on the other hand, is starting out in the platform economy era without a single major international corporation in contention. But it’s not for want of smart individuals and innovative ideas here in Europe. You need only look at the number of Europeans who have taken up senior positions in Silicon Valley, possibly never to return.\nThis has to change. There’s a lot to be positive about. Look at the start-up scene here in Berlin. It has a great deal of potential - but we're failing to tap all of it. How are European start-ups to keep pace with their international competitors if they have to comply with 27 or 28 different legal systems within the EU? And what will become of the established start-ups? The European Commission looked into this and found that 44 percent of start-ups are acquired by US firms.\nSo what needs to change? One essential factor is that they have better access to capital.\nThat brings me to the second key economic issue that concerns the EU besides digitalisation. I’m afraid I’ll have to bore you again as there has been hardly any progress made on this over the past 12 months. Europe really must push on with developing its single financial market at long last.\nNot only is the venture capital segment not yet fully developed, the capital market lacks the kind of depth needed to float young companies on the stock market with the same success we regularly see in the US. With conditions as they are, how else will our own economy manage to change fast enough?\nI think the European financial market needs one thing now: more integration. The banking union was an important step in the right direction. But we can’t stop midstream. We have to follow through and take the next step towards capital markets union.\nI admit, such steps are laborious. However, if Europe fails to establish a strong financial centre, it is then set to fall even further behind competing regions.\nOf course, one element of a strong European financial centre is strong European banks. If global protectionism flourishes, it is now clearer than ever that it cannot be in our interest for Germany to be importing all its key banking services in future. Europe needs a strong domestic option in these areas. That’s why Deutsche Bank was founded here in Berlin back in 1870.\nDeutsche Bank\nDeutsche Bank wants to provide this option. And it can. Now we are again being asked whether our business model can actually work. I can assure you we’re convinced that we are on the right track. We shall remain resolute. We set out on this path in autumn 2015 and we have always maintained that the reorganisation would take longer than one or two years.\nIn the first phase we made significant improvements to our control systems and reduced legal risks.\nThe second phase began last March and marked the beginning of us realigning our business divisions. Our current task involves creating the undisputed largest private and commercial bank in Germany, serving more than 20 million clients. At the same time, cutting our costs further and investing in our systems continue to be priorities.\nThe third phase has now begun and it’s just as important as the previous two: we want to continue to grow and to focus on our relationship with you, our clients. We have much to offer. No other bank in Germany - or even in Europe - has the kind of global expertise that we do.\nLadies and gentlemen, our aspiration is quite clear. We aim to be the leading European bank with global reach. And that’s why it’s essential to have a strong Europe with an equally strong financial market.\nWe, Deutsche Bank, have much to gain from progressive European policies. And we want those of you here who are clients of Deutsche Bank to benefit from a bank that is taking an active part in shaping the financial world of the future.\nGains for society\nWe would like to show you a short film to illustrate this. It features a client you all know. And a client adviser who has been advising this particular company from Swabia for more than 20 years.\nThe film shows our bank from one of its strongest sides. It shows our roots are woven into the very fabric of the German economy.\nOn that note and without further ado, let the film roll. I look forward to an enjoyable evening with you all.\nThank you.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}