{
    "url": "https://www.db.com/news/detail/20180116-deutsche-bank-strengthens-its-insurance-business?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "January 16, 2018",
    "tags": [
        "Corporate products",
        "Digitalisation",
        "Entrepreneurship",
        "Private products",
        "Research"
    ],
    "title": "Deutsche Bank strengthens its insurance business",
    "body": "Berlin-based InsurTech company Friendsurance is the bank’s new strategic partner\nDigital “insurance manager” function to complement traditional bank services, offering clients a convenient and easy way to manage their insurance needs\nOne more step towards becoming a platform provider\n  Deutsche Bank and the digital insurance broker Friendsurance will work together to advise clients and help them take out and manage insurance policies. The partnership is aimed at making it more simple, transparent and convenient for clients to arrange insurance. To drive this Deutsche Bank will integrate Friendsurance’s digital products into its online banking portal. Starting mid-2018, bank clients will be able to use the insurance manager function to manage and optimise insurance policies and take out new ones quickly and securely.\nPremiums for property and casualty insurance totalled 66 billion euros in Germany in 2016. More than one fourth (27 percent) of these premiums were negotiated by insurance brokers. Deutsche Bank and Friendsurance expect clients will increasingly turn to digital brokers for their insurance needs in the coming years.\n“We aim to become our clients’ main digital bank. Many of them want a reliable platform where they can efficiently manage all their financial needs and where they can get products that go beyond what traditional banking services offer. Digitalisation is creating the technological framework to make this possible,” says Markus Pertlwieser, Chief Digital Officer Private & Commercial Clients at Deutsche Bank. “The insurance manager function is a logical addition to our digital offering and we have found the right partner in Friendsurance.”\n“This cooperation helps us to raise client satisfaction levels and inspire greater loyalty from our bank customers. And we are opening up to new, internet-savvy target groups,” explains Tim Kunde, Managing Partner and co-founder of Friendsurance. Using the digital insurance manager function, clients will be able to see all their insurance policies together with key details such as notice periods, coverage and a claims history, all at a glance. It will also be possible for clients to manage their insurance policies online, to compare policies and conditions and, if necessary, change insurer or take out a new policy.\nIn the event of a claim, quick help is at hand from the insurance manager function: in addition to the digital offering, clients can call a hotline manned by qualified insurance experts. Deutsche Bank’s chosen insurance partner covers products offered by every single insurer on the market. When selecting a policy, the determining factor is that the insurer applies the same criteria that leading consumer protection groups do. So the insurance manager function will not just come up with the cheapest insurance policies but the most suited to each individual client’s needs and situation.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}