{
    "url": "https://www.db.com/news/detail/20180116-deutsche-am-completes-transfer-of-one-billion-euro-global?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "January 16, 2018",
    "tags": [
        "Company",
        "Corporate products",
        "Research"
    ],
    "title": "Deutsche AM completes transfer of one billion euro global",
    "body": "Deutsche Asset Management (Deutsche AM) today announced the completion of the management transfer to its real estate investment business, of a one billion euro global property portfolio managed on behalf of its German institutional client Bayerische Ärzteversorgung (BAV). BAV is the pension fund for doctors in Bavaria and one of the largest institutions that make up Bayerische Versorgungskammer (BVK), the Bavarian umbrella pension scheme for self-employed professionals, and long-standing client of Deutsche AM.\nThe portfolio consists of 16 properties in 10 countries across Europe, including England, Scotland, France, Italy, the Netherlands, Sweden and Finland, as well as the United States. Deutsche AM will provide investment management and transaction services on the portfolio.\nClemens Schaefer, Head of Portfolio Management, Real Estate, Europe at Deutsche AM said: “We look forward to working together with BVK to manage and extend the existing portfolio focused on core locations in developed countries.”\nGeorg Allendorf, Head of Real Estate, Europe at Deutsche AM added: “This mandate is validation of the strong and long lasting relationship between BVK and Deutsche AM.”\nFor further information, please contact:\nNick Bone\nPhone: +44 207 547 2603\nEmail: nick.bone@db.com\nDeutsche Asset Management - Real Estate\nDeutsche Asset Management’s real estate investment business has been investing in real estate assets for more than 45 years. As part of the Alternatives platform, the real estate business has more than 450 employees around the world and USD 57.6 / EUR 48.8 billion in assets under management as of September 30, 2017, and offers a diverse range of strategies and solutions across the risk/return and geographic spectrums, including core and value-added real estate, real estate securities, real estate debt and\nopportunistic real estate. The real estate investment business employs a disciplined investment approach and aims to deliver attractive long-term risk adjusted returns, preservation of capital and diversification to its investors, which include governments, corporations, insurance companies, endowments, retirement plans, and private clients worldwide.\nAn investment in real estate involves a high degree of risk, including possible loss of principal amount invested, and is suitable only for sophisticated investors who can bear such losses. No assurance can be given that investment objectives will be achieved.\nPast performance is not a guarantee of future results. Forecasts are based on assumptions, estimates, opinions and hypothetical models or analysis which may prove to be incorrect. Confidential. For Professional Client MiFID Directive 2004/39/EC Annex II) only. For institutional investors only.\nDeutsche Asset Management\nWith EUR 711 billion of assets under management (as of September 30, 2017), Deutsche Asset\nManagement¹ is one of the world’s leading investment management organizations. Deutsche Asset\nManagement offers individuals and institutions traditional and alternative investments across all major asset\nclasses.\n¹ Deutsche Asset Management is the brand name of the Asset Management division of the Deutsche Bank\nGroup. The respective legal entities offering products or services under the Deutsche Asset Management\nbrand are specified in the respective contracts, sales materials and other product information documents.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}