{
    "url": "https://www.db.com/news/detail/20180115-the-future-of-cryptocurrencies?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 15, 2018",
    "tags": [
        "Corporate products",
        "Cryptocurrencies"
    ],
    "title": "The future of cryptocurrencies",
    "body": "Cryptocurrencies are fast moving, transparent, and have the potential to upend existing infrastructure, Catherine Wood, CIO ARK Invest, said during a fireside chat with Business Insider reporter Frank Chaparro on December 8, 2017. The discussion, moderated by Hailey Orr, GCM Capital Markets Strategist, was part of Corporate Finance’s Global Markets Outlook meeting.\nInnovation\nWood said that blockchain technology is one of five innovative platforms currently emerging simultaneously (the other four include genomic sequencing, robotics, energy storage such as electric vehicles, and next-generation internet such as artificial intelligence). Both she and Chaparro agreed that there is a big future for blockchain technology beyond just bitcoin, the name of the best-known cryptocurrency. “Everyone is paying attention to it now,” said Chaparro.\nOne application for bitcoin or other cryptocurrencies may be as a way to send money without paying huge fees, which is particularly helpful in emerging markets where migrant workers send money back home.\nStore of value\nWood also said cryptocurrency has also become a ‘store of value.’ “We’ve seen the price escalate because most people hold on for dear life and don’t sell because they figure they will always be sorry,” she said.\nDisruptive potential\nCryptocurrencies have the potential to disrupt big data aggregators such as Facebook, Amazon and Google. Wood said, “We believe that data will be commoditized as it becomes fully transparent and in many blockchains there is full transparency of software code and transactions. If that’s true then data will be transparent and will become commodity. That could drive a hole into the economic models of some of these data aggregators.”\nSince there is transparency in the technology, Wood said there is less regulatory oversight than expected. “Bitcoin is one of the safest networks because it is so important for anyone involved to make sure the ecosystem is safe. No regulator wants to be blamed for preventing their country from participating in what could be the next big technology,” she said, pointing out that Japan recently declared bitcoin as legal tender.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}