{
    "url": "https://www.db.com/news/detail/20180115-we-did-not-capitalise-on-our-advantages?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 15, 2018",
    "tags": [
        "Company"
    ],
    "title": "“We did not capitalise on our advantages”",
    "body": "Mr Cryan, Deutsche Bank was supposed to see profit after tax again for the first time in three years in 2017. How frustrated are you that the balance sheet adjustment due to the US tax reform has now thwarted those plans?\nIt is a bit annoying. We are expecting to see positive earnings before tax for 2017, but in fact a slight loss after tax. We will benefit from the lower taxes in the US in the future, however.\nWill this further loss have an impact on the distribution of dividends and employees’ bonus payments?\nWe have said that we intend to return to our normal system of variable compensation for 2017, and that is still the case. The supervisory board and the annual general meeting make the decision on dividends.\nJohn Cryan, January 2018 (Copyright Alexander Kraus)\nDeutsche Bank is in the middle of restructuring. What currently requires your greatest attention and what are your priorities for 2018?\n2018 will see a continuation of our efforts from 2017. We want to lay the foundations for growth, and we are focusing here on two areas.\nFirstly, we intend to hire new client advisors. Secondly, we want to continue to invest heavily in technology, and we have to pick up the pace even more here. At the same time, we need to remain extremely disciplined with regard to costs.\nWhy has Deutsche Bank been so late compared with other banks when it comes to restructuring and changing its business model?\nWe began restructuring about five years later than the banks in the US. Unfortunately, we did not capitalise on our advantages after the financial crisis and adjusted our business model far too late. On top of that, digitalisation has changed the nature of many types of transactions, such as securities trading, which is now largely carried out through non-bank financial institutions.\nDid making it through the financial crisis comparatively well ultimately work to Deutsche Bank’s disadvantage?\nI don’t share the view that Deutsche Bank made it through the crisis in good shape. UBS, my former employer, ran into trouble during the financial crisis and had to raise a lot of fresh capital. It then dropped its rates business in the US and introduced other sweeping changes.\nThese were the right steps for UBS to take. In contrast, Deutsche Bank stretched the problems out over many years. For example, the bank took some collateral from debtors so that their liabilities disappeared from the books.\nIn return, the bank came into possession of casinos, hotels and ports that it had to get rid of again later, at great effort. As a result, many financial woes only hit hard in 2015 and 2016. Deutsche Bank should have also made a cleaner break of things at the time.\nSome investors level the criticism that Deutsche Bank does not have a sustainable business model.\nWe are as dissatisfied as our investors with the current results, but I firmly believe that we are on the right path with our business model. We have invested a great deal in Germany and affirmed our commitment to German retail and commercial banking.\nOur footprint among SMEs is not as large as it should be yet, but we can expand it. We are very well positioned in transaction banking, but we will become even better by investing further in IT. In investment banking, the fact that we had to scale down several large trading books − partly due to regulations, partly due to a market share which was too small – has had an impact.\nThere is a lot of talk about whether the decline in earnings in these areas is cyclical or structural. I think it is structural in nature.\nIs Deutsche Bank still an investment bank? A number of critics claim that if Deutsche Bank isn’t an investment bank any more, then it isn’t anything at all any more.\nThat is simply false. First of all, we are an investment bank and will remain one. Secondly, we are by far the largest retail and commercial bank in Germany with more than 20 million clients. In the first nine months of 2017, we generated a 7.3% return on tangible equity in retail and commercial banking in Germany, while experts are wondering how it is even possible to exceed 3% in Germany.\nThe returns in corporate and investment banking are currently lower, which is due in part to several large legacy security holdings, especially in derivatives. We could sell them, but only at extremely unattractive conditions. The low interest rates are also putting a strain on us, but they will rise again some day.\nWe began restructuring about five years later than the banks in the US\nJohn Cryan\nSo what does Deutsche Bank stand for?\nWe want to be the leading globally networked European bank. What does that mean? It means we support our German, European, Asian and American clients in particular whenever they do cross-border business.\nInternational business was a key reason why the bank was founded. In Germany, we are also the clear market leader in several areas. Price pressure may be causing us trouble here, and the margins are probably the lowest in the world, but in return we work twice as efficiently as a comparable US bank.\nI think it is all the more remarkable that we are currently generating the highest returns in this market. That underlines our excellent position in Germany.\nBut earnings aren’t the only problem. Costs are a factor as well.\nDeutsche Bank employs a workforce of almost 100,000. In reality, you should be able to make do with half of that, right? You’re alluding to a statement by me that was interpreted differently than it was meant. It’s about long-term development, not short-term job-cutting schemes. The fact is, we have to constantly become more efficient.\nThere are two reasons why we have so many employees. First, because doing things by hand is still so widespread. Second, we had tremendous weaknesses in our internal controls. We had to hire a lot of staff in order to change that. But here too, computers will take on a larger share of the workload in the long term.\nYou frightened some of your staff with your statements about how the company has too many employees. What is the timeline for reducing the number of employees?\nI didn’t intend to frighten anyone. But it’s also clear that Deutsche Bank will only be successful in the long term if we automate many of our processes. We still have a lot of ground to make up here.\nStaff costs account for around EUR 12 billion of our EUR 24 billion cost base. Of course jobs will also become redundant as a result of automation. But this change will take many years.\nWe will try to cut a lot of these jobs through normal staff turnover. Moreover, we hire some 12,000 employees a year throughout the group. The number of employees will automatically decline if that figure is any lower.\nThe cost base is supposed to fall from EUR 24 billion, the most recent figure, to EUR 21 billion by 2021. With all due respect, that doesn’t sound very ambitious.\nI disagree. It is very ambitious. The costs could perhaps be reduced even more dramatically, but then there wouldn’t be enough money left over for investments. We invested more than originally planned in 2017, for example. The return to our normal system of variable compensation is also a good investment for us in keeping our good people and attracting new talent to us.\nThe Postbank integration isn’t exactly making rapid progress, either. What is the reason for that?\nI’m surprised to hear your question, as we are completely on schedule here. Please don’t forget that this is the largest merger since the Single Supervisory Mechanism was established in the autumn of 2014.\nWe are building a digital bank, the IT and restructuring units are being merged, and we are creating a shared headquarters with two locations for the “blue” and the “yellow” bank. Plus, it’s important in Germany that everything is done in consensus with the staff.\nThat takes a little time at first. But once you have reached an agreement, everything goes according to plan.\nIn future, you will operate only one “engine room” and rely primarily on the Deutsche Bank and Postbank brands. Are things going to stay that way, or will Postbank clients gradually become Deutsche Bank clients?\nThat is not the plan. The clients like both brands, and they will still be able to decide in future where they want to be a client. We won’t be pushing anybody anywhere.\nCan you sell the same products to both groups of clients?\nThat would be wrong in view of the clients. Postbank and Deutsche Bank may have similar clients, but they have consciously selected different banking services, and that is reflected in the products.\nPostbank’s clients expect easy-to-understand, affordable banking products that don’t require advice. Deutsche Bank’s clients appreciate our advice, they are also looking to have more complex financing requirements fulfilled, and they demand a certain banking ambience.\nDeutsche Bank employs around 8,600 staff in the United Kingdom. How many of them will relocate to Frankfurt as a result of Brexit?\nThe figure of 4,000 that often gets mentioned in the media is much too high. It is primarily a question of technology. It is mainly bankers, technology experts and traders who work in London, and they want to stay there.\nThe booking centre will definitely be relocated. But that will affect fewer jobs than many people think. We expect to create several hundred new jobs in Frankfurt to begin with, but also elsewhere.\nAn Italian employee might prefer to move from London to Milan to serve Italian clients from there. Italy is supporting the people moving there by offering advantageous tax conditions. So is Paris.\nFormer Deutsche Bank CEOs kept in very close contact with the government in Berlin and were seen virtually as advisers. What is your relationship with the government?\nWe have good relationships with politicians in Berlin on the whole.\nThere is an appropriate balance between distance and intimacy.\nPersonally, I am really going to miss Wolfgang Schäuble. I have great respect for him. But we are also in regular contact with other governments, in the UK and the US, for example. We are a global bank, albeit one with strong roots in Germany and Europe.\nWhat will Deutsche Bank look like in five years?\nA lot of markets will be smaller, and our position with commercial clients will then be better. The bank will also be more German and more attractively positioned with corporate clients in the rest of Europe. We will have fewer staff and lower costs.\nWill John Cryan still be working for the bank?\nMy contract still has another two and a half years to run. I often get asked what comes after that, but it’s not a question I ask myself.\nInterview conducted by Michael Rasch and Ermes Gallarotti. © Neue Zürcher Zeitung. All rights reserved.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}