{
    "url": "https://www.db.com/news/detail/20180112-of-course-we-re-not-finished-yet?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 12, 2018",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "\"Of course, we're not finished yet\"",
    "body": "In an extensive Q&A interview with the German business daily ‘Handelsblatt’ Deutsche Bank Presidents Marcus Schenck and Christian Sewing talk about how to transform the bank, the mutual benefits of the Corporate & Investment Bank and the Private & Commercial Bank and the public debate about bonuses.\nMr Schenck, Mr Sewing, at Deutsche Bank you are both seen as part of a new generation of managers. What lessons did the financial crisis teach you?\nSchenck: The most important lesson was not to just concentrate on the next two quarters. It is crucial to build a stable, sustainable business and also to attract talented individuals, who make different choices nowadays. When I started work back in the mid-1990s, young people were pushing to the front, eager to make easy money.\nBut money still plays an important role today, doesn’t it?\nSchenck: My impression is that money no longer has the same value to young people that it used to. Nowadays, people want to know they are doing something worthwhile and not just helping to increase the next quarter’s profit.\nSo what do they want instead?\nSchenck: They want to work for a company that allows them to participate in large, important deals. And they place value on doing worthwhile things for our clients. That’s why our #PositiveImpact hashtag is so popular among our young employees. Before and during the financial crisis, we did some things behind our clients’ backs – that certainly didn’t make a positive impact.\nThings that led to the bank losing its excellent reputation. Deutsche Bank used to be the pride of the German economy. Neither Anshu Jain nor John Cryan have managed to reinstate this sense of pride. How do you think that will change?\nSchenck: It will only improve when we’re making solid profits and we no longer have to keep discussing quarterly or full-year losses. I don’t expect financial institutions to regain the kind of undisputed position that they had in the 1990s – not before I retire. Society has changed too much for that to happen.\nSewing: To be fair, though, 2017 was a year of great improvements. Since our capital increase and our clear statement on how the bank will do business both in its domestic market as well as with its investment banking arm, you can see how our employees have started to feel proud of their company once again. They’ve started believing that the bank will improve its position again. Staff surveys show this.\nAnd the leadership and employee cultures at the bank – how must they improve?\nSewing: One of the most important drivers in this context is digitalisation. If we want to become a technology company, we need to establish entirely different hierarchies and change the way we collaborate. We’ve made first steps toward this. Years ago, for example, it was unthinkable of having employees two to three levels below Board level present ideas at a Management Board meeting. Today, it’s quite normal. That is so motivating; our employees notice that their ideas are welcome.\nBut Deutsche Bank still doesn’t have a digital native on its Management Board – someone who grew up with the Internet. Is that a shortcoming?\nSewing: I’d say it’s a generational matter. Digital natives are in their early thirties, at the very most. And Management Board members really ought to bring a certain amount of experience to the role. Of course, at other levels in the bank we have many digital natives and their work is crucial. For example, in retail banking, they help make sure we don’t lose business to the big internet platforms like Google or Facebook. In the past two years, we have built up an incredible amount of expertise.\nDigitalisation also means being agile, and having small teams and flat hierarchies. Is that even feasible in a company the size of Deutsche Bank?\nSchenck: Without a doubt. In our investment bank, for instance, we have established a team with highly qualified programmers. Their desks are right next to a trader who explains to the team which parts of an IT procedure are still too complicated. An IT specialist uses this information to programme a dummy and has the trader try it out. It’s that simple! No large-scale project needed.\nSewing: That’s basically how things work in our Digital Factory in Frankfurt-Sossenheim. Teams from different departments all work together there on one specific topic. For instance, there’ll be someone from the branch sitting next to someone from our Digital Department and someone else from Legal or Compliance. All of them working together on projects without any need for troublesome, lengthy approval processes. Having this kind of environment attracts the right kind of people – important people – to the bank.\nSo what can Deutsche Bank learn from Facebook, Google and Co.? Apart from fear?\nSewing: Very much. For example, we can learn how to enjoy trying different things out or how to think outside of the box. We should keep venturing out of the traditional banking business, and try to gain existing clients’ long-term loyalty or acquire new ones through our digital products. And we need to learn that out of the whole array of ideas that we develop in our Digital Factories, ultimately, 40 or even 50 percent might never succeed. We bankers have a totally different way of thinking. Our training tells us that 98 or 99 percent of all loans we grant have to be repaid. And that’s good for loans. But when we develop digital products, we need to have more courage to fail; it doesn’t all have to be perfect.\nDon’t you think that it is the Management Board that should be leading by example with a change in mentality this far-reaching?\nSewing: Absolutely.\nAt ING, the large Dutch bank and a forerunner in digitalisation, the Management Board members responsible for the domestic market no longer have their own offices. How attached are you to having your own four walls at the bank?\nSchenck: Not very much at all. I’m frequently on the move, visiting London, New York and Asia. My office is actually my iPad and my telephone. The Management floors and offices in the bank’s Frankfurt head office were planned long before we ever took up our posts. I’m sure no one would plan that kind of office use any more. Most certainly not. We could invest a few hundred million euros and make the offices more modern, but I think we need the money for other things right now.\nYour investors would certainly agree. Despite the new strategy and all your efforts to reorganise the business, Deutsche Bank has announced a net loss for 2017 – for the third year in a row. What’s wrong with your business model?\nSewing: It’s got nothing to do with our business model. Of course, we’re not happy with what we expect to be a slight loss. But the main culprit behind this minus figure is the 1.5 billion euros in valuation adjustments that are a one-time charge as a result of the tax reform in the US. That aside, we expect pre-tax profit to be positive.\nBut the US tax reform is not your only problem. Following on from a disappointing third quarter, the last months of 2017 were not good ones for the important business of securities trading. Revenues slumped by 22 percent.\nSchenck: Nevertheless, we should keep our operational performance quite distinct from one off special effects. Our business is not yet where we want it to be. But we made great progress in all our business areas. Even if we do book a small loss for 2017, it’s not nearly as dramatic as in previous years. We’ve been busy clearing up, putting the bank in a position to be able to generate profit in the long term.\nYou sound very optimistic. How optimistic are you about CEO John Cryan’s statement that, after two years of transition, 2018 would be the year the tide turns for the better?\nSchenck: If you mean that we don’t expect substantial one-off charges or a capital increase like we did in the past years, then yes, of course.\nSewing: In terms of operations, the tide started turning last year. This year we will be able to devote greater attention to our clients.\nWill it be enough to be able to pay the announced 11 cents per share for 2017?\nSchenck: That’s something that the Supervisory Board and the AGM will decide in the coming months.\nDo you think you might have been a little too optimistic last year, leaving your investors disappointed now?\nSewing: No. I don’t think so. We did almost everything we said we would. Of course, we’re not finished yet. Costs, for example, remain a high priority. We need to keep on top of those.\nWhat does that mean for your area of business? How many jobs will ultimately be lost through the integration of Postbank?\nSewing: We stand by what we said in October: with the integration of Postbank and the Private & Commercial Bank, our objective is to generate synergies worth 900 million euros. Just before Christmas, we started a programme offering voluntary redundancy payments or early retirement arrangements. We aim to cut about 1,000 jobs this way. And interest in the programme is high. The legal merger of the two units will presumably be concluded in the second quarter, as previously announced.\nYour new major shareholder, the influential US fund Cerberus, made it clear on a recent trip to Germany that Deutsche Bank still has significant shortcomings in terms of efficiency. Listening to you both, it sounds like you both share this opinion.\nSchenck: Yes, in principle. But we have to look into exactly where we can become more efficient. If we were to reduce the number of staff in the investment bank that have direct contact with our clients, then we’d have to stop doing certain kinds of business. But the machinery behind all this, the IT and processes, certainly could do with improving if you compare it with our competitors.\nSewing: The same can be said for all business divisions. In our retail banking business, we still have a considerable amount to do.\nSome investors are getting impatient and are calling for the bank to make demonstrable progress in the first two quarters of 2018. Is that realistic?\nSchenck: We always maintained that the bank’s reorganisation would take years to complete. We’re midway along the path. Now, we want to demonstrate our ability to regain market share after this phase of stabilising things. This is already visible in some of our businesses. For example, we are currently acting as lead advisor for three major global mergers worth a total of more than 200 billion dollars. This is a real success.\nSewing: Although I can understand our investors’ impatience. I can’t just bring forward the integration plan for Postbank by four months. It goes without saying that we aim to grow as strongly as we can. At the same time, we have to build a sustainably profitable bank and we can only do that if we stick to our schedule.\nNevertheless, after three consecutive years of losses, it can be asked whether the business model is viable.\nSchenck: When we took office, we said from the beginning that the world would not look completely different after a period of twelve months. We first had to work through legacy issues, for example, by eliminating the biggest legal risks and investing in our internal controls. At the same time, last year’s capital increase enabled us to reorganise our business areas and further adjust the portfolio. Now it is all about working meticulously on the details. In the Corporate & Investment Bank we have to regain market share and in the retail banking business, complete the merger between Postbank and Deutsche Bank. These are complex projects.\nYou talk about working meticulously on the details, but what about the bigger picture? Are there no doubts surrounding the strategy?\nSchenck: We are firmly convinced of the strategy. From today’s perspective, the original plan to separate from Postbank was the wrong one – so we corrected it. Ultimately, it is predominantly those competitors in investment banking with a strong private and commercial banking business that are gaining market share. As Deutsche Bank, we intend to keep growing in the private and commercial banking business, also because the results achieved there are less vulnerable to cyclical fluctuations than in investment banking.\nIf that is the case, why don’t you just invest more in this area and less in investment banking?\nSewing: Because investment banking continues to generate a significantly larger share of earnings. In my area, private and commercial banking, as well as in wealth management, we can only offer many solutions because our investment banking is strong. It is clear to me that the basic direction the bank is taking is the right one. We shouldn’t play around with the strategy.\nMr Sewing, if we go over the calculations again, then your area achieved a return on equity of around 7 percent during the first nine months, whereas Mr Schenck’s generated only half as much. Doesn’t it annoy you that the bank is investing heavily in investment banking?\nSewing: No, not at all. Of course we want to grow in the private and commercial banking business but that doesn’t mean that we intend to shrink our investment banking operations. I can only run my commercial banking business successfully when Marcus has success with his large clients area. One example: we made great progress in the Corporate & Investment Bank in Germany in 2017, at the same time, we acquired an additional 2,500 new clients in commercial banking – that means we are also benefiting from the successes achieved by our investment banking colleagues.\nBut investment banking does not only consist of the advisory business, payment services and financing solutions. The weakness of such a crucial area for the bank as securities trading seems to developing into a chronic problem.\nSchenck: Of course, we would have liked to have had a little bit more momentum from the markets. Unfortunately, the opposite has been the case since May 2017 at the latest and the fourth quarter was one of the weakest in the past 25 years. This slump affected everyone in the market. Therefore, the decisive question for us is how we have fared compared to our competitors. Are we going to manage to stabilise and gradually expand our position? I would say that we have accomplished this in practically all areas.\nBut in trading activities, the US banks have taken further market share from you?\nSchenck: In 2017 trading was the only area where we performed less strongly than we would have hoped. This is why we have strengthened our team in this area, and it is already paying off.\nAs you know, the strategy of acquiring market share in investment banking is not entirely new. It had fatal consequences for Deutsche Bank in the exuberance prior to the financial crisis. Is the bank repeating past mistakes? Mr Sewing, as a former risk manager, how do you see this?\nSewing: I am confident that Marcus and his colleague Garth Ritchie are going about repositioning the Corporate & Investment Bank in the right way. While it is true that we want to gain market share, we are being more selective than prior to the financial crisis. Risk controls are a lot stricter, we are starting from a totally different basis.\nThat makes it sound like there is major harmony in management. However, when it came to establishing bonus levels for 2017 a few weeks ago, there were quite heated debates on the Management Board and Supervisory Board, weren’t there?\nSchenck: Of course there are discussions when it comes to bonuses. This has always been the case at every bank. This time we had to carry out particularly intensive negotiations because we more or less took a break in 2016. That was a deep cut. Some employees were unwilling to participate and for this reason, sought employment elsewhere. Fortunately, there were not too many because the majority of our employees are exceptionally loyal. John Cryan announced early on that we intended to return to our normal model of variable compensation in 2017, so we had to strike a balance this time around.\nAnd how did you achieve it? After all, it is not only about retaining important investment bankers, but also about taking the interests of sorely afflicted shareholders into account.\nSchenck: Our bonuses will be competitive. Of course, that does not mean that, compared to our ten biggest competitors, we pay at the upper end, after all, our results are also not yet at the upper end. But neither do we want to be at the bottom of the list when it comes to compensation. This is exactly what we debated about.\nAnd, Mr Schenck, are you satisfied with what you managed to extract for your investment bankers?\nSchenck: But it is not about extracting something. What is important for us is remunerating our staff adequately for what they have achieved. It amounts to an investment decision just like at a football club: if you want to be in with a chance of winning the championship, then you have to retain or acquire specific players. Of course, there is not only one opinion regarding this on the Management Board. However, I cannot imagine the members of the management of Bayern Munich are always of the same opinion regarding how much their players should earn.\nMr Sewing, is this how you see it, too?\nSewing: Absolutely. Together, we have agreed on an approach we can justify. Competitive salaries are an important issue for the entire bank. In the Private & Commercial Bank we are faced with a similar task to the one Marcus and Garth are contending with in investment banking. If Frank Strauss and I do not invest in the team now, we will lose market share in the long run.\nIn that case, is it the right outward signal to be giving that, despite having made losses, you are again distributing more money to employees?\nSchenck: We have made a net loss because the US tax reform has resulted in one-off valuation adjustments. We would not even be having this discussion had President Donald Trump signed the law two weeks later, in other words, after the turn of the year. Incidentally, in the long run we will also naturally benefit from lower corporation tax rates in the US; our current results will pick up.\nHowever, the public at large continues to almost automatically associate bonuses for bankers with the excesses prior to the financial crisis.\nSchenck: Nevertheless, a lot has changed. Compensation is very tightly regulated nowadays. Bonuses are disbursed over a period of up to five years, and as far as the amount goes, those days are definitively over – one reason being that we are no longer permitted to conduct certain transactions, trading on our own account, for example. Bonus levels have declined across the entire industry.\nSewing: And these rules are correct – we had to learn from the financial crisis.\nGiven how harmonious you both seem during this interview, could you see yourselves managing Deutsche Bank together one day?\nSchenck: That is not the issue here. Right now, it is particularly important that we work together well as a team. I think it is great that none of us retreats to their office in order to do their homework on their own. Some of the bank’s problems arose because there was a lack of real cooperation between the business divisions, and this is where we see our opportunity. Recently, there was a discussion about which division the turnover from a specific transaction should be attributed to. Christian and I sat together and it took us five minutes to resolve the issue.\nSewing: That is precisely the point. Our employees see that the people in the upper management levels are not permitting themselves to become divided and this sends an important signal to the entire team.\nHowever, as Presidents and Co-Heads of your divisions, you are also in competition with each other as potential successors to John Cryan? Has this not had a detrimental effect on your friendship?\nSewing: I believe we have just answered that. Our cooperation has become more intensive since our appointment as Presidents and Co-Heads of our divisions. How we deal with each other is as normal as it was before. I can approach Marcus for advice if I have a problem in my area. And he does the same.\nHow long has it been since you last had a beer together?\nSewing: It’s been far too long, but we are both going to the Champions League match between Bayern Munich and Beşiktaş Istanbul together.\n  Handelsblatt on 12.01.2018\nYasmin Osman, Michael Maisch, Daniel Schäfer\n© Handelsblatt GmbH. All rights reserved. Photos © Bert Bostelmann / bildfolio.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}