{
    "url": "https://www.db.com/news/detail/20180112-dbaccess-china-investors-in-china-factor-in-environmental-concerns?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 12, 2018",
    "tags": [
        "Company",
        "Digitalisation",
        "Investment Banking",
        "Research"
    ],
    "title": "dbAccess China: investors in China factor in environmental concerns",
    "body": "At Deutsche Bank’s 16th annual dbAccess China Conference, which opened in Beijing this week, 22 percent of investors polled said they view a company’s environmental performance as a very important factor in investment decisions. A further 69 percent of respondents reported that while financial performance is still key, environmental performance is indeed a consideration. International investors’ explicit focus on environmental factors is an important reflection of a broader shift in China’s macro policy agenda, as the world’s second largest economy seeks to strike the right balance between economic and environmental sustainability.\ndbAccess China is the region’s pre-eminent investor forum on the outlook for China’s companies, industry sectors and overall economy. This year the conference brought together nearly 200 corporates and 700 investors representing more than 300 buyside institutions, who participated in large group presentations on macroeconomic and key sector topics. Concurrently the bank helped arrange roughly 2,000 one-on-one meetings between companies and investors followed by 15 premium field trips and site visits across the country, giving investors the chance to see companies' manufacturing facilities or major development projects.\nWerner Steinmueller, CEO for Asia Pacific, opened the event with an address highlighting the importance of closing the knowledge gap that many international investors have with regard to China. He mentioned that typical questions from institutional investors range from the technical – “what can international investors do with new investment channels such as Bond Connect and Stock Connect?” to the thematic - “what are the country’s policymakers doing to address commonly mentioned economic concerns?”\n“Despite its ever growing importance in the world economy, China has in many ways remained a myth among the majority of the western investment community,” Steinmueller said. “It has therefore become extremely important for organisations like Deutsche Bank to continue creating platforms that regularly bring together industry experts, investors, and corporates, to discuss matters of common interest. Through such discussions, myths are clarified, opportunities identified, and hopefully investment strategies can be formulated.”\nDuring this year’s conference, delegates had heated discussions and lively debate on a wide range of topics. Discussing China’s extensive adoption of cashless payments, Shu Li, a core member of the Technology, Media and Telecommunications practice at Boston Consulting Group, said that mobile payments have directly replaced cash payments and achieved explosive growth in the country. Other prominent topics included China’s financial market reforms, sector-level deleveraging, and property market development trends.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}