{
    "url": "https://www.db.com/news/detail/20220928-deutsche-bank-invests-in-synthesized?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 28, 2022",
    "tags": [
        "Digitalisation"
    ],
    "title": "Deutsche Bank invests in Synthesized",
    "body": "The bank’s Corporate Venture Capital (CVC) group is investing in Synthesized, a leading data generation platform provider, which allows engineering and data science teams a quick way to create and share trusted data through advanced machine learning and automation.\nDeutsche Bank is already partnering with Synthesized to better leverage data and accelerate the adoption of client insights driven by AI/ML, while at the same time protecting data privacy and security. Via Synthesized, the bank’s engineering teams have access to the synthetic test data they need – speeding up testing, driving more accurate outcomes and shortening time to market. Through synthetic, non-traceable versions of original datasets, the platform will enable the bank to rapidly experiment with large data sets for AI/ML use cases and additional new technologies.\n“Synthesized's mission is to provide access to secure, compliant, high-quality synthetic data, faster and easier. Our investment in Synthesized will further accelerate our application migration, data analysis, experimentation and testing in the cloud – enabling Deutsche Bank to increase its data productivity and innovation velocity,” said Gil Perez, Chief Innovation Officer and Head of Corporate Venture Group at Deutsche Bank. “We are thrilled to expand our partnership with Synthesized and having it join the bank’s Corporate Ventures Capital portfolio companies. This is another milestone in Deutsche Bank’s ongoing cloud and innovation journey.”\nSynthesized is the latest addition to the bank’s CVC portfolio, following the investment into SkyHive, Tania and SeaLights. The CVC programme is a core element of the bank’s innovation agenda. The CVC team focuses on investing in selected fintech and start-up technology solutions that will enable Deutsche Bank to either improve the client experience, create innovative banking and financial services, or increase productivity by helping the bank to digitalise more of its front-to-back processes.\nFind out more about the CVC programme here.",
    "number_of_ratings": 5,
    "rating": 5.0,
    "likes": 7
}