{
    "url": "https://www.db.com/news/detail/20220926-change-makers-meet-to-build-investment-community-for-ocean-impact?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "September 26, 2022",
    "tags": [
        "Europe",
        "Sustainability",
        "Wealth"
    ],
    "title": "Change-makers meet to build ocean investment community",
    "body": "More of the world’s ultra-high net worth individuals are getting behind ocean conservation and impact, as seen this week when Deutsche Bank’s International Private Bank (IPB) and the Ocean Risk and Resilience Action Alliance (ORRAA) host more than 100 influential investors, entrepreneurs and philanthropists in Mallorca, Spain to accelerate ocean sustainability.\nThe inaugural Deutsche Bank x ORRAA Ocean Conference aims to build an investment community to support the sustainable blue economy, starting with Deutsche Bank’s clients.\nAs one of Europe’s leading private banks with global reach, Deutsche Bank’s International Private Bank services over 3.3 million clients worldwide, including many of the world’s leading entrepreneurial families, philanthropists and ultra-high net worth individuals. Those attending the conference collectively represent tens of billions of euros in capital and are actively seeking to support and create impact in ocean health for its long-term sustainability.\nOver three days, international ocean advocates and experts will convene to address some of the most pressing challenges facing the Ocean, with guest speakers including:\nSir Ben Ainslie CBE, Olympic sailor\nRalph Chami, Assistant Director, Financial Policies Division, Institute for Capacity Development, IMF\nJosé María Figueres Olsen, Costa Rican businessman and politician who served as President of Costa Rica from 1994 to 1998\nLouise Heaps, Head of Sustainable Blue Economy, World Wildlife Fund\nProf. Callum Roberts, lead scientist on the Future Climate Coral Bank project\nLewis Pugh, OIG, British/South African endurance swimmer and United Nations Patron of the Oceans\nHer Excellency Ilana Seid, UN Ambassador for Palau;\nHer Excellency Aminath Shauna, Minister of Environment for the Maldives\nDr. Richard Spinrad, Undersecretary of Commerce for Oceans and Atmosphere, NOAA Administrator, Government of the United States of America\nGlobal Head of the IPB and Chief Executive Officer of EMEA, Claudio de Sanctis said: “Seventy five percent of our clients say they wish to leave a legacy that has a positive impact in the world. A healthy ocean ecosystem is vital for a healthy planet, so supporting sustainable ocean solutions is an investment in the future like no other. Deutsche Bank is committed to accelerating sustainable solutions for the ocean by enabling private capital into ocean finance to create lasting impact for future generations.”\nORRAA Executive Director Karen Sack said: “We need a step change in how we go about channeling investment into ocean and coastal resilience. Crucially, we also have to develop the pipeline of projects and companies from around the world and, in particular, the Global South which need access to investment. This is something which ORRAA is focused on delivering. The conference we are co-hosting with Deutsche Bank is a crucial staging post to growing the investment community in the Ocean.”\nThe Deutsche Bank x ORRAA Ocean Conference brings together ocean impact startups, private capital, NGOs, and ocean science experts to accelerate investment into the ocean ecosystem.\nOcean impact startups joining the conference include EcoSubsea, Ocean Bottle, Matter, Avant Meats, Biofeyn, Coral Vita, ECOncrete, and Bound4Blue.\n– Ends –",
    "number_of_ratings": 8,
    "rating": 4.1,
    "likes": 108
}