{
    "url": "https://www.db.com/news/detail/20220923-the-great-wealth-transfer-in-asia-pacific?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 23, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "The great wealth transfer in Asia Pacific",
    "body": "Deutsche Bank’s APAC Head of Wealth Planning, Sheau-Yuen Tan, talks about the great wealth transfer in Asia Pacific in our latest “150 seconds on APAC”. Watch the video to learn more. \nYou can also read the full transcript of the video here: \nAccording a McKinsey study, the Asia Pacific region accounts for around 42% of global wealth. The inter-generational wealth transfer has implications for how wealth management services are being offered by banks like Deutsche Bank that are helping clients with the wealth transfer.\nQ: How are entrepreneurs in Asia Pacific looking at passing on their legacy to the next generation?\nLegacy planning can take many forms, depending on what families hope to achieve, how large or complex the family is, what types of assets they invest in, their risk tolerance, and investment philosophy. We also consider non-financial goals in legacy planning, such as cementing the founder's important values and minimizing family disagreements.\nClients can use a combination of tools in their legacy plans, including wills that are more public in nature, trusts that are more private and allow wealth to be managed and distributed over a longer period of time or even forever, family offices that institutionalize the wealth of large families, and charitable trusts for philanthropic purposes.\nQ2: What trends do you see among the next generation on how they manage or grow their wealth?\nThe majority of those transferring wealth in the next decade are currently between the ages of 65 and 84. Their primary goal in legacy planning is to ensure that their hard-earned wealth remains within the family and is used in the way they would have wanted. In contrast, the next generation’s aspirations become more global as they embrace digitalisation, and seek diversity in investments, geographical footprints, and management styles.\nOne out of five businesses have a next generation member (aged 40 or younger) on the management team, and we keep these generational differences in mind when we advise the family.\nQ: How can they incorporate sustainable investments in their portfolio?\nIn the aftermath of the pandemic, there is an increase in concerns about social inequality and injustice. Many of today's wealthy next generation are aware of their highly privileged position. They want to use their money not only to leave a legacy, but also to lead the way in responsible investing and sustainable business practices which combine financial returns with social and environmental benefits.\nWhen advising families of multicultural origin in Asia, it is critical to remember that there is no one-size-fits-all solution. Incorporating ESG investments into the investment portfolio should be a step-by-step strategy, and families can begin with a small portion of their portfolio set aside for ESG investments and reflect on their priorities, what positive impact they want to see in the communities and review these strategies against longer term financial returns.",
    "number_of_ratings": 4,
    "rating": 5.0,
    "likes": 9
}