{
    "url": "https://www.db.com/news/detail/20220922-deutsche-bank-tops-asiamoney-fx-survey-at-no-1-in-asia-pacific?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "September 22, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank tops Asiamoney FX Survey at No. 1 in Asia Pacific",
    "body": "Deutsche Bank was named overall foreign exchange (FX) market leader at the Asiamoney FX Survey 2022, ranking number one by market share in five markets across Asia Pacific: Singapore, Hong Kong, Japan, Malaysia, and New Zealand.\nThe Asiamoney FX rankings were derived from Euromoney’s flagship global FX survey, which is widely considered the most comprehensive in the industry. The survey polls institutional investors, corporates, financial institutions, and end users globally to identify the leading providers of FX trading services.\nIn June 2022, for the first time in a decade, Deutsche Bank was named No. 1 globally in the Euromoney survey, ranking top in half of all categories. The year before, the closely watched survey ranked Deutsche Bank number 2 globally and in Asia Pacific.  \nDarren Boulos, Deutsche Bank’s Co-Head of Global FX in APAC, said, “No survey better captures our strong foothold in the USD 7 trillion-a-day market, both globally and in Asia Pacific. Being ranked first in the world’s major financial hubs reflects our commitment, breadth, and quality of services that we provide to the region and our clients.\" \nRuchir Sharma, Deutsche Bank’s newly appointed Co-Head of Global FX in APAC, said, “Liquidity is key to navigating increasingly volatile market conditions and we look forward to continuing to support our clients. This award also reaffirms our strengths in fixed income and currencies, where strong as we are, continue to offer exciting opportunities.”\nLast month, Deutsche Bank won Best Emerging Market (EM) Trading Platform at the FX Markets Asia Awards for the second year running, for offering best-in-class and innovative solutions. The bank also won Best Corporate Bank Indonesia at the Asiamoney Best Bank Awards 2022.\nDeutsche Bank went live with its e-FX trading hub in Singapore in October 2021. The e-FX hub is Deutsche Bank’s global FX centre along with New York, London, and Tokyo, and was developed in partnership with the Monetary Authority of Singapore. It enables the bank’s clients to execute FX transactions more closely aligned to geographic location, providing faster trade execution, better price transparency and deeper liquidity.",
    "number_of_ratings": 19,
    "rating": 1.4,
    "likes": 66
}