{
    "url": "https://www.db.com/news/detail/20220916-helping-conserve-marine-biodiversity-across-asia-pacific?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "September 16, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Helping conserve marine biodiversity across Asia Pacific",
    "body": "Deutsche Bank and The Nature Conservancy (TNC) today announced a new partnership to help conserve and restore marine biodiversity across the Asia Pacific region. The partnership consists of four TNC-led community conservation projects in Indonesia, Hong Kong SAR, Mainland China and Australia, which aim to safeguard wildlife species and replenish shellfish reefs, one of the world’s most critically endangered marine ecosystems.\n“Marine biodiversity plays a crucial role in the sustainable development of economies, communities and the environment. Our partnership with TNC forms part of our broader focus on oceans and coastlines, where globally, the livelihoods of over three billion people are linked to. We look forward to working with TNC to support these essential projects,” said Annie Yeo, Head of Corporate Social Responsibility, Asia at Deutsche Bank.\nWill McGoldrick, Regional Managing Director for TNC in Asia Pacific, said: “We are grateful for being able to partner with Deutsche Bank for this work. By supporting these marine conservation projects around the Asia Pacific region, we help conserve marine habitats and restore the biological wealth of oceans, with benefits for marine life, local communities and coastal economies.”\nThis partnership comes on the back of Deutsche Bank’s newly launched CSR environmental impact programme called How We Live, which helps to protect and restore nature and raise awareness for the environment through education. Working with Deutsche Bank’s employees, local grassroots organisations, environmental groups and charities, this programme aims to address critical issues for the nature and communities globally.",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 78
}