{
    "url": "https://www.db.com/news/detail/20220914-how-we-live-deutsche-bank-launches-new-programme-for-environmental-impact?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "September 14, 2022",
    "tags": [
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "How We Live: Deutsche Bank launches new programme for environmental impact",
    "body": "From supporting clients in their transition to a low-carbon economy to the actions we are taking to reduce our own carbon footprint, Deutsche Bank is playing its part in creating a more sustainable world. It’s our responsibility as a bank to help fund solutions to climate change, including arranging more than 200 billion euros of ESG financing and investment by end 2022. But changing how we live has to happen at an individual level too. The climate crisis affects us all, which is why the bank’s new CSR programme gives our employees the chance to get involved in protecting, restoring and providing education about their environment.\nEnvironmental impact programme How We Live is inspired by the conviction that when we act together, the results are more powerful and far-reaching. Our partners are local grassroots organisations, environmental groups and charities. Our ambition is to address critical issues for nature and communities in all regions.\nWe are focusing on oceans and coastlines because the livelihoods of over three billion people are linked to marine and coastal biodiversity. Healthy rivers and wetlands are another priority as they are crucial to our food chain and water supply.\nWe are involved in protecting woodlands because our forests not only provide habitats for more than 80 percent of all species, they remove carbon dioxide from the air and generate drinking water. And since as much as two-thirds of the global population is expected to live in cities by 2050, we support parks, playgrounds and other urban green spaces that provide access to nature.\nHow We Live gathers existing CSR projects and new partnerships under one umbrella; some examples are:\nWe’ve been working with German tree-planting charity Trinkwasserwald for over ten years, which has helped us plant more than half a million trees worldwide to date.\nA new scientific study in China is our latest involvement in reef conservation in Asia-Pacific.\nIn the UK, the Waterways Protection project aims to prevent plastics and other litter from polluting the seas.\nBrotherhood Sister Sol in New York City is a leading example of youth education on urban environmental issues, with the goals of creating jobs and support for local businesses, and preparing the next generation to build a more climate-friendly society.\nVolunteers on How We Live projects will be making a difference for people and the planet. The KPIs of the programme measure social and environmental positive impact — because wherever an environment is improved, people benefit too. That data will help show how this programme contributes to the UN’s Sustainable Development Goals.\nLareena Hilton, Global Head of Brand Communications and CSR at Deutsche Bank:\n“How We Live adds a new dimension to our global CSR strategy and the volunteering possibilities for employees across the bank. The new environmental impact programme is helping to create a more sustainable world and contributing to the bank’s sustainability strategy. And as every How We Live project has a local focus, employees will help protect and restore nature and build a deeper understanding of why we must care for the natural world and change how we live.”\nMore information can be found on our How We Live internet site. ",
    "number_of_ratings": 43,
    "rating": 2.7,
    "likes": 69
}