{
    "url": "https://www.db.com/news/detail/20220913-deutsche-bank-appoints-richard-stewart-as-group-treasurer?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, September 13, 2022",
    "tags": [
        "Company",
        "Personnel announcements"
    ],
    "title": "Deutsche Bank appoints Richard Stewart as Group Treasurer",
    "body": "Deutsche Bank today announced the appointment of Richard Stewart as Group Treasurer with effect from Monday, September 19. Stewart will also continue in his current role as Head of the Capital Release Unit. He will report to James von Moltke, Chief Financial Officer, in his capacity as Group Treasurer while continuing to report to Rebecca Short, Chief Transformation Officer, in his role as Head of the Capital Release Unit.\n“Richard is highly qualified to succeed in his new role, given his experience and achievements in capital and balance sheet management,” James von Moltke, Chief Financial Officer, said. ”He has contributed significantly to the success of Deutsche Bank’s transformation. Under Richard’s leadership, the Capital Release Unit continued to reduce leverage exposure and risk weighted assets, freeing up capital from non-strategic activities, while simultaneously delivering substantial cost reductions.”\nRichard Stewart said: “I am privileged to have this opportunity to lead Group Treasury. I look forward to helping the team to build on its successes of the past few years. Treasury has played a vital role in supporting Deutsche Bank’s transformation agenda, delivering capital and balance sheet strength, achieving significant improvements in resource efficiency and cost of funding as well as completing a string of successful capital market issuances. This gives us a strong platform for the future.”\nStewart joined Deutsche Bank in 2006 and was appointed Head of the Capital Release Unit in June 2021. Prior to this he held several senior roles in Market & Valuation Risk Management. His Deutsche Bank experience also includes eight years in Strategic Corporate Lending, where he was Head of Portfolio Risk.",
    "number_of_ratings": 22,
    "rating": 1.4,
    "likes": 64
}