{
    "url": "https://www.db.com/news/detail/20171215-deutsche-bank-wins-three-accolades-at-risk-awards-2018?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "December 15, 2017",
    "tags": [
        "Awards",
        "Company"
    ],
    "title": "Deutsche Bank wins three accolades at Risk Awards 2018",
    "body": "Deutsche Bank’s Corporate & Investment Bank division has received three prestigious accolades at Risk magazine’s annual awards.\nThe awards, which were presented during a ceremony in London, are:\nCurrency Derivatives House of the Year\nQuant Research House of the Year\nInstitutional Investment Product of the Year\nThis is the fourth time the bank has been awarded Currency Derivatives House of the Year. Risk recognised Deutsche Bank for its strategy to “pivot away from pure execution” in light of a quiet market across the industry. The judges also pointed to the broad range of innovative technology services for clients as a key differentiator.\nExplaining its choice for Quant Research House of the Year, Risk praised the bank’s quant research team, referring to one client’s comment that Deutsche Bank “has a gift for describing the finer points of complex ideas from machine learning to liquidity risk premia”. Risk also noted that in data science the team’s approach \"allows investors to stitch systematic and fundamental strategies together, providing them with insights not usually gained through one individual strategy.”\nThe award for Institutional Investment Product of the Year reflects Deutsche Bank’s pioneering work in the risk premia space, which has become a popular area of focus in the investment world. For investors, risk premia is a low cost alternative to investing in traditional hedge funds and combines multiple instruments taking long or short positions as well as using specific trading rules. Risk noted that Deutsche Bank “has sought to carve a niche for itself developing bespoke portfolios of systematic, alternative risk premia strategies tailored to customers’ individual investment objectives”. Risk highlighted that Deutsche Bank has completed more than 60 such bespoke deals.\nHonouring the work of firms and individuals in the derivatives markets and risk management, the Risk Awards are the longest-running awards of their kind - over 30 years in existence. The prestigious awards are decided by the editor and journalists of Risk and influenced by the submission of pitch documents, feedback from clients and industry peers.\nFor more information on the Risk Awards visit the Risk Awards website following the links below.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}