{
    "url": "https://www.db.com/news/detail/20171212-robin-offers-portfolio-management-for-retail-investors?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "December 12, 2017",
    "tags": [
        "Capital markets",
        "Corporate products",
        "Digitalisation",
        "Investment Banking",
        "Research",
        "Wealth"
    ],
    "title": "ROBIN offers portfolio management for retail investors",
    "body": "Deutsche Bank customers have been able to manage their assets digitally since the end of November. ROBIN, its digital portfolio management tool, manages clients’ investments in exchange-traded funds (ETFs). ROBIN functions using Deutsche Bank’s own algorithms in combination with the market opinions of Ulrich Stephan, the bank’s Chief Investment Officer for private and commercial clients. In this context, digital portfolio management has been designed as an open platform, which means that it not only invests clients’ money in Deutsche Bank funds, but also in selected products offered by four leading providers.\nClients can use ROBIN from a minimum investment amount of 5,000 euros; monthly savings plans are also possible. Flat fees of 0.8 to 1.0 percent are charged depending on the amount invested. For now, ROBIN is available on maxblue, the bank’s online investment platform, but it will also be launched via the Deutsche Bank website during the course of 2018. “We are not using ROBIN to just digitalise conventional securities transactions,” says Markus Pertlwieser, Chief Digital Officer of the bank’s private and commercial banking operations. “It also opens up portfolio management to a wider investor base. Clients can now take advantage of Deutsche Bank’s investment expertise using manageable sums of money. It is simple, transparent and good value.”\nHow ROBIN works\nROBIN closes the gap between online brokerage, where clients make investments themselves, and classic portfolio management – where the bank’s financial experts invest clients’ assets, monitor performance and if required, buy and sell securities.\nWith ROBIN, clients set up an account providing their key financial information – such as income, monthly outgoings and experience with investment products – as well as investment horizon and risk appetite. The digital portfolio manager then proposes a suitable investment strategy. If the client agrees with the strategy, ROBIN creates an individual ETF portfolio, monitoring it automatically and adjusting it where necessary. In this way, ROBIN calculates the potential risk of loss for the entire portfolio and not just the risk for the individual asset classes. To this end, the algorithms continually analyse the capital markets while simultaneously taking Deutsche Bank analysts’ and investment strategists’ forecasts into account. Therefore, ROBIN combines human and machine capabilities. In the event of stronger fluctuations in the capital markets, ROBIN invests more defensively, while during calmer market developments, it increases the share of equities, for instance, in order to make the most of opportunities.\nGlobal expertise for a broad client base\nClients do not need expert knowledge on stock markets to help their assets grow. “With ROBIN, our clients are investing their money professionally. The investment robot gives them access to Deutsche Bank’s knowledge of the global capital markets,” said Global Chief Investment Officer Ulrich Stephan. “We made a conscious decision to keep the minimum investment amount low. So our digital portfolio management service is attractive for a broad range of clients.”\nROBIN invests clients’ assets in ETFs – a special kind of traditional investment fund that is traded on the stock exchange and contains a mix of equities, fixed income and commodities. Clients’ portfolios are monitored every day the stock exchange is open and, if fluctuations on the market make a change necessary, adjusted in line with each client’s investment strategy.\nHow much does ROBIN cost?\nFees for ROBIN are lower than those charged for traditional portfolio management services. And clients see directly how much services will cost them. Fees are staggered; the bank can pass the cost benefits it achieves when investing larger sums on to its clients.\nFees for ROBIN are applied at three different rates: the first 25,000 euros are charged at an annual rate of 1 percent per year. portfolio sums between 25,000 and 50,000 euros are charged at 0.9 percent per year and for sums above 50,000 euros at 0.8 percent per year.\nFor example: a client invests 65,000 euros in a digital portfolio. Presuming an average 5,000 euros of this amount is held as liquidity, it follows that an average sum of 60,000 euros is invested in securities. Liquid assets incur no fees, so the client only pays fees on the invested sum of 60,000 euros. The first 25,000 are subject to a fee of 1 percent per year, which is 250 euros. For the amount between 25,000 and 50,000 euros, a 0.9 percent annual charge applies, i.e. 225 euros. And for the remaining 10,000 euros, the fee drops to 0.8 percent or 80 euros a year. So, in our example, the client pays 555 euros per year for his investment.\nAdded to this is a charge for the ETFs themselves – an average annual charge of 0.25 percent, which the ETF issuers debit directly as third-party costs.",
    "number_of_ratings": 3,
    "rating": 3.7,
    "likes": 0
}