{
    "url": "https://www.db.com/news/detail/20171211-deutsche-asset-management-marks-20-years-of-sustainable-investing-innovation?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "December 11, 2017",
    "tags": [
        "Asset Management"
    ],
    "title": "Deutsche Asset Management marks 20 years of sustainable investing innovation",
    "body": "20th anniversary of first social impact strategy by major financial institution\nMicrofinance funds contribute towards Sustainable Development Goals\nDeutsche Asset Management (Deutsche AM) today celebrates the 20th anniversary of the launch of its first social impact strategy. Deutsche AM was the first major financial institution to offer sustainable investing in 1997 aimed at generating viable returns with real and measurable social and environmental outcomes from its investments.\nDeutsche AM distributes loans to microfinance institutions and alternative financial services companies. The loans help entrepreneurs in more than 50 developing countries to improve their lives and communities while generating investor returns.\n“Since the launch of our first strategy 20 years ago, Deutsche AM has continued advancing the responsible investing industry by working closely with governments, institutions and private investors to develop investments that help underserved communities globally while generating investor returns,” said Andrew Pidden, Global Head of Sustainable Investments. “Responsible investing is at the forefront of Deutsche AM’s commitment to enabling clients to contribute to a sustainable future. We are proud of our efforts over the past two decades.”\nDeutsche Bank was also the first commercial bank globally to receive accreditation from the United Nations Green Climate Fund (GCF), acknowledging the Sustainable Investments platform’s capabilities in structuring innovative public-private climate finance solutions to achieve GCF objectives.\nDeutsche AM’s global Sustainable Investments team develops initiatives and programs that cover energy, environmental, employment, education, housing, as well as financial inclusion. With a geographical footprint across the United States, Europe and Asia, the Sustainable Investments business encompasses Deutsche AM’s environmental and social impact investment expertise.\nFor further information please contact:\nAdib Sisani\nPhone: +49 (0)69 910 61960\nE-Mail: adib.sisani@db.com\nOksana Poltavets\nPhone: +1 212 250 0072\nE-Mail: oksana.poltavets@db.com\n\nDeutsche Asset Management\nWith EUR 711 billion of assets under management (as of September 30, 2017), Deutsche Asset Management¹ is one of the world’s leading investment management organizations. Deutsche Asset Management offers individuals and institutions traditional and alternative investments across all major asset classes.\n¹ Deutsche Asset Management is the brand name of the Asset Management division of the Deutsche Bank Group. The respective legal entities offering products or services under the Deutsche Asset Management brand are specified in the respective contracts, sales materials and other product information documents.\n© Deutsche Asset Management. All rights reserved.\nPast performance is not indicative of future returns. There is no assurance provided that investment objectives will be achieved. Not all products and services are available in all jurisdictions.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}