{
    "url": "https://www.db.com/news/detail/20240307-empowering-women-in-asian-agriculture?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 7, 2024",
    "tags": [
        "Asia-Pacific",
        "Corporate Citizenship"
    ],
    "title": "Empowering women in Asian agriculture",
    "body": "Deutsche Bank, through its Corporate Responsibility programme in Asia, is helping women from local communities and social entrepreneurs break the bias, access opportunities, and create impact in their fields. \nClosing the gender divide in agriculture\nFarming in Asia is mostly a male-dominated sector. Women make up 43% of the global agricultural labour force. Yet they face significant gender barriers such as lack of access to funds, agricultural training, and latest technology.\nWith climate change impacting food production in the region, it’s now more crucial than ever to provide women farmers with the resources to help them feed the world.\nHere’s how Deutsche Bank is inspiring inclusion in the agriculture sector in Asia, and helping women improve their livelihoods:\nPhilippines: Supporting careers in food production\nIn the Philippines, Deutsche Bank partners with Gawad Kalinga to provide scholarships to young people to prepare them for a future in agriculture and food production. 25-year-old Mary Kris L. Alinsub, is one of these scholars. The scholarship gave her an education in the School for Experiential and Entrepreneurial Development (SEED Philippines), the pioneering nationwide agri-education school system for the rural poor.\nRaised in a farming family, the scholarship has opened new opportunities in her career. She has obtained the Technical Education and Skills Development Authority (TESDA) National Certificate on Organic Agricultural Production. Her next goal is to find stable work to provide for her entire family and contribute to her community meaningfully.\nMary Kris L. Alinsub, Philippines\nIndia: Enabling transformation of organic waste to increase farming yield\nIn India, the bank provides funding for women farmers like Barfi Devi to access new farming equipment such as a bio-digester, which converts organic waste into biofertilizer and biogas. This reduces significant costs for Barfi while having a positive environmental impact.\nTogether with Centre for Microfinance, Deutsche Bank funded the installation of a bio-digester in her farm. This is an environmentally sustainable system that transforms natural waste, such as cow dung, into biofertilizer and biogas. The high quality organic biofertilizer can then be used in fields, increasing the productivity and the yield. Another by-product of the process, biogas, is a renewable energy that can be used for cooking. As energy costs rise, the cost saving here is significant. This further enables Barfi to invest in expanding her agricultural portfolio and build a brighter future for her family.\nBarfi Devi, India\nSri Lanka: Supporting sustainable honey production\nDeutsche Bank works with NGO Ruk Rakaganno to help women like Sumanawathie in rural communities in Sri Lanka to set up sustainable bee honey production. This serves as an additional revenue stream in the face of rising cost of living.\nHoney is a valued commodity in Sri Lankan households, used both as a sweetener and an ingredient in indigenous medicine. It is typically obtained through a process called “honey hunting”, that leads to the destruction of hives with a drastic environmental impact. Ruk Rakaganno offers a sustainable alternative, providing women with the infrastructure and training they need to raise bee colonies. Sumanawathie hopes that this initiative can help educate children on the importance of environmental conservation and bring the community closer together through awareness of the process.\n\nRuk Rakaganno, Sri Lanka",
    "number_of_ratings": 3,
    "rating": 4.7,
    "likes": 15
}