{
    "url": "https://www.db.com/news/detail/20220908-deutsche-bank-research-receives-top-rankings-in-institutional-investor-survey?language_id=1",
    "language": "EN",
    "article_type": "News Research",
    "publish_date": "September 9, 2022",
    "tags": [
        "Europe",
        "Awards",
        "Research"
    ],
    "title": "Deutsche Bank Research receives top rankings in Institutional Investor survey",
    "body": "Deutsche Bank Research has received two prestigious rankings in the Institutional Investor, 2022 All-Europe Research Team survey.\nDeutsche Bank’s European Equity Research Team was ranked No.1 in Germany Research by Firm, up from No.3 in 2021, with a 20 percent share of the votes. This represents a return to the top-ranked position in our home market for the first time since 2017.\nTim Rokossa, Head of Company Research, Germany, and Head of Auto Research secured the team’s second No.1 spot. His achievement is the first No.1 Germany Research by Analyst ranking. Rokossa said: “My name might be the one listed, but it was a group effort without a doubt. Collaboration between the different teams on the research and sales sides is key to delivering top-class results in these very competitive markets, particularly in the context of an entire country. We are truly grateful that our clients appreciate that”.\nIn addition to the top two rankings, the European Equity research team grew its market share of the overall vote in a voting pool that was up 10% since last year.\nGerry Gallagher, Head of European Equity Research, said: “These rankings and the vote improvements return us to the top position in our home market and signal that our innovative equity model, a core offering of the Investment Bank, is delivering the value and connectivity to our clients that we strive for every day.”\nA few of the stand-out research reports in 2022 that have contributed to Deutsche Bank Research’s strong result include:\n– Russia-Ukraine: What if...: Impact on European Equity\n– Gas & Germany: Winter is coming\n– Crisis Update: Zeitenwende – Geopolitical Turning Point\n  Institutional Investor is a leading international business to business publisher, focused primarily on international finance. Those with access to Institutional Investor can access and read the full results of the survey on their website. ",
    "number_of_ratings": 27,
    "rating": 2.4,
    "likes": 27
}