{
    "url": "https://www.db.com/news/detail/20220907-christian-sewing-s-keynote-at-the-handelsblatt-banken-summit-2022?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 7, 2022",
    "tags": [
        "Company"
    ],
    "title": "Christian Sewing's keynote at the Handelsblatt Banken Summit 2022",
    "body": "Dear Mr Matthes, Ladies and Gentlemen, \nI am delighted to be with you today at a time that is more challenging than anything I have experienced in more than 30 years of banking.  While the Covid pandemic proved to be a temporary shock to the world economy, Russia's war against Ukraine has destroyed a number of certainties on which we built our economic system over the past decades. \nThe brakes have been applied to globalisation and, in the face of major geopolitical tensions, it is unlikely to pick up its old momentum any time soon. \nAs a result, many seemingly perfect global value and supply chains have been disrupted.  \nThe workforce, which for a long time was thought to be available without limit, has become a bottleneck factor worldwide. \nAt the same time, electricity and gas have become scarce and extremely expensive. Energy is set to stay an expensive commodity in Europe for some time. This represents a structural competitive drawback and it is a threat to our economy. In the long term, we will need to respond with structural solutions.  \nThese points are the most important reasons for soaring inflation. As a result, we will no longer be able to avert a recession in Germany.  \nYet we believe that our economy is resilient enough to cope well with this recession – provided the central banks act quickly and decisively now. Right now many people still have their savings to fall back on to pay the higher prices; many companies are still sufficiently financed. But the longer inflation remains high, the greater the strain and the higher the potential for social conflict.  \nThree lessons \nThis combination of short and longer-term challenges seems unique at this point. And while it is essential we meet the short-term needs, we also have to explore what this means for our long-term ability to compete.  The greatest complexity still lies ahead of us when we begin to draw the real lessons of the past few years. In my view, there are three main lessons:  \nFirstly, we have seen how dangerous it is for us in Europe to become too dependent on individual countries or regions. At the moment the main focus is on energy and raw material imports from Russia – and rightly so. We must do everything we can to ensure that our cars, our heating and our factories are not only able to run when an autocrat in the Kremlin is favourably disposed towards us. All efforts by politicians and companies to change this deserve unconditional support.  \nThat is not enough, though. When it comes to dependencies, we also have to face the awkward question of how to deal with China. Its increasing isolation and growing tensions, especially between China and the United States, pose a considerable risk for Germany.  \nChina is a cornerstone of our economy. About 8 percent of our exports go to China and 12 percent of our imports are from the country. More than a tenth of the sales of all DAX-listed companies are from China. At the latest during the pandemic it has become clear just how much our supply chains rely on China. Reducing this dependency will require a change no less fundamental than decoupling from Russian energy.  \nAt the same time – and this is my second lesson – we need to tackle the climate crisis with much more resolve than to date.  Climate change is already causing damage of gigantic proportions. In light of Covid and the war in Ukraine, the danger is that the topic will slip down the list of priorities. That would be the biggest mistake we could make, though. Fighting the climate crisis is a generational task that will radically change the economy and society. Every company will have to face the issue – not just out of its responsibility to society, but to secure its own continued existence. Those who fail today to put sustainability firmly at the centre of their strategy will – in ten years – have trouble selling their products, finding employees or attracting investors. They will disappear from the market.  \nThe third lesson, I believe, is that we have been under the illusion for the past 30 years that we could live forever in an ever more globalised world with no major conflicts and with steady growth.  Francis Fukuyama has often been criticised for equating the end of the Cold War with the \"end of history\". But de facto we acted as if this thesis was correct; we have been acting as if the world was on its way to becoming one big village where everyone is interested in economic cooperation because, after all, everyone benefits from it. That has stopped being the case for some time now, though. \nThe truth is that 30 years of presumed calm will now be followed by a period of heightened volatility with economic uncertainty, regular crises and geopolitical conflicts that are also likely to drag on for decades. Trouble spots are not cut off from the rest of the world; they impact other regions in a number of ways. As such, we must come up with holistic solutions that take this degree of interplay into account. Dealing with this complexity will be a great challenge for us. Good risk management is the order of the day. \nWe must not leave the playing field and with it the access to global capital markets largely to foreign banks. The past few months should have taught us this. In Germany, we must not allow ourselves to add a further dependency – access to finance – to our current dependencies on gas, raw materials and supply chains.\nChristian Sewing, CEO\nNational feat of strength  \nLet us not delude ourselves: we certainly have our work cut out for us if we are to accomplish these three tasks – reducing dependencies, dealing with permanently higher volatility and driving the historic transformation of our economy.  We will only succeed through a concerted joint effort, with politics, business and society all working closely hand in hand.  \nThe financial sector must and can play a crucial role.  \nWe need banks that are able to finance these mammoth tasks, while protecting their clients against risks and being reliable partners, accompanying clients worldwide.\nAnd for this we need a domestic financial sector that stands on its own two feet and can assert itself against its global competitors. We must not leave the playing field and with it the access to global capital markets largely to foreign banks. The past few years should have taught us this. In Germany, we must not allow ourselves to add a further dependency – access to finance – to our current dependencies on gas, raw materials and supply chains.\nWe have the means to prevent this, but we still have much to do. As a financial sector, we have already achieved a lot: we are much more stable and resilient today than we were ten years ago. We are profitable. Our industry has foregone relatively little profit in the first half of the year and even managed to increase revenues. And the loan defaults that the industry faces in the coming months should remain manageable because banks have taken the necessary provisions. \nProgress in the financial sector is far from sufficient \nThat is far from enough, though, if the German financial sector is to play a leading role in the long term. What we need is: \nFor us banks to work harder at becoming even more efficient and focusing even more on clients, especially in digital services. \nWe need reliable regulation that does not always create higher hurdles and tie up more capital than necessary – capital that is needed right now to finance the economy. \nAnd sooner or later we will also need consolidation, not nationally, but Europe-wide. Size counts in banking – and if we don't want to hand over the playing field to the Americans, Europe must create the right conditions for big banks. I can only repeat what I’ve said before: both the European banking union and the capital markets union are essential here.  \nThe above points are not new, but they are becoming more urgent. We are actually very well equipped so there is no reason to talk ourselves down. We are operating in an economy that has shown enormous resilience and that will also navigate the upcoming recession – because corporate balance sheets are strong, and debt is low by international standards. This economy has great potential as long as we focus now on aligning ourselves for the long term and on how to minimise the threat of de-industrialisation: with less regulation, more courage and more pragmatism; this attitude is incredibly important.  \nAnd that goes for banks, too. We have proven banks can be part of the solution.  We can do much more, though. Before the financial crisis of 2007, just 15 years ago, Europe's banks were more profitable than their competitors in the US. Since then, the Americans have unrelentingly left us behind. We could, of course, agonise over this. Instead, we should rather see it as an incentive to buck the trend. The dominance of American banks is no law of nature. \nAt Deutsche Bank, we are convinced that the way to achieve this is by being a strong partner to our clients. They need a bank that supports them in all kinds of environments, in all markets and all over the world. This is what we emphasised when we formulated our Global Hausbank aspiration. We have radically transformed our business since 2019 and strategically repositioned ourselves in line with this aspiration.  \nWe are convinced that this strategy will be especially effective in volatile times – because now is the moment when advice and expertise are highly sought after. \nAnd this does not apply to us alone. Despite all the differences between the banks in Germany, we have one thing in common: we were there for our clients during the pandemic, we were there for our clients when Russia invaded Ukraine and we continue to be there – in these volatile times that urgently call for sustainable transformation. We have regained a great deal of trust. Let us work together to create the conditions for renewed dynamic growth across our entire economy. ",
    "number_of_ratings": 46,
    "rating": 3.3,
    "likes": 35
}