{
    "url": "https://www.db.com/news/detail/20220907-deutsche-bank-announces-expected-acceptance-amount-for-public-tender-offer?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, September 7, 2022",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank announces expected acceptance amount for public tender offer",
    "body": "Deutsche Bank Aktiengesellschaft (XETRA: DBKGn.DE/NYSE: DB) announces a total expected acceptance amount of 1.1 billion euro equivalent for its public tender offer for five series of its senior non-preferred bonds.\nThe tender offer encompassed the following securities:\nCoupon  Currency Maturity Date ISIN\n1.625% EUR January 2027 DE000DL19U23\n0.75% EUR February 2027 DE000DL19VT2\n1.875% EUR  February 2028 DE000DL19WL7\n1.375% EUR February 2032 DE000DL19VU0\n1.875% GBP December 2028 XS2303762475\nThe tender offer was announced on 30 August 2022 and expired on 6 September 2022. Deutsche Bank will price the transaction today.\nInformation is available on Deutsche Bank’s Investor Relations website under https://www.db.com/ir or by contacting +49 800 910-8000.\nNo offer or invitation to acquire any bonds is being made pursuant to this announcement. The tender offer is being made pursuant to a Tender Offer Memorandum dated 30 August 2022 (the “Tender Offer Memorandum”) and is subject to restrictions in certain jurisdictions, as fully described in the Tender Offer Memorandum. The distribution of this announcement and the Tender Offer Memorandum may be restricted by law in certain jurisdictions. Persons into whose possession this announcement and/or the Tender Offer Memorandum comes are required to inform themselves about, and to observe, any such restrictions. Requests for the Tender Offer Memorandum relating to the tender offer may be directed to the Tender Agent: Kroll Issuer Services Limited (phone: +44 20 7704 0880, attention: Arlind Bytyqi / Jacek Kusion; email: deutschebank@is.kroll.com)",
    "number_of_ratings": 3,
    "rating": 2.7,
    "likes": 2
}