{
    "url": "https://www.db.com/news/detail/20220905-deutsche-bank-s-chief-investment-office-appoints-cio-emea-completing-global-cio-team?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 5, 2022",
    "tags": [
        "Africa",
        "Europe",
        "Middle East",
        "Personnel announcements",
        "Private products",
        "Wealth"
    ],
    "title": "Deutsche Bank’s Chief Investment Office appoints CIO EMEA, completing global CIO team",
    "body": "Deutsche Bank’s Chief Investment Office today announced the appointment of Zeynep Ozturk-Unlu as the Chief Investment Officer (CIO) for Europe Middle East and Africa (EMEA ex Germany) for the Private Bank. Her appointment completes the bank’s global team of CIOs.\nThe Chief Investment Office is committed to maintaining close connectivity with clients and local markets in every geographic region. With Zeynep’s appointment, the CIO team is represented by highly respected client facing investment and capital markets professionals in each region globally; Dr. Ulrich Stephan covering Germany, Zeynep Ozturk-Unlu covering EMEA (excluding Germany), Deepak Puri covering Americas, Stefanie Holtze-Jen covering Asia Pacific, Markus Müller as ESG CIO, and led by Global Chief Investment Officer, Christian Nolting.\nDeutsche Bank’s Global Chief Investment Officer Christian Nolting said: “We are delighted to welcome Zeynep Ozturk-Unlu to Deutsche Bank’s Private Bank in the role of Chief Investment Officer, EMEA. Attracting someone of her calibre speaks volumes about our attractiveness as a leading European bank with global reach, and the business unit’s strategic growth path.”\nOzturk-Unlu joins Deutsche Bank in London from Citi where she spent 22 years of her career, most recently in New York as Head of Capital Markets Americas, leading North America and Latin America. Previously she was with Citi Private Bank in London as EMEA Capital Markets Head Fixed Income, and before that as Citi’s Head of Central Eastern Europe and Turkey cross-asset sales in institutional markets. A native of Turkey, she began her career in corporate banking in Istanbul.  \nAs CIO EMEA, Ozturk-Unlu will play an important role presenting the CIO view to clients and other stakeholders, including the media. She joins our Multi Asset Investment Committee (MIC) as a voting member and is responsible for developing the Europe Middle East Africa (ex Germany) part of the CIO house view.    \n“Zeynep Ozturk-Unlu plays a key role in our global CIO structure, and brings a wealth of EMEA local markets experience and insight for the benefit of our private banking and wealth management clients across the EMEA region,” Nolting added.\nOzturk-Unlu reports to Global Chief Investment Officer Christian Nolting, effective immediately.",
    "number_of_ratings": 4,
    "rating": 4.0,
    "likes": 22
}