{
    "url": "https://www.db.com/news/detail/20220905-deutsche-bank-to-open-representative-office-in-bangladesh?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 5, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank to open representative office in Bangladesh",
    "body": "Deutsche Bank is expanding its global network with the launch of its first representative office in Dhaka, Bangladesh. With this new market entry, Deutsche Bank’s regional footprint in Asia Pacific will soon span 15 diverse markets.\nResponding to strong client demand for trade finance support in this fast-growing country, Deutsche Bank will commence operations in Bangladesh shortly. The representative office will focus on supporting multinational corporate clients, predominantly exporters to Bangladesh. The bank has hired Syed Naushad Zaman, previously Deputy Head of the Commerzbank Representative Office in Bangladesh, to lead its business in the country.\n“We continue to grow and invest in our business in Asia Pacific,” said Deutsche Bank Chief Executive Officer for Asia Pacific and Member of the Management Board Alexander von zur Muehlen. “We are proud that in our 150th anniversary in Asia Pacific, we are welcoming a 15th market to our strong regional network.\"\nBangladesh is a great example of the significant opportunity that we see for our platform in the region. With its fast-growing economy we enter this market to support its increasing participation in regional and global trade. \nAlexander von zur Muehlen\nAtul Jain, Deutsche Bank Global Co-Head for Trade Finance and Lending, added, “Bangladesh is an increasingly strategic market for both our global multinational and German corporate clients. This representative office reflects our firm commitment to support our clients’ evolving risk management and financing needs in this dynamic growth market.”\nAccording to the Embassy of Bangladesh, Germany is the largest trading partner of Bangladesh in Europe and the second largest globally. German exports to Bangladesh have tripled in the past 25 years. In 2021 German exports to Bangladesh recorded a 45 per cent increase to US$ 877 million. At almost US$ 400 million, just under half of this was machinery and equipment.",
    "number_of_ratings": 11,
    "rating": 4.7,
    "likes": 15
}