{
    "url": "https://www.db.com/news/detail/20220901-deutsche-bank-india-announces-200-engineering-scholarships-for-women?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "India, September 1, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank India announces 200 engineering scholarships for women",
    "body": "Deutsche Bank announced a partnership with Smile Foundation to provide engineering scholarships to 200 young women from low-income backgrounds in India. The students, from Bengaluru, Jaipur, Mumbai, and Pune, will receive funding for a four-year engineering course at select colleges across the cities.\nFirst-year engineering students with an annual family income of less than 500,000 rupees (approx. 6,200 euros) and with an aggregate score of 60 percent or higher in their secondary and higher secondary examinations will be eligible to apply.\nAfter a thorough interview and screening process, successful candidates will receive a scholarship of up to 100,000 rupees (approx. 1,240 euros) per year, a laptop, career training and assistance with internships and job placements. Along with the training provided by Smile Foundation, Deutsche Bank’s staff volunteers will provide mentorship and support to the students over the four year-period.\nThe application process for students in Bengaluru starts today and will begin in other cities in the coming weeks.\n“Young women from low-income families face an uphill task when trying to purse their dreams. Those who can continue to pursue higher education often juggle responsibilities at home with a demanding curriculum and financial pressure. This can be overwhelming and result in high dropout rates. Through the Deutsche Bank Engineering Scholarship, we hope to help some of these talented young women fulfil their ambitions,” says Khurshed Dordi, Deutsche Bank’s Group Chief Operating Officer for India.\n\"At Smile, we strongly believe that when girls and women get equal opportunities, they have the potential to lead change in their families, communities and propel the progress of our country. We are thankful to Deutsche Bank for extending their support for this very special initiative, in addition to the amazing partnership we have had for our mobile healthcare programme,\" says Santanu Mishra, Co-founder & Executive Trustee, Smile Foundation.\nOver the last five years, Deutsche Bank has partnered with Smile Foundation to address the primary healthcare needs of more than 520,000 individuals in slums and villages in Bengaluru, Jaipur, Kalyan, Mumbai, and Pune. At the peak of the Covid pandemic, Deutsche Bank also provided funding to help Smile Foundation distribute 4,600 covid screening kits to frontline health workers in public health institutions.",
    "number_of_ratings": 8,
    "rating": 5.0,
    "likes": 59
}