{
    "url": "https://www.db.com/news/detail/20221026-a-message-from-christian-sewing-on-q3-results-2022?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 26, 2022",
    "tags": [
        "Financial Results",
        "Strategy"
    ],
    "title": "A message from Christian Sewing on Q3 results 2022",
    "body": "Dear Colleagues,\n\nBeing there for our clients when they need us most has been our rallying cry for years. This past quarter we showed what it means when we truly live up to this. We stayed close to our clients in this very difficult economic situation. We helped them with their liquidity needs, we helped them mitigate risk and react to a rapidly changing environment. Our clients greatly appreciate this and it is also driving the demand for many of our services.\n\nThe results we published today reflect this. Our pre-tax profit of 1.6 billion euros is not only nearly three times as much as in the same period a year ago, it is also the best third quarter result since 2006. Our nine-month profit, which amounted to 4.8 billion euros before taxes, is the highest in 11 years.\n\nThis is an outstanding result of which we can all be proud. It reflects the strength that our bank has developed in recent years. It is based on an increase in revenues to 6.9 billion euros, 15 percent higher than in the third quarter of 2021. We owe this growth to momentum across all our business divisions. The past quarter saw particularly strong revenue growth in the Corporate Bank (+25 percent) and the Private Bank (+13 percent) which benefited from additional business and higher interest rates. However, revenue growth in the Investment Bank (+6 percent) is also impressive; year on year, we were able to more than offset the industry-wide drought in the Origination & Advisory business with even stronger growth in Fixed Income & Currencies. Our Asset Management division performed well with a one percent revenue increase despite plunging asset prices on many financial markets.\n\nThese results continue the positive trends of recent quarters. On behalf of the Management Board, I would like to thank you all. Since we announced our strategy in July 2019, we have never let ourselves be distracted from our path, though we have seen significant changes and macroeconomic shocks in the last two years.\n\nThis discipline, this continuity and this irrepressible will to move our bank forward are truly impressive. They have put within immediate reach the goals we formulated for the end of 2022, above all for the profitability of our business. We want to earn a post-tax return on tangible equity of 8 percent this year. After the third quarter, we are even slightly above this figure. We can actually achieve what many observers thought was out of reach even well into the current year. This would further strengthen confidence in us, following on from another upgrade of our ratings by Moody's two weeks ago that already gave us a strong boost.\n\nBut to instill confidence in our sustainable profitability, it is also essential that we continue to pay close attention to costs. This is even more true in the current environment, with prices rising worldwide. In the third quarter, we demonstrated how this price surge can be offset by savings. Adjusted costs rose by 4 percent excluding transformation costs and bank levies. If you strip out currency effects, costs were one percent below the previous year's level, despite the fact that we continued to make targeted investments in our business, controls and technology.\n\nWe must not let our guard down because cost pressure will remain high for some time. We will therefore continue to scrutinise expenditure carefully, just as carefully as we monitor our risks in view of the difficult economic environment. Here we once again demonstrated our strength in the past quarter; through active risk management, we were able to keep all risk ratios stable at the levels they were at before the Russian invasion of Ukraine. This is a remarkable result.\n\nWe increased our credit loss provisions to 350 million euros in the third quarter. However, we remain convinced of the quality of our loan book and have confirmed our full-year forecast of credit loss provisions of around 25 basis points of the average loan volume.\n\nThanks to this solid balance sheet, our continued robust CET1 ratio of 13.3 percent and plentiful liquidity reserves far above regulatory requirements, we feel very well prepared for what lies ahead. Looking at what we have achieved together also makes me optimistic. Just over three years after we started our transformation, our strategy is demonstrating a big impact; our bank is more balanced with four strong and growing businesses, our profitability makes us resilient and gives us flexibility and we have a world-class team that delivers excellence to our clients around the world every day.\n\nTogether, we have reached many milestones in recent years. The next one is now ahead of us in the coming weeks, bringing this successful year to an equally successful end. I look forward to working with you to achieve this goal, knowing how much we can rely on you.\n\nBest wishes,\nChristian Sewing",
    "number_of_ratings": 24,
    "rating": 4.6,
    "likes": 23
}