{
    "url": "https://www.db.com/news/detail/20221005-how-we-live-turning-the-tide-to-protect-marine-life?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 5, 2022",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "How We Live: turning the tide to protect marine life",
    "body": "The ocean is a vast ecosystem of marine life that supports the lives and livelihoods of more than three billion people around the world. Yet it’s under threat from climate change, environmental damage and pollution. Through conservation and education, our environmental impact programme How We Live is working to turn the tide.\nProtecting endangered marine species has a positive impact on land as well as beneath the waves. Those at risk include the sea turtle, which plays a critical role in maintaining coral reefs through its feeding habits. If the turtles aren’t there to remove sponges and debris from the surface of the reefs then the reefs die. The effects of that are far-reaching since reefs are not just central to all kinds of marine life — they also help shield coastal communities from rising sea levels and extreme weather. Home to some of the world’s most spectacular coral reefs and coastlines is the Asia Pacific region. In Indonesia, for example, we’re supporting a project that trains people from the local community to keep the nesting sites of sea turtles safe instead of hunting them, which creates jobs and helps preserve nearby reefs. Sea turtles are in danger in Europe, too, and we’ve teamed up with the World Wildlife Fund Italy to fund a rehabilitation centre for turtles injured by fishing equipment or boats.\nAs well as being the most important habitat below water, reefs are the most vulnerable, which is why we are focused on their conservation. An estimated 50 percent of coral reefs have been destroyed by human activity. Recycling the shells from oysters and mussels is an ingenious and entirely natural way to kickstart the growth of new reefs. How We Live is funding the first-ever research on reef conservation and restoration in China, which we hope will become the basis for education and legislation. And in our new partnership with The Nature Conservancy (TNC) we are supporting community conservation projects in Indonesia, Hong Kong SAR, Mainland China and Australia, which aim to safeguard wildlife species and replenish shellfish reefs.\nOn the other side of the world, education is also at the centre of a project to bring oyster reefs back to New York Harbor. The Billion Oyster Project engages students, volunteers and community members in its city-wide restoration movement. Oysters clarify the water as they feed, and large reef systems provide natural defence against storm damage. To date, more than 6,000 students from over 100 schools have engaged in hands-on learning opportunities to explore these principles in their own backyard. So, too, have Deutsche Bank volunteers, who have helped prepare shells – donated by local restaurants – to be used in the hatchery.\nAs the ocean’s filtration system, reefs also prevent pollutants from settling on the seabed and washing up onshore. One pollutant which reefs cannot get rid of is plastic. Every year, an estimated eight to twelve million tonnes of plastic flows into the ocean, causing immense harm to reefs and other marine life. As much as 80 percent of it enters the ocean via rivers, as litter picked up from cities and towns along the way. One solution to this is to remove the plastic before it arrives at the coast. In the UK, Deutsche Bank volunteers are getting involved in the Waterways Protection Project to clean up rivers and canals in London and Birmingham with expert charity, Hubbub Foundation. Our International Private Bank is focused on ocean conservation globally and has organised river clean-up events in Frankfurt, London, Madrid, Milan, Mumbai and New York in partnership with environmental NGO, River Cleanup.\nWhile focusing our Chief Investment Office research on the topics of ocean degradation and biodiversity loss, our clients are also helping us to make a difference, too. The Deutsche Bank Ocean Resilience Philanthropy Fund provides grants to projects that use science-backed and nature-based solutions to restore the ocean. One of the first organisations to receive funding is the Maldives Coral Institute. Its Future Climate Coral Bank research project aims to identify corals that are resilient to the effects of global warming, which can be used to build a gene bank for reef restoration globally.\nAbove or below water, every ecosystem depends on partnership, and we are working with others at country level and globally to magnify the impact of this programme for people and the planet. Deutsche Bank is the first bank to actively support the United Nations Decade of Ocean Science for Sustainable Development in Germany and the first bank to become a full member of the Ocean Risk and Resilience Action Alliance (ORRAA). By supporting these projects and others like them, we are playing our part in spurring on the global action required to achieve United Nations Sustainable Development Goal 14 — to conserve and sustainably use the oceans, seas and marine resources.\nMore information can be found on our How We Live website.",
    "number_of_ratings": 21,
    "rating": 1.9,
    "likes": 88
}