{
    "url": "https://www.db.com/news/detail/20221003-deutsche-bank-tops-asia-s-longest-running-bond-survey?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 3, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank tops Asia’s longest-running bond survey",
    "body": "Six Deutsche Bank employees emerged as top-ranked individuals at the 23rd Asian G3 Bond Benchmark Review, Asia’s longest-running fixed income survey.\nThe latest survey of the secondary Asia G3 bond market by Asset Benchmark Research drew the participation of more than 800 institutional investors, who nominated their top sell-side individuals by function: analysts, economists/strategists, sales and trading.\nDeutsche Bank’s Head of Asia Pacific Credit Analysis, Owen Gallimore, was named one of the top economists and strategists in Asia. Gallimore, who joined Deutsche Bank in November 2021, is a China onshore specialist who has been top-rated since 2015.\nDeutsche Bank rankings in the survey:\nTop 20 economists & strategists – No. 2: Owen Gallimore\nTop 20 traders – No. 5: Zhirong Chen; No. 11: Alissa Ren; No. 16: Chirag Srivastava\nTop 20 salespeople (Hong Kong) – No. 9: Anne Zhang\nTop 20 salespeople (Singapore) – No. 6: Aileen Ngui\nWe are grateful for the deep support we received from our clients, which speaks to the quality of our research and trading calls and significantly higher volumes we have achieved this year. \nOwen Gallimore.\n\"The investor feedback we have gotten is invaluable to us as we further strengthen our APAC credit trading franchise,” said Gallimore.\nAlissa Ren and Zhirong Chen have been on top of the rankings for the past three consecutive years or longer, while new entrants in the recent polls for trading and bond sales are Aileen Ngui, Anne Zhang and Chirag Srivastava.\nThe Asian G3 Bond Benchmark Review has been conducted annually since 1999. It provides data on the product needs of institutional investors and the market penetration of banks active in the Asian G3 bond and Asian CDS space.",
    "number_of_ratings": 3,
    "rating": 5.0,
    "likes": 6
}