{
    "url": "https://www.db.com/news/detail/20221002-japan-s-unique-exchange-traded-funds-purchasing-programme?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 2, 2022",
    "tags": [
        "Asia-Pacific",
        "Research"
    ],
    "title": "Japan’s unique Exchange Traded Funds Purchasing programme",
    "body": "Deutsche Bank's Japan Chief Economist Kentaro Koyama talks about the Bank of Japan’s unique Exchange Traded Fund Purchasing programme as a monetary easing tool in our latest “150 seconds on APAC” video.\nYou can also read the full transcript of the video here: \nThe Bank of Japan began purchasing equity Exchange-Traded Funds in 2010 as a monetary easing tool to help the equity market.\nQ.    How is Japan’s special ETF purchasing unique from other easing programs around the world?\nThe purchase of equity ETFs is a unique policy that no other major central bank has implemented. It also differs from traditional asset purchasing programs. For example, its price is highly volatile compared with sovereign bonds, and it has no maturity date. These features make the BoJ's exit strategy difficult.\nQ.    What is the impact of the progamme on equity markets?\nBased on our analysis, the impact of the BoJ's ETF purchases on aggregate stock prices is limited. Also, it shows strong return reversal after stock trended higher. This means that the impact of the purchases is temporary. This is consistent with the fact that the volume of purchases is small compared to sovereign bond purchases by BoJ. In other words, even if the BoJ were to end its ETF purchases, the impact on the aggregate stock market would be limited.\nQ.    How will expected and unexpected purchases affect the markets?\nExpected and unexpected purchases have different effects. In general, the BoJ tends to purchase ETFs when stock prices fall above a certain level in the morning session. If the purchases are unexpected based on this rule, the effect on the stock market gets larger. Having said that, headline CPI inflation exceeds 2% even in Japan. Inflation expectation of households and corporates is also rising. Given this situation, we believe that such emergency policies will need to be reviewed in the near future.",
    "number_of_ratings": 37,
    "rating": 1.6,
    "likes": 52
}