{
    "url": "https://www.db.com/news/detail/20160225-deutsche-bank-bafin-closes-major-special-audits?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "February 25, 2016",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank: BaFin closes major special audits",
    "body": "The German Federal Financial Supervisory Authority (Bundesanstalt für Finanzdienstleistungsaufsicht or “BaFin”) has informed Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) that it has closed several major special audits of the Bank. The special audits include those on interbank offered rates (IBOR), Monte dei Paschi di Siena and precious metals.\nAccordingly, BaFin does not see the need to take further action against the Bank or former and current members of the Management Board with respect to the closed special audits. The regulator cited the changes already implemented and further measures already taken or planned by the Bank as reasons for this decision.\nJürgen Fitschen, Co-CEO of Deutsche Bank, said: “We are pleased that with the closure of these special audits a substantial part of the ongoing supervisory investigations has been concluded. We take very seriously the findings of these special audits and the deficiencies that have been identified.”\nJohn Cryan, Co-CEO of Deutsche Bank, added: “We have taken many steps to improve our controls and processes and to strengthen the Bank’s governance. We will continue to work intensively to fullfil the requirements of BaFin and other regulators.”\nDeutsche Bank will continue to improve its processes and risk culture. The Management Board has already implemented a broad range of measures to remediate deficiencies. BaFin requires that the Bank must not cease its efforts and that it continuously reviews the effectiveness of these measures.\nThe Bank is committed to continuously adapting its processes to reflect internal and external changes. It will continue to review measures that it has taken to assess their effectiveness and may implement further changes.\nBaFin acknowledges that the Management Board of the Bank takes its criticism seriously and has clearly committed itself to eliminate the deficiencies and take remediation measures. BaFin requires the Bank to detail the planned measures further and implement them as soon as possible. The Supervisory Board increased the Management Board from eight to 10 members, embedding responsibility for each business division in the Management Board. In addition, the management is currently working to renew the Bank’s IT systems.\nJohn Cryan said: “We challenge and improve our processes continuously and will not cease to do so. We will implement all of the agreed measures in the near future and will keep regulators updated on our progress.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}