{
    "url": "https://www.db.com/news/detail/20160223-deutsche-bank-announces-successful-completion-of-euro-bonds-public-tender?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "February 23, 2016",
    "tags": [
        "Capital markets",
        "Company",
        "Investment Banking"
    ],
    "title": "Deutsche Bank announces successful completion of Euro-bonds public tender",
    "body": "Deutsche Bank (XETRA: DBKGn.DE/ NYSE: DB) announces the successful completion of the tender offer to repurchase up to EUR 3 billion of five Euro-denominated issues of senior unsecured debt securities. Against the spread / price targets communicated on 12 February 2016, Deutsche Bank decided to further increase the purchase price by 1.50-2.60 percentage points or respectively lower the spreads by 20-25 bps at which it accepts bonds within this tender offer.\nThe resulting accepted total volume amounts to EUR 1.27 billion of the total tendered amount of EUR 1.75 billion. Securities with a notional value of EUR 0.48 billion were tendered at levels tighter than the final purchase spreads / higher than the final purchase prices and were not accepted. The tender offer had been announced on 12 February 2016.\nWith this transaction, Deutsche Bank managed its overall wholesale funding levels and simultaneously provided liquidity to holders of the debt securities listed in the tender offer. The relatively low investor participation reflects the improving market sentiment and an investor preference to retain exposure to Deutsche Bank. Deutsche Bank expects to record a positive income in the first quarter of 2016 related to this transaction of approximately EUR 40 million.\nThe announced tender offer for the USD denominated securities remains open until 11 March 2016. Deutsche Bank plans to announce the early tender results for bonds tendered in the first ten business days of the offer period on 29 February 2016.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}