{
    "url": "https://www.db.com/news/detail/20160223-deutsche-bank-releases-annual-alternative-investment-survey-highlighting-hedge-fund-sentiment-and-allocation-trends-for-2016?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "February 23, 2016",
    "tags": [
        "Capital markets",
        "Company",
        "Corporate products",
        "Investment Banking",
        "Private products",
        "Wealth"
    ],
    "title": "Hedge fund sentiment and allocation trends for 2016",
    "body": "Deutsche Bank today released its 14th annual Alternative Investment Survey, one of the industry’s largest and longest standing hedge fund investor surveys. This year, 504 global hedge fund investors, representing USD 2.1 trillion in hedge fund assets, share their insights into their current sentiment and allocation plans for 2016.\n“Despite a challenging year for global financial markets and for hedge funds, investors remain committed to their hedge fund programs, with 41% planning to increase their hedge fund allocations in 2016,” said Ashley Wilson, Global Co-Head of Prime Finance at Deutsche Bank.\nGreg Bunn, Global Co-Head of Prime Finance at Deutsche Bank noted, “we are seeing greater demand for tailored strategies and products that cater to investors’ changing needs and requirements. More investors are looking to increase their allocations to products such as alternative beta / risk premia strategies, liquid alternatives, hybrid private equity / hedge fund vehicles and co-investment opportunities.\n“Investors are becoming increasingly sophisticated in constructing their hedge fund portfolios. The return dispersion seen in 2015 means that choosing the right manager and constructing the right portfolio is ever more critical, said Anita Nemes, Global Head of Capital Introduction at Deutsche Bank. “Investors are concentrating and redesigning their portfolios in search of less correlated, diversified return streams.”\nHighlights of Deutsche Bank’s 14th annual Alternative Investment Survey:\nHedge funds expected to deliver in 2016, with assets climbing to $3 trillion\nHedge funds are expected to outperform equity markets in 2016. Additionally, 41% of respondents plan to increase their hedge fund allocations during the year. Industry assets are expected to grow approximately 5% in 2016, surpassing $3 trillion.\nThe argument for hedge funds in pension funds’ portfolios remains compelling\nPension funds’ allocations to hedge funds are trending upward year on year. The average pension fund has an 8% allocation to hedge funds, up from 7% last year. Additionally, 71% of pension fund respondents utilise an investment consultant, compared to just 15% in 2010. This trend is contributing to a change in pension funds’ portfolio allocation tactics, including a more scientific focus on alpha versus beta and greater demands around operational excellence.\n2015 return dispersion: top quartile managers deliver double digit returns\n63% of respondents indicated their top quartile of hedge funds produced, on average, +10.0% or more in 2015. Meanwhile, almost half saw their bottom quartile of hedge funds lose, on average -5.0% or more for the year. Selecting the right hedge funds – those with a unique skill set, competitive advantage and true alpha proposition – is increasingly critical for investors. The return dispersion witnessed in 2015 is expected to drive respondents’ portfolio changes in 2016.\nPortfolio concentration continues: fewer managers, greater competition\nManagers today are competing for a place amongst an average of 36 funds (median: 25) versus 60 (median: 45) in 2008. Due to a scarcity of alpha and capacity concerns, more investors are concentrating their portfolios in search of higher returns, reduced overall costs and greater portfolio efficiency.\nInvestors increasingly embrace quantitative strategies\nOver two thirds of respondents invest in systematic strategies, including one in every two who plan to add to one or more quantitative sub-strategies in 2016. The largest investment consultants and pension funds are driving demand: 45% of these respondents plan to add to one or more systematic strategies, including quantitative equity market neutral, CTA, quantitative macro, quantitative equity and quantitative multi-strategy.\nMarket neutral is the new black\nThose managers that have demonstrated their ability to deliver alpha on both the long and short side of the book irrespective of market directionality are well placed to benefit from increased investors flows. After a strong year of performance, equity market neutral strategies are expected to be amongst the best performers in 2016, and are also the most in-demand. On a net basis, 32% of investors are increasing their exposure to fundamental equity market neutral (versus 17% last year), and 18% to systematic equity market neutral (versus 11% last year).\nAlternative beta / risk premia sees growing demand\n20% of respondents invest in alternative beta / risk premia strategies today, up from 15% last year and 8% the year prior. 60% of these respondents plan to grow their allocation in 2016. We are seeing some investors complement their core ‘alpha’ portfolios with more liquid and cheaper alternative beta / risk premia strategies in order to allocate risk capital more dynamically and efficiently.\nMulti-strategy, event driven and credit distressed strategies: manager rotation expected\nMulti-strategy and event driven strategies are amongst those strategies with the highest expected turnover in 2016. 16% and 20% of respondents plan to redeem from these strategies, respectively, while 9% and 18% plan to add. Additionally, 18% plan to add to credit distressed to add and 17% plan to reduce.\nHedge fund fees and cost considerations move in favour of greater alignment of interest\nManagement and performance fees have come down marginally, however investors will pay for quality. The average management fee that investors pay remains unchanged year on year at 1.63%, whilst the average performance fee has trended downward slightly during this period from 18.03% to 17.85%. Despite continued headline pressure on fees, 42% of investors say they would allocate to a manager with fees in excess of “2&20” for a new allocation.\nPartnership is key\nAs their expectations and requirements change, investors are increasingly looking to align themselves with strategic partners who have the experience, expertise and resources to help them manage their own portfolios, whether that is in the form of knowledge sharing and/or tailored strategies and products. More than two thirds of respondents placed “access to founders / CIOs / senior investment professionals” in their top three factors influencing the manager selection process.\nAdditionally, one third of respondents today have utilised the single investment funds to create more tailored solutions. Lastly, demand for non-traditional hedge fund products is on the rise, with a growing number of investors allocating to alternative UCITS strategies, alternative ’40 Act mutual funds, hybrid PE/HF vehicles, hedge fund run long-only and co-investment opportunities.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}