{
    "url": "https://www.db.com/news/detail/20160223-special-report-the-uk-und-eu-exit-emergency?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "February 23, 2016",
    "tags": [
        "Research"
    ],
    "title": "The UK & EU: Exit Emergency",
    "body": "It states: “While our baseline case is for the UK to vote to remain in the EU by a narrow majority, polls showing ‘leave’ gaining ground highlight the risk.”\nAhead of the referendum, delayed investment could be a mild negative for GDP, the report explains. “The biggest hit to output is likely to be felt immediately after a Brexit vote during the exit negotiations. In the longer term, the UK should adapt to life outside the EU: lower GBP, looser monetary policy (inflation permitting) and focus on trade with faster growing countries should come to the rescue.”\n“The draft renegotiation broadly accommodated the UK’s four requests of the EU. While there is a clear path to putting this agreement in place, contentious issues remain up for discussion ahead of the February 18-19 EU summit.\n“In the event of a Brexit, uncertainty will prevail until the exit terms become clear. In negotiating exit options, all of which have their shortcomings, the EU will need to strike a balance between ensuring continued strong trade with the UK but at the same time sending a clear message to other countries that withdrawal is not costless.”\nThe report asserts: “Our structurally bearish sterling view is based on a slowing of the UK cycle, renewed fiscal tightening and downside risks to UK capital inflows rather than political risks. A possible British exit from the EU another tail risk for the pound, however. A UK exit from the EU is likely to negatively impact sterling and may see our existing forecasts of GBP/USD 1.15 by end-17 and EUR/GBP 0.82 by end-19 front-loaded.”\nWith respect to rates, the report says: “We see an underperformance of UK cash in the run up to the vote, a steeper curve and gilts underperforming on a cross market basis. In the case of a vote to leave, expect more aggressive pricing of cuts at the very front end. Non-resident investors are likely to reduce inflows in the run up to the referendum, with the potential - should uncertainty and Brexit probability rise - of an increase in gilt outflows.”\nAs for equities, it says that “combining the projected changes in valuations and earnings per share (EPS) expectations over the coming year, we would pencil in 15% downside for the entire market and 26% for the domestic basket under a Brexit scenario.”\nIt concludes: “We see the EU referendum as a risk for bank equity performance principally because of the uncertainty of the implications of Brexit for the outlook of the UK economy, and for the legal and regulatory framework of providing financial services into and out of the EU.\n\"A weaker UK economy in the event of Brexit would likely hit profitability thanks to looser monetary policy and credit losses. While financial regulation is unlikely to change materially with the UK out of the EU, there is significant uncertainty over the implications for passporting of financial services into the rest of the EU.”\nPDF\nRead the full report here.\nContact\nBarbara Boettcher\n(+49) 69 910-31787\nbarbara.boettcher@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}