{
    "url": "https://www.db.com/news/detail/20160212-deutsche-bank-announces-public-tender?language_id=1",
    "language": "EN",
    "article_type": "Ad-hoc Release",
    "publish_date": "February 12, 2016",
    "tags": [
        "Capital markets",
        "Company",
        "Investment Banking"
    ],
    "title": "Deutsche Bank announces public tender",
    "body": "Deutsche Bank (XETRA: DBKGn.DE/NYSE: DB) announces a public tender offer to purchase certain series of EUR and USD-denominated senior unsecured debt securities.\n\nThe Bank's strong liquidity position allows it to repurchase these securities without any corresponding change to its 2016 funding plan.\n\nThe EUR tender offer encompasses the following securities and has a target acceptance volume of EUR 3bn.\n\nISIN\nDE000DB7XHM0\nDE000DB7XJB9\nDE000DB7XJC7\nDE000DB5DCS4\nDE000DB7XJP9\nThe USD tender offer encompasses the following securities and has a target acceptance volume of USD 2bn.\nISIN\nUS25152R2U64\nUS25152R2X04\nUS25152R2Y86\nUS25152RVS92\nUS25152RXA66\nUS25152RYD96\nUS25152RWY51\nUS25152CMN38\nThe tender offer is expected to be open for seven business days for the EUR denominated securities, and 20 business days for the USD denominated securities, subject to lower pricing for bonds tendered after day 10.\nInformation is available on Deutsche Bank’s Investor Relations website under https://www.db.com/ir and from the following sources:\nEUR: Deutsche Bank AG, London Branch (+44 20 7545 8011, liability.management@db.com). Requests for the Offer Documents may be directed to the Tender Agent: Deutsche Bank AG, London Branch (+44 20 7547 5000, xchange.offer@db.com)\nUSD: Deutsche Bank Securities Inc. at +1 (866) 627-0391 (toll-free) or +1 (212) 250-2955 (collect). Requests for the Offer Documents may be directed to Global Bondholder Services Corporation, which is acting as the Tender Agent and Information Agent for the Offers, at +1 (212) 430-3774 or +1 (866) 470-3700 (toll-free).\nDeutsche Bank AG\nTaunusanlage 12\n60325 Frankfurt am Main\nGermany\nISIN: DE0005140008\nWKN: 514000\n\nListed: Regulated market in Berlin-Bremen, Düsseldorf, Frankfurt (Prime Standard), Hamburg, Hanover, Munich and Stuttgart; EUREX; NYSE\nThe International Securities Identification Numbers (ISINs) of further financial instruments issued by Deutsche Bank AG, and admitted to trading on a domestic organized market or for which such admission has been applied for, are listed in the attached PDFs.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}