{
    "url": "https://www.db.com/news/detail/20220131-deutsche-bank-and-the-development-guarantee-group-sign-memorandum-of-understanding-to-tackle-climate-financing-gap-for-developing-countries?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "January 31, 2022",
    "tags": [
        "Investment Banking",
        "Sustainability"
    ],
    "title": "Deutsche Bank & The Development Guarantee Group sign Memorandum of Understanding to tackle climate financing gap for developing countries",
    "body": "Deutsche Bank today announced it has signed a memorandum of understanding with the Development Guarantee Group (“DGG”).  Under the agreement, Deutsche Bank will act as an Origination Partner for the Green Guarantee Company (“GGC”), which will be managed by DGG. GGC is a specialist guarantor for climate mitigation and adaptation projects in developing countries. \nClaire Coustar, global head of ESG FIC, Deutsche Bank said: “As we work towards the critical goal of keeping warming to 1.5 degrees, there is a real need for greater mobilisation of private capital to emerging and developing countries. The guarantees that the GGC provides make green bonds and loans issued to finance green projects in developing countries investment grade, and therefore more compelling to a broader group of global investors.”\nShe continued: “As a founding signatory to the Net Zero Banking Alliance and contributor to the GFANZ taskforce ‘Mobilising Private Capital to EM&DCs’, Deutsche Bank understands the transition funding needs present in the global emerging markets. We look forward to our partnership with the Green Guarantee Company to facilitate access to long-term, cost efficient funding for our clients.”\nLasitha Perera, Co-Founder, The Development Guarantee Group said: “We are delighted to be partnering with Deutsche Bank and to benefit from its extensive experience in delivering innovative financing solutions for its clients in emerging and developing countries as well as global institutional investors. Climate-related infrastructure in global emerging markets represents a significant opportunity for global institutional investors.”\nShe added “However, this opportunity remains relatively unexplored due to a perception of risk that is usually higher than the actual reality on the ground. Addressing this information asymmetry by providing guarantees to global institutional investors is how the Green Guarantee Company is looking to work with Deutsche Bank to close the existing climate finance gap and contribute to protecting our planet.”\nPlease use the contacts on the right, or:\nThe Development Guarantee Group           \nMedia Relations\nMaria-Pia Kelly\nCommunications Manager",
    "number_of_ratings": 3,
    "rating": 1.0,
    "likes": 3
}