{
    "url": "https://www.db.com/news/detail/20220128-a-greener-future-for-china?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 28, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "A greener future for China?",
    "body": "China’s climate goals are to hit peak carbon dioxide emissions before 2030 and achieve carbon neutrality by 2060. This sets the stage for making green investment and financing the most important market theme in the coming decades, says Deutsche Bank Research China Strategist Linan Liu.  \n A greener 2021\nHigh-quality green development was a key theme in the country’s Five-Year Plan (2021-2025) last year. In 2021, real GDP growth in China was 8.1 percent year on year and it was notably greener compared with 2020, said Liu. \n“First, energy intensity (energy consumption per unit of GDP) fell by 2.7 percent year on year; second, clean energy consumption (natural gas, hydro/nuclear/wind/solar power) accounted for 25.3 percent of total energy consumption, up by one percentage point from 2020; and third, output of new energy cars and solar powered batteries rose by 145.6 percent and 42.1 percent year on year,” Liu explained.\nDeutsche Bank’s Asia Research team expects China’s energy intensity to continue decreasing.  \nAccelerating green in 2022 \nChina’s so-called “1+N”  policy framework that aims to facilitate its peaking and neutrality goal is set to continue in 2022. “We see more policies connecting to 1+N,  with clear targets and effective measures, including specific green transition plans for energy, industry, transportation, agriculture and urban and rural construction,” says Liu.\nLiu expects fiscal stimulus spending to focus on green infrastructure investment in 2022, mostly in new areas such as clean energy, digitalisation, the data centre industry and 5G wireless networks.\nIndustry experts estimate China's average annual green financing demand to be between 2.5 and 16 trillion renminbi before 2060. As green investment accelerates in 2022, so will the structure and breadth of China's green finance market, Liu says. \nWhich green sectors will China invest in? \nAccording to Liu, clean energy comes out on top. This includes solar and wind power, as well as other renewable sources, including but not limited to hydro, nuclear power and hydrogen energy.\nTo make travel greener, China needs to build more charging stations for electrical vehicles and more inter-city and commuter rail lines. There is also immense potential to apply carbon capture, utilisation and storage (CCUS) technology to China's carbon-intensive industries, says Liu. ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}