{
    "url": "https://www.db.com/news/detail/20220127-against-exclusion-and-forgetting-we-show-the-light?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 27, 2022",
    "tags": [
        "Corporate Citizenship",
        "Diversity",
        "History"
    ],
    "title": "Against exclusion and forgetting – We show the light",
    "body": "Since 2019, Deutsche Bank, together with football club Borussia Dortmund, Daimler, Deutsche Bahn and Volkswagen, has been supporting the expansion of the Yad Vashem Holocaust memorial in Israel. For this year's Holocaust Memorial Day on 27 January, the Bank is participating in a \"Show the Light\" sticker campaign by the Friends of Yad Vashem in Germany: 80,000 stickers depicting a Hanukkah menorah were distributed to all readers of the daily newspaper \"Kieler Nachrichten\" this week and are intended to set an example against exclusion, violence and forgetting.\nRahel Posner photographed the hanukkiah shown here to mark Hanukkah in 1931. It stands at a window of her flat, with a Nazi flag hanging opposite. Her husband Arthur Posner was the last rabbi in the north German city of Kiel before the Holocaust. His open letter protesting against the first posters that went up saying \"No entry for Jews\" had appeared in local newspapers. This put him at odds with the Nazi party, and ultimately led to the Posner family fleeing to what is now Israel.\nKiel’s daily newspaper has distributed thousands of stickers depicting Rahel’s hanukkiah, asking people to stick it to their window and post a photo on social media as a sign against exclusion, violence and forgetting. Today, the photo and the candle holder are both in the Yad Vashem memorial in Israel.\nThe \"Show Light\" campaign is also intended to be a new way of keeping memories alive. It is about taking a new look at individual fates with the help of exhibits from the Holocaust memorial Yad Vashem.\n\"It is our joint responsibility to find new forms of remembering,\" says Ruth Ur, Executive Director of the Yad Vashem Circle of Friends and initiator of the project.\nIn the last three years, Deutsche Bank has participated in several campaigns. Most recently with a commemorative event in Berlin for Holocaust Remembrance Day 2021.\n\"Our commitment to Yad Vashem is part of our corporate culture, which stands for openness and diversity. Discrimination must never again find a place at Deutsche Bank and in Germany. I’m pleased to join colleagues in setting an example with this photo,\" said Paul Achleitner, Chairman of the Supervisory Board of Deutsche Bank.",
    "number_of_ratings": 6,
    "rating": 2.2,
    "likes": 27
}