{
    "url": "https://www.db.com/news/detail/20220111-deutsche-bank-appoints-muriel-danis-as-global-head-of-product-platforms-and-sustainable-solutions?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "January 11, 2022",
    "tags": [
        "Sustainability"
    ],
    "title": "Deutsche Bank appoints Muriel Danis as Global Head of Product Platforms & Sustainable Solutions",
    "body": "Deutsche Bank’s (XETRA: DBKGn.DB / NYSE: DB) International Private Bank (IPB) today announced the appointment of Muriel Danis as Global Head of Product Platforms & Sustainable Solutions, effective March 14, 2022.\nClaudio de Sanctis, Global Head of the IPB and CEO EMEA said “Muriel Danis’ appointment is testament to our business’ ability to attract leading industry talent to our fast-growing product platform and reflects our ambition to become the house of choice for clients who wish to make positive social change. Her role will be a significant driver as we pursue delivery of the IPB’s ESG targets.”\nDanis joins Deutsche Bank with over 22 years of experience across Global Markets and Private Banking, most recently at HSBC in London as Global Chief Operating Officer in the Wealth Management division’s Products and Investment Groups.\nPrior to that, she held an array of roles, including Global Head of Advisory, as well as Global Head of Product Management and Business Development. She was also a Director in the Family Office Partnership, Middle East and Africa in Dubai. Before joining HSBC, she had a number of positions within Credit Suisse’s Private Bank and Global Markets divisions.\nIn this newly created role, Danis will be responsible for the continuous development of Deutsche Bank’s product and services platforms across the IPB’s client segments and will ensure robust governance across regions. This will include responsibility for trading and capital markets governance, funds, alternatives and accounts, cards and payments products as well as supporting the development of the IPB’s sustainable solutions in line with the commitments laid out at the Sustainability Deep Dive in May 2021.\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nStuart Haslam\n+44 7385 936262\nEmail: stuart.haslam@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 5
}