{
    "url": "https://www.db.com/news/detail/20160607-konzept-08-how-to-solve-europe-s-three-biggest-problems?language_id=1",
    "language": "EN",
    "article_type": "Research",
    "publish_date": "June 7, 2016",
    "tags": [
        "Research"
    ],
    "title": "konzept #08: How to solve Europe's three biggest problems",
    "body": "It is easy to\nbe gloomy about Europe’s future. Brexit and the refugee crisis loom large even as enduring problems such as Greece, moribund economic growth and a dysfunctional banking system defy comprehensive resolution. Hence, we devote the eighth issue of Konzept to propose some credible, if radical sounding, solutions to three of these seemingly intractable problems. Implementing these to ensure Europe’s long-term survival, however, requires policy makers and the public alike to jettison dearly-held beliefs, economic orthodoxy and dogma.\nFirst up we call for the European Central Bank to move interest rates back into positive territory and end its ever-looser monetary policy. Even if it was the right path once, today the balance of trade-offs weighs more heavily to the downside. There are distortions galore, savers punished, speculators rewarded and all the while governments across Europe have been let off the painful reform hook.\nLikewise with the refugee crisis in Germany we lay out the three key areas where nativists and liberals should be able to find common ground in order to move the immigration debate forward. Most importantly the issue of cost and iniquity can only be resolved via reforms to the welfare system whereby benefits are phased in for new arrivals.\nOur final feature article argues that utility-like regulation of the banking sector is proving counter-productive. Banks remain too nervous to lend, too burdened to provide market liquidity and too hobbled to finance entrepreneurial bets on the future. The deleterious effect on economic growth is becoming apparent to everyone.\nMoving beyond Europe, our shorter articles explain how driverless technology will boost demand for cars. We catalogue the investment implications of the anticipated weather shift from an El Niño to a La Niña pattern this year. Another article lays out the positive case for stock pickers as the active fund management industry faces tough questions. We investigate the growing trend of paying scrip dividends and our last article explains the battle that is raging over your next pay rise and its implications for the bond and stock markets.\nFinally, our infographic brings you back to Europe as we highlight how different the continent is in reality from people’s perception of it.\nDavid Folkerts-Landau, Group Chief Economist and Global Head of Research",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}