{
    "url": "https://www.db.com/news/detail/20160728-deutsche-bank-names-nicolas-moreau-to-be-the-management-board-member-responsible-for-deutsche-asset-management?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "July 28, 2016",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Deutsche Bank names Nicolas Moreau to be the Management Board member responsible for Deutsche Asset Management",
    "body": "Nicolas Moreau (51) will join the Management Board of Deutsche Bank, effective October 1, where he will be responsible for Deutsche Asset Management. This decision was reached by the bank’s Supervisory Board at its meeting today. Moreau is joining from the French insurance company Axa, where he has worked for 25 years in a variety of roles, including as Chief Executive Officer of Axa Investment Managers. Most recently he was in charge of the insurance company’s activities in France and served as a member of the Group Management Committee.\nAt Deutsche Bank Moreau will be based in London and will initially receive a three-year contract. He will succeed Quintin Price, who stepped down in June for health reasons. “Nicolas Moreau has a deep knowledge of the asset management industry, both from a supplier and a client perspective,” Supervisory Board Chairman Paul Achleitner said. “In addition he possesses a wealth of experience as a member of the management board of a complex, global financial institution, providing the ideal basis for further developing Deutsche Asset Management.”\nThe Supervisory Board also decided to appoint Kim Hammonds and Werner Steinmüller to the Management Board of Deutsche Bank with effect from August 1. Their terms will also initially be limited to three years.\nHammonds (49) has been employed by Deutsche Bank since November 2013. Under her leadership Deutsche Bank is executing a fundamental overhaul of its IT systems. Since the beginning of 2016, Hammonds has been responsible for the bank’s entire technology and operations, including digital transformation, information security, data management and corporate services. She will retain her role as Group Chief Operating Officer.\nSteinmüller (62) joined Deutsche Bank in 1991. Since 2004, he has been in charge of transaction banking. He will be the first Management Board member in the history of Deutsche Bank to be based in the Asia-Pacific region. Steinmüller will manage business in this growth region from Hong Kong. He will remain in his role as Chairman of the Supervisory Board of Postbank.\nAs a result of the addition of Hammonds and Steinmüller, the Management Board of Deutsche Bank will comprise 11 members in future. “With Werner Steinmüller, we have entrusted a highly experienced and well-regarded banker with further expanding our business in Asia,” Supervisory Board Chairman Achleitner said. “He is a long-standing expert in this key growth region.” Achleitner said that Kim Hammonds has succeeded in getting fundamental changes to the bank’s IT systems off the ground in recent years. “She is responsible for a division that is essential for the transformation of Deutsche Bank.”\nJohn Cryan, Chief Executive Officer of Deutsche Bank, welcomed the expansion of the Management Board: “Each of the three new members of the Management Board brings unique experience that strengthens us as a team. I’m pleased that Nicolas will add long-standing asset management experience to our board and that we are able to welcome Kim and Werner, who are both proven experts in their respective areas, to the board.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}