{
    "url": "https://www.db.com/news/detail/20160727-quarterly-results-a-message-to-employees-from-john-cryan?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 27, 2016",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Quarterly results: a message to employees from John Cryan",
    "body": "Dear Colleagues,\nThe past quarter could hardly have been more challenging. There were some exceptionally difficult moments and, after the “Brexit” referendum in the UK, Europe stands at a crossroads. The initial financial market turmoil now lies behind us, but the challenges remain.\nThis tough environment took its toll on our share price and on those of many other banks. Doubts were raised about our financial strength. These were unjustified but they unsettled some clients and that made our day-to-day work more difficult.\nSo first of all, let me thank you for your commitment and spirit. In the past three months, we proved once again how fundamentally strong this bank is.\nI would now like to share an overview of our second-quarter results with you as well as further details on where we have reached in our comprehensive restructuring of the bank. Despite our challenges, we should not overlook the substantial progress we have made.\nUnfortunately, much of this progress is not apparent in our second-quarter results. We delivered revenues of 7.4 billion euros, 20 percent lower year-on-year. Excluding the impact of the Non-Core Operations Unit (NCOU) and Hua Xia Bank, Deutsche Bank revenues declined 12 percent. This partly reflects a challenging market environment with historically low interest rates and significant uncertainties. It also reflects our strategic decision to withdraw completely or in part from certain countries and business lines, such as higher risk-weight securitised trading.\nCosts were 6.7 billion euros and provision for credit losses was 259 million euros. Our cost reduction was due partly to lower compensation expenses and partly to lower litigation charges. Litigation charges, impairments and restructuring and severance expenses came to around 600 million euros in total and these impacted our pre-tax profits, which fell to 408 million euros. Net income was 20 million euros, reflecting the fact that certain impairments were not tax deductible.\nWhile our results show that we are undergoing a sustained restructuring, we are satisfied with the progress we are making. All our operating businesses achieved successes despite the difficult environment. Let me give you some examples:\nIn Private, Wealth & Commercial Clients (PW&CC), we attracted around 2,000 new commercial banking clients in Germany and increased our average lending volume by 1.7 billion euros over the past year. We also grew new customer finance loan volumes by five percent year-on-year. In our international business, we acquired over 10,000 new private and commercial clients.\nWe expect our Global Markets business to remain global No. 4 in debt sales and trading despite lower revenues that in part reflect our strategy. Admittedly, we performed less well than our US peers, but that has much to do with differences in geographic exposure where US markets were more robust. Nonetheless, in our core FX and rates businesses, as in many other areas, revenues were stable compared with a year earlier.\nOur Transaction Banking business is solid despite the challenging environment and is well placed to continue to grow. We remain the world leader in euro clearing.\nWe were also successful in many areas in Corporate Finance and are No. 2 in debt origination in Europe.\nDeutsche Asset Management continues to produce solid profits and high returns.\nLast but not least, Deutsche Bank continues to attract top bankers onto our platform. In the second quarter, we were able to strengthen our management team with Thomas Piquemal, who joined us from EDF, and John Gibbons, from JPMorgan. Simultaneously, we are filling many top positions internally.\nAt the same time, we should not ignore the fact that Deutsche Bank’s risk profile has rarely been as solid as it is today, despite any market rumours to the contrary. Here are the main points:\nCredit quality remains good, with credit losses remaining low on an absolute and relative basis.\nIn our markets business, our trading risk (Value at Risk, or VaR) is low by any historical measure.\nOur liquidity position has become even stronger compared to the first quarter. We have nearly 220 billion euros in liquidity reserves.\nOur Common Equity Tier 1 (CET1) capital ratio rose slightly to 10.8 percent. We anticipate that this ratio will improve by approximately 40 basis points with the disposal of Hua Xia Bank in the second half of the year. We expect our year-end CET1 ratio to be around 11 percent.\nWe are confident that we will reduce NCOU RWA to below 10 billion euros, materially completing a wind-down process which has been a drag on our results.\nHowever, resilience and a substantial capital buffer are not enough. We must make more progress with our restructuring – and we are doing so:\nWe completed negotiations with the Works Council in Germany. As a result, around 3,000 jobs will go. We regret this. We do not take such decisions lightly but, after careful consideration, we have concluded that unfortunately they are unavoidable. We will now be able to close branches in our home market and modernise our private clients business. Outside Germany, we have already closed about 50 branches and will close over 30 more this year and next.\nWe have completed our operational separation of Postbank so that a sale is now possible.\nIn Global Markets, we are approximately half-way through withdrawing from countries we plan to exit and have made significant progress with investments to strengthen our equities business. We have also withdrawn from our onshore business in Russia.\nIn Wealth Management, we are accelerating investment in fast-growing markets like Asia.\nOn July 1, we launched our Intermediate Holding Company (IHC) for our US business, DB USA Corp. This will encompass a substantial part of our US business and infrastructure. We now have a self-standing bank in the US. We are working diligently to meet the requirements of US regulators.\nWe have reached a turning point in employee numbers. Despite bringing more than 900 colleagues into the bank who were previously external contractors, total headcount fell by 138 during the quarter. Once again, reducing jobs is something we do reluctantly but there is no alternative if we are to lower our costs.\nDuring the first half of the year, we cut the number of vendors by 850, thus reducing complexity.\nWe are making substantial progress with the restructuring of our IT. We have decommissioned 1,400 servers and, during the quarter, we reduced risk by rolling out our Client Adoption and Review (dbCAR) and Know Your Client systems in six additional countries.\nWe accomplished all of this in an environment which was challenging and remains uncertain. Here I would like to speak plainly. If this weak economic environment persists, we will need to be still more ambitious in our restructuring. We will do everything in our power to accelerate the measures we have already planned.\nWe recognise that we are asking a lot of you and that this will continue for the foreseeable future. However, we have also achieved successes, thanks above all to your commitment. For that, my Management Board colleagues and I would like once again to offer you our profound thanks. We are a strong bank and we will emerge as a stronger, better Deutsche Bank.\nWith best wishes,\nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}