{
    "url": "https://www.db.com/news/detail/20160715-stefan-simon-nominated-to-deutsche-bank-s-supervisory-board?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "July 15, 2016",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Stefan Simon nominated to Deutsche Bank's Supervisory Board",
    "body": "The Supervisory Board of Deutsche Bank has nominated Stefan Simon (46) to become its new member. It is intended that Mr. Simon will stand for election as a member of the Supervisory Board at the Annual General Meeting on May 18, 2017. Until then, he is to be appointed as a member of the Supervisory Board by court order. The application for this appointment was submitted to the local court in Frankfurt am Main today.\nStefan Simon is a partner at the law firm Flick Gocke Schaumburg in Bonn and an honorary professor at the University of Cologne. The Supervisory Board’s Nomination Committee recommended his nomination following the suggestion of Paramount Services Holdings Ltd. and Supreme Universal Holdings Ltd., two long-term investors in Deutsche Bank. These investors had informed Deutsche Bank that they have increased their respective holdings to just under five percent.\n“We are pleased that our Qatari shareholders are banking on the success of Deutsche Bank as shown through their long-term holdings,” said Paul Achleitner, Chairman of the Supervisory Board. “We welcome Stefan Simon, a highly qualified attorney, to the Supervisory Board. He has a great deal of experience in corporate law, corporate governance and compensation oversight.”\nSucceeding Georg Thoma as Chair of the Supervisory Board’s Integrity Committee is the U.S. attorney Louise Parent, who has already performed this role on an interim basis since April 2016. “We appreciate very much that Louise Parent will continue to provide her outstanding expertise as the Chair of the Integrity Committee on a permanent basis,” said Achleitner. “We know that these important tasks are in the best of hands with her.”\nThere will also be a change on the employee representatives’ side of the Supervisory Board. Rudolf Stockem has resigned his position for health reasons, effective July 31, 2016. The employee representatives will appoint a successor for Mr. Stockem in due course.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}