{
    "url": "https://www.db.com/news/detail/20160714-urban-age-conference-shaping-cities-on-july-14-15?language_id=1",
    "language": "EN",
    "article_type": "Event",
    "publish_date": "July 14, 2016",
    "tags": [
        "Corporate Citizenship",
        "Sustainability"
    ],
    "title": "Urban Age conference “Shaping Cities”",
    "body": "The two-day Urban Age conference (July 14 & 15), organised by the London School of Economics and the Alfred Herrhausen Society, is designed to bring the world of cities and city-makers to Venice. With hundreds of projects displayed across the city for the 15th International Architecture Exhibition, La Biennale di Venezia, it provides an ideal context to feed fresh ideas to the United Nations Habitat III conference on Sustainable Cities to be held in Quito in October 2016.\nMayors and urban leaders of Barcelona (Spain), Bogotá (Colombia), Kampala (Uganda), Venice (Italy), Paris (France) and Safed (Israel) will debate all issues relating to the topic “Shaping Cities“. They will be joint by the key players in international and national organisations including the United Nations, UN Habitat, the Cities Alliance, India’s National Institute of Urban Affairs and the Chicago Council on Global Affairs.\nThe Urban Age conference in Venice is organised around in six distinct themes:\nWho Owns the City? What are the main political and economic forces shaping urban societies?\nExpansion or Redevelopment? Can spatial planning tame urban growth and what are the impacts of urban form on productivity, the environment and social inclusion?\nAdaptation and Social Integration. How do existing residents adapt to the arrival of newcomers and how can their interactions be shaped by different physical environments?\nWhat Role for Architecture? How can design ingenuity be harnessed to respond to everyday social and environmental battles? What are the limits of the design profession in addressing both the scale and nature of the urban condition?\nScales of Intervention: a comparative overview of bottom-up and top-down approaches to urban design, repair and planning including projects from cities across the world.\nShaping the New Urban Agenda. What are the main messages emerging from architecture, urban design and planning for Habitat III? What forces will shape the New Urban Agenda?\nThe conference will take place at Teatro alle Tese, Arsenale, La Biennale di Venezia, July 14 & 15.\nRegister at: https://urbanage.lsecities.net/conferences/shaping-cities-venice-2016.\nThe conference is open for ticket-holders of the 15th International Architecture Exhibition, La Biennale di Venezia.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}