{
    "url": "https://www.db.com/news/detail/20160712-deutsche-bank-supports-entrepreneurs-for-social-good?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 12, 2016",
    "tags": [
        "Corporate Citizenship",
        "Corporate products",
        "Research"
    ],
    "title": "Deutsche Bank supports entrepreneurs for social good",
    "body": "Deutsche Bank has launched Made for Good - its new global enterprise programme that supports the success of pioneering ideas and business models to help drive positive social change. From microenterprises, to start-ups, non-profits and commercial businesses, Made for Good gives businesses that drive positive change in society access to what they need to get off the ground and reach their next level. From business advice and coaching to funding and connections; as a financial services provider, Deutsche Bank has a strong track record of helping businesses succeed.\nDeutsche Bank employees will be central to this effort, sharing their business know-how and acting as mentors and advisers offering practical guidance on how to manage the road ahead. “We are proud to be using the skills of our business to help entrepreneurs around the world create social good,” said John Cryan, Chief Executive Officer.\nLareena Hilton, Global Head of Brand Communications and CSR, adds: “We have created the Made for Good programme to advance new ideas and business models that can help communities and economies to prosper. We give our support to enterprises that provide innovative solutions to urgent social and environmental needs such as access to education, healthcare, clean water and food, that create routes out of poverty, invigorate local economies, contribute to vibrant and diverse communities, and more.”\nAlongside offering provisions for investment readiness through business advice and support, Deutsche Bank helps enterprises access sources of funding that fit their business model and stage of development. This is achieved through partnerships with others or through the bank’s social venture investments. For example in Germany, Deutsche Bank has helped set up a dedicated crowdfunding platform for social projects and in 1997 it became the first global bank to create a microfinance fund which has generated around 4 million microcredits in partnerships with over 140 microfinance institutions in 53 countries.\nFor further information visit www.db.com/madeforgood.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}