{
    "url": "https://www.db.com/news/detail/20160701-db-usa-corporation-a-message-from-john-cryan?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 1, 2016",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "DB USA Corporation: a message from John Cryan",
    "body": "Dear Colleagues,\nToday marks a new chapter for Deutsche Bank in the United States. We are launching DB USA Corporation, our US Intermediate Holding Company (IHC), which will hold a substantial part of our US businesses and infrastructure. This is a milestone in the implementation of Strategy 2020 and underlines our commitment to a strong operating platform in the US.\nThe IHC model has been designed by regulators to mitigate risks that any large foreign bank operating in the US could present to the US financial system. We have accordingly strengthened governance, capital and risk management and reporting for our US operations. We welcome the transparency and discipline associated with the IHC model.\nIn practice, this new structure will bring several changes to our US operations. These include the creation of a 16-member board of directors comprised of Deutsche Bank executives and external members, the appointment of a Chief Risk Officer and a Chief Financial Officer and the implementation of dedicated reporting for DB USA Corporation.\nIn this new context, Jeff Urwin will assume responsibility on the Management Board for the Americas in addition to his role as Head of Corporate & Investment Banking. Jeff has over 25 years of experience as a corporate financier and transaction banker in the Americas. He is well-suited to oversee the implementation of our client and infrastructure upgrade plans in the region, having led the initial review and redesign of our know-your-client and client on-boarding procedures across the bank.\nJeff’s appointment is similar to the approach we have taken already in Germany and the UK, which ensures that Management Board members responsible for our business divisions also take accountability for a region.\nBill Woodley, who as previously announced has become the CEO of DB USA Corporation, will also become CEO of the Americas, reporting to Jeff. Bill’s experience as Deputy CEO of the Americas, operational knowledge and long service with the bank complement Jeff’s track record with clients and extensive experience.\nMany colleagues have helped to prepare us for today’s IHC launch by strengthening internal controls, upgrading technology and data management systems and enhancing capital and risk management processes and reporting capabilities. As you will know from the feedback we received on Wednesday from the Federal Reserve as part of its Comprehensive Capital Analysis and Review exercise, more work remains to be done but we have made progress.\nPlease join me in wishing Jeff and Bill success in their duties and in thanking our colleagues who have worked on launching the IHC.\nYours sincerely,\nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}