{
    "url": "https://www.db.com/news/detail/20160701-people-survey-results-a-message-from-john-cryan-and-karl-von-rohr?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 1, 2016",
    "tags": [
        "Company",
        "Management & Leadership",
        "Strategy"
    ],
    "title": "People Survey results: a message from John Cryan and Karl von Rohr",
    "body": "Dear Colleagues,\nWhen we took office as your new Management Board team a few months ago, we promised that communication with you would be a two-way dialogue. Part of this is that the Management Board receives feedback directly from you on what you think we are doing well and what you think we need to improve. So we are grateful to the many of you who participated again in this year’s employee survey, the Spotlight People Survey. This helps us identify weaknesses and areas where we should take a closer look.\nIt’s true that the results paint a sobering picture of the mood inside our bank, but they are very insightful for all of us on the Management Board. And in some areas, they are actually a cause for optimism.\nLet’s start with the weaknesses: compared with a year ago, still fewer of you feel committed to Deutsche Bank, and just under half of you are proud to be working here. These results are unsatisfying, but they are not totally unexpected. We realise that the ongoing transformation of our businesses, and the resulting job cuts, are causing a lot of concern and uncertainty.\nThe recent balance of interest agreements reached with employee representatives in Germany for the first few business divisions and infrastructure functions were therefore an important step. We continue to work to provide clarity for all impacted employees so people know as soon as possible what this means for them.\nYour assessment of the bank’s working environment is equally critical: one third of colleagues surveyed still experience significant barriers to doing their job well, such as complex processes, slow decision-making or a lack of cooperation. We have excellent employees, capable of achieving outstanding results. But in some cases, our processes are not yet clear and simple enough. This is obviously partly a reflection of increased regulatory requirements.\nLooking forward\nNow let’s look at the positives: the survey results indicate that your engagement and identification with your work are still remarkably high. A large percentage of you are ready to go above and beyond what is normally expected in your role. We owe you our thanks for that. And the vast majority still perceive their jobs to be challenging and interesting, enabling them to make good use of their abilities. That gives us confidence, because it is enormously important personally for all of us to have a role that is challenging and makes the most of our interests and skills.\nThe fact that three quarters of survey participants actively engage with our corporate values is also a good sign. More than 70% are convinced that the values will have a positive impact on reaching our strategic aspirations. And more than 60% now observe changes in behaviour. We are pleased about this progress, which means that change is becoming tangible.\nTogether with our Management Board colleagues we are particularly pleased that you can also see progress in the areas we identified 12 months ago for further action:\nAccountability: we’ve created greater accountability at all levels and are holding each other responsible.\nRemoving barriers: we are making progress in simplifying and speeding up processes and systems.\nCommunication: we are creating a more open and transparent environment. Compared with last year, more employees feel positive about the flow of information.\nAt the Management Board we will also take a closer look at your feedback, including the many individual text comments you submitted, to identify additional areas of focus for our work over the coming year. That includes more clearly articulating our vision for the bank’s future – and how we plan to reach our goals.\nWe have taken on a lot with Strategy 2020 and are now making steady progress. We appreciate how hard you are all working. The next few months won’t be easy. But if we openly discuss what we can do better and implement these insights in a disciplined fashion, then, step by step, we will create a better working environment, and a better Deutsche Bank.\nYours sincerely,\nJohn Cryan                        Karl von Rohr",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}