{
    "url": "https://www.db.com/news/detail/20220525-deutsche-bank-named-one-of-the-times-top-50-employers-for-women-2022?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "May 25, 2022",
    "tags": [
        "Diversity"
    ],
    "title": "Deutsche Bank named one of The Times Top 50 Employers for Women 2022",
    "body": "For the third year in a row, Deutsche Bank has been listed in The Times Top 50 Employers for Women in the UK for taking action to address gender inequality in the workplace.\nThis year’s applicants were closely assessed on the work they do to remove the drivers that can perpetuate gender inequality, by focussing on factors from flexible working and family-friendly policies to pay, reward and progression. This year the Times’ partner and assessing body, Business in the Community (BITC), also considered the lived experience of women employees by asking what areas they feel need to be improved.\nThe Times Top 50 Employers for Women is the UK’s most high profile and well-established listing of employers striving for equity for women in the workplace.  Deutsche Bank’s recognition is due to the wide range of programmes, initiatives, and employment practices driving change in its business. These efforts, sponsored and actively supported by senior management, impact the full employee lifecycle spanning talent attraction, retention and development, and promotion.\nTiina Lee, Chief Executive Officer, UK & Ireland, said: “We know we still have work to do to advance gender equality across the bank and the wider business community, but it is immensely gratifying to see our diversity and inclusion efforts recognised alongside some of the world’s leading companies, especially with such strong competition for places. Thank you to our Employee Resource Groups, employees and leaders across the bank for their passion, hard work and advocacy in building a more inclusive and equitable workplace, here and across our industry.”\nKaty Neep, Gender Equality Campaign Director at Business in the Community, said: “The cost of living crisis following hot on the heels of the disproportionate impact of COVID-19 faced by women has further shone a light on how far we have to go on gender equality. Without action from all employers, we will end up chasing our tails while trying to eradicate the inequalities gap and create truly inclusive workplaces for all women.”\n“This year’s application process was the most competitive one we have ever seen. Employers like Deutsche Bank haven’t lifted their foot off the pedal when it comes to supporting women at work and they are a strong example of what commitment to making gender inequality a thing of the past looks like.”",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 14
}