{
    "url": "https://www.db.com/news/detail/20220510-deutsche-bank-partners-with-the-united-nations-decade-of-ocean-science-for-sustainable-development-in-germany?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "May 10, 2022",
    "tags": [
        "Sustainability"
    ],
    "title": "Deutsche Bank partners with the United Nations Decade of Ocean Science for Sustainable Development in Germany",
    "body": "Deutsche Bank today announced it has become the first German bank to become an official network partner for the German Ocean Decade Committee, after signing a memorandum of understanding to actively support the United Nations Decade of Ocean Science and Sustainable Development (UN Ocean Decade) in Germany.\nThe partnership with the German Ocean Decade Committee aims to promote ocean literacy in Germany, raise awareness of the ten challenges outlined by the UN Ocean Decade and to act as a link between German and international Ocean Decade activities.\nThis is the latest partnership for Deutsche Bank in support of the ocean. Last year Deutsche Bank became the first bank to join the Ocean Risk and Resilience Action Alliance (ORRAA) as a full member. In February this year Deutsche Bank’s International Private Bank (IPB) opened its new Deutsche Bank Ocean Resilience Philanthropy Fund for global contributions.\nGlobal Head of the IPB and CEO EMEA, Claudio de Sanctis, said: “Home to 80 percent of all life on earth, the ocean is the planet’s greatest carbon sink and absorbs 90 percent of the excess heat generated by greenhouse gas emissions. A healthy ocean is vital for a healthy planet. Like our partnership with ORRAA, Deutsche Bank is pleased to partner with the German Ocean Decade Committee to raise awareness about the ecological importance of the ocean and promote ocean conservation.”\nDeutsche Bank’s IPB has made the ocean a strategic priority in its Environmental, Social and Governance (ESG) strategy, and the Private Bank’s Chief Investment Office prioritises research into the ocean and biodiversity loss.\nGlobal Head of the Private Bank’s Chief Investment Office, Markus Müller, said: “Marked by rising sea levels, pollution and biodiversity loss, the ocean and its biosphere are under severe threat. As the first German banking partner for the German Ocean Decade Committee, Deutsche Bank welcomes the opportunity to take an active role in developing ocean literacy.”\nPartnering with the German Ocean Decade Committee will see Deutsche Bank and its Chief Investment Office participate in forums and share insight into the economic and investment implications of ocean health. In March, Markus Müller participated in an online forum on ocean literacy for the finance sector, hosted by UNESCO, the Intergovernmental Oceanographic Commission, and the Swedish Government as part of the Ocean Decade.\n“Our clients tell us they want to create positive change in the world, as they create a legacy for the future. Partnering with the Ocean Decade is our commitment to supporting ocean sustainability, and helping to preserve the ocean and its biosphere for future generations,” added Claudio de Sanctis.\nPhotographs courtesy of Pedro Carrillo-Montero from Deutsche Bank in Spain.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 24
}