{
    "url": "https://www.db.com/news/detail/20240731-eib-and-deutsche-bank-to-boost-europe-s-wind-manufacturers?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main / Luxembourg, July 31, 2024",
    "tags": [
        "Europe",
        "Corporate products"
    ],
    "title": "EIB and Deutsche Bank to boost Europe`s wind manufacturers",
    "body": "EIB activates €5 billion initiative for wind industry with €500 million counter-guarantee to Deutsche Bank.\nUnder this pilot project EIB will support Deutsche Bank to issue advance and performance bonds of up to €1 billion to support the construction of new wind projects. \nDeal is part of the EU Wind Power Package to accelerate the green energy transition in Europe\nThe European Investment Bank (EIB) is activating a €5 billion initiative to support manufacturers of wind-energy equipment in Europe by extending a €500 million counter-guarantee to Germany-based Deutsche Bank AG. The transaction will enable Deutsche Bank to set up a portfolio of up to €1 billion of banking guarantees for new investment in wind farms in the EU. \nThe deal represents the first operation under the December 2023 EIB plan to provide €5 billion to strengthen the provision of commercial bank guarantees for companies throughout the European wind industry. The initiative, part of an EU Wind Power Package presented by the European Commission in October 2023 to maintain a healthy and competitive wind energy supply chain across the Union. It foresees counter-guarantees to the sector’s main lenders, which include Deutsche Bank.\n“A quick build-up of wind power is crucial for decarbonising the economy,” said EIB Vice-President Nicola Beer. “Together with Deutsche Bank, we are promoting the expansion of renewable energy in Europe and in that way bringing the price of sustainable energy down. The respective project will also help to safeguard and create jobs in a sustainable and competitive European industry.”\nThe EIB’s counter-guarantees under its €5 billion initiative are designed to share credit risks faced by commercial banks when dealing with players in the wind industry. The instrument facilitates access to advance payment and performance guarantee lines, benefitting both the banks and the industry.\nIn this initial project, Deutsche Bank will use the EIB`s backing to provide banking guarantees to wind-energy manufacturers. This will enable the manufacturers to receive advance payments as well as to provide performance guarantees when taking on new wind projects. The guarantee scheme also enables manufacturers to pay their suppliers in advance for the supply of wind farms and the related wind value chain components, which include turbines, grid connection infrastructure, cables and transformer stations. \nThe EIB-Deutsche Bank €1bn guarantee facility is estimated to initiate private investments of up to €8 billion.\n“The acceleration as well as the overall magnitude of the energy transition require massive investments but also collateral and guarantee requirements. Our accord with the EIB provides tangible additional guarantee volumes for wind manufacturers to win and perform the substantial amount projects”, said Alexander von zur Muehlen, CEO of Asia Pacific, Europe, Middle East & Africa (MEA) and Germany and Member of the Management Board at Deutsche Bank. \"These partnerships between public actors and the private sector will be a cornerstone for financing the success of the digital and sustainable transformation”, said von zur Muehlen.\nWhile the wind-power sector has to date been an EU success story, challenges remain within the supply chain by uncertain demand, slow project-permitting, supply-chain bottlenecks, high inflation and commodity prices, as well as greater international competition.\nThe EIB-Deutsche-Bank contract is an example of using risk-sharing instruments to tackle such challenges and, by extension, ensure the financing of projects for the green transition. The counter-guarantees free up additional financing that can be used to meet the increased production required to accelerate the deployment of wind energy.\nWind energy will play a significant role in achieving the EU's renewable-energy target. For the EU to achieve a 45% renewable-energy share by the end of the decade, installed wind capacity will need to expand by 117 gigawatts (GW), of which the EIB`s €5 billion initiative will enable building 32 GW.\n“There can be no successful clean energy transition without a strong clean tech manufacturing sector in the EU. This initiative will help the European wind sector to have access to the necessary financial support it needs to keep flourishing at home and on the global stage,” said Maroš Šefčovič, Executive Vice-President for European Green Deal, Interinstitutional Relations and Foresight.\n“Wind energy is key for Europe to achieve its ambitious renewable energy target. For that to happen, we need to keep supporting our equipment manufacturers so that Europe can advance the green transition while remaining competitive and ensuring green jobs. This timely initiative with the EIB is an important deliverable under the European Wind Power Package to unlock investments and give a boost to the wind sector,” said Kadri Simson, Commissioner for Energy.\n\nFor further information please contact:\n\nDeutsche Bank AG                                   \nMedia Relations                                        \nHeinrich Frömsdorf\nPhone: +49 172 5424016\nE-mail: heinrich.froemsdorf@db.com                                                                    \n\nEuropean Investmentbank                                             \nMedia Relations                                        \nMarie Antonie Kerwien\nPhone: +352 691 289 790\nE-mail: a.kerwien@eib.org",
    "number_of_ratings": 2,
    "rating": 5.0,
    "likes": 6
}