{
    "url": "https://www.db.com/news/detail/20240719-deutsche-bank-named-world-s-best-bank-for-corporates?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "July 19, 2024",
    "tags": [
        "Awards"
    ],
    "title": "Deutsche Bank named “World's Best Bank for Corporates”",
    "body": "Deutsche Bank has been awarded “World’s Best Bank for Corporates” in Euromoney’s Awards for Excellence 2024. The bank was also named “Best Bank for Corporates in Germany”, and “Best Investment Bank in Germany”.\nThese awards are recognition of Deutsche Bank’s position as not only the premier bank in Germany and European champion but a clear leader on the global stage. The wins also demonstrate the bank’s progress with its long-term strategy - increasing revenues and remaining disciplined on costs – and the momentum it is seeing as a Global Hausbank, supporting its clients as they undergo their own transitions.\nCommenting on its global decision, Euromoney said: \"Five years ago, Christian Sewing carved out a new Corporate Bank. The approach has highlighted Deutsche’s strengths, and helped it build on its underlying advantages. In addition to large corporate clients, it has helped Deutsche cover Mittelstand clients with more focus. Last year, the Corporate Bank was by far the most profitable part of the group.\"\nFabrizio Campelli, Head of Corporate Bank and Investment Bank, said: “Our Global Hausbank strategy centers around bringing the whole bank to our clients. It builds on the transformation we undertook five years ago, where we focused our bank’s business model on our strengths and, since then, have built a resilient and sustainably profitable Deutsche Bank. These awards demonstrate that we are not only on the right track, but clearly leading the way, with our clients firmly at the centre of everything we do.\"\nDavid Lynne, Head of Corporate Bank at Deutsche Bank, said: “This recognition underscores the strength of our global network and our deep dedication to the lasting success of our clients around the world. It is a true testament to our Global Hausbank philosophy to be the preferred provider for our clients, meeting all their financial needs, at home and abroad.”\nRemarking on Deutsche Bank’s recognition as “Best Investment Bank in Germany”, Euromoney said: “Deutsche Bank’s German investment-banking revenues gave it an impressive positioning in the Dealogic rankings, far higher than any regional competitor. This included top positions across debt and equity capital markets, M&A, and loans.” \nJulian Schoof, Head of Investment Bank Coverage DACH at Deutsche Bank, said: “We are delighted that Deutsche Bank has, once again, been recognised as the leading investment bank in our home market. Thanks go to our colleagues across the bank for their strong partnership and dedication, as well as our clients, for the deep trust they continue to place in Deutsche Bank.”\nThe awards were collected at Euromoney’s Awards for Excellence ceremony in London by JP Gillmann, Global Head of Corporate Coverage, Panos Stergio, Global Head of Institutional Client Group, Julian Schoof and David Feldmann, Head of Institutional Client Group EMEA and Head of Markets in Germany, Austria and Switzerland.\nAbout the Euromoney for Excellence Awards\nEuromoney’s Awards for Excellence were established in 1992 and were the first of their kind in the global banking industry. Over 30 years on, they remain the worldwide gold standard in this regard and are determined by an editorial panel of judges following a three-month research and interview process. Over 600 banks from over 100 countries enter every year, making it the most comprehensive programme in the industry.",
    "number_of_ratings": 8,
    "rating": 4.4,
    "likes": 21
}