{
    "url": "https://www.db.com/news/detail/20210819-notalone-176million-steps-from-uk-and-ireland-employees-help-youth-mental-health-charities?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "August 19, 2021",
    "tags": [
        "Corporate Citizenship"
    ],
    "title": "#NotAlone: Supporting young people’s mental health",
    "body": "Deutsche Bank’s global #NotAlone campaign has been highlighting the impact of the pandemic on youth mental health across the summer. In the UK and Ireland (UKI), support has focused on two expert charities – YoungMinds in the UK and Jigsaw in Ireland. Evidence from the National Health Service shows a 48 percent increase in the number of young people with a probable mental health disorder – rising from one in nine to one in five since the start of the pandemic.\nYoungMinds and Jigsaw have both seen significant increased demand on their services. And with the impacts of the pandemic expected to be felt for years to come, Deutsche Bank is providing vital financial support for their critical strategic programmes.\nThe bank’s employees have been getting involved in the campaign through the global #NotAlone steps challenge. By taking as many steps as possible in teams or individually, employees have united to share an important message with young people: You are not alone.\nSmashing targets to boost funding\nOver a two-week period, 1,652 UKI employees walked, jogged or trekked more than 172 million steps. Aiming for a target of 50 million steps, they smashed this within week one and enabled an additional 50,000 euros donation to be released to the charities.\nTaking their steps individually or together in teams across London, Dublin and beyond, employees were not only supporting the #NotAlone campaign but their own wellbeing too.\nLondon-based employee Graham topped the individual leaderboard in the UK and reached an impressive 355,536 steps by enjoying, ”…long evenings in the local countryside which helped me feel much stronger both mentally and physically.” In Ireland, John clocked up a remarkable 303,405 steps by, ”…walking with the dogs early in the morning, a run around lunch and then taking the kids to their sports training.”\nSix colleagues made up the top team for UKI, under the nickname ‘Steps Task Force’. Team captain Stefan shared how an, “…all-in strategy and everyone in the team committing to 50% more steps than their average in the last two days of the challenge…” eventually gave them the winning spot.  Together team ‘Steps Task Force’ reached 1,848,898 steps, more than 200,000 ahead of 2nd place.\nInvesting to help an entire generation\nThe bank’s 150,000 euros donation, will enable YoungMinds and Jigsaw to deepen the impact they have on those most in need across UKI.\nFor YoungMinds the funds will be invested to co-create more blogs, videos and guides with experts and young people who have lived experience of struggling with mental health. By strengthening its ‘Never Alone’ digital portal, the charity will continue to provide free guidance and speak to young people like a trusted friend, whenever they need it. More than 2.5 million young people used the portal in 2020 alone.\nAnd Jigsaw will utilise the donation to advance its ‘Jigsaws Schools Hub’ for students and teachers across Ireland. Aiming to reach at least 360,000 students and 65,000 teachers, the charity will provide vital resources and toolkits that aim to normalise conversations around mental health.\nTiina Lee, Deutsche Bank’s UKI CEO, said: “We are proud to work with YoungMinds and Jigsaw through our #NotAlone campaign. Both charities are providing such vital services and expertise for young people across our UKI region to best manage their mental health. We hope the donations help increase reach to those seeking advice and guidance.”\n\nTiina Lee handing donation to Julie Wilson-Dodd, YoungMinds trustee\n\nIan Melia (right), Chief Operating Officer Deutsche Bank Ireland, virtual donation handover to Justin McDermott, fundraising manager for Jigsaw ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 4
}