{
    "url": "https://www.db.com/news/detail/20210812-deutsche-bank-to-commence-ifsc-banking-unit-at-gift-city?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "India, August 12, 2021",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank to commence IFSC Banking Unit at GIFT City",
    "body": "Deutsche Bank, a leading German bank with strong European roots and a global network spread across 59 countries, has received approval from the GIFT SEZ Authority to set up an IFSC banking unit at India’s first International Financial Services Centre (IFSC) at GIFT City, Gujarat.\nDeutsche Bank is among the largest international banks in India, having set up its first branch in the country in Mumbai more than 40 years ago. With over INR19,000 crore of capital deployed in its India branch operations and a presence across all major business centres, Deutsche Bank is a trusted partner and advisor to its customers and clients, offering a whole range of services across Corporate Banking, Investment Banking and its International Private Bank. The Deutsche Bank Group currently employs more than 18,000 people across its various entities in the country.\n“We welcome Deutsche Bank, one of the leading European banks to launch its offshore banking operations at GIFT IFSC. This will serve as a primer for renowned banks from other geographies to consider GIFT City a viable destination for international financial services. Progressive banking regulations in GIFT IFSC provides new business opportunities in several areas for foreign banks such as FPI Business, Non-Deliverable Forwards (NDF), Aircraft leasing- financing, and upcoming framework to enable international bullion exchange operations from GIFT IFSC.” said Tapan Ray, MD & Group CEO, GIFT City.\n“With borders between global financial centres increasingly blurring, establishing a presence at the IFSC in GIFT City was the next logical step for us as we seek to support the growth aspirations of our clients. The banking unit will allow us to expand the services available to our clients to smoothly carry out international business transactions, particularly in the areas of Financing, Trade and Currencies,” said Kaushik Shaparia, CEO, Deutsche Bank India.  \nSince being established in 2015, the International Financial Services Centre at GIFT City has attracted leading international and domestic players across the financial services spectrum, ranging from banks, asset management companies, alternate investment funds and professional services firms. Banking transactions at the GIFT IFSC crossed USD 100bn in value by the end of July 2021.",
    "number_of_ratings": 6,
    "rating": 5.0,
    "likes": 23
}