{
    "url": "https://www.db.com/news/detail/20210812-deutsche-bank-executes-its-first-esg-linked-repo-transaction-globally-with-turkeys-akbank?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Istanbul, August 12, 2021",
    "tags": [
        "Asia-Pacific",
        "Europe"
    ],
    "title": "Deutsche Bank executes its first ESG-linked repo transaction globally with Turkey's Akbank",
    "body": "Deutsche Bank is proud to announce the successful execution of its first ESG-linked repurchase agreement transaction globally with Turkey’s Akbank. A repurchase agreement (repo) is collateralised borrowing undertaken by a bank as part of interbank financing.\nThe 300 million US dollar transaction is also the first time ESG and sustainability targets have been attached to interbank financing in repo format in Central and Eastern Europe, Middle East and Africa (CEEMEA).\nAkbank, one of Turkey’s leading banks, partnered with Deutsche Bank to structure and execute the innovative transaction. Recognised as a leader in sustainable finance and sustainability-linked solutions, Deutsche Bank developed the ESG-linked repo transaction to align Akbank’s existing sustainability efforts with its financing strategy.\nThe structure of the transaction links the repo interest rate to Akbank’s performance with respect to three areas of ESG key performance indicators: 1) gender balance, 2) electricity sourcing of Akbank from renewable resources, and 3) no greenfield coal power plant loan origination.\nOrhan Ozalp, Head of Global Emerging Markets (GEM) for Central and Eastern Europe and CEO of Deutsche Bank AS Turkey said: “Deutsche Bank is committed to being the leading investment bank for ESG finance in Turkey. This first-of-a-kind regional transaction is evidence of our ESG structuring ability, expertise in designing ESG metrics, and commitment to working in partnership with a leading institution to create positive impact on society. After this landmark deal, Deutsche Bank’s ESG-linked financing in Turkey will exceed 5 billion Turkish lira in the first six months of the year.”\nClaire Coustar, Global Head of ESG for Fixed Income & Currencies (FIC) and Vice Chair of Deutsche Bank AS Turkey Board of Directors, said: “Akbank has been a leader in sustainability for many years. As the first ESG-KPI linked repurchase agreement in CEEMEA, this transaction demonstrates our joint ability to innovate in ESG as well as stand behind our ESG ambitions through economic alignment. We look forward to further opportunities to collaborate on sustainability initiatives with Akbank and its parent, the Sabanci Group, in the future.”\nIn a statement, Sebnem Muratoglu, Executive Vice President for Treasury at Akbank, said: “Akbank has always been at the forefront of ESG initiatives in the sector. We announced our sustainability strategy in January 2021, and recently pledged that we will not be lending to greenfield coal power plant projects, adding them in our exclusion list. We aim to increase the share of sustainable finance-based borrowing transactions in our overall portfolio to 30% by the end of 2021 and this latest transaction with Deutsche Bank also underlines our commitment. The total ESG linked financing we’ve executed with diverse transactions including IFI loans, green bond, our recent ESG linked syndicated loan, sustainable Tier 2, and ESG-linked repo transaction has exceeded 1.7 billion million US dollar since the beginning of 2020. Our ambitious and visionary ESG strategy makes Akbank a benchmark case when it comes to ESG not just in banking but the entire Turkish private sector.”\nDeutsche Bank has placed sustainability at the core of its business and is committed to helping clients transition to a net-zero carbon economy, helping clients to define and achieve sustainability strategies and make contributions to environmental and social objectives while meeting their financing needs. This transaction will contribute towards Deutsche Bank’s target of facilitating over 200 billion euros in sustainable finance and investments by 2023.\nDeutsche Bank recently celebrated its 110 year anniversary in Turkey, having opened its Istanbul branch on August 16, 1909. Today, the Corporate Bank and Investment Bank support the Turkish economy by offering lending and trade finance facilities to leading Turkish institutions and corporates.\n\nFor further information, please contact:\nDeutsche Bank AG Media Relations\nMohanad Nahas\nPhone: +971(4) 3611-754\nEmail: mohanad.nahas@db.com",
    "number_of_ratings": 4,
    "rating": 5.0,
    "likes": 11
}