{
    "url": "https://www.db.com/news/detail/20210804-zurich-italy-acquires-deutsche-bank-financial-advisors-network?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "August 4, 2021",
    "tags": [
        "Private products"
    ],
    "title": "Zurich Italy acquires Deutsche Bank Financial Advisors Network",
    "body": "Deutsche Bank and Zurich Italy have reached an agreement that provides for a further development of their partnership, thanks to the acquisition by Zurich of the network of Financial Advisors of the Deutsche Bank Group in Italy. The terms of the agreement provide for the transfer of a business unit consisting of 1085 Financial Advisors (March 2021), 97 employees and 16.5 billion euros of assets under management (March 2021).\n\nThe acquisition allows Zurich Italy to further develop its distribution network in the Italian market, focusing on delivering excellence in the field of financial and insurance consultancy, backed by over thirty years of history in the Italian market and characterized by strong growth in recent years. It also offers further growth potential to the already successful network led by Silvio Ruggiu, thanks to the choice of a historic partner which intends to make targeted investments into the strong advisory capabilities of the network.\nThe agreement enables Deutsche Bank to reposition its business in Italy by refocusing and reinvesting in areas where it can compete to win; as the house bank for family entrepreneurs, as the premium bank for affluent customers, and by leveraging its well-established consumer brands across digital channels.\nAs a result of this transaction, clients will be able to enjoy enhanced benefits deriving from the partnership between Deutsche Bank and Zurich, with the opportunity to access a more diverse offering of market-leading investment, insurance, banking and financial services.\nThe closure of the transaction is subject, among others, to regulatory approval.\n\nAlessandro Castellano, CEO of Zurich Italy said: “We are pleased to announce the acquisition of the network of Deutsche Bank Financial Advisors in Italy. A further strengthening of our presence in the Italian market thanks to a network that excels in terms of expertise and presence on the territory. Valuable advisory is for us the key to the success of our business: the strong partnership with Deutsche Bank, which we have been working with for many years in Italy and globally, has allowed us to appreciate the value and expertise of its financial advisors, a landmark in the asset management sector. This acquisition is for us a significant step forward in a path of growth and continuous innovation and evolution of the business towards multi-channel model. Deutsche Bank's network of Financial Advisors will work in synergy with the already consolidated and strong network of Zurich’s agents to offer the fullest possible range of distributive channels and the best solutions for financial and insurance planning. This is a very important project for Zurich that we want to develop over the next few years with further investments to support it.”\n\nDeutsche Bank Chief Country Officer in Italy Roberto Parazzini said: “We are pleased with the agreement reached today with our long-standing and well respected partner Zurich, a strategic operation that will strengthen our partnership and the distribution of financial solutions to our clients in Italy, while offering further growth potential to the network of financial advisors. This transaction marks a significant milestone in the transformation of our business in Italy, where we are repositioning and reinvesting to grow. Deutsche Bank is focused on becoming the house of choice for family entrepreneurs, strengthening coverage of affluent customers and positioning our consumer brands for renewed growth. Already this year we have increased our network of wealth relationship managers by around 30% to grow our wealth management offering. We are also investing in our business banking capabilities, leveraging our brands to develop a specialised service offering on our digital channels for both business and personal customers.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 13
}