{
    "url": "https://www.db.com/news/detail/20170828-verimi-new-registration-identification-and-data-platform-to-launch-at-the-turn-of-the-year-2017-2018-with-new-partners-on-board?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "August 28, 2017",
    "tags": [
        "Digitalisation",
        "Research"
    ],
    "title": "verimi – new registration, identification, and data platform",
    "body": "Bundesdruckerei, Deutsche Lufthansa and Deutsche Telekom all set to join the venture\nMarket launch of basic version digital “master key” (Single-Sign-On) planned for turn of the year 2017/2018\nUsers themselves decide how much data may be used\nThe cross-industry registration, identification and data platform partnered by leading German and European companies is taking shape. The platform now has a name: verimi, a combination of the words “verify” and “me”. Introductory information about the platform can be found at www.verimi.com. The venture will be based in Berlin and employ over 30 people when it launches. The platform venture is well on schedule and will go live with an online digital “master key” (Single-Sign-On) at the turn of the year 2017/2018. This will make logging onto websites much easier and using web services much more secure.\nNew partners to the venture are the DAX-listed companies Deutsche Lufthansa, Deutsche Telekom as well as Bundesdruckerei, an IT security company, all of which have signed an agreement with the founding partners Allianz, Axel Springer, Daimler, Deutsche Bank with Postbank as well as Core and Here Technologies. The new partners’ joining still requires the approval of the relevant antitrust authorities.\nAt launch, the platform will already cover a broad market as it has attracted partners from the automotive, aviation, financial, insurance, IT, media, technology, and telecommunication industries. And the partners are committed to quickly attracting more companies representing all sectors of the German and European economies. verimi is the competitive European answer to international platform providers. It has been purposely designed as a cross-industry, open platform that application partners or other initiatives can join and, together with the founding partners, can help to expand and grow.\nSecure digital “master key” available soon\nThe development of the offerings on the platform proceeds as scheduled: verimi plans to launch the online digital “master key” (SSO) as its first product at the turn of the year 2017/2018, beginning with a basic version with a number of essential features.\nThe “master key” requires users to log onto the platform once using their name and a password. They can then access participating companies’ applications that are already connected to the platform at that point in time.\nLogging onto a new application will no longer require personal data to be laboriously entered each time. Nor will users require several passwords for different websites. When they register, users are asked for their express consent to data being passed on to partner companies. Once they have consented, they can then decide which data they allow to be passed on (opt-in). This feature means that verimi complies with the European Regulation on Privacy and Electronic Communications (“ePrivacy”).\nFor application partners verimi is establishing the framework for personalised advertising and content that is both data protection-compliant and matches users’ preferences.\nExpanding verimi functionality\nMore features will gradually be added to the registration and identification platform, for instance digital access to authorities (eGovernment) or digital payment and financial services. And this basis will enable new digital business models to be developed. Further details will be announced in the coming weeks.\nUlrich Hamann, CEO of Bundesdruckerei, says: “verimi combines secure identification, simple, and convenient usability and the highest data protection standards – as a leading company in the field of secure ID and as a strong proponent of digital sovereignty, we are delighted to be able to share our expertise in this venture.”\nHarry Hohmeister, Member of the Executive Board of Deutsche Lufthansa AG and Chief Officer Hub Management, says: “With this cross-industry initiative we are bolstering the digital expertise in Europe. verimi has the potential to combine the highest standards of data protection and security with user-friendliness.”\nTimotheus Höttges, CEO of Deutsche Telekom AG, says: “Digitalisation is based on simplicity and trust. Our aim with verimi is to offer a practical and ultra-safe online master key. We will ensure that our clients’ digital identities remain within EU jurisdiction and enjoy the security afforded by German data protection rules.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 22
}