{
    "url": "https://www.db.com/news/detail/20150427-deutsche-bank-announces-next-phase-of-strategy?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 27, 2015",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Deutsche Bank announces next phase of strategy",
    "body": "Key decisions:\nDeleveraging CB&S to build a more focused investment bank, with planned gross leverage reduction of approximately EUR 200 billion and redeployment of EUR 50-70 billion in relationship-driven businesses\nFocusing retail business on a market-leading advisory-led proposition to clients and deconsolidating Postbank\nInvesting up to EUR 1 billion additionally to deploy digital technologies across the platform\nInvesting over EUR 1.5 billion to accelerate growth in GTB and Deutsche AWM\nFocusing geographical footprint on key markets and cities\nTransforming the Bank’s operating model by reducing complexity, increasing controls and boosting efficiency with the aim of delivering additional annual gross savings of EUR 3.5 billion for a planned one-time cost to achieve of EUR 3.7 billion\nMedium-term financial ambitions:\nIncreasing leverage ratio to at least 5%\nStabilizing the CRD 4 fully loaded Basel 3 Common Equity Tier 1 ratio at approximately 11%\nCost/income ratio of approximately 65%\nPost-tax return on tangible equity in excess of 10%\nAspiration: Payout ratio to shareholders of 50% or more\nDeutsche Bank (XETRA: DBKGn.DE / NYSE: DB) today announced the next phase of its strategy, covering the period through to 2020. The Bank’s announcement covers key strategic decisions, division-specific initiatives and financial targets.\nJürgen Fitschen and Anshu Jain, Co-Chief Executive Officers, said: “Today marks the next milestone in the journey we began in 2012. Deutsche Bank’s course is clear. We reaffirm our commitment to being a leading global bank based in Germany. To achieve this, we must remain client-centric, but focus more sharply on mutually attractive client relationships; remain global, but become more geographically focused; and remain universal, but avoid trying to be all things to all people.”\nThey continued: “Our strategy review process was thorough and rigorous. We consulted key stakeholders and carefully evaluated different models. As a result of our strategy review, we are convinced that pursuing a focused client-centric business model is the right choice for us. This business model, which is unique to Deutsche Bank, will get us closer to our roots.”\nThey concluded: “Our course for the next five years is simple: we are focusing to deliver value. We are confident that, by 2020, Deutsche Bank will be better capitalized and less leveraged; more cost-efficient; well-funded; more value-creating for shareholders; and better governed, with stronger systems and controls. We look forward to celebrating Deutsche Bank’s 150th anniversary by delivering results which are worthy of this great institution.”\nSix new decisions\nAs a result of its strategy review process, the Bank took six new decisions which support the next phase of its strategy. The Bank’s objectives are to:\nBuild a more focused, relationship-driven investment bank;\nReshape its retail business to focus on an advisory-led proposition and de-consolidate Postbank;\nDeploy digital technology across the platform;\nInvest to accelerate growth in GTB and Deutsche AWM;\nRationalize its geographical footprint by exiting or reducing its presence in some countries;\nTransform its operating model to achieve higher efficiency, reduced complexity, better resilience and resolvability.\nStrategy 2020 in Deutsche Bank’s core businesses\nCorporate Banking & Securities (CB&S) has gained market share while reducing balance sheet resources and selectively exiting lower-return business since 2012. In the next phase, CB&S aims further to de-emphasize lower-return business, increase its focus on client solutions and invest in growth in higher-return products. CB&S plans to reduce gross leverage by approximately EUR 200 billion, while redeploying EUR 50-70 billion to improve its position in relationship-driven businesses.\nPrivate & Business Clients (PBC) will focus on developing a leading advisory-driven, omni-channel proposition for private and commercial clients requiring a superior product offering. Between now and 2020, PBC aims to invest some EUR 400-500 million in digital technology. It also plans to reduce its branch network by up to 200 branches by 2017. PBC aims to remain a leader in Germany with strong positions in five other attractive European markets, serving over 13 million customers. The Bank envisages that it will re-IPO Postbank and expect its deconsolidation by the end of 2016.\nGlobal Transaction Banking (GTB): Strategy 2020 aims to maximize GTB’s strong global franchise, client synergies with CB&S, growth potential, attractive returns and net liquidity. Through 2020, the Bank plans to invest more than a cumulative EUR 1 billion in GTB’s platform and increase leverage exposure by more than EUR 50 billion to support GTB’s business with corporate and financial institution clients. GTB will also adapt its delivery model to focus on hub locations and focus more closely on the most mutually beneficial client relationships.\nDeutsche Asset & Wealth Management (Deutsche AWM) has gained considerable traction after an intensive restructuring launched in 2012. The business aims to accelerate growth by expanding its balance sheet by 5-10% per year until 2020, increasing the number of relationship managers by 15% in key markets, adding product specialists, and developing innovative products in growing asset classes.\nA more digital bank\nAcross all four businesses, the Bank will substantially invest in digital technologies. The Bank plans to invest up to EUR 1 billion additionally over the next three to five years in digitization to capture new revenue opportunities, for example, through remote advisory channels; realize platform efficiencies through automated or digitized processes; and develop new client propositions.\nFocusing Deutsche Bank’s geographical footprint\nThe next phase of the Bank’s strategy recognizes that centers of global economic power are shifting toward key emerging markets and cities. Through 2020, the Bank’s objective is to refocus its global footprint, reducing the number of countries or local presences by 10-15% and actively investing in markets and urban centres which are most relevant to international and multinational clients, play to the Bank’s existing strengths, and offer the most attractive growth prospects for the Bank’s core businesses.\nTransforming the operating model\nThe Bank aims to transform its operating model by simplifying its structure, strengthening its controls, and becoming more efficient, more resilient and more resolvable. Strategy 2020 targets additional annual gross savings of EUR 3.5 billion by 2020. Of these, the Bank aims to realize approximately 60% by efficiency improvements arising from digitization, infrastructure adjustments and other measures, and approximately 40% from rightsizing the platform as the Bank exits structurally unprofitable businesses, focuses its geographic footprint and reduces its branch network. To achieve these savings, Strategy 2020 foresees one-time costs to achieve of EUR 3.7 billion.\nThrough its existing Operational Excellence program, the Bank delivered EUR 3.3 billion of savings as of the end of 2014 and plans to deliver a further EUR 1.2 billion by the end of this year.\nMedium-term financial ambitions\nThe next phase of the Bank’s strategy sets clear financial ambitions for the medium term: a leverage ratio at or in excess of 5%, a CRD 4 Common Equity Tier 1 ratio of approximately 11%, a cost-income ratio of approximately 65% and a post-tax return on tangible equity of more than 10%. The Bank aspires to a payout ratio of 50% or more from dividends and, potentially, share buybacks.\nThe Bank will provide further details of execution, including its plans by business division, infrastructure function and region, decisions on geographical footprint optimisation and implementation timeline, within the next 90 days.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}