{
    "url": "https://www.db.com/news/detail/20150421-deutsche-bank-supports-transport-for-london-s-first-green-bond?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "April 21, 2015",
    "tags": [
        "Sustainability"
    ],
    "title": "Deutsche Bank supports Transport for London's first green bond",
    "body": "Proceeds from the ten year new bond issue will support the objectives of TfL’s Corporate Environmental Framework including the reduction of air pollution in London, improvements in natural resource management and preparing for the potential impacts of climate change. Deutsche Bank also acted as a lead manager on the TfL transaction.\nMarking Deutsche Bank’s investment, which was made out of the Bank’s London Branch, Colin Grassie, UK Chief Executive Officer said: “Deutsche Bank is pleased to have both advised on and invested in the first ever Green Bond issue from Transport for London. Leveraging the Bank’s expertise, we hope to build on TfL’s leadership in the UK Green Bond sector by encouraging more UK issuers and investors to consider funding products which target environmentally sustainable development.”\nSimon Kilonback, Director of Group Treasury at Transport for London said: \"We welcome Deutsche Bank Treasury’s investment which recognises London’s transport is helping to drive economic growth and environmental benefits to London and across the country and provides valuable support to the UK Green Bond sector. High profile contributions from leading UK investors help to build confidence in Green Bonds and encourage new issuers into the marketplace.”\nTherese McCarthy Hockey, Deutsche Bank’s Deputy Group Treasurer and Head of UK Treasury, the department responsible for managing Liquidity Reserve investments, also commented: “Deutsche Bank Treasury is pleased to be involved in TfL’s landmark Green Bond issuance and to utilise our liquidity buffer in a way that highlights the potential of the UK Green Bond market to the investor community.”\nGreen Bonds\nGreen Bonds are fixed income instruments which finance environmentally sustainable projects while offering competitive returns. Deutsche Bank is one of the founding members of the Green Bond Principles which establish voluntary guidelines for transparency and disclosure for the benefit of both issuers and investors.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}