{
    "url": "https://www.db.com/news/detail/20150420-the-account-on-your-wrist-deutsche-bank-offers-banking-via-the-apple-watch?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 20, 2015",
    "tags": [
        "Company",
        "Corporate products",
        "Digitalisation"
    ],
    "title": "Deutsche Bank offers Banking via the Apple Watch",
    "body": "  A new chapter in the relationship people have with technology: that's how Apple describes its new Apple Watch, which goes on sale in Germany on April 24, 2015. And, to go with it, Deutsche Bank has created a new, customised banking app. Using this app, mobile banking clients can view their personal financial information quickly and easily just by looking at their Apple Watch. All they need is an iPhone with the latest operating system and Deutsche Bank's free \"Meine Bank\" app.\n\"That's exactly how our clients want to do their banking today,\" says Markus Pertlwieser, Chief Operating Officer (COO), Private & Business Clients, at Deutsche Bank. \"They can now gain access to extensive financial services within a few seconds – literally with a flick of the wrist. Banking via the Apple Watch with Deutsche Bank is safe, convenient and fast.\"\nKeep a close eye on personal finances\nIn time for the launch of Apple's new smartwatch, Deutsche Bank's new banking via the Apple Watch service offers the following functions:\nFinancial overview: All accounts, cards and portfolios maintained with the bank – at a glance.\nTransaction overview: The Apple Watch app shows all the pending and executed transactions on an account, covering up to 90 transactions from the last 180 days. Credit card transactions for the current month are also displayed.\nPortfolio overview: The app offers a complete overview of all assets held in the client’s portfolio, such as equities, bonds and commodities, along with comprehensive information on the price, market and performance indicators for each individual asset.\nPersonal financial planner: Using Deutsche Bank's digital financial planner, clients can automatically allocate expenses from the last three months to categories such as household, living or travel.\nBranch and ATM finder: Shows up to 20 entries near the client's current location, with detailed information on the closest branch as well as the Cash Group and Shell cash services. One click starts navigation to the chosen destination.\nParticularly safe: no personal financial data is actually stored on the Apple Watch itself, preventing third parties from gaining access to account or portfolio information once the watch is no longer connected to the user’s iPhone in the event of theft or loss. Particularly client-friendly: as an extra feature, the app offers a voice-over function which reads content aloud. This makes banking via the Apple Watch perfect for blind and visually impaired people.\nTo transfer financial data to the Apple Watch, clients will need the latest version of the \"Meine Bank\" app installed on their iPhone. The minimum system requirements are an iPhone 5 with iOS 8.2. As soon as the Apple Watch is connected to the iPhone, the watch version of the app will be installed automatically and can be activated in a few easy steps. No additional login is needed on the Apple Watch.\nNext-generation banking\nDeutsche Bank has unveiled a series of new digital services for its clients in recent months. photoTAN, which makes mobile banking more convenient, and fingerprint login, which gives clients a safe login option using their fingerprints, have proven to be a hit. The Deutsche Bank mobile banking app has already been downloaded around one million times. Deutsche Bank plans to launch more than 70 digital services in 2015.\nMore information on these and other digital banking innovations as well as images for download are available at https://www.deutsche-bank.de/pfb/content/onlinebankingkampagne.html\nMore information about digital banking\nAs part of its Strategy 2015+, Deutsche Bank is investing EUR 200 million in its Private & Business Clients (PBC) division to advance digital banking for its private and business clients. Relevance and convenience for clients, high quality and speed to market are the criteria driving the development of PBC’s digital banking services.\nTo achieve these objectives, PBC is significantly expanding the range of services, information and interaction opportunities it offers clients and combining the advantages of online and branch banking. This includes giving clients 24/7 access from around the world to the bank’s expertise as well as the knowledge of its relationship managers by using digital technology in addition to its branch network.\nToday, half of Deutsche Bank’s more than 8 million clients in Germany already use its online services. Digital communication accounts for 80% of the division’s interaction with clients. The annual volume of credit transfers amounts to more than EUR 100 billion, with clients using mobile devices or their PCs for nine out of ten simple transaction banking processes.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 1
}