{
    "url": "https://www.db.com/news/detail/20150417-deutsche-bank-launches-siren-a-real-time-tool-for-tracking-the-eurozone-economy?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "April 17, 2015",
    "tags": [
        "Company",
        "Research"
    ],
    "title": "Deutsche Bank launches SIREN",
    "body": "Deutsche Bank Research announced today that it has created the first daily monitor of the eurozone economy that captures momentum as well as growth relative to expectations. SIREN, which stands for Summary Index of Relevant Economic News, is an essential product for anyone wishing to answer the following questions in real time: Is the eurozone economy accelerating or decelerating? Is growth faster or slower than expected? Are there signs of a turning point?\nDavid Folkerts-Landau, Group Chief Economist and Member of the Group Executive Committee said: “With 19 different member countries and countless data releases every month, the eurozone’s growth path is fiendishly hard to monitor – especially in real time. No longer. As the only index that includes both momentum and surprise components, SIREN is the most comprehensive and timely tracking tool available. Deutsche Bank continues to lead the way in European research.”\nThe creators of SIREN, senior economist Marco Stringa and strategist Nicholas Weng added: “SIREN is showing that since momentum troughed in November last year the eurozone economy has continued to improve steadily. It also confirms upside risk relative to our 1.4% year on year growth forecast as well as market consensus. Surprises troughed in September, turned positive in December and since then macro data have largely continued to surprise on the upside”.\nSIREN’s high frequency does not come at the cost of its ability to track gross domestic product. Indeed its correlation with eurozone GDP is superior to any individual monthly indicator. It also leads the OECD composite leading indicator for the eurozone thanks to its daily frequency. Similarly, its surprise component leads well-known peer surprise indices, and is less volatile too. This enhances the information content when assessing turning points.\nA full report, including background methodology on the new index and the current readings for the eurozone economy, is being published today.\n  For further information, please contact:\nDeutsche Bank AG\nPress and Media Relations\nEMEA\nGaël Gunubu\nPhone: +44 (207) 54 51374\nE-mail: gael.gunubu@db.com\nGermany\nDr. Axel Lüdeke\nPhone: +49 69 910 41750\nE-mail: axel.luedeke@db.com\nUS\nOksana Poltavets\nPhone: +1 (212) 250 0072\nE-mail: oksana.poltavets@db.com\nAsia\nCandice Sun\nPhone: +852 2203-7077\nE-mail: candice.sun@db.com",
    "number_of_ratings": 1,
    "rating": 1.0,
    "likes": 1
}