{
    "url": "https://www.db.com/news/detail/20211123-deutsche-bank-s-sustainability-linked-deals-win-accolades-at-financeasia-s-anz-awards?language_id=1",
    "language": "DE",
    "article_type": "Media Release News",
    "publish_date": "November 23, 2021",
    "tags": [
        "Asia-Pacific",
        "Awards"
    ],
    "title": "Deutsche Bank’s sustainability-linked deals win accolades at FinanceAsia’s ANZ awards",
    "body": "Deutsche Bank’s commitment to help advance sustainable economic growth and expertise in providing innovative solutions for clients in Australia was recognised by FinanceAsia as part of their Australia and New Zealand Achievement Awards for 2021. The bank was recognised for its work on landmark transactions, scooping Best Local Bond Deal, Best Deal - Corporate and Best Deal – Institution. \nGlenn Morgan, Deutsche Bank’s CEO in Australia, said: “We are always delighted to be recognised for the role we play in bringing innovative transactions to the market on behalf of our clients, but here we are particularly proud that the awards are all for ground-breaking sustainability-linked transactions,”\n“As a European bank operating in Australia, we play an important role in helping to partner with clients to execute their sustainability strategies and both transactions are a clear illustration of this in practice” Morgan added.\nThe Queensland Treasury Corporation (QTC) transaction saw Deutsche Bank take home \"Best Local Bond Deal\" and \"Best Deal - Institution\". In response to an evolving Green Bond market, Deutsche Bank managed QTC’s 2032 green bond, which priced at AUD 3bn. This bond marks the largest semi-government green bond in the local market. The proceeds from this issuance will be used to fund a variety of green projects, including renewable energy, clean transportation and water investments to support Queensland's transition to a low carbon, climate resilient and environmentally sustainable economy.\nThe \"Best Deal-Corporate\" was awarded to Deutsche Bank for the AirTrunk SSL Corporate Loan Conversion.\nActing as a Joint Sustainability Structuring Agent, Deutsche Bank successfully advised leading data centre operator AirTrunk in the conversion of its existing EUR 1.3bn corporate loan into a sustainability-linked loan (SLL).\nThis transaction is the largest SLL for a data centre globally and marks the first data centre loan globally to utilise Operating Power Usage Effectiveness (PUE) as a KPI to determine its loan margins. The existing loan, as well as future incremental loans, will be sustainability-linked, ensuring long-lasting positive impact on the environment and community as AirTrunk further expands their platform across Asia Pacific.",
    "number_of_ratings": 3,
    "rating": 1.0,
    "likes": 32
}