{
    "url": "https://www.db.com/news/detail/20211122-cop26-what-does-it-mean-for-financial-markets?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 22, 2021",
    "tags": [
        "Investment Bank",
        "Sustainability"
    ],
    "title": "COP26: what does it mean for financial markets?",
    "body": "The UN Climate Change Conference COP26 came to an end on Saturday, November 13 with nearly 200 countries agreeing to the Glasgow Climate Pact, along with a flurry of commitments and announcements from governments, companies, banks, NGOs and other organisations.\nDeutsche Bank was on the ground in Glasgow with a delegation of experts who talked to clients, development banks and other partners and stakeholders about green topics and how to help speed up the pace of change.\nRepresenting our Investment Bank were Henrik Johnsson, Co-Head of European Banking & Capital Markets; Claire Coustar, Global Head of ESG for our Fixed Income business; and Trisha Taneja, Head of ESG Advisory for our Origination and Advisory business. Talking points included how Deutsche Bank’s Investment Bank is working with clients to help them reduce their carbon emissions, and how it is providing and arranging funding for green projects such as solar and wind energy and energy-efficient real estate.\nIn a podcast recorded last week, Johnson, Coustar, and Taneja share their thoughts on how COP26 will impact the financial markets and the bank’s investment banking clients.\nListen in to find out more about the role of banks in combatting climate change, the agreement on carbon market regulations, the 130 trillion US dollars figure announced by the Glasgow Financial Alliance for Net Zero (which Deutsche Bank is a member of), the EU and China’s agreement on a common green taxonomy, the initiatives announced around mobilising capital for clean tech and developing countries, the UK’s introduction of mandatory climate disclosures and what to look out for in the year ahead.",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 9
}