{
    "url": "https://www.db.com/news/detail/20211121-olivier-vigneron-to-become-group-chief-risk-officer-of-deutsche-bank?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "November 21, 2021",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Olivier Vigneron to become Group Chief Risk Officer of Deutsche Bank",
    "body": "Olivier Vigneron has been designated as Deutsche Bank’s Group Chief Risk Officer, effective June 1, 2022. Subject to regulatory approvals, he will succeed Stuart Lewis, who in March announced his decision to retire after the Annual General Meeting 2022 after 25 years’ service. Olivier Vigneron will join Deutsche Bank as a Senior Group Director on March 1, 2022.\nVigneron is joining Deutsche Bank from Natixis, where he served as Chief Risk Officer since 2020.\nHaving started his career in credit derivatives trading at Goldman Sachs, he has more than 20 years of experience in financial services and held several senior markets and risk management positions across various banks, including three years of service in Deutsche Bank’s structured credit trading business between 2002 and 2005.\nAfter stints at UniCredit and BNP Paribas, Olivier Vigneron joined J.P. Morgan’s credit hybrids trading business in 2008. In 2012 he became Head of Model Development and Capital Analysis at J.P. Morgan, where he was responsible for the global implementation of Basel III advanced capital models.\nFrom 2015 he served as the bank’s Chief Risk Officer for EMEA and Firmwide Risk Executive for Market Risk, overseeing the bank’s market risk management globally. In this role Vigneron also served on the supervisory board of J.P. Morgan A.G. in Frankfurt and chaired its risk committee. Vigneron graduated from the École Polytechnique (Paris) with an engineering degree and holds a PhD in Economics from the University of Chicago.\nPaul Achleitner, Chairman of the Supervisory Board of Deutsche Bank, said: “The Supervisory Board would like to thank Stuart Lewis for his 10 years of outstanding service to the Management Board of Deutsche Bank. Stuart has played a vital role in establishing best-in-class risk controls for our bank and steered Deutsche Bank safely through some very challenging periods.\nWe are pleased that in Olivier Vigneron we have found a strong successor to support Deutsche Bank in maintaining and further developing its robust risk management capabilities. Olivier Vigneron has an exceptional expertise across all risk disciplines and will be a great addition to Deutsche Bank’s Management.”\nChristian Sewing, CEO of Deutsche Bank, said: “The Management Board and I are pleased to welcome Olivier to Deutsche Bank – in fact, to welcome him back to Deutsche Bank. Having been part of our structured credit business in the early 2000s, Olivier is no stranger to our firm. A stringent and global risk management regime will be of paramount importance for the banking industry in years to come. We are convinced that Olivier brings the global expertise and perspective required to assess and manage all risk types and to maintain Deutsche Bank’s strong track record in risk management.”\nOlivier Vigneron said: “Deutsche Bank is one of Europe’s leading financial institutions with a strong global network. I am very much looking forward to working with an outstanding risk management team that has a first-class reputation across the industry.”\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nSebastian Krämer-Bach\n+49 69 910 43330\nEmail: sebastian.kraemer-bach@db.com\nSebastian Jost\n+49 69 910 48180\nEmail: sebastian.jost@db.com                                     \nInvestor Relations\n+49 800 910-8000\ndb.ir@db.com\nAbout Deutsche Bank\nDeutsche Bank provides retail and private banking, corporate and transaction banking, lending, asset and wealth management products and services as well as focused investment banking to private individuals, small and medium-sized companies, corporations, governments and institutional investors. Deutsche Bank is the leading bank in Germany with strong European roots and a global network.\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement.\nSuch factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission.\nSuch factors are described in detail in our SEC Form 20-F of 12 March 2021 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 5,
    "rating": 5.0,
    "likes": 19
}