{
    "url": "https://www.db.com/news/detail/20211120-alexander-wynaendts-nominated-for-election-as-next-chairman-of-deutsche-bank-s-supervisory-board?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 19, 2021",
    "tags": [
        "Company",
        "Management & Leadership"
    ],
    "title": "Alexander Wynaendts nominated for election as next Chairman of Deutsche Bank’s Supervisory Board",
    "body": "The Nomination Committee of Deutsche Bank’s Supervisory Board recommends proposing Alexander (Alex) Wynaendts for election to the Supervisory Board at the Annual General Meeting on May 19, 2022. It is intended that he will subsequently be elected the successor to Paul Achleitner as Chairman. Achleitner, who will have served 10 years in the post, previously announced his decision not to stand for re-election. The recommendation to elect Alex Wynaendts to the Supervisory Board is subject to the approval by the Supervisory Board plenary.\nAlex Wynaendts brings extensive expertise and decades of in-depth experience in the global financial services sector to this role. From 2008 to 2020 he served as CEO of Aegon N.V., a leading European financial institution providing life insurance, pensions and asset management. He began his career at ABN AMRO, where he spent 13 years in private and investment banking in Amsterdam and London. Wynaendts joined Aegon N.V. in 1997 and held various leadership roles before becoming CEO in 2008. During his 12-year tenure, Wynaendts led Aegon through the financial crisis that started in the summer of 2008.\nHe was credited with restoring the company’s balance sheet and ensuring that the company maintained its strong capital position. He subsequently redefined Aegon’s strategy, successfully transforming the company into a client centric, purpose-driven and profitable organisation. Currently Wynaendts holds positions on several Boards of Directors, among them Citigroup, Uber Technologies and Air France-KLM. He also serves on the Salesforce Advisory Board for Europe, the Middle East and Africa. He will step down from the board of Citigroup.\nThe Supervisory Board will also recommend to the AGM to create the role of another Vice Chairman alongside employee representative Detlef Polaschek. Norbert Winkeljohann, who joined Deutsche Bank’s Supervisory Board in 2018, will be proposed for that role.\nOver the last several months, the Nomination Committee of Deutsche Bank, under the leadership of Mayree Clark, conducted a systematic and comprehensive search process for the new Chairman. “I am very pleased that Alex Wynaendts has accepted our invitation to join Deutsche Bank’s Supervisory Board and to lead the outstanding team Paul Achleitner has built over the past years,” said Clark. “He is a European at heart with a truly global perspective. He has a proven track record in the financial services industry, in-depth understanding of technology and has worked with regulators on both sides of the Atlantic.”\nPaul Achleitner said: “It is my strong belief that a high-performing company requires both a strong Supervisory- as well as a strong Management Board. Alex Wynaendts has exactly the right personality and skills to ensure a continued trustful working relationship between both boards at Deutsche Bank. With the people decisions we have taken in the recent past, Deutsche Bank is well underway on its path to sustainable profitability.”\nChristian Sewing, CEO of Deutsche Bank, said: “I look forward very much to working with Alex Wynaendts. He has vast experience in the financial industry and an excellent network, not only in Europe but also globally. Alex Wynaendts thus stands for what has always been Deutsche Bank's identity.”\nAlex Wynaendts said: “It is a great honour to have been nominated by Deutsche Bank as a member of its Supervisory Board. I very much look forward to joining this leading European-based financial institution and to serving the interests of Deutsche Bank’s stakeholders – its clients, employees, shareholders, and the communities in which it operates. It is my strong belief that Deutsche Bank is well placed to address the growing needs of its global client base. I am committed to support the leadership team and all employees in continuing with the successful execution of its strategy.”\nFor further information please contact:\nDeutsche Bank AG\nMedia Relations\nSebastian Krämer-Bach\n+49 69 910 43330\nEmail: sebastian.kraemer-bach@db.com \nSebastian Jost\n+49 69 910 48180\nEmail: sebastian.jost@db.com \nInvestor Relations\n+49 800 910-8000\nEmail: db.ir@db.com\nAbout Deutsche Bank\nDeutsche Bank provides retail and private banking, corporate and transaction banking, lending, asset and wealth management products and services as well as focused investment banking to private individuals, small and medium-sized companies, corporations, governments and institutional investors. Deutsche Bank is the leading bank in Germany with strong European roots and a global network.\nThis release contains forward-looking statements. Forward-looking statements are statements that are not historical facts; they include statements about our beliefs and expectations and the assumptions underlying them. These statements are based on plans, estimates and projections as they are currently available to the management of Deutsche Bank. Forward-looking statements therefore speak only as of the date they are made, and we undertake no obligation to update publicly any of them in light of new information or future events.\nBy their very nature, forward-looking statements involve risks and uncertainties. A number of important factors could therefore cause actual results to differ materially from those contained in any forward-looking statement. Such factors include the conditions in the financial markets in Germany, in Europe, in the United States and elsewhere from which we derive a substantial portion of our revenues and in which we hold a substantial portion of our assets, the development of asset prices and market volatility, potential defaults of borrowers or trading counterparties, the implementation of our strategic initiatives, the reliability of our risk management policies, procedures and methods, and other risks referenced in our filings with the U.S. Securities and Exchange Commission. Such factors are described in detail in our SEC Form 20-F of 12 March 2021 under the heading “Risk Factors”. Copies of this document are readily available upon request or can be downloaded from www.db.com/ir.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 56
}