{
    "url": "https://www.db.com/news/detail/20211116-deutsche-bank-successfully-completes-issuance-of-additional-tier-1-capital-instruments?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "Frankfurt am Main, November 16, 2021",
    "tags": [
        "Company"
    ],
    "title": "Deutsche Bank successfully completes issuance of Additional Tier 1 capital instruments",
    "body": "Today Deutsche Bank AG (XETRA: DBKGn.DE / NYSE: DB) issued Additional Tier 1 (AT1) capital instruments with a principal amount of total 1.25 billion euros. The issuance will allow prudent and cost-efficient management of Deutsche Bank’s AT1 stack while still meeting Pillar 1 and 2 AT1 requirements.\nThe securities will bear a fixed coupon of 4.50%, payable annually, until 30 April 2027. The Bank can call the securities, subject to prior supervisory approval on each day between 30 November 2026 and 30 April 2027, thereafter between 30 October and 30 April of each subsequent year. The applicable interest rate will be reset at five year intervals starting on 30 April 2027 on the basis of the then prevailing 5 year Euro swap rate plus the initial credit spread of 4.552% per year.\n“This issuance further strengthens Deutsche Bank’s capital position and enables us to support our clients in financing their activities,” said Dixit Joshi, Group Treasurer. “We reaffirm our commitment to managing our capital base in a prudent and cost-effective manner. We took advantage of favourable market conditions, supported by upgrades of Deutsche Bank from three leading rating agencies in recent months, and have now largely completed our 2021 issuance plan.”\nThe new AT1-securities (ISIN DE000DL19V55) are expected to be listed on the Luxembourg Stock Exchange and traded on its regulated market.\nThe denominations of the securities are 200,000 euros. Deutsche Bank AG acted as sole bookrunner for the offering. \nThe securities of Deutsche Bank AG mentioned in this release have not been registered under the Securities Act of 1933, as amended (“Securities Act”) and will be issued under “Regulation S” of the Securities Act only and may not be offered, sold or delivered within the United States absent registration under the Securities Act or an exemption from registration requirements.",
    "number_of_ratings": 2,
    "rating": 1.0,
    "likes": 0
}