{
    "url": "https://www.db.com/news/detail/20211115-christian-sewing-the-best-may-still-lie-ahead-for-our-industry-in-europe?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 15, 2021",
    "tags": [
        "Corporate products",
        "Private products"
    ],
    "title": "Christian Sewing: \"The best may still lie ahead for our industry in Europe”",
    "body": "Minister Boddenberg,\nState Secretary Kukies,\nLadies and Gentlemen,\nToday, I am very pleased to welcome you all in person for the first time again to open Euro Finance Week here at Kap Europa together with you. \nHowever, my joy is also tempered by the rising infection numbers that we are seeing; we know full well what they mean. The past few weeks, ladies and gentlemen, have shown us once again how important it is that we all get vaccinated. As much as I am concerned about individual freedom, I do see it as our civic duty to protect ourselves and others through vaccination.\nWhile the health consequences of the pandemic continue to impact us, one thing is certain: many companies have got through the crisis much better than feared, and I am also confident that this will continue. Credit for this goes first and foremost to the politicians, who responded quickly and effectively. And we, the banks, were also able to keep our promise to be part of the solution.\nFor this reason, the outlook remains positive overall: our economists anticipate economic growth of 4.2 percent worldwide and 4.5 percent in Germany in 2022.\nRisk environment has deteriorated further\nHowever, this is only a fairly general indicator. Overall, the picture is much more differentiated. We are currently looking at a political and economic environment that seems to be getting continuously riskier – a trend I already addressed here last year. The number of potential flashpoints is increasing. Therefore, I cannot spare you from starting with an economic policy risk analysis this year as well, which goes far beyond the danger of a fourth wave of the pandemic.\nFirstly, global trade. The pandemic has made us painfully aware of how fragile seemingly perfect supply chains can be. Let's not fool ourselves: the extent to which value chains are currently fragmenting was not on anyone's agenda. No one thought that supply would be the brake on growth, not demand. There are bottlenecks the likes of which we have not seen for decades and which are somewhat reminiscent of the oil price shock in the 1970s – with the well-known consequences for price trend.\nEveryone now agrees: there will be no return to the smooth global trade of the pre\u0002coronavirus era any time soon, regardless of how the pandemic develops. The only question is how long it will last and how bad it will be. What is certain is that the current trend will have lasting consequences for the behaviour of the major economies. For security reasons alone, many countries will do their utmost to become more autonomous from a strategic point of view; although we can consider ourselves lucky to be part of the EU in this respect.\nAll this is happening in a global environment that is already very tense, particularly the relationship between the US and China. As expected, the new US administration has brought a generally more constructive tone back into international relations, but no turnaround in its policy towards China. The strong reaction of the US to the latest escalation in the conflict between China and Taiwan even raises fears of a further escalation. And this would, of course, also have consequences for Europe and our economy – exactly what kind is difficult to predict.\nAdded to this are the tensions within Europe. The situation on the border between Poland and Belarus is a depressing reminder that the European Union must reckon with conflicts on its borders that have an impact internally. This puts European unity and also Europe as a community of values to the test before the eyes of the whole world. Here, too, the consequences are difficult to predict.\nThe international conflicts unfortunately also cast their shadow on the fight against the climate crisis, the greatest challenge of our generation. The outcomes of the recent G20 summit as well as the UN Climate Change Conference in Glasgow show: CO2 and climate risks are increasingly becoming strategic location factors, but so far they have been difficult to price. There are great ambitions in\nthe fight against climate change, but so far there is no reliable framework, there are no clear programmes, no credible interim targets. Only one thing is clear: gigantic investment programmes are coming our way.\nAgainst this background, rapidly rising global public debt is a cause for concern. According to data from the International Monetary Fund, global government, corporate and private household debt rose to 226 trillion dollars last year. This is the highest level on record, and the 27 trillion dollar year-on-year increase is also unprecedented. For all the success of the emergency measures against the coronavirus crisis, this debt burden is simply unsustainable in the long term and a constant potential trouble spot for the global financial markets. The money we spend has to be earned. This natural law of economics still applies at the end of 2021.\nThe ultra-loose spending policies of many governments are only made possible by an equally generous monetary policy that drastically intervenes in pricing on the bond market. But this in turn has considerable risks and side effects: inflation is on the rise around the world faster than any economist would have anticipated a year ago. In Germany, the inflation rate in October was 4.5 percent; in the US, it was\neven over six percent.\nThe central banks assume that this is a temporary effect. Our economists do not share this opinion. And I personally am sceptical about monetary stability from what I hear in conversations with our clients. They are all preparing for inflation rates that will remain high for longer. And we know what that means: if inflation expectations rise, inflation usually rises at some point as well. Market participants start to anticipate price increases. And this will also have an impact on wage negotiations.\nI think that monetary policy must counteract this – and sooner rather than later. The supposed cure-all of the past years – low interest rates with seemingly stable prices – has lost its effect, now we are struggling with the side effects.\nIn short: the consequences of this ultra-loose monetary policy will become increasingly difficult to fix the longer central banks fail to take countermeasures. \nEurope's banks have become more resilient and the best may still lie ahead for them\nThe environment in which we operate has once again become more complex and uncertain. We live in a world with higher risks, political conflicts and economic disintegration.\nAll of this increases the strategic importance of banks for Germany and Europe. In this permanently more complex environment, it is essential that an economy – and especially an export-oriented economy like the German and European economy – can rely on strong banks.\nThe good news is that our industry is much more resilient today than it was ten or 15 years ago. If proof was needed, we have provided it over the past year and a half. During the Covid-19 pandemic, we, the banks, had to absorb sometimes high write-downs and yet remained on track. And this does not only apply to the US banks, which are excelling with record profits. No, the banks in Europe have also proven in the past quarters that they are crisis-proof, stable and not least profitable. In the current year, almost all leading financial institutions in Europe have achieved significant profit increases, and many of them have exceeded market expectations.\nAll this, ladies and gentlemen, is no coincidence. While in some places the swan song has been sung, many European banks have worked hard in recent years to clear the backlogs from the financial crisis and to position themselves for the future. They have adjusted their business models and cleaned up their loan books – the share of non-performing loans is only just above four percent even in Italy and Spain, and only one percent in Germany. On this basis, the industry then prudently expanded business again, while at the same time increasing its capitalisation, improving controls and imposing painful cost-cutting programmes on itself.\nThis is now paying off.\nThe next stage of the transformation\nAnd I argue that the best may still lie ahead for our industry in Europe. Namely, when we now go to the next stage and transform ourselves further.\nThe requirements for this are twofold: firstly, we, the banks, need to better adapt to the changing risk environment and to generational trends such as digitalisation and sustainability. Secondly, the regulatory environment must also be designed in accordance with the geostrategic role of the banks.\nLet me start with what we as banks need to do:\nFor a long time, it seemed as if banking was gradually becoming a kind of standard commodity. The need for advisory services declined in many areas, our clients became more and more self-sufficient. \nThat has changed fundamentally: the need for digital and sustainable transformation, as well as the changing global landscape, means that demand for advisory services is rising again – and rapidly. Our task now is to to accompany our clients through this transformation as consultants and risk managers. It is about exploring opportunities and hedging risks, putting expertise and networks at the service of our clients. It is about accompanying them when financing becomes more complex because new factors, such as CO2 emissions or biodiversity, have to be considered. It is about creating platforms that reduce this complexity for our clients.\nIn short: we must do all we can to help our clients find answers to their biggest challenges and position themselves for the future. And that means nothing less than a renaissance of good old-fashioned banking advice.\nSustainability as a great opportunity\nThe big issue of sustainability will increasingly take centre stage. No one should believe that it will disappear again. Anyone who waits for this to happen will risk their raison d'être and will eventually disappear from the market themselves.\nThe UN Climate Change Conference has also shown this: political results may have fallen short of the high expectations, but one thing should encourage us all: at the level of the companies and also the banks, things are now getting serious. This became impressively clear in Glasgow. I would even say that the issue has developed the kind of momentum that I have only experienced in more than 30 years, at most, with digitalisation.\nHowever, while digitalisation was seen as a threat for banks, sustainability is a great opportunity because, as in the Covid-19 pandemic, we can be part of the solution here. We are needed; not only our balance sheet, but also our expertise. And we, the banks, would do well to invest right here.\nEuropean banks could benefit significantly from the trend towards the green economy because the European and even more so the German economy is particularly well positioned in this area. After all, we are the country with the best engineers in the world. We have the opportunity to develop the sustainable energy, building and mobility concepts of the future and to make Europe a market leader in this area, even though competition has undoubtedly become fiercer in green technologies as well.\nWe are already feeling Europe's strength in this area in the market for sustainable financing and bonds. European banks are among the drivers here and have a significantly higher market share than with conventional bonds. Overnight, the European Union has become the leading issuer of green bonds, with the support of the local banks. And the further potential is enormous.\nBut it must not stop at individual initiatives. The aim is to establish Europe as a leading location for the green transformation in cooperation with companies, politics and science – without losing sight of the social components.\nTo achieve this, as banks we still have some homework to do, but we are not the only ones. Politicians are also called upon. We need coherent, universally accepted agreements on which economic activities are to be considered sustainable, which ones we can take together into the new greener world. We need a common language to enable a socially acceptable transition to a low-carbon future. We need uniform principles and standards for how we measure sustainability in order to create transparency and trust.\nAnd there is something else we urgently need in order to become leaders in the area of sustainability. And that is capital.\n\nCapital on a scale that neither banks nor governments in Europe will be able to handle on their own. I know I'm repeating myself here, but I can't say it often enough: Europe needs a strong, integrated capital market.\nLadies and gentlemen, I would like to remind you of a man who realised this three decades ago. His name is Hilmar Kopper; he passed away last Thursday after a short illness. I know that many of you share our grief because you met Hilmar Kopper at some point; he was a unique Spokesman of the Management Board and later Chairman of the Supervisory Board of our bank.\nKopper was a man of great vision. He was already aware in the 1990s that a bank that wants to support its clients all over the world and on large projects needs access to the global capital markets. Achieving this required decisive and also courageous steps.\nHilmar Kopper, in his determined way, laid the foundation for Deutsche Bank in its present form. We are one of the very few banks in Europe that can be there for its clients worldwide and the only German bank with such extensive expert knowledge of capital markets. This is also to Hilmar Kopper’s credit. He always realised that we need these capabilities in Europe and must not leave this strategically important field to foreign banks alone.\nLadies and gentlemen, this is all the more true in complex times like the present. And I hope that, in the spirit of Hilmar Kopper, we now also do everything to ensure that Europe itself finally gets a strong, single market for capital– not least to finance the sustainable transformation that we have ahead of us. Without a capital markets union, I am convinced that there will be no green deal. Or to put it positively: there is no more cost-effective green stimulus package for Europe than the capital markets union.\nOf course, this also means that we need large and strong banks in Europe that can be proactive for their clients on the capital market. This is exactly why we need a banking union. And that is precisely why we have to make compromises in Germany as well. If there are to be trans-European banks in the future, there must also be a common European deposit guarantee.\nUnfortunately, there has been no progress on this issue for far too long. That is why I am all the more pleased that Finance Commissioner Mairead McGuinness has recently reopened the debate with a call to complete the banking union. Our support is assured and we look forward to a constructive dialogue with Brussels.\n\nStructural disadvantages for EU banks\nThis brings me to the second requirement that is needed for us, the banks, to be able to successfully support the transformation of our clients. We need tailwind from politicans and regulators.\nI am not talking here about the interest rate policy and the interest rate gap with other currency areas, which causes us great harm here in the euro zone and has now become a major competitive disadvantage.\nNo, there are still at least three competitive disadvantages that are or at least could become substantial:\nThe first disadvantage concerns the securitisation market, which in Europe is just one tenth the size of the US market. Mistrust of securitisation is still high more than ten years after the financial crisis – unjustifiably so, as it could help to build a bridge between bank financing and the capital market, funding large investments efficiently and with well-diversified risks. By converting bank loans into securities, we can ease the burden on bank balance sheets and thus increase the scope for further lending to the economy. When Europe's policymakers review the securitisation framework in the coming months, they should urgently dismantle the current rigid regulation. Europe's economy would benefit greatly from this.\nThe second issue is the European Single Resolution Fund, the SRF. It is growing and growing, but not because the risks in the banking sector have become greater. Rather, the fund volume and thus the banks' contributions are linked to the amount of deposits, which have risen sharply due to the continued expansionary monetary policy.\nAs a result, 52 billion euros is now already sitting unused in the fund. Nevertheless, the EU plans to collect the full amount of contributions for 2022 and 2023, which would far exceed the fund's original target amount of 55 billion euros. And this comes at a time when we urgently need capital.\n\nHow could we solve this?\nFirstly, the contribution assessment basis should now be adjusted so that contributions are substantially reduced.\nSecondly, we propose that the money be used to build up a fund that would grant direct loans to the economy, based on clear EU directives.\nThis is a solution that would benefit all parties involved and use the fund's capital wisely.\n\nA significant factor for competition will also be how the capital requirements post Basel III are expanded, and that is my third point.\nThe EU Commission has recently made a proposal for how the EU supervisory framework could be changed. We found some positive things in it. In particular, the draft takes into account the special nature of the European banking market, such as the high proportion of low-risk mortgages in loan portfolios or the economic importance of small and medium-sized enterprises. The longer transition periods will also help the industry, of course. On the other hand, many of the exemptions are temporary and there is no legal or planning certainty. And the bottom line is that the additional capital requirements are still significant.\nConclusion\nLadies and gentlemen, I have described to you the overall situation as it appears to me; I have talked about the general environment, which is characterised by risks and uncertainty, but also offers us great opportunities. \nTo seize these opportunities, we need strong banks – Europe needs strong banks. Banks that are not only profitable, but determined to tackle the challenges that lie ahead. And we also need European investment banks that are positioned to support Europe's businesses effectively.\nIn the coming years, strategic decisions will have to be made that will determine the balance of economic power in the decades to come. We in Europe must not hand over the reins here. The strength of the banking system has long since become a geopolitical competitive factor. We should treat it accordingly.\nThis requires close cooperation between banks and their clients, but also between banks, regulators and politicians.\nEurope is built on the principle of cooperation. And this is also the key for the future. In a world where global power balances are shifting, those who are willing to cooperate closely and create a strong community of values will succeed. And that is why I argue so strongly for an even deeper integration of our continent because I am convinced that we can only grow and increase prosperity if we focus on what Europe has in common and what unites us. Because this is the only way we can pave the way for a politically and economically strong future for Europe.\nBut we must also tread this path with determination. We in Europe are often still too hesitant when it comes to shaping our own future. What we need is a different attitude. Let's get things done now – with a clear plan and disciplined and strong implementation.\nWe, the banks, stand ready to tread this path together, as a strong partner and part of the solution.\nThank you very much.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 14
}