{
    "url": "https://www.db.com/news/detail/20211112-hilmar-kopper-has-passed-away?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "November 12, 2021",
    "tags": [
        "Company",
        "Personnel announcements"
    ],
    "title": "Hilmar Kopper has passed away",
    "body": "Deutsche Bank AG mourns the death of its former Spokesman of the Management Board, Hilmar Kopper, who passed away on Thursday at the age of 86 after a short but serious illness, surrounded by his family.\nHilmar Kopper served Deutsche Bank for 48 years – his entire professional life. He started his career in 1954 as a trainee at Rheinisch-Westfälische Bank and, after time spent in New York and in the bank’s international banking unit he was appointed branch manager in Leverkusen in 1969. He joined the bank's Management Board in 1977 and oversaw, for example, the construction of the two towers that are Deutsche Bank’s Frankfurt headquarters.\nAfter the assassination of Alfred Herrhausen in 1989, the Management Board appointed Hilmar Kopper as its new Spokesman – a position he retained until 1997. He was then Chairman of the Supervisory Board until May 2002. Kopper also represented Deutsche Bank in various national and international institutions and supervisory boards. For example, for many years he was Chairman of the Supervisory Board of what is today Daimler AG.\nKopper played a key role in shaping Deutsche Bank and setting the course for its global orientation. Under his aegis, Deutsche Bank took decisive steps in growing its international capital markets business. One of these was the acquisition of Morgan Grenfell in 1989, another the preparations for the takeover of Bankers Trust during his time as Chairman of the Supervisory Board.\nHe also made his mark in Germany, for example by building up retail banking in the former East Germany. In addition, Deutsche Bank expanded its presence in Eastern and Southern Europe under his leadership.\nKopper also pushed for a reappraisal of Deutsche Bank's past under National Socialism, which led to the publication of historian Harold James' widely acclaimed study as part of the book \"Deutsche Bank 1870-1995\".\nPaul Achleitner, Chairman of the Supervisory Board of Deutsche Bank, paid tribute to Hilmar Kopper as one of the most influential board members in Deutsche Bank's postwar history: \"With Hilmar Kopper, Deutsche Bank loses one of its most formative personalities. In his time, he steered the bank with leadership and foresight, and with a clear understanding of how much globalisation would change the banking business. In doing so, he laid the foundation for what the bank is today: a globally successful universal bank with a strong business in its home market of Europe, a global network and deep capital market expertise.\"\nChristian Sewing, Chief Executive Officer of Deutsche Bank, said, \"Hilmar Kopper was closely associated with our bank throughout his professional life and beyond. He was a role model for our employees. As Spokesman of the Management Board, he took on responsibility for our bank at a difficult time following the death of Alfred Herrhausen. He strategically shaped our bank and set the course for us to be able to serve our clients around the world as a global Hausbank today. Our thoughts and condolences are with his wife and children. We will be sure to honour Hilmar Kopper's memory.\"",
    "number_of_ratings": 10,
    "rating": 4.7,
    "likes": 15
}