{
    "url": "https://www.db.com/news/detail/20211109-sundp-upgrades-deutsche-bank-s-issuer-credit-rating-from-bbb-to-a?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "November 9, 2021",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "S&P upgrades Deutsche Bank’s Issuer Credit Rating from BBB+ to A-",
    "body": "S&P Global Ratings (Standard & Poor’s) has upgraded several of Deutsche Bank’s ratings, including the Long-Term Issuer Credit Rating and Senior Preferred Debt Rating, from BBB+ to A-, outlook stable. The Issuer Credit Rating is an important benchmark of credit quality for clients and other counterparties who trade with the bank. Deutsche Bank’s counterparty ratings are now in ‘A’ territory with all leading rating agencies.\nS&P commented: “Deutsche Bank’s transformation program is delivering tangible benefits. The upgrade indicates that the operational restructuring launched in 2019 is transforming Deutsche Bank into a more profitable, more focused and better-controlled group.”\n“It’s very encouraging to see our progress on Deutsche Bank’s transformation recognised, once again, by a leading rating agency,” said Christian Sewing, Chief Executive Officer. “These upgrades reflect that our strategy is the right one and that we are executing well. Importantly, they also enable us do more business with our clients.”\n“This is a significant milestone on our transformation journey,” added James von Moltke, Chief Financial Officer. “Our re-focused business model is delivering improved profitability with tight risk and balance sheet management. These upgrades support us on the path toward our 2022 targets.”\nS&P’s action represents the third ratings upgrade from a leading rating agency in recent months. Deutsche Bank’s ratings were upgraded by Moody’s in August and by Fitch in September. \nDrivers of these upgrades, in S&P’s own words\nQuality of both strategy and execution. S&P commented: “The transformation program is more decisive than previous editions in addressing Deutsche Bank's competitive weaknesses: excessive costs and too many underperforming business units.” The agency added: “Furthermore, we see greater rigor in senior management's execution of the plan, and the bank is achieving its milestones as it works toward its 2022 financial targets. This has positive implications for franchise stability and the predictability and sustainability of earnings.”\nRevenue resilience despite restructuring and interest rate headwinds. S&P noted: “Despite its restructuring, Deutsche Bank has been able to leverage favorable market conditions to grow revenue. In particular, it has benefited from buoyant capital markets activity in recent quarters. This demonstrates the continued strength of its investment bank franchise and mitigates margin pressure from prolonged negative euro interest rates.”\nPositioned for continued earnings growth. The agency believes Deutsche Bank is well placed to benefit from both internal and environmental factors: “We expect that Deutsche Bank's earnings will improve further in 2022 as transformation charges fall away, operating costs decline, and the CRU winds down. Interest rate headwinds are also easing thanks to deposit repricing, rising long-term euro rates, and loan growth.”\nA solid risk profile. S&P described Deutsche Bank’s risk management as a contributor to their decision: “We think Deutsche Bank has a good track record in financial risk management, and its credit exposures are well-diversified and significantly collateralized.”\nCost discipline does not prevent key investments. S&P noted that, the bank’s cost discipline has not diluted our commitment to continued control and technology investment. The agency said: “Importantly, Deutsche Bank's focus on cost efficiency does not appear to have squeezed necessary investments in internal control remediation, including its anti-financial-crime framework.” S&P added: “the bank's ongoing technology investments are crucial to its medium-term ability to remain competitive.”\nCapital and liquidity strength. For S&P, Deutsche Bank’s conservative balance sheet management has delivered results. The agency noted: “Deutsche Bank maintains sound capital, bail-in buffers, and liquidity. The Common Equity Tier 1 ratio was 13.0% at Sept. 30, 2021, and we expect it will remain about that level. Deutsche Bank's liquidity and funding profiles remain solid, in our view.”\nAn overview of Deutsche Bank’s ratings with leading agencies, including the upgrades announced by S&P, is as follows:",
    "number_of_ratings": 1,
    "rating": 4.0,
    "likes": 12
}