{
    "url": "https://www.db.com/news/detail/20250218-deutsche-bank-dominates-high-yield-bonds-in-asia?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "February 18, 2025",
    "tags": [
        "Asia-Pacific",
        "Investment Banking"
    ],
    "title": "Deutsche Bank dominates High Yield Bonds in Asia",
    "body": "Deutsche Bank's expertise in financing earns prestigious recognition in the Asia Pacific region. The bank was named Asia’s High-Yield Bond House of the Year from IFR. Deutsche Bank also secured 14 wins at The Asset Triple A Sustainable Finance Awards 2025.\nDeutsche Bank: A force in the Asian High-Yield Bond Market\nDubbed Asia's \"championship team\" by IFR, Deutsche Bank demonstrated unparalleled expertise in the region's high-yield bond market. The bank garnered recognition for its role in reviving the Asian high-yield bond market by structuring innovative deals, guiding debut issuers, and finding investor demand even in challenging markets.  \nIFR highlighted Deutsche Bank as the \"runaway leader\" in introducing debut issuers to the market. The bank's success stemmed from its deep understanding of investor sentiment, intelligent deal structuring, and ability to identify pockets of demand. Notable debut deals that solidified Deutsche Bank's leadership include Sorik Marapi's green bond and Golomt Bank's landmark Mongolian issuance, setting new benchmarks in the Asian high-yield bond landscape.\nThese accolades are a testament to our unwavering commitment to providing innovative and bespoke solutions for our clients. In a volatile market, our team's deep expertise and dedication have been instrumental in helping clients navigate challenges to achieve their financing objectives. \nEd Tsui, Head of DCM and Syndicate for Asia Pacific\n“We have never stopped providing solutions to our clients in the last two years. We’re building this market one issuer at a time,” said Ed, emphasizing the bank's commitment to nurturing the market's growth.\nBeyond debut issuances, Deutsche Bank solidified its position by fostering long-term relationships with clients, securing repeat business from key players like Shriram Finance.\n“Once we have taken a capital market issuer out, we almost always do their repeat bonds. The whole business is about finding those new targets and maintaining relationships in the old ones,” said Sameer Gupta, Head of South Asia DCM.\nA leader in Sustainable Finance in Asia Pacific\nDeutsche Bank APAC continues its winning streak, receiving recognition for its commitment to sustainable finance at The Asset Triple A Sustainable Finance Awards 2025. The bank garnered 14 awards, highlighting its exceptional performance in structuring and executing deals across five key markets: China, Hong Kong SAR, India, Singapore, and Vietnam.\nThe awards spanned a diverse range of categories, reflecting Deutsche Bank's comprehensive expertise in sustainable finance solutions. Some notable wins include:\nChina\nBest Bond for a Sovereign: Ministry of Finance of the People’s Republic of China dual-tranche 2 billion US dollar senior issuance\nBest Green Bond for a Corporate: CK Hutchison Holdings 1 billion US dollar green bond\nBest Green Bond/Blue Bond – Provincial Government - People’s Government of Hainan Province of the People’s Republic of China CNH3 billion triple-tranche dim sum bond\nBest Green Bond/Blue Bond – Financial Institution - China Construction Bank (London) 1 billion US dollar green bond and CNH2 billion blue bond\nBest Bond – Corporate - Alibaba Group Holding 5 billion US dollars equivalent dual-currency multi-tranche senior unsecured fixed rate notes\nBest Syndicated Loan – Internet Technology - ByteDance Limited 10.80 billion US dollar term loan and revolving credit facilities\nHong Kong SAR\nBest Green Bond – Transport - MTR Corporation CNH4.5 billion dual-tranche green bond\nBest Bond - AIA Group US$1 billion subordinated securities\nBest Local Currency Bond - Urban Renewal Authority 16 billion Hong Kong dollar triple-tranche fixed rate notes\nBest Syndicated Loan – Logistics - Winner Star Holdings 1.25 billion US dollars equivalent syndicated term loan facilities\nIndia\nBest Sustainability Bond - Piramal Capital & Housing Finance 300 million US dollar sustainability bond\nBest Social Loan – NBFI - Shriram Finance 468 million US dollar equivalent dual-currency syndicated social term loan facilities\nSingapore\nBest Securitization - Maybank Singapore 500 million euro soft bullet covered bond\nVietnam\nBest Equity-Linked Deal - Vinpearl Joint Stock Company 150 million US dollar exchangeable bond and concurrent repurchase of outstanding 2026 exchangeable bond",
    "number_of_ratings": 2,
    "rating": 3.5,
    "likes": 2
}