{
    "url": "https://www.db.com/news/detail/20161116-deutsche-bank-and-sydney-contemporary-announce-new-partnership?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 16, 2016",
    "tags": [
        "Art",
        "Company",
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank and Sydney Contemporary announce new partnership",
    "body": "Deutsche Bank is pleased to announce a partnership with Sydney Contemporary, Australia’s premier contemporary art fair. As Principal Partner of the Fair for up to three years, Deutsche Bank is strengthening its commitment to making contemporary art accessible to new audiences.\nJames Roth, Deutsche Bank’s Co-Head of Corporate Finance Australia and member of the Biennale of Sydney’s Board of Directors, said: “We are thrilled to be partnering with Sydney Contemporary. This partnership is a reflection of both our long-standing commitment to contemporary art in Australia and our endorse¬ment of the Sydney Contemporary’s success as Australia’s largest and most diverse gathering of local and international galleries.”\nRoth continued: “We are incredibly proud of our commitment to contemporary art and consider it an important part of our cultural fabric. This new collaboration is in line with the Bank’s sponsorship of other leading art fairs around the globe, including the Frieze Art Fair and Frieze Masters in London as well as Frieze New York, and provides us with an exciting opportunity to engage with clients, employees and the art loving public.”\nSydney Contemporary founder, Tim Etchells, stated: “We are delighted that Deutsche Bank has decided to partner with Sydney Contemporary. Their passion for art is unprecedented in the corporate sector. We first worked with Deutsche Bank in the early days of Art HK, and they were great partners. We are looking forward to renewing the relationship going forward.”\nAbout Deutsche Bank\nDeutsche Bank’s partnership with Sydney Contemporary extends its global commitment to promoting cultural vibrancy in the markets in which it conducts business. Under the motto “Art Works”, Deutsche Bank has made contemporary art widely accessible through its own collection, exhibitions and cooperative ventures for over 35 years. Today, the Deutsche Bank Collection is one of the most significant corporate art collections in the world. In April 2016, the bank united its activities in support of Art, Culture & Sport (ACS) into one independent unit.\nIn Australia, Deutsche Bank has enjoyed a relationship with the Biennale of Sydney and the Museum of Contemporary Art (MCA) Australia for many years. The Bank’s Education Partnership with the MCA (2010-2016) is still one of the most significant commitments to contemporary art in Australia, enabling the launch of the National Centre for Creative Learning, with more than 88,000 visitors since its opening in 2013.\nFor more information about Deutsche Bank’s Global Art Program, please go to www.art.db.com and www.db-artmag.com.\nAbout Sydney Contemporary\nSydney Contemporary is Australia’s international art fair, showcasing work by emerging and established artists from leading Australian and international galleries. Housed once again in Carriageworks, located within Sydney’s striking contemporary arts precinct, the third edition will take place from 7 to 10 September 2017.\nWith a thriving art scene and a growing collector base, Sydney is a dynamic cultural destination with an international reputation for presenting the very best in visual art through its public institutions, private collections, leading commercial galleries and the internationally renowned Biennale of Sydney, the third oldest in the world. Defined by the vibrancy of its host city, Sydney Contemporary provides commercial galleries with a dynamic platform to showcase the work of emerging and established artists, enabling local and visiting audiences to build on their existing knowledge, and develop their international art collections.\n\nFor further information please contact:\nDeutsche Bank AG\nPress & Media Relations\nJill Valentine (Sydney)\nPhone: +61 (2) 8258 2162\nE-mail: jill.valentine@db.com\n\nKlaus Winker (Frankfurt am Main)\nPhone: +49 69 910 32249\nE-mail: klaus.winker@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}