{
    "url": "https://www.db.com/news/detail/20161115-made-for-good-supports-entrepreneurs-who-want-to-change-the-world?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "November 15, 2016",
    "tags": [
        "Corporate Citizenship",
        "Entrepreneurship",
        "Research"
    ],
    "title": "Made for Good supports entrepreneurs wanting to change the world",
    "body": "Every November, across 160 countries, the Global Entrepreneurship Week (GEW) inspires people to explore their potential as self-starters and innovators. This year’s GEW takes place between November 14-20 and will range from large-scale competitions and events to intimate networking gatherings. Through local, national and global activities, the week will aim to connect participants to potential collaborators, mentors and even investors.\n\nTogether with our partner Social Impact gGmbH, we have enabled the Ready for Finance since 2013 / Photo: Christian Klant\nDeutsche Bank’s programme for social entrepreneurs\nMade for Good, Deutsche Bank’s enterprise programme for social good, has the same goal: to help start-ups and early-stage enterprises — microenterprises, non-profits and commercial businesses — build momentum and capacity. The programme supports entrepreneurial ventures that create wider social good by exploring solutions for societal problems, mapping routes out of poverty and contributing to economic growth.\nThe importance of financial services support\nWhile it is assumed that businesses pursuing these goals receive plenty of funding, studies actually show their success is being restricted by a lack of support. Over 80 percent of impact investors disregard seed or start-up stage businesses. Deutsche Bank has the commercial insight to step in and help businesses at every level with advice and support, a broad network and funding sources.\nEurope’s potential for social enterprise\nWhile the US is regarded as the best place for social enterprises, according to research by the Thomson Reuters Foundation, cities like Berlin and London have been identified as hotspots too. Deutsche Bank and its partners — the Global Social Entrepreneurship Network and UnLtd — sponsored this ground-breaking new research to analyse worldwide conditions for start-ups dealing with social challenges. “Being part of this research enables Deutsche Bank to help build momentum and capacity for this exciting sector,” said Lareena Hilton, Global Head of Brand Communications & CSR at Deutsche Bank.\nHelping unlock Germany’s social start-ups\nIn Germany young, aspiring social entrepreneurs have traditionally faced many challenges. To raise awareness, Deutsche Bank enables the annual Landmarks in the Land of Ideas competition since 2006 to showcase 100 innovative initiatives and sustainable business models. This year, the winner of the public vote was the online course of openSAP called “Auch du kannst das. Deutsch für Asylbewerber” (“You can do it, too! German for Refugees”). The initiative supports the integration of refugees by providing an online platform for volunteers to teach German to the newcomers.\n\nWinner of the Impact Fund: the social start-up „Climb“ fosters an engaging learning environment during school breaks / Photo: Mario Andreya\nSupporting the integration of refugees in Germany\nThis important cause is reflected across several Made for Good initiatives. In early 2016, Deutsche Bank, Social Impact gGmbH and SAP started a joint accelerator programme, the so-called Wirkungsfonds (impact fund), to enable refugee-focused start-ups to scale their business models:\nThis initiative is the first of its kind in Germany and provides charitable grants to social start-ups that tangibly improve the social and economic participation of refugees in Germany. The total funding available is EUR 200,000 with grants of up to EUR 25,000 available for each initiative. The best six, as decided by a public vote, will pitch in January for the remaining EUR 60,000 in the fund.\nThe value of Deutsche Bank volunteers\n“Interaction with Deutsche Bank volunteers, who are industry experts, is so valuable for our start-ups,” said Norbert Kunz, Founder and CEO, Social Impact. Made for Good provides direct access to the business know-how Deutsche Bank employees can offer. As judges, mentors and advisers, volunteers can give practical guidance on how to manage the road ahead.\nIn October, Deutsche Bank employees brought Start with a Friend to Frankfurt am Main. The social initiative fosters the integration of refugees in Germany through mentoring partnerships. Over the last year, colleagues invested over 14,000 hours of free consulting to social enterprises or charities. In addition, more than 170,000 people were reached through the bank’s enterprise initiatives in 12 countries over a five year period.\nThe global impact of Made for Good\nIn the UK, the Deutsche Bank Awards for Creative Enterprise helped to launch approximately 200 creative business ventures.\nIn India, together with the Be! Fund, Deutsche Bank helps young people in disadvantaged areas set up businesses that alleviate local social problems.\nIn South Africa, Deutsche Bank’s Alternate Income Generation project helps charities become more sustainable by diversifying their revenue streams.\nIn the US, Deutsche Bank is backing the expansion of Brooklyn Navy Yard in New York City to bring new jobs to an area of high unemployment.\nIn the Middle East, training financed by Deutsche Bank enables single mothers to support their families by running cooking business from their homes.\nIn November, Made for Good will be launched in Italy, followed by the extension of the programme in other countries and regions.\nOn November 30 and December 1, Deutsche Bank will host the first Made for Good start-up market in its headquarters in Frankfurt am Main. From 11 am to 5 pm, social entrepreneurs will present their ideas and sell their products – ranging from sustainably produced silk scarves from India to tear-resistant purses.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}