{
    "url": "https://www.db.com/news/detail/20161115-diary-app-for-autism-wins-24-hour-deutsche-bank-and-autistica-hackathon?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 15, 2016",
    "tags": [
        "Corporate Citizenship",
        "Digitalisation",
        "Education",
        "Employee engagement",
        "Research"
    ],
    "title": "Diary app for autism wins 24-hour Deutsche Bank and Autistica Hackathon",
    "body": "Deutsche Bank and autism research charity Autistica have developed a prototype app to help young people with autism to understand and manage anxiety.\nMore than 150 of the bank’s technology and design experts competed to build a prototype smartphone app in the hackathon or programming competition. Joining them were young women from the bank’s Student to STEMette programme, technology undergraduates and autistic interns currently working at the bank.\nThe app draws on a paper-based anxiety toolkit created by King’s College London and funded by Autistica, one of the bank’s UK Charities of the Year (COTY).\nA panel of judges from Deutsche Bank, Autistica and King’s College London evaluated 18 prototypes that were designed to fulfil three core functions: to provide information that helps users understand anxiety, offer advice on managing panic attacks and share longer-term strategies for coping with anxiety.\nJuliusz Wiatrak, Deutsche Bank technologist and leader of the winning team in the competition, said: “At the core of our new app is an emotion diary that helps users manage their anxiety levels. If a user posts an ‘anxious’ state, the app provides help including a breathing exercise and an option to revisit 'happy moments’ posted earlier in the diary. It also allows users to share their data for research into the mental health of autistic individuals.”\nKim Hammonds, Group Chief Operating Officer of Deutsche Bank, said: “This prototype app is an example of how hackathons can help us change the way we work – how we partner together, solve problems together and leverage diverse skills to make a difference.”\nJon Spiers, Chief Executive of Autistica, said: “What we got back from the hackathon is so much more than we ever imagined: innovative ideas we can take away and workable prototypes that we can share with potential funders. We are overwhelmed with all that has been achieved in 24 hours.”\nDeutsche Bank will give all coding created at the hackathon to Autistica, which will seek funding to develop the prototypes further.\nTeams from London, Frankfurt, Bangalore, Bucharest, Cary, Pune and St Petersburg competed in the event, which took place on November 9 and 10.\n\nFor further information please contact:\nDeutsche Bank AG\nPress & Media Relations\nDon Hunter\nPhone: +44 20 754-14120\nE-Mail: don.hunter@db.com\nKlaus Thoma\nPhone: +49 69 910-33405\nE-Mail: klaus.thoma@db.com\n\nAutistica\nRebecca Sterry\nPhone: +44 20 3857 4348\nMobil: +44 7716 426896\nE-Mail: rebecca.sterry@autistica.org.uk\n\nNotes to editor:\nAutistica both funds and campaigns for medical research to understand the causes of autism, improve diagnosis, and develop new treatments and interventions. All the research that Autistica carries out is guided by families, to ensure that it makes a real difference to the lives of those living with autism. Since being founded in 2004, Autistica has raised £10 million in support of autism research to build longer, healthier happier lives for all those affected.\nAutism\nOne in a hundred people in the UK has autism, a lifelong developmental disability that affects how a person communicates with, and relates to, other people. It also affects how they make sense of the world around them. Autism is a spectrum condition, which means that while all people share certain difficulties, their autism will affect them in different ways.\nSome autistic people are able to live independent lives but many have learning disabilities or co-occurring healthcare conditions often requiring a lifetime of specialist support, as well as the health issues we all face as part of the normal ageing process.\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\nAutistica was nominated and chosen as one of two UK COTY by employees for 2016-17 to enable the charity to achieve transformational change to benefit those living with autism. Deutsche Bank's COTY partnerships with small charities go beyond fundraising to provide access to in-house resources and expertise to help them solve real world challenges. Deutsche Bank’s UK COTY programme has raised more than GBP 16 million for 24 charities since it was established in 1999.\n\nStudent to STEMette works with female GCSE or A-level students studying STEM (Science, Technology, Engineering or Maths) subjects to nurture an interest in STEM careers, provide role models and access to the banking industry. Students are paired with female employees with STEM backgrounds and careers for a four-month intensive mentoring programme. Student to STEMette targets issues of diversity and social mobility, supporting the future talent pipeline within STEM and the wider social and economic benefits it provides through employment opportunities.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 16
}