{
    "url": "https://www.db.com/news/detail/20161110-deutsche-bank-ft-remark-survey-of-200-financial-market-participants-examines-what-is-driving-today-s-capital-markets?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 10, 2016",
    "tags": [
        "Capital markets",
        "Company",
        "Corporate products",
        "Investment Banking",
        "Research"
    ],
    "title": "Deutsche Bank / FT Remark survey of 200 financial market participants examines what is driving today's capital markets",
    "body": "• Regulation, new technologies and emerging markets are key issues impacting strategic thinking\n• Survey highlights belief that blockchain technology will be widely used within the next three to six years\nFinancial regulation, new technologies such as blockchain and a revival of emerging markets are key issues driving financial markets, according to a recent survey conducted by Deutsche Bank and FT Remark, the research arm of the Financial Times, amongst 200 financial market participants.\n\n“These three themes are fundamentally redefining the securities services landscape and the knock-on effects will impact the business models of many capital markets participants,” said Satvinder Singh, Head of Global Securities Services and Head of GTB EMEA ex Germany.\nAccording to the survey, these three themes have caused the vast majority of respondents to partially or completely reshape their operating models (96%), buying behaviour (95%) and capital/fund allocations (98%) over the past two years.\nNuanced perspective on regulation\nRegulation including Basel III (62%) and Solvency II (48%) are viewed as delivering the most benefits, whereas the European Market Infrastructure Regulation (EMIR) (2%) and the Foreign Account Tax Compliance Act (FATCA) (1%) are considered the most burdensome. Overall, market participants have a nuanced perspective on regulation: instead of a threat, regulatory change is being viewed as an opportunity to improve settlement, liquidity and collateral management.\nBlockchain technology is coming to a bank near you\nBlockchain technology will radically change the market for securities services.\nA staggering majority (87%) believe that this technology may completely change the settlement model for securities. As a consequence, securities clearing and settlement will become more efficient while costs are expected to decrease substantially. Almost two-thirds (62%) expect the introduction of blockchain technology to produce substantial savings ranging from 11%-25%.\nAlmost half (48%) argue that it will help the industry cope with the risk of system failure and market disruption. Even though this technology is at an early stage, 75% see this technology being widely used within the next three to six years.\nRevival of Emerging Markets\nA clear majority of market participants are convinced of a a revival of emerging markets. 54% believe emerging markets will deliver growth rates last seen during the 2001-2011 boom, citing India/ South Asia as the most attractive region. However, 76% point to a lack of capital markets infrastructure, which deters them from operating or investing in emerging markets.\nAbout the survey\nDeutsche Bank and FT Remark, the research arm of the Financial Times, conducted a survey amongst 200 financial market participants to examine what themes are driving capital markets and how this will affect their strategic thinking. For this survey, Deutsche Bank and FT Remark have asked institutional investors, banks, financial sponsors, broker-dealers, sovereign institutions, corporate and financial institution issuers and investor relations executives. The participants surveyed are key decision makers at the core client groups that the bank’s Global Securities Services business reaches.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}