{
    "url": "https://www.db.com/news/detail/20161109-deutsche-bank-and-autistica-to-develop-autism-app?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "November 9, 2016",
    "tags": [
        "Company",
        "Corporate Citizenship",
        "Digitalisation",
        "Diversity",
        "Employee engagement",
        "Research"
    ],
    "title": "Deutsche Bank and Autistica to develop autism app",
    "body": "Deutsche Bank and autism charity Autistica are today holding a 24-hour hackathon event to develop an app that will help people with autism manage anxiety.\n\nKim Hammonds, member of the Management Board of Deutsche Bank and Group Chief Operating Officer, will open the event, which will see more than 150 of the bank’s technology and design experts compete to build a prototype smartphone app. Joining them will be students, technology undergraduates and interns with autism currently working at the bank.\nA hackathon – a combination of the words hack and marathon – is a programming competition in which people develop ideas for new digital products in the space of a few hours.\nTeams from around the world will seek to develop an app with three core functions: to provide information that helps users understand anxiety, offer advice on managing panic attacks and share longer-term strategies for coping with anxiety.\nThe app will harness the mental health research of Autistica, one of the bank’s UK Charities of the Year. It will build on a paper-based anxiety toolkit created by Professor Emily Simonoff of King’s College London as part of a programme of research funded by Autistica.\nMaking the toolkit available on an app will make it more accessible to people with autism wherever they are located and whenever they experience anxiety.\nAnxiety disorders affect 40% of children and 54% of adults with autism in the UK. As a result, school, relationships and even leaving the house can become daily challenges. Therapies used for anxiety need to be adapted for people with autism. Mental health services currently lack professional staff with specialist skills and therapy is often unavailable or available only after a long delay.\nScott Marcar, Chief Technology Officer of Deutsche Bank, said: “This hackathon gives us the chance to apply our design technology skills to make a real difference to people with autism. By putting together a diverse team of technologists, students and interns with autism working at Deutsche Bank, we will create a fully functioning prototype app to help autistic people manage anxiety.”\nJon Spiers, Chief Executive of Autistica, said: “It can sometimes take a long time for research to feed through to those who need it most, but through this hackathon, we can get our science turned into something practical and innovative immediately. By having experts with a wide range of skills coming together all at once, we can develop and test as we go.”\nTeams from London, Frankfurt, Bangalore, Bucharest, Cary, Pune and St Petersburg will compete in the event.\nNotes to the editor:\nHackathon for autism:\nStart: Wednesday, November 9 at 13:00 GMT\nEnds: Thursday, November 10 at 13:00 GMT\nVenue: Central London\n\nAutistica both funds and campaigns for medical research to understand the causes of autism, improve diagnosis, and develop new treatments and interventions. All the research that Autistica carries out is guided by families, to ensure that it makes a real difference to the lives of those living with autism. Since being founded in 2004, Autistica has raised £10 million in support of autism research to build longer, healthier happier lives for all those affected.\nAutism\nOne in a hundred people in the UK has autism, a lifelong developmental disability that affects how a person communicates with, and relates to, other people. It also affects how they make sense of the world around them.\nAutism is a spectrum condition, which means that while all people share certain difficulties, their autism will affect them in different ways. Some autistic people are able to live independent lives but many have learning disabilities or co-occurring healthcare conditions often requiring a lifetime of specialist support, as well as the health issues we all face as part of the normal ageing process.\n\nAbout Deutsche Bank\nDeutsche Bank provides commercial and investment banking, retail banking, transaction banking and asset and wealth management products and services to corporations, governments, institutional investors, small and medium-sized businesses, and private individuals. Deutsche Bank is Germany’s leading bank, with a strong position in Europe and a significant presence in the Americas and Asia Pacific.\n\nFor further information please contact:\nDeutsche Bank AG\nPress & Media Relations\nDon Hunter\nPhone: +44 20 754-14120\nE-Mail: don.hunter@db.com\nKlaus Thoma\nPhone: +49 69 910-33405\nE-Mail: klaus.thoma@db.com\nAutistica\nRebecca Sterry\nPhone: +44 20 3857 4348\nMobil: +44 7716 426896\nE-Mail: rebecca.sterry@autistica.org.uk",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}