{
    "url": "https://www.db.com/news/detail/20160914-group-chief-operating-officer-kim-hammonds-opens-new-dublin-data-lab?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 14, 2016",
    "tags": [
        "Company",
        "Digitalisation",
        "Research"
    ],
    "title": "Group Chief Operating Officer Kim Hammonds opens new Dublin data lab",
    "body": "Kim Hammonds, Group Chief Operating Officer of Deutsche Bank, donned virtual reality goggles on Friday as she opened a new data lab in Dublin. The lab aims to bring information to life for staff so that they can use it to enhance the Bank’s products, services and processes.\nThe goggles displayed client analytics in three dimensions, enabling Hammonds to spot connections between different sets of data and see the effects of applying different filters to the data at a glance.\nRay Richardson, Head of Research & Development in Dublin, said that the goggles encouraged users to ask questions that might not otherwise occur to them and to work in a new way, unconstrained by a keyboard or monitor.\nThe lab, in Dublin, Ireland, uses cutting-edge technology to scan vast quantities of information for patterns and insights and present them in a user-friendly visual format. It has been specially designed to help staff interact with data, with floor-to-ceiling whiteboards for capturing ideas, banks of video screens for displaying information and break-out spaces for collaboration.\nHammonds watched as images appeared on video screens showing the flow of information between the Bank, the links between different legal entities with whom the Bank does business and even between various Group audit points.\nThe databases will also be accessible by colleagues in the business divisions, who will be able to contribute and update data as appropriate.\nHammonds said that she would encourage other Management Board members to visit the site following a visit from Chief Executive John Cryan last week, saying: “You need to tell the company what you are doing so everyone understands the capability here.”\nElaborating on this later at a town hall, she said: “The whole day I have been thinking that there are so many applications of what is happening here that we can apply across the Bank. Think of everything you do and how it could be reused at scale. If we could get this scaled across the firm, we can win at a much higher speed.”\nHammonds said that she was focused on driving efficiency across the firm while reducing the complexity of systems, processes, technology and the customer base.\nWhile modernising and simplifying the Bank’s technology remained a high priority, she said she was also exploring how technology could generate revenue: “The goal is not just technology cleanup but using technology to drive a revenue stream for the company. There is a lot of opportunity in that space.”\nThe lab, known as The Hive, will create 40 new roles in Dublin for data science, visualisation, analytics and technology specialists.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}