{
    "url": "https://www.db.com/news/detail/20160914-deutsche-x-trackers-grows-us-business-through-strategic-hires?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 14, 2016",
    "tags": [
        "Asset Management",
        "Company",
        "Corporate products"
    ],
    "title": "Deutsche X-trackers grows US business through strategic hires",
    "body": "Deutsche Asset Management (Deutsche AM) announced today the expansion of its Deutsche X-trackers team in the US through several key hires in its portfolio management division. Patrick Dwyer and Brandon Matsui join as Portfolio Managers and Directors. Both will be based in New York, reporting to Bryan Richards, Head of Passive Portfolio Management.\nDwyer and Matsui are part of a broader group of strategic hires that the firm has made this year to support the growth of its Deutsche X-trackers business in the US. Earlier this year, the platform expanded its multifactor suite with the launch of Deutsche X-trackers FTSE Emerging Comprehensive Factor (Ticker: DEMG) and Deutsche X-trackers Russell 2000 Comprehensive Factor (Ticker: DESC) exchange traded funds (ETFs). The platform was named “Best ETF Issuer in 2015,”(1) just three years after beginning its build-out, in the annual ETF.com Awards.\n“We have been aggressively building out our passive business in the US as part of our broader strategic plan for our Americas Asset Management franchise,” said Fiona Bassett, Head of Deutsche’s Passive Asset Management unit in the Americas. “We are delighted to further add to the team as we continue in our drive to support our clients with the delivery of best in class solutions and service.”\nDwyer joins Deutsche AM from Northern Trust where he most recently held the role of Head of International Equity Index Portfolio Management for North America. He has 15 years of global equity index portfolio management experience. Prior to joining Deutsche AM, Matsui was a senior portfolio manager at Charles Schwab, responsible for leading the development of its fixed income ETF offerings.\n(1) Source: ETF.com\n(2) Deutsche Asset Management is the brand name of the Asset Management division of the Deutsche Bank Group. The respective legal entities offering products or services under the Deutsche Asset Management brand are specified in the respective contracts, sales materials and other product information documents.\nDeutsche Asset Management\nWith EUR 719 billion of assets under management (as of June 30, 2016), Deutsche Asset Management(2) is one of the world’s leading investment management organizations. Deutsche Asset Management offers individuals and institutions traditional and alternative investments across all major asset classes.\n© Deutsche Asset Management. All rights reserved. DBX002229 08/22/2017\nConsider the Fund’s investment objectives, risk factors, and charges and expenses before investing. This and other important information can be found in the Fund’s prospectus, which may be obtained by calling 1-855-DBX-ETFS (1-855-329-3837) or by viewing or downloading a prospectus at www.deutsche-etfs.com. Please read it carefully before investing.\nInvesting involves risk, including the potential loss of principal.\nInvesting involves risk, including possible loss of principal. Stocks may decline in value. Foreign investing involves greater and different risks than investing in US companies, including currency fluctuations, less liquidity, less developed or less efficient trading markets, lack of comprehensive company information, political instability and differing auditing and legal standards.\nEmerging markets tend to be more volatile and less liquid than the markets of more mature economies and generally have less diverse and less mature economic structures and less stable political systems than those of developed countries. Funds investing in a single industry, country or in a limited geographic region generally are more volatile than more diversified funds.\nBecause the fund seeks to provide exposure to stocks based on the following multifactors – value, momentum, quality, low volatility and size – it is expected exposure to such investment factors will detract from performance in some market environments, as more fully explained in the fund’s prospectus. Performance of the Fund may diverge from that of the Underlying Index due to operating expenses, transaction costs, cash flows, use of sampling strategies or operational inefficiencies.\nAn investment in any fund should be considered only as a supplement to a complete investment program for those investors willing to accept the risks associated with that fund. See the prospectus for details.\nShares are not individually redeemable, and owners of Shares may acquire those Shares from the Fund, or tender such Shares for redemption to the Fund, in Creation Units only.\nDBX Advisors LLC is the investment adviser to the Deutsche X-trackers Funds. Deutsche X-trackers Funds are distributed by ALPS Distributors, Inc. ALPS Distributors, Inc. is not affiliated with DBX Advisors or FTSE Russell.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}