{
    "url": "https://www.db.com/news/detail/20160912-september-message-to-employees-from-john-cryan?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 12, 2016",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "September message to employees from John Cryan",
    "body": "Dear Colleagues,\nI hope you enjoyed a relaxing summer holiday. I intentionally avoided the words “summer break” because, unfortunately, there wasn’t much of a break this year.\nPrecisely because so much is happening at Deutsche Bank, I would like personally to update you each month – so that you know what we have achieved, what lies ahead and what the Management Board and I are working on.\nAlthough it wasn’t a particularly calm summer, there were some relaxing moments. I especially enjoyed the season opening of the Berliner Philharmoniker, which Deutsche Bank has supported for many years. My wife and I were able to attend an outstanding concert with works by Gustav Mahler and Pierre Boulez.\nIn our bank, there were also welcome developments. In early August, Kim Hammonds and I opened our new building in Jacksonville, Florida. It is good to have moments like this as they show that we are making progress. That was also the case elsewhere: we were able to sell our subsidiary in Argentina as planned while ensuring that most of the jobs there will be preserved.\nThat said, I do not want to make things out to be better than they are. The business environment is challenging, with persistent low interest rates and ever increasing regulatory requirements. Within the bank, we are not yet where we want to be. We therefore have no time to waste.\nDespite all our challenges, I personally have a different impression of our bank than that painted by some observers. I can assure you that my Management Board colleagues and I will do everything we can to show you and the public that we can look to the future with confidence.\nDo not allow yourself to become distracted by speculation about alleged mergers or sales plans. There is one rumour in particular that I would like to dispel by making it unambiguously clear that Deutsche Asset Management is and will remain an essential part of our business model.\nWe have enough on our plate to solve on our own, and we intend to concentrate on this for now. We want to resolve further important litigation cases, and we are now approaching the finish line in our second and third round of negotiations with employee representatives in Germany.\nBut our work is not just about pursuing restructuring. We must also change how we work in the future. Too often I see in my own daily routine that too many different people are busy doing the same work as each other. Sometimes there are valid reasons for this. But often a particularly cautious approach or a hierarchical mindset gets in our way instead of making us better and safer.\nAs our Chief Risk Officer Stuart Lewis said recently, every one of us must be a risk manager. Each of us has a responsibility. For this reason, I too encourage you to accept this responsibility. Trust yourself to make decisions instead of waiting for an instruction from above. I encourage our managers to support this kind of self-reliance.\nThis mindset is also necessary if we want to see ourselves increasingly as a technology company. We should be more daring and think a bit more like entrepreneurs. This does not just apply to the Management Board. Entrepreneurial initiative arises wherever business is done. You are best placed to see what could be changed and what could be improved. Often it is the small steps that bring us farthest forward.\nInnovation is crucial in this respect. This Friday, for example, we will open our new data analytics centre in Dublin. Next week we are especially looking forward to hosting clients at our Technology Conference on September 13 and 14, where tech giants from Microsoft to Salesforce will meet in Las Vegas. At the end of September, Kim Hammonds and Christian Sewing will officially open our new digital factory in Frankfurt-Sossenheim, where developers are already diligently at work. Facilities such as Sossenheim and Dublin exemplify the technological transformation of our bank.\nBefore us lies an extended final sprint in an exacting year of restructuring work. This will demand a lot from all of us, especially as our normal business must always take priority. Keep asking your clients what we can do for them. Ask yourself where you – where we – can demonstrate entrepreneurial spirit. Astonishing yourself is what makes life worth living, as Dublin-born Oscar Wilde once wrote.\nIf my fellow members of the Management Board and I can be of assistance, please let me know.\nYours sincerely,\nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}