{
    "url": "https://www.db.com/news/detail/20160912-sylvie-matherat-basel-iv-could-bring-us-almost-back-to-the-start?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 12, 2016",
    "tags": [
        "Corporate products"
    ],
    "title": "“Basel IV could bring us almost back to the start”",
    "body": "The Basel Committee on Banking Supervision has set itself an ambitious goal: in the future, banks shall be obliged to measure risks on their balance sheets and calculate capital requirements using standardised models. This should make it easier to compare the risk and capital positions of different banks – and to identify quickly any imbalances. These are good objectives, objectives I shared as a regulator, and share as a banker. However, achieving them is complex, and the risk is high that the reality will differ considerably from the desired outcome.\nA wide range of new, better regulations since the financial crisis in 2008 have ensured that banks today have more high-quality equity available, raised their liquidity reserves and reduced their debt ratios. With its new initiative, the Basel Committee wants to enhance the so-called Basel III regulations by making Banks regulatory positions more easily comparable.\nHowever, many banks and regulators agree that the Committee’s latest proposals, known colloquially as Basel IV, need work to meet these objectives. More specifically, the impact of the current proposals may be the exact opposite of their intention. The proposals could not only result in risks on bank balance sheets becoming harder to detect, but curiously enough could encourage banks to take on greater risks – reducing financial stability and reducing availability of credit where it is most needed.\nSo what´s the problem?\nThe Committee believes that the current system, where banks measure the risk of their business using internal models, and hold capital against these calculations, leaves banks too much discretion. They fear banks understate the risks in order to hold less capital, and maximise profit. Therefore the Basel committee proposes standardised models or capital floors on top of internal models which lead to the same outcome.\nThey hope that a more one-size-fits-all approach will result in banks calculating risks the same way, and that capital levels will be more reliable and comparable. This is nice in theory, but much more complicated in reality.\nTake a simple example: when two exposures have the same name, a ‘mortgage’, or a ‘trade finance facility’, this does not mean they represent the same level or type of risk. A retail mortgage in Germany is much less likely to default than an equivalent US mortgage. This is due to many reasons – legal frameworks, collateral types, local interest rates, or simply culture. Banks’ internal models consider and value all of these based on historical data, local knowledge and experience. By definition standardised approaches do not do this.\nThe result would be that the capital cost of extending a mortgage in the US and in Germany would be the same – despite the risk and return being very different. In order to reach a consensus within Basel Committee Countries this capital cost is likely to represent an average meaning that it will be too expansive by comparison to the risks in Germany and not enough in the US – each of them being a not desirable outcome.\nBusiness decisions\nThe same logic applies for a lot of products and services that banks provide. Loans to corporates and loans to fund commercial real estate and infrastructure investments are amongst the most negatively impacted.\nThis could make riskier business even more attractive for banks because – in comparison to before – they would not always have to possess more capital for high-risk businesses than low-risk ones. The safest clients, German corporates for example, could find themselves in a situation where they are less able to get the credit or services that they need.\nThe Committee’s proposed models would therefore deprive regulators from the benefit of sophisticated models to show real, detailed risks that banks face. In short: there could be less transparency, not more.\nAll this could be a recipe for new problems!\nIt is true that the existing system and models are not perfect. I´m not saying that the Basel Committee’s objectives are wrong. There are examples of models underestimating risk leading to too much risk in the system, and less reliable comparisons. The Committee is therefore right to address this to truly finalise the banking rulebook. However, supervisors should not eliminate models, instead they should improve them by identifying the reasons for variance within models.\nA Basel Committee study found that around 75% of variance in models reflects actual risk – meaning they are working properly. Much of the residual 25% variance is caused by differences in supervisory definitions or interpretations. This can be resolved and in fact is in the process to be resolved with one of the biggest success of post crisis new regulatory framework. The creation of a European supervisor, the ECB, which should harmonise supervisory practices.\nThese institutions, namely the ECB and European Banking Authority, have already done a great job to tackle inconsistencies by harmonising definitions, inputs and understanding. Where there are models with questionable outcomes, these institutions hold banks accountable – and they must continue to do this. But we should remember: Twenty years ago, Basel I started out with very sweeping, risk insensitive approaches. Policy makers quickly realised that these led to mispriced risks and misaligned incentives – hence the more sophisticated regime in place today. Basel IV could bring us almost back to the start.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}