{
    "url": "https://www.db.com/news/detail/20160908-sylvie-matherat-more-developed-capital-markets-are-essential-for-european-growth?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 8, 2016",
    "tags": [
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Sylvie Matherat: more developed capital markets are essential for European growth",
    "body": "Addressing an audience of European Union officials, industry representatives and academics, Matherat, Chief Regulatory Officer and member of the Management Board, said “the further development of the single capital market in the EU is essential” for restoring economic growth.\nIn a fireside chat with Dirk Schoenmaker, a Senior Fellow at Bruegel and Professor of Banking and Finance at Rotterdam School of Management, Matherat explained that investment banks play a key role in enabling growth in Europe. Some 80% of corporate financing in the region is in the form of bank lending, with just 20% coming from the capital markets – almost the inverse of the US.\nHowever, European banks are gradually retreating from global investment banking, while the market share of US banks increases, she noted. Among the reasons for this are more favourable market conditions in the US resulting from both traditionally higher volumes and fees, and from a more stable and less constraining regulatory landscape.\nIf this trend continues, European companies will be increasingly reliant on overseas banks for access to international capital markets, which could have significant consequences, including erosion of supervisory control, loss of competition and greater fragmentation of capital flows within the EU.\nEU policy makers need to be sensitive to the cumulative impact of regulation in Europe to ensure a level playing field, Matherat noted, calling for a “harmonisation of regulation” across the region.\nHowever, for the Capital Markets Union to be successful, the EU must first further develop the required framework for more sophisticated capital markets, she said. This includes harmonising corporate, fiscal and insolvency regimes and educating companies so they are equipped to access the markets and to provide the required transparency.\nBruegel is a European think tank that specialises in economics. Its members comprise both private and public stakeholders including EU Member State governments, international corporations and institutions.\nThe two-day Annual Meetings are Bruegel’s flagship event, offering a mixture of large public debates and small private sessions to address key issues in European and global economics. A total of 1,000 participants joined this year’s event.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}