{
    "url": "https://www.db.com/news/detail/20160906-made-for-good-partners-of-deutsche-bank-present-themselves-at-startupnight?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "September 6, 2016",
    "tags": [
        "Corporate Citizenship",
        "Entrepreneurship",
        "Research"
    ],
    "title": "Made for Good partners of Deutsche Bank present themselves at startupnight",
    "body": "For the first time, Deutsche Bank has partnered with one of the highlights of the entrepreneurial scene: startupnight in Berlin. In Deutsche Bank’s Atrium, 32 startups presented a range of innovative ideas – among them FinTechs as well as social startups that have one thing in common: the desire to drive things forward.\nThe fourth annual startupnight in Berlin was a showcase for the creativity of Europe’s latest generation of entrepreneurs. Under the motto “Meet Investors. Meet Corporates. Scale your Business. Be International”, the weekend event attracted more than 3,400 visitors to Germany’s leading startup city.\nDeutsche Bank Berlin served as a new venue for this year’s startupnight. The light-filled courtyard provided a perfect setting for 32 startups and their innovative business ideas. In addition to numerous banking services, such as state-of-the art accounting software or solutions for the self-employed, the startups on show included a number of social enterprises. Among them were several of our Made for Good partners, who receive coaching from Deutsche Bank employees. The Made for Good programme of Deutsche Bank and its foundations helps to build momentum and capacity of ventures that create wider social good.\n“For us, it’s important to get people talking about us in the cities where we operate,” says Bernd Günter, 46, of Auticon, the first and so far only company in Germany that exclusively employs autistic adults as IT consultants.\nOur goals are not purely financial; we also want to bring about change in our society, in our economy, in our culture and in people’s minds. To do that, we need visibility and public awareness.\nBernd Günter, Auticon\nIt is essential for Auticon to meet with other entrepreneurs, says Günter: “We’re happy to discuss our business models, our projects and our ideas – and we find lots of people with a similar outlook in the startup community.”\nOne such person is Christian Schloh, 43, of the Berlin startup Dycle, which promotes the recyclability of diapers and offers families a reliable system to reduce their waste and improve their carbon footprint. “There’s always an opportunity for us at events such as this. While there’s probably less chance of connecting with our actual target audience, i.e. parents, we are likely to meet new cooperation partners.”\nThe Dycle project is still in its infancy. Having run a successful pilot project in Berlin last year, they are now planning to start their regular business in 2017. One problem that Dycle faces is assessing the funding it needs – no easy task for a sector that does not yet exist.\nThis is a familiar problem for Norbert Kunz, founder and CEO of Social Impact, a cooperation partner of Deutsche Bank: “When startups come up with totally new products, it’s hard to assess their rating.” External expertise helps us to avoid errors in the calculations. And without a compelling business plan, it is hard to attract investors. To address these challenges, the six Social Impact Labs in Germany provide entrepreneurs with lots of opportunities: coaching, co-working, and – most importantly – networking. Businesses also receive support from startup experts, some of whom are Deutsche Bank volunteers.\nStartup focus\nDuring the panel discussion, Norbert Kunz and Alexander Gallas, Head of Corporate Volunteering at Deutsche Bank, presented the latest cooperation project: a special accelerator programme for social startups – the Impact Fund. At least nine startups can participate in the pitch process and are eligible to receive grants from the fund, which Deutsche Bank and SAP have jointly set up and each donated 100,000 euros.\nThe impact fund is the first of its kind in Germany and provides non-repayable grants up to 25,000 euros to social startups that tangibly improve the social and economic participation of immigrants in Germany.\nThese grants make a huge difference for social startups “as it’s much harder for them to find funding elsewhere,” says Norbert Kunz. The difficulty for social startups is that their priority is social value rather than profit. Consequently, they are less appealing to investors. Alexander Gallas understands the problem well: “In addition to funding, we match them with our colleagues who provide financial, communications and marketing expertise. They also benefit from our extensive network of clients and investors.”\nNetworking, it is generally agreed, is a crucial factor in the startup sector. Hence the importance of startupnight, says Norbert Kunz: “Events such as this offer an opportunity for startups to meet with potential investors, to share their experiences, to get feedback on their product or service, and – as a result – to improve their performance.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}