{
    "url": "https://www.db.com/news/detail/20160906-deutsche-bank-wealth-management-streamlines-focus-after-completing-sale-of-us-private-client-services-business?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "September 6, 2016",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Deutsche Bank Wealth Management streamlines focus after completing sale of US Private Client Services business",
    "body": "Deutsche Bank Wealth Management today announced that it will focus on making strategic investments in its US Wealth Management business after successfully closing the sale of its US Private Client Services (PCS) unit to Raymond James Financial, Inc.\nThe unit will continue to operate under the name of Alex. Brown. The agreement was originally announced in December 2015.\nDeutsche Bank Wealth Management has been strategically expanding its wealth management presence in selected US markets including the West Coast and Florida.\n“The successful sale of the US PCS business is a significant step toward the bank’s Strategy 2020 goal to become a simpler and more efficient organization,” said Fabrizio Campelli, Head of Deutsche Bank Wealth Management. “We will now concentrate on further building out our wealth management capabilities for ultra-high-net-worth clients in the US, underlined by a series of recent senior appointments including Patrick Campion, who joined us last month as Head of Deutsche Bank Wealth Management for the Americas.”\nDeutsche Bank and Raymond James will preserve and enhance the value proposition for Alex. Brown clients through a strategic distribution arrangement, providing access to certain Deutsche Bank products and banking services.\nCampelli continued: “We will now be able to better serve our clients and grow our Americas business by focusing on a single distribution channel. We are looking forward to continuing our collaboration with Raymond James as a distribution partner.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}