{
    "url": "https://www.db.com/news/detail/20161031-deutsche-bank-opens-its-data-store-to-external-software-developers?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 31, 2016",
    "tags": [
        "Company",
        "Digitalisation",
        "Entrepreneurship",
        "Research",
        "Strategy"
    ],
    "title": "Deutsche Bank opens its data store to external software developers",
    "body": "From 1 November, ambitious programmers will be able to test ideas for future services with simulated, but client-driven data\ndbAPI programming interface successfully tested at Deutsche Bank Hackathon in Berlin – three-day competition saw 750 applicants and 70 participants from 22 countries\nWinning teams and Bank explore potential collaboration with new Digital Factory or Axel-Springer Plug&Play\nFrom 1 November, Deutsche Bank is giving ambitious software developers from Germany and abroad the opportunity to create digital solutions for bank clients that go far beyond traditional financial services. The address developer.db.com provides access to the Bank's proprietary development environment, allowing programmers to test their ideas for digital services of the future. Deutsche Bank has opened an application programming interface, dbAPI, specifically for this purpose. Once they have registered, the interface is easy and convenient for developers to use.\nKim Hammonds, member of the Management Board of Deutsche Bank and Group Chief Operating Officer commented: “The launch of our new developer portal for innovators and start-ups is a further milestone in the digitalisation of Deutsche Bank.\nIt offers a huge advantage for creative developers and programmers: they can put their business ideas and apps to the test even while they are still developing them. This is all possible thanks to the test data, which reflects the profiles and needs of many millions of Bank customers. This collaborative approach will both help external parties and Deutsche Bank to reduce time-to-market for new products and services to the benefit of our clients“.\nThe developer portal offers permanent access to a test environment. The launch version of the portal will gradually be expanded to include additional functions. The finished apps will later work with real customer data provided the client has explicitly consented to this. In return, the client will, over time, be able to use an increasing number of apps that go far beyond pure banking services. For example, an app might allow the members of a club or a residents' association to conveniently manage their joint budget digitally in the future.\nLast weekend in Berlin, Deutsche Bank's first hackathon, API/Open, showed what bright sparks can achieve in the new test environment. 14 teams comprising 70 participants from 22 countries were selected to take part in the Bank's programming competition and were given access to Deutsche Bank's IT world via dbAPI for the first time. More than 150 teams with 750 developers, designers and ideators from around the world had applied to take part in the three-day hackathon. The bank was interested particularly in applications that went beyond traditional banking services.\nThe winning teams not only received prize money totalling EUR 50,000 – new avenues are also opening for the best developers: the hackathon winners have the choice of exploring a collaboration with Deutsche Bank's Digital Factory or presenting their ideas to the Axel Springer Plug&Play start-up accelerator.\nThe winning ideas announced by the jury on Sunday afternoon promise to deliver a wide range of everyday uses once they have been fully developed. First prize was awarded to the “Finance Guru” app, second prize to “Flattr” and third prize to “FinChild”. The jury presented a special tech award to the “AutoBudgie” application (see below for additional information).\nChristian Sewing, member of the Management Board of Deutsche Bank and Head of its Private, Wealth & Commercial Clients Corporate Division (PW&CC) commented: \"With Deutsche Bank's first hackathon, we are promoting creative competition for the best ideas. In recent months, we have improved the quality of our advisory service and client satisfaction with numerous digital innovations. And we will continue to do this – whether it is in our branches, online or through mobile channels.\"\nDeutsche Bank is already working together with start-ups, fintechs, external developers and designers on a wide range of projects and plans. The latest example of the Bank's inclusive and creative working style is the Deutsche Bank Digital Factory, which opened its doors in Frankfurt in September with approximately 400 employees.\nThere are plans to expand this development centre for digital banking products to 800 employees by 2018. In addition, the three Deutsche Bank Labs located in the tech hubs of London, Palo Alto and Berlin, are driving innovation on site. In Berlin, Deutsche Bank is also cooperating with Axel Springer Plug&Play, which promotes fledgling start-ups, and is harnessing the potential on the Innovations Campus of Factory Berlin, one of the largest think tanks for digital innovation in Germany.\nAdditional information on the winners of Deutsche Bank Hackathon API/Open and their creative ideas:\nThe most important criteria from the jury’s point of view were the creativity of each solution, the quality of the technology, and the added value that the app would deliver for users and for customers. All of the concepts that achieved one of the top places were related to financial planning, and show promise beyond the banking sector.\nFirst place, along with prize money of EUR 30,000, was awarded to the dwins team based in Frankfurt am Mail for the “Finance Guru” app, which provides its users with practical assistance for concluding the necessary contracts when it comes to activities such as moving home.\nSecond place, along with prize money of EUR 15,000, went to the IntraBase team from Vienna for the “Flattr” app. This software enables residents’ associations, for example, to collaborate conveniently on managing their expenses.\nThird place, along with prize money of EUR 5,000, went to the Finchild team for its app of the same name. The app provides children with a practical and lively introduction to dealing with money, with help from their parents.\nThe Tech Award was presented to the Fireflies team from Milton Keynes (United Kingdom) for an application called “AutoBudgie”. This digital assistant helps car owners to reliably plan the costs related to purchasing, maintaining and repairing their vehicle.\nDeutsche Bank's new developer portal: https://developer.db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}