{
    "url": "https://www.db.com/news/detail/20161027-a-message-from-john-cryan-on-deutsche-bank-s-third-quarter-financial-results-2016?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 27, 2016",
    "tags": [
        "Company",
        "Financial Results",
        "Management & Leadership"
    ],
    "title": "A message from John Cryan on Deutsche Bank's third quarter financial results 2016",
    "body": "Dear colleagues,\nThis quarter, I would like to start my letter to you rather differently – by quoting some of our clients:\n“A strong economy needs strong banks. If we want to continue to hold our own among global competitors in future, it is important for us to have a global player like Deutsche Bank by our side.” Peter Terium, Chief Executive Officer of RWE.\n“Deutsche Bank, as a German company, knows our structure. It also knows the way German export-oriented companies work.” Marcus Kuhnert, Chief Financial Officer of Merck KGaA.\n“KKR has been working with the bank for 30 years. We think all the commotion over Deutsche Bank is overblown. The bank is far stronger than in 2008.” Johannes Huth, Head of EMEA for KKR.\nWhy do I quote these statements? Because in the past few months, a great deal has been said about us which deflects attention from our clients. It is our clients who need to be satisfied with us. It is our clients whom we serve with products, services and expertise, and it is for our clients that we create value.\nThat’s why I’d like to start with a figure which we have not focused on since I started as Chief Executive. In the first nine months of this year we have earned around 4.6 billion euros in our operating business, before having to spend 3.0 billion euros of this on restructuring and severance, litigation charges, impairments and reducing assets in our Non-Core Operations Unit (NCOU).\nThat left pre-tax profits of 1.6 billion euros for the first nine months of the year. In the third quarter, pre-tax profits were 619 million euros, after costs of 1.0 billion euros related to these items.\nYou know that I am not in favour of subtracting these specific items from our results. However, we should be aware of how much operating strength we possess in our business. That is regularly overlooked, especially since our negotiations with the US Department of Justice have attracted so much attention.\nOf course, legal cases like these are a burden for us and cause concerns which are reflected, for example, in the volatility of our share price. This was not helped by numerous rumours which I will not comment upon in detail here.\nWhat you have achieved against the backdrop of the past few weeks is all the more remarkable. You addressed critical questions from clients, supported each other in many places and did not lose your nerve. Your commitment was exemplary. For that I would like to thank you profoundly, also on behalf of all my Management Board colleagues.\nUnfortunately, we must anticipate that the situation will remain tough for some time to come. Discussions with the Department of Justice are moving forward and we are working hard on achieving a resolution of this matter as soon as possible. Simultaneously, our environment has worsened further in some important areas. As we indicated at the time of our half-year results, we will have to accelerate and intensify our restructuring.\nIn the Management Board, we’re firmly committed to building a better Deutsche Bank, step by step – better in its core businesses, better in its controls and closer to its clients. In other words, our focus is not so much on talk, but primarily on action. What we announce, we aim to deliver.\nThere is evidence of this in the third quarter:\n– We have already strengthened our internal controls and will continue to do so. Our aim is clear: never again should legal risks burden this bank in the way they have in recent years.\n– We completed the sale of our US private brokerage business called Private Client Services (PCS), although we remain committed to serving our ultra-high and high net worth clients in the US who were outside of the PCS platform.\n– In Deutsche Asset Management we reached an agreement to sell Abbey Life. This should improve our Common Equity Tier 1 ratio from early 2017.\n– Furthermore, we are making good progress in de-risking our balance sheet. During the quarter we reduced Risk-Weighted Assets (RWAs) by 18 billion euros to 385 billion euros, thanks primarily to good work by our colleagues in our NCOU.\n– Our headcount has started to come down, even though negotiations with the workers’ council in Germany were only completed at the beginning of October. However, we aim to be more ambitious in headcount reduction, as you can see from the decision to introduce extensive hiring restrictions. If and where it is absolutely necessary to fill positions, we will give preference to internal candidates.\nWe remain financially strong, with a liquidity reserve of some 200 billion euros at the end of the third quarter, historically low levels of market risk, strong credit quality in our loan portfolio, and capital ratios that are well in excess of regulatory minima. However, it is about more than saving costs, reducing risks, strengthening controls and making the bank less complex overall. We also stayed the course in our client businesses. You can see this not only in our financial results but also in some concrete examples:\n– In Corporate & Investment Banking (CIB), we are regaining strength. The business has produced three successive quarters of revenue growth, which has strengthened recently. In initial public offerings (IPOs) we rank amongst the top five houses globally. We co-led the IPOs of Nets and Innogy, among other transactions. In the UK, we are advising on the largest cross-border takeover since the year 2000, as British American Tobacco seeks to complete its acquisition of Reynolds American. In Germany, we are the clear leader in corporate finance as measured by fees.\n– In Transaction Banking we remain the leader in euro clearing. The publication Euromoney named us Best Cash Manager in Western Europe for the fifth consecutive year.\n– Our Global Markets business achieved year-on-year revenue growth of ten percent, thanks to higher revenues in Debt Sales & Trading. We achieved this despite the continued strategic downsizing or closure of selected businesses, countries and client relationships.\n– In Deutsche Asset Management, pre-tax profit is up by seven percent year-on-year in the first nine months of 2016.\n– In Private, Wealth & Commercial Clients, despite low interest rates, we achieved solid growth in our credit business.\n– We have continued to digitise the bank. The openings of our Digital Factory in Frankfurt and our Data Lab in Dublin are the best examples of this. We have begun to implement the private cloud and reduced our number of operating systems from 45 to 41 so far this year. Additionally, our Mobile Banking App won the prestigious Red Dot Design Award.\n– In Postbank, we also achieved growth in our credit business whilst keeping loan losses very low. In the third quarter, we reduced provision for credit losses to 45 million euros, down by 30 percent versus the third quarter of last year.\nIn spite of these achievements, I do not want to paint a flattering picture. We have a lot of work ahead of us. However, we have stable foundations and we have the strength to overcome the challenges of the coming months. When I see the successes you have achieved even in this difficult year, and the commitment you have shown to our clients and to Deutsche Bank, I look to the future with confidence.\nYours sincerely, \nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}