{
    "url": "https://www.db.com/news/detail/20161025-deutsche-bank-employees-recognised-in-financial-times-outstanding-awards?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "October 25, 2016",
    "tags": [
        "Awards",
        "Company",
        "Corporate Citizenship",
        "Employee engagement"
    ],
    "title": "Deutsche Bank employees recognised in Financial Times / OUTstanding awards",
    "body": "The Financial Times newspaper and OUTstanding, a professional network for lesbian, gay, bisexual, transgender and intersexual (LGBT) executives, have recognised four Deutsche Bank employees in their 2016 Leading LGBT and Ally Executives lists. The lists, which are now in their fourth year, recognise executives who promote LGBT inclusion within and outside their workplace. Deutsche Bank employees across a range of divisions and geographies featured on the lists this year:\nEileen Taylor, Global Head of Regulatory Management (Ally Executive list). Recognised for her work in promoting an inclusive environment at Deutsche Bank.\nMasa Yanagisawa, Head of Markets Prime Finance Sales Japan and Head of Capital Introduction Pan Asia (LGBT Executive list). Recognised for his achievements in working together with other members of the Japanese financial industry to develop LGBT-friendly workplaces and raise public awareness through initiatives such as the Tokyo Pride Parade.\nDarren Beaumont, Technology Product Manager, COO Chief Technology Office (LGBT Future Leader list). Recognised for his efforts of using technology to connect colleagues globally around LGBT inclusion.\nJean-Luc Vey, Innovation Manager, PW&CC Chief Information Office (LGBT Future Leader list): Recognised for his role as co-founder and member of dbPride in Germany since 2001 and for his work outside Deutsche Bank including as co-founder and board member of Germany’s non-profit organisation “PROUT at work” since 2013.\nAlly Executives were selected for their contribution towards creating a workplace environment in which LGBT people feel they can be themselves. LGBT Executives were chosen on the basis of their seniority and influence on LGBT inclusion beyond their daily work. LGBT Future Leaders are defined as high performing individuals at various levels in their careers working towards LGBT inclusion.\nTaylor said: “We are delighted to see four colleagues recognised for their work with the LGBT community. Deutsche Bank values and promotes an inclusive work environment where all employees can be themselves and thrive.”\nExecutives featured on the OUTstanding lists were selected by a judging panel of leading businessmen and women. In 2016, the panel included Lord Brown, Executive Chairman of L1 Energy; Dawn Airey, CEO of Getty Images and Ashok Vaswani, CEO of Personal and Corporate Banking at Barclays.\nThe full lists can be found on the Financial Times website.\nDeutsche Bank actively supports LGBT initiatives around the world. It takes part in several external events every year, with many activities led by or involving dbPride, the dedicated employee network for LGBT employees and their allies. In 2016, this included IDAHOT Day (International Day Against Homophobia, Transphobia & Biphobia).\nEarlier this year, Deutsche Bank froze its plans to expand operations in Cary, North Carolina, as the result of state legislation which invalidated existing protections of the rights of lesbian, gay, bisexual and transgender fellow citizens in some municipalities. The bank has also received various accolades honouring its commitment to LGBT causes. For example, it was awarded the maximum score of 100 in the Human Rights Campaign’s annual Corporate Equality Index for the 13th consecutive year.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}