{
    "url": "https://www.db.com/news/detail/20161017-deutsche-bank-releases-2016-alternative-ucits-survey?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 17, 2016",
    "tags": [
        "Asset Management",
        "Company",
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Deutsche Bank releases 2016 Alternative UCITS Survey",
    "body": "Deutsche Bank Global Prime Finance today released its 2016 Alternative UCITS Survey. In this year’s survey, 130 institutional investors which collectively manage and/or advise on over $700 billion in hedge fund assets and $150 billion in alternative UCITS* assets, share insights into their current allocation plans and investment preferences for alternative UCITS funds.\n“Total assets managed by alternative UCITS funds have grown by 26% annually since the 2008 global financial crisis to reach close to €400 billion. Our survey results suggest that growth is set to continue, with two thirds of alternative UCITS respondents expecting to increase their allocations this year.” says Anita Nemes, Head of the Hedge Fund Capital Group and Hedge Fund Consulting at Deutsche Bank. “We are also seeing a growing number of hedge fund clients embrace UCITS as a growth strategy for their businesses, leading to an increase in new interesting fund launches.”\n  Highlights from Deutsche Bank’s 2016 Alternative UCITS Survey\nNearly 70% of all investors surveyed allocate to alternative UCITS funds and a further 5% are planning to make their first investment this year\nTwo thirds of alternative UCITS investors plan to increase their allocation to such products in 2016\n58% of responding alternative UCITS investors report that demand has come primarily from underlying institutional clients\nSystematic equity market neutral and fundamental equity market neutral are the most sought after strategies by alternative UCITS investors\nThe United States/Canada is the most sought after investment region.\n\nThe survey was carried out by Deutsche Bank’s Hedge Fund Capital Group.\n*For the purpose of this survey, “UCITS” refers to the EU Directive, Undertakings for Collective Investment in Transferable Securities Directive, adopted in 1985, relating to legislation of collective investment schemes. “Alternative UCITS” refers to absolute return strategies (including hedge fund and alternative beta / risk premia strategies) run within a UCITS compliant framework.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}