{
    "url": "https://www.db.com/news/detail/20161014-deutsche-bank-hosts-women-s-leadership-day-in-jacksonville?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 14, 2016",
    "tags": [
        "Corporate Citizenship",
        "Sustainability"
    ],
    "title": "Deutsche Bank Hosts Women's Leadership Day in Jacksonville",
    "body": "Deutsche Bank in Jacksonville is today hosting a Women’s Leadership Day event to recognize the connection between women leaders and the important role they play in the lives of female students and their choice of career path. The event theme, “Classroom to Boardroom,” will be highlighted through technology showcases, key notes and a panel discussion. Women’s Leadership Day will bring together more than 100 attendees from the bank and the community for a full day of events focused on the role of education in career development, mentorship and networking.\nEvents open with the presentation of software applications, or “apps,” developed through a partnership between Deutsche Bank and the Girl Scouts of Gateway Council. For the past four months, women leaders in technology from Deutsche Bank in Jacksonville and Cary, NC, mentored four teams of middle school Girl Scouts to design apps geared toward addressing important social and community issues. The apps will be showcased and voted on, and the winning team will be announced by Kim Hammonds, Member of the Management Board and Group Chief Operating Officer, Deutsche Bank.\n“At Deutsche Bank, we understand that diverse and inclusive leadership is essential to our bottom line,” said Leslie Slover, Regional Head of Deutsche Bank Jacksonville and Cary, NC. “It’s one of the reasons we have events like this, to introduce women to senior role models and inspire them to take their careers to the next level. I hope that each attendee leaves Women’s Leadership Day with a connection to at least one person they didn't know before, and at least one idea to act on when returning to their offices.”\n“According to the Girl Scout Research Institute, 77 percent of girls say that, because of Girl Scouts, they are considering a career in STEM, and partnerships like this provide critical experience and guidance in STEM-related fields,” said Mary Anne Jacobs, CEO of Girl Scouts of Gateway Council. “Through STEM programs, girls tend to persevere, become resourceful problem-solvers, challenge-seekers and promoters of cooperation and team-building, and they feel empowered to make a difference in the world — all qualities of strong leaders.”\nThe afternoon session features a panel discussion moderated by Deborah Gianoulis Heald, President and CEO of the Schultz Center for Teaching and Leadership. She will be joined by panelists Kim Hammonds; Lakshmi Goel, Associate Professor of Information Systems, Coggin College, University of North Florida; Retired General Valeria Gonzalez-Kerr, US Army; Imani Hope, Jacksonville Public Education Fund and Cindy Watson, Executive Director of Jacksonville Area Sexual Minority Youth Network. A range of topics slated to be addressed include how academia and the military are preparing women for leadership roles in their careers, and what corporations are doing internally to promote diversity.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}