{
    "url": "https://www.db.com/news/detail/20161012-new-eiu-report-reveals-5-major-trends-that-keep-corporate-treasurers-awake-at-night?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 12, 2016",
    "tags": [
        "Company",
        "Corporate products",
        "Investment Banking",
        "Research"
    ],
    "title": "New EIU report reveals 5 major trends that keep corporate treasurers awake at night",
    "body": "According to the survey, uncertainty about economic growth is by far the top concern of treasurers worldwide\nLow or even negative interest rates are triggering significant policy changes in cash management\nAn avalanche of new regulatory requirements has spawned a palpable sense of frustration among many treasurers\nRespondents welcome technological change in treasury departments but they do not necessarily embrace it\nTreasury functions are expanding their remits, especially into risk management and capital allocation\nAgainst a challenging macroeconomic and regulatory backdrop, corporate treasury is expanding its company-wide responsibilities, according to Managing risk in challenging economic times, a white paper published by The Economist Intelligence Unit (EIU) and Deutsche Bank. The report builds on a survey of 150 corporate treasurers and 150 CFOs.\nFour in ten survey respondents list global economic growth among the top three most serious macro risks. More than half (55 percent) acknowledge that their function struggles to keep abreast of the rapidly changing macroeconomic environment. The difficult macroeconomic climate notwithstanding, 80 percent still hold fair or large amounts of excess cash. Hence, “expanding or modifying investment strategies for excess cash” is the preferred way to adapt treasury management strategies in light of low or negative interest rates in many markets.\nLow interest rates are one long-term consequence of the financial crisis; the wave of financial regulation is another. Almost 40 percent think the workload resulting from regulation will remain unchanged over the next 12 months, and another 40 percent expect that it will actually increase.\nMore than seven in ten respondents say the adoption of new technologies is gaining momentum in their company’s treasury department. However, interviews conducted for the white paper reveal that treasurers are reluctant to embrace new technologies. Almost seven in ten survey respondents are concerned about cyberattacks, for example.\nMartin Koehring, the white paper's editor, said: “The macroeconomic, regulatory and technological challenges are not just shaping the outlook of corporate treasurers—they are also changing how the function is interacting with the rest of the business. Our white paper confirms that partnering with the business has increased in areas such as mergers & acquisitions and working-capital management. Encouragingly, more than eight in ten CFOs say that leadership teams now increasingly consult corporate treasurers on strategic questions.”\nFor further information please contact:\nDeutsche Bank AG\nPress & Media Relations\nFrank Hartmann\nPhone: +49 69 91042744\nEmail: frank.hartmann@db.com\nEconomist Intelligence Unit\nMartin Koehring, Senior Editor\nPhone: +44 (0)20 7576 8028\nEmail: MartinKoehring@economist.com\nNotes to editors\nIn July-August 2016 The Economist Intelligence Unit (EIU), on behalf of Deutsche Bank, surveyed 150 senior corporate treasury executives and 150 CFOs to find out how they are managing risk in challenging economic times. Respondents were drawn from across the world, with 100 in the Americas, 100 in Europe, the Middle East and Africa, and 100 in Asia-Pacific. Of these, 200 represent companies with US$2bn-5bn in annual revenue, the remainder companies with US$5bn and above.\nExecutives were drawn from a wide range of sectors, including financial services (11%); healthcare, pharmaceuticals and biotechnology (10%); telecommunications (10%); conglomerates (10%); construction and real estate (7%); automotive (7%); energy and natural resources (6%); consumer goods (5%); chemicals (4%); retailing (3%); and transport, travel and tourism (3%). In addition, The EIU conducted a series of in-depth interviews in July-August 2016 with 20 senior treasury and finance executives at corporations from around the world.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}