{
    "url": "https://www.db.com/news/detail/20161006-deutsche-bank-completes-next-stage-of-restructuring?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 6, 2016",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Deutsche Bank completes next stage of restructuring",
    "body": "Deutsche Bank has reached an agreement with its Group and General Works Councils and signed all remaining balance of interests agreements planned for 2016 on role reductions in Germany. After announcing the agreements on the reduction of 3,000 jobs roles in June 2016, another 1,000 jobs will now be reduced. This brings the total number of role reductions in Germany to around 4,000. These are part of 9,000 jobs being reduced worldwide to make the Group more competitive as part of Strategy 2020.\n“We consistently implement our strategy to make the bank more efficient,” said Karl von Rohr, member of Deutsche Bank’s Management Board with responsibility for the Bank’s labour relations in Germany. “We are fully aware that today’s decision is a difficult change with significant personal impact for many employees. We will ensure that any staff reductions are carried out in a socially responsible manner,” von Rohr added. That commitment by the bank is part of the agreements.\nThe first round of negotiated agreements in June relating mainly to the private and commercial banking business in Germany are already being implemented. Negotiations during the second and third rounds covered around 450 jobs in the bank’s Chief Operating Office, an infrastructure function. The remaining job reductions will be spread across the Human Resources (HR) Department, Communications & Corporate Social Responsibility (Communications & CSR), Deutsche Asset Management (Deutsche AM), Global Markets and Corporate Finance and DB Research, the macroeconomic research unit.\nThe staff reductions will be carried out in a timely, transparent and responsible manner for every impacted employee. Whenever possible, the Bank intends to offer affected employees vacant positions within the Group. Furthermore, the bank will also assist affected employees in finding new jobs outside of the company where necessary.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}