{
    "url": "https://www.db.com/news/detail/20161006-deutsche-bank-wins-rmb-house-of-the-year-award?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "October 6, 2016",
    "tags": [
        "Awards",
        "Company"
    ],
    "title": "Deutsche Bank wins \"RMB House of the Year\" award",
    "body": "Deutsche Bank’s expertise in China‘s currency, the Renminbi (RMB), was last night hailed as the industry’s best by Asia Risk magazine, which awarded the bank the coveted title of “RMB House of the Year Award 2016”.\nSince the beginning of RMB internationalisation, Deutsche Bank has led a number of market firsts; the first bank to transact a CNH cross-currency swaps, as well as FX swaps and forwards. Today the bank provides a diverse range of onshore and offshore RMB solutions right across its platform, from equities, FX, fixed income, to asset management tracker funds and cash management, reflecting a true house approach to RMB.\nDeutsche Bank’s Head of Global RMB Solutions Evan Goldstein said, “We are delighted to be named RMB House of the Year, and recognised for the market leading RMB solutions we deliver to corporates and financial institutions. We will continue to innovate and support our clients as they navigate the challenges posed by this low interest rate world.”\nAsia Risk editor Aaron Woolner acknowledged Deutsche Bank’s RMB flows and structuring expertise, crediting the bank’s insight and skill in RMB.\n“Clever thinking is underpinned by a broad-based business such as Deutsche Bank’s role in the onshore interbank bond market and the expansion of its FX4Cash RMB payment capability to five new Asian markets over the past year,” Mr Woolner said.\n“Deutsche Bank stood out for its ability to both innovate with products such as the Volatility Knock Out and the USDCNH Cancellable Call Spread. Both required not only structuring skills but also a comprehensive underlying RMB business, with multi-directional flows to manage the consequent risks. The Volatility Knock Out structure was particularly impressive given that it was put together at a time of extreme uncertainty in the market,” he added.\nAccording to Deutsche Bank research, RMB is forecast to become the third most traded currency in the world by 2020. It’s expected that companies will use the currency to invest and trade as China’s capital markets develop and its economy continues to mature.\nDeutsche Bank is active across all areas of the RMB market spanning FX, capital markets, credit and rates trading, equities, trade finance and cash management, sub-custody, and payments clearing. The breadth of the bank’s platform enables it to be a consistent provider of liquidity, financing, risk management and customised solutions to clients transacting in RMB. Deutsche Bank also offers full RMB pricing and structuring solutions 24 hours a day, 5 days a week to onshore and offshore clients investing and trading in RMB.\nDisclaimer:\nThis press release has been approved and/or communicated by Deutsche Bank AG or by its subsidiaries and/or affiliates (“DB”). Deutsche Bank AG is authorised under German Banking Law (competent authority: BaFin – Federal Financial Supervisory Authority) and by the Prudential Regulation Authority and subject to limited regulation by the Financial Conduct Authority and Prudential Regulation Authority.\nDetails about the extent of our authorisation and regulation by the Prudential Regulation Authority, and regulation by the Financial Conduct Authority are available from us on request. Securities and investment banking activities in the United States are performed by Deutsche Bank Securities Inc., member NYSE, NASD and SIPC, and its broker-dealer affiliates. Lending and other commercial banking activities in the United States are performed by Deutsche Bank AG, and its banking affiliates.\nCopyright © Deutsche Bank AG",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 121
}