{
    "url": "https://www.db.com/news/detail/20160128-a-message-from-john-cryan-on-deutsche-bank-s-full-year-and-fourth-quarter-2015-results?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 28, 2016",
    "tags": [
        "Company"
    ],
    "title": "A message from John Cryan on Deutsche Bank's full year and fourth quarter 2015 results",
    "body": "Dear Colleagues,\nI would like to give you an update on the continuing progress we have been making on the implementation of Strategy 2020 and on the details of the fourth-quarter 2015 results we announced today.\nSince October, we have successfully contracted to sell our stake in Hua Xia Bank. We have settled our Office of Foreign Assets Control (OFAC) issues with some regulators. And we have achieved progress towards our goal of winding down the Non-Core Operations Unit (NCOU) by the end of 2016.\nWe took much-needed action to simplify the Bank and to bring it under better control. We are reducing the number of products and services we offer; deepening our relationships with our most promising clients; and focusing our geographic reach by closing our onshore presence in 10 countries.\nWe have begun the process of off-boarding selected clients in areas of higher risk and, since November, have also made great strides in upgrading our client on-boarding processes. In addition, we have embarked on a programme of investing in and upgrading our IT infrastructure.\nUnfortunately, as a consequence of all the actions we took in the second half of 2015, the results for the year were significantly impacted. As we announced on January 20, we reported our first annual loss since 2008.\nOur net loss of EUR 2.1 billion in the fourth quarter was driven by three factors: further provisions for regulatory and litigation matters of approximately EUR 1.2 billion; charges for restructuring and severance of EUR 0.8 billion, primarily related to our previously announced plans to close branches in our Private & Business Clients (PBC) business division; and a year-on-year decline in fourth-quarter revenues, principally in Corporate Banking & Securities (CB&S).\nOur EUR 6.8 billion loss for the year was driven by regulatory and litigation provisions of EUR 5.2 billion; impairments on goodwill and other intangible assets of EUR 5.8 billion; an impairment and other transaction-related effects of EUR 0.7 billion on Hua Xia Bank; and restructuring and severance charges of EUR 1.0 billion related to Strategy 2020.\nHaving said that, we should not lose sight of the fact that, thanks to your efforts, our businesses actually all did well in 2015.\nIn PBC, revenues held up well in the face of continuing pressure from low or even negative interest rates. Progress in Deutsche Asset & Wealth Management (AWM) was very strong, with income before income taxes (IBIT) up 23%. Global Transaction Banking (GTB) had a record year, with IBIT up 25%. These are excellent performances.\nIn CB&S, we also saw strong results in sales and trading, especially against a backdrop of difficult markets in the second half. Debt revenues were up 10% and equities revenues were up 6% year-on-year. Corporate Finance was down slightly, but concluded some outstanding and important transactions for clients.\nIn the NCOU, we achieved a 41% reduction in RWAs in 2015.\nWe will remain focused in 2016. We are working hard to clear up our legacy issues. This involves seeking to resolve our litigation and regulatory matters as soon as possible. We will also continue to sell down our NCOU positions as a matter of priority. Restructuring work will continue throughout the year, including preparing for the deconsolidation of Postbank, rationalising our branch network, and developing better digital banking capabilities. In the US, we must also complete the set-up of our Intermediate Holding Company.\nWe all know that periods of restructuring can be challenging. They take time, resolve and patience. I have first-hand experience of this, and I’m confident we will get through this successfully. As I have said before, by executing these steps in a disciplined manner, we have the potential to transform ourselves from a restructuring story into a stronger, more efficient, and better-run institution.\nI know you’re working very hard. On behalf of the entire Management Board, I want to thank you sincerely for your ongoing dedication and commitment to Deutsche Bank.\nKind regards,\nJohn Cryan",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}