{
    "url": "https://www.db.com/news/detail/20160114-esg-and-financial-performance-aggregated-evidence-from-more-than-2000-empirical-studies?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "January 14, 2016",
    "tags": [
        "Sustainability"
    ],
    "title": "ESG and financial performance: aggregated evidence from more than 2000 empirical studies",
    "body": "They analyze whether the effect was stable over time, how a link between ESG and CFP differs across regions and asset classes and whether any specific sub-category of E, S or G had a dominant influence on CFP. In this paper we highlight the main conclusions.\nAbstract\nThe search for a relation between environmental, social, and governance (ESG) criteria and corporate financial performance (CFP) can be traced back to the beginning of the 1970s. Scholars and investors have published more than 2000 empirical studies and several review studies on this relation since then.\nThe largest previous review study analyzes just a fraction of existing primary studies, making findings difficult to generalize. Thus, knowledge on the financial effects of ESG criteria remains fragmented. To overcome this shortcoming, this study extracts all provided primary and secondary data of previous academic review studies. Through doing this, the study combines the findings of about 2200 individual studies. Hence, this study is by far the most exhaustive overview of academic research on this topic and allows for generalizable statements. The results show that the business case for ESG investing is empirically very well founded.\nRoughly 90% of studies find a nonnegative ESG–CFP relation. More importantly, the large majority of studies reports positive findings. We highlight that the positive ESG impact on CFP appears stable over time. Promising results are obtained when differentiating for portfolio and nonportfolio studies, regions, and young asset classes for ESG investing such as emerging markets, corporate bonds, and green real estate.\n    ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}