{
    "url": "https://www.db.com/news/detail/20210331-deutsche-bank-launches-green-deposits-for-its-corporate-clients?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 31, 2021",
    "tags": [
        "Corporate products",
        "Sustainability"
    ],
    "title": "Deutsche Bank launches green deposits for its corporate clients",
    "body": "Deposited funds contrast with an equivalent amount of Deutsche Bank’s green asset pool\nCorporate clients thereby support the transition to a clean, energy-efficient and environmentally sustainable economy\nDeutsche Bank announces the launch of a green deposits programme – a new cash management solution for corporate clients in the form of term deposits for under 12 months where cash finances an equivalent amount of Deutsche Bank’s green asset pool. Corporates need to fulfil certain eligibility criteria such as minimum deposit amount and certain level of ESG ratings to use the bank’s green deposits programme.\n“The new programme is an important step on our journey into ESG as a cash management provider. It marks the first of many cash management products we’ll look to introduce as part of the bank’s sustainability framework”, said Ole Matthiessen, Head of Cash Management at Deutsche Bank. “Linking our clients’ liquidity requirements with their sustainability goals is a huge achievement, one that we’re very proud of and something we’ll continue to build on as a liquidity solutions provider in the future”, explained Johnny Grimes, Head of Liquidity Product, Transactional FX at Deutsche Bank.\nDeutsche Bank’s green asset pool may include loans to companies and projects which support the transition to clean energy sources and to an energy-efficient and environmentally sustainable global economy – at the same time helping our clients to achieve their own ESG objectives.\nTo be included in the green asset pool, the asset must fall within a sector deemed eligible according to sustainability criteria as defined by the bank’s Green Financing Framework, which is aligned with international standards set by the International Capital Market Association. To identify eligible green assets within these sectors, Deutsche Bank follows a three-step process: a pre-selection process to identify eligible loans in the portfolio; an internal validation process, whereby the Deutsche Bank Green Financing Forum confirms whether the selected assets comply with the bank’s framework; and an external verification process by a reputable third party.\nThe launch of this green deposits programme is part of Deutsche Bank's wider sustainability strategy. In May 2020, Deutsche Bank published quantitative targets for its sustainable finance business activities. One of these targets is to generate a total of more than 200 billion euros in sustainable financing and ESG investments under management by the end of 2025. The bank also set itself a number of targets to reduce its environmental footprint, paying particular attention to energy efficiency and energy consumption. With its own operations carbon neutral since 2012, the bank aims to maintain this and to source 100 percent renewable electricity by 2025.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 17
}