{
    "url": "https://www.db.com/news/detail/20210329-stefan-schaffer-announced-as-head-of-db-global-technology-in-bucharest-romania?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 29, 2021",
    "tags": [
        "Europe",
        "Digital banking & services",
        "Digitalisation"
    ],
    "title": "Stefan Schaffer announced as Head of DB Global Technology in Bucharest",
    "body": "Deutsche Bank has announced that Stefan Schaffer will assume the position of Head of DB Global Technology, Deutsche Bank’s technology centre in Bucharest that focuses on developing financial and banking software applications. Schaffer joins the Bucharest team while continuing to perform his current role of Head of Central Chief Information Office (CIO) for Technology, Data & Innovation at Deutsche Bank’s Private Bank.\nSchaffer joined Deutsche Bank in July 2020 and has almost 30 years of experience in delivering exceptional IT solutions for businesses, including risk management, compliance, and anti-fraud. Schaffer studied at what is today the Karlsruhe Institute of Technology and holds a bachelor’s degree in mathematics and computer science.\n“I am very happy to join one of the most dynamic units within Deutsche Bank,” Schaffer said. “DB Global Technology has already proven to be an essential part of the bank’s technology transformation, by consistently delivering innovative, efficient, flexible, and scalable solutions in response to Deutsche Bank’s business needs. I look forward to working together with such an extraordinary team and local management.”\nDilipkumar Khandelwal, Global Head of Technology Centres at Deutsche Bank, said: “Our aim is to build on the strategic evolution of the technology centre in Bucharest, and more closely partner with our teams across the globe. I am confident Stefan and the team will continue to deliver excellence for our businesses and further strengthen our talent in Bucharest.”\nDB Global Technology is set to continue expanding its local team and developing new projects in 2021. The centre in Bucharest now has 1,000 team members and continues to grow, hiring specialists in cloud technologies, cyber security, networking, and SAP S/4 Hana platform testing.\n“We welcome the appointment of Stefan Schaffer as Head of DB Global Technology as this marks a new maturity stage for the centre, which continues to take on more complex projects and additional responsibilities. This is also a vote of confidence in the capacity of the Bucharest centre to deliver globally competitive technology products and services for the finance industry,” said Mihai Ionescu, Head of Deutsche Bank’s Representative Office in Romania.\nDeutsche Bank has been present in Romania since 1998. It delivers tailor-made corporate, investment and transaction banking products and solutions to its corporate and institutional clients as well as Private Wealth Management services to private clients. Deutsche Bank is one of the leading German banks. A long-standing partner to the Romanian government, the bank has assisted with the financing of some of the country’s most important infrastructure projects.\n  For further information, please contact:\nDeutsche Bank AG  \nAndreea Cătuneanu\nEmail: andreea.catuneanu@db.com \nPhone: +40(31)222-4005\nMarkus Dahlem\nEmail: markus.dahlem@db.com \nPhone: +49(69)910-62016",
    "number_of_ratings": 1,
    "rating": 5.0,
    "likes": 5
}