{
    "url": "https://www.db.com/news/detail/20210329-deutsche-bank-focuses-its-management-board-to-support-sustainable-profitability?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 29, 2021",
    "tags": [
        "Company",
        "Management & Leadership",
        "Strategy"
    ],
    "title": "Deutsche Bank focuses its Management Board to support sustainable profitability",
    "body": "Deutsche Bank today announced a reorganisation of its Management Board. This will align the leadership team to the third phase of the bank’s transformation which was launched in December 2020. The aim of the reorganisation is to focus the management team more closely on the four business divisions in order to ensure sustainable profitability following the bank’s return to profitability last year. The bank has also realigned some infrastructure functions to further sharpen the focus on controls, costs, and risks. At the same time, the Supervisory Board wants to send a clear signal of continuity: Christian Sewing, Chief Executive Officer, will receive a new contract running until April 2026.\nAs part of the reorganisation Sewing will transfer responsibility for the Investment Bank and the Corporate Bank to Fabrizio Campelli, currently serving as Chief Transformation Officer. In this context, the CEO will assume additional responsibility for Human Resources. Michael Ilgner, Global Head of HR, will report to Sewing. Going forward, Ilgner will also oversee Global Real Estate to adapt the bank’s strategy in this area to the future working environment.\nThe Chief Transformation Office will be transferred from Campelli to Rebecca Short who will join the Management Board. Currently she is Head of Group Planning & Performance Management and Member of the Group Management Committee (GMC). Short also takes over Global Procurement from the Chief Operating Office (COO) and Management Board responsibility for the Capital Release Unit.\nThe Chief Operating Office will no longer be a separate Management Board function going forward. The ownership of the areas within COO will be shared between other Management Board members. In this context the business-related parts of COO that support the Investment Bank and the Corporate Bank, which were previously run in a centralised organisation, will move closer to their respective businesses under Campelli’s responsibility. He will be responsible for a closer front-to-back alignment of business and operations, which has proven effective in the Private Bank and the asset manager, DWS. Bernd Leukert, Management Board member responsible for Technology, Data and Innovation (TDI), will assume responsibility for most of the remaining COO areas.\nIn the light of the reorganisation, the current Chief Operating Officer, Frank Kuhnke, will leave Deutsche Bank.\nThe bank’s risk management and control functions will also be reorganised. The longest-serving member of the Management Board, Stuart Lewis, Chief Risk Officer, has informed the Supervisory Board of his decision to retire at the Annual General Meeting 2022. To ensure an orderly transition, Stefan Simon, Chief Administrative Officer and Member of the Management Board responsible for Legal and Regulatory Affairs, will assume responsibility for Compliance and Anti-Financial Crime (AFC), with effect from May 2021. The aim is to consolidate the areas which are particularly impacted by legal requirements and require a close dialogue with regulators. Apart from this move the mandate of the Chief Risk Officer remains unchanged. The Supervisory Board will decide on Lewis's succession in due course.\nThere are also changes relating to the Private Bank. Lars Stoy, who currently manages the Postbank brand in the bank’s home market, will assume responsibility for the Private Bank Germany, reporting to the bank’s President, Karl von Rohr, who had taken on this role on an interim basis. Stoy will also become a member of the Group Management Committee (GMC). That will allow von Rohr to dedicate more time to his duties as President and his responsibilities for the Germany and EMEA regions, for the Private Bank as a whole and Asset Management.\n\"Christian Sewing’s management team has impressively transformed and strengthened Deutsche Bank over the past three years,\" said Paul Achleitner, Chairman of the Supervisory Board. \"It is our priority now to adapt the Management Board for the next phase of Deutsche Bank’s transformation, which is about efficiency, effective controls and delivering sustainable profitability. The realignment of responsibilities will allow the CEO to focus on cross-divisional priorities such as client centricity, sustainability and the control environment. Overall, we see Deutsche Bank’s leadership well positioned, which is also underscored by the new contract for Christian Sewing.”\nAchleitner also thanked the departing Board member, Frank Kuhnke. “Being Deutsche Bank’s COO for the last three years, Frank Kuhnke has played a major role in ensuring that our bank has stabilised and achieved its strategic objectives. We thank him for a total of 35 years of commitment and successful work for Deutsche Bank and wish him all the best for his future endeavours.\"\nAll changes will take effect on 1 May 2021, subject to regulatory approvals.",
    "number_of_ratings": 2,
    "rating": 4.5,
    "likes": 37
}