{
    "url": "https://www.db.com/news/detail/20210324-best-in-asia-bonds-2020-high-yield-bond-house-and-emerging-markets-bond-advisor?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "March 24, 2021",
    "tags": [
        "Asia-Pacific",
        "Awards"
    ],
    "title": "Best in Asia bonds 2020 – “High-Yield Bond House” and “Emerging Markets Bond Advisor”",
    "body": "Deutsche Bank’s commitment to going the extra mile for issuers across Asia and emerging markets in a tumultuous year has been recognised by both IFR and The Asset. The bank won “Best Emerging Markets Bond Advisor” at The Asset’s Triple A Sustainable Capital Markets Regional Awards for 2020 last week, hot on the heels of yet another endorsement of its position as a market-leader in bonds from IFR with “Asia’s Best High Yield Bond House” at its Asia Awards 2020 earlier this month.\nThe Asset commended Deutsche Bank for its role on a number of significant high-yield bond transactions in 2020 and in continuously extending outreach to different sectors in Chinese high-yield. The publication also recognised the bank’s efforts in ramping up focus on ESG-related high-yield issuances, noting, for example, its role as green structuring advisor on a bond offering by Zhenro Properties, and as sustainable structuring advisor for Kaisa Group.\nAnnouncing Deutsche Bank as the Best High Yield Bond House in its annual awards programme, IFR Asia wrote: “Deutsche Bank showed its commitment to issuers across Asia in 2020 with an unrivalled collection of high-yield offerings in the most challenging of circumstances. After the coronavirus took hold, it delivered crucial funding for hard-hit companies from India to Macau. It helped reopen the Chinese high-yield market and gave investors options beyond the property sector. And it developed the asset class with acquisition financings and green bonds.” Read the full award write-up here. \nHaitham Ghattas, Deutsche Bank’s Head of Capital Markets for Asia Pacific, said: “We are delighted to once again be recognised for our leadership in Asia’s bond market and for our role in helping provide access to the region’s emerging markets.” Commenting on the award wins, Ghattas added that “without very effective cross-bank teamwork, house recognition like these would not have been possible.”\nIn its Asia Awards 2020, IFR also awarded the bank ESG Deal of the Year for its role on Star Energy’s 1.1 billion US dollar amortising green bond and High Yield Deal of the Year for Vedanta Resources’ 1.4 billion US dollar 13% amortising 2023 bond.",
    "number_of_ratings": 2,
    "rating": 1.0,
    "likes": 4
}