{
    "url": "https://www.db.com/news/detail/20210318-deutsche-bank-and-tis-join-forces-to-develop-and-offer-multi-bank-services?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "March 18, 2021",
    "tags": [
        "Corporate products"
    ],
    "title": "Deutsche Bank and TIS join forces to develop and offer multi-bank services",
    "body": "Frankfurt/Walldorf, March 18, 2021. Deutsche Bank and Treasury Intelligence Solutions (TIS) announced that they are entering a strategic partnership to develop and distribute multi-bank services for Treasury & Finance. \nThe focus of the cooperation is on new and innovative products & services combining the complementary capabilities and skills of an experienced payment platform provider with the expertise of a global corporate bank.\nThe first area of cooperation is an innovative payment fraud prevention solution combining the excellence of TIS’ cloud platform with the long-established expertise of Deutsche Bank in fraud prevention.\nPayment fraud is a major issue for CFOs and finance departments. Both parties see increasing demand from clients for effective solutions that are easy to use and can be deployed rapidly.\nThe software service will extend beyond the payment data of individual customers, leveraging the knowledge of all corporates using the service, while the shared data remains anonymised. The solution will help improve the detection of potential fraud, before the payment instruction even leaves a client’s system. Working closely with customers to better understand their challenges and pain points, the new service represents true co-creation.\n“Establishing client solutions that are beyond traditional financial services by leveraging Deutsche Bank’s expertise in global payment markets is a key focus area for us. Partnering with TIS and combining our strengths with an established provider of technology-enabled treasury services will provide our clients with a state-of-the-art, multi-bank-enabled risk management tool to mitigate an ever increasing fraud risk”, said Ole Matthiessen, Global Head of Cash Management at Deutsche Bank\n“Harnessing both company and community data to solve key challenges, such as fraud prevention, together with Deutsche Bank is a big win for our customers,” says Erol Bozak, co-founder and Chief Product Officer of TIS. “TIS is excited to team up with a global powerhouse in transaction banking to develop multi-bank payment solutions,” added Joerg Wiemer, co-founder and Chief Strategy Officer of TIS.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 10
}