{
    "url": "https://www.db.com/news/detail/20220629-deutsche-bank-fx-recognised-again-in-2022-e-fx-awards?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 29, 2022",
    "tags": [
        "Awards",
        "Investment Banking"
    ],
    "title": "Deutsche Bank FX recognised again in 2022 e-FX awards",
    "body": "Deutsche Bank’s Global Foreign Exchange (GFX) business has won two categories in the FX Markets magazine’s 2022 e-FX awards for the second year running: Best Liquidity Provider for Forwards/Swaps and Best Liquidity Provider for Options.\nThe FX Markets e-FX Awards are in their 20th year, and seek to recognise the dedication, skill and creativity that market participants offer in the rapidly developing world of electronic foreign exchange trading.\nThree key themes set Deutsche Bank apart from the field:\nProviding consistent liquidity to clients: Deutsche Bank remains committed to providing consistent and fair liquidity to clients, even in distressed markets. In  2021, the bank executed its largest number of trades ever (61,480), while also responding a record number of RFQs (1,930,001).\nDelivering on the demand for complex transactions: The bank has met the increased need for large and complex transactions in the past year, executing the largest ever deal-contingent (DC) trade for a Japanese company, as well as a large, strategic and complex DC hedge.\nEnabling seamless service through continued innovation: Technology lies at the heart of Deutsche Bank’s offering – and enables us to provide an efficient service to clients in a way that routinely simplifies the complex. For example, the new features added to the DB’s option pricer, including the integrated Autoblotter and the new auto unwind, are helping to give greater control to clients, and straightforward access to the information that matters.\nRussell Lascala, Global Head of FX at Deutsche Bank said:\n“The momentum in our business right now is phenomenal.  These awards follow our stand out performance in last week’s Euromoney FX survey where we led the field in half of all categories.  The FX Markets wins highlight our forward, swaps and options e-FX capabilities in particular – growth areas where are innovating to create advantage for clients and securing our place as market leader.  We’ll build on this external recognition to go even deeper with clients and target more market share.”",
    "number_of_ratings": 2,
    "rating": 3.0,
    "likes": 4
}