{
    "url": "https://www.db.com/news/detail/20220617-deutsche-bank-signs-net-zero-carbon-buildings-commitment-and-joins-ep100?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 22, 2022",
    "tags": [
        "Company",
        "Sustainability"
    ],
    "title": "Deutsche Bank signs Net Zero Carbon Buildings Commitment and joins EP100",
    "body": "Deutsche Bank has signed up to the World Green Building Council’s (WGBC) Net Zero Carbon Buildings Commitment, pledging to reduce and compensate operational emissions associated with energy used to light, heat, cool and power buildings, for assets over which it has direct control.\nIn addition, as part of the commitment, the bank will maximise reduction of the embodied carbon emissions for owned new developments and major renovations by 2030 and compensate all residual upfront emissions. Embodied carbon emissions are those associated with the manufacture of materials, transport to and from the construction site, and processes used during the construction phase of a building or infrastructure.\nTogether, operational and embodied carbon emissions combined are 39 percent of global energy-related carbon emissions (28 percent from operational emissions, 11 percent from construction, according to the WGBC).\nDeutsche Bank is one of seven new signatories to the Commitment, bringing the total to 169 signatories over 28 cities in six states and regions.\nThe WGBC is a global action network comprised of around 70 Green Building Councils around the globe, and as members of the UN Global Compact, they work with businesses, organisations and governments to support the ambitions of the Paris Agreement and the UN’s Sustainable Development Goals (SDGs). Their aim is to transform the building and construction sector across three strategic areas: climate action; health and wellbeing; and resources and circularity. \nThe Net Zero Carbon Buildings Commitment was launched in September 2018 at the Global Climate Action Summit and is part of WGBC’s global “Advancing Net Zero” project to accelerate the path to net zero carbon buildings to 100 percent by 2050.\nDeutsche Bank now also member of EP100\nDeutsche Bank has also become a member of the EP100 initiative. This is a global corporate Energy Productivity initiative led by the international non-profit Climate Group.\nEP100 members are committed to doubling their energy productivity, rolling out energy management systems, or achieving net zero carbon buildings, all within set timeframes. Over 120 businesses have already committed to measuring and reporting on energy efficiency improvements, essential for the reduction in energy-related emissions needed to achieve global climate goals. ",
    "number_of_ratings": 7,
    "rating": 1.6,
    "likes": 17
}