{
    "url": "https://www.db.com/news/detail/20220621-deutsche-bank-s-chief-administrative-officer-stefan-simon-to-join-afca-board?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "Frankfurt am Main, June 21, 2022",
    "tags": [
        "Europe",
        "Germany",
        "Boards and Committees"
    ],
    "title": "Deutsche Bank’s Chief Administrative Officer Stefan Simon to join AFCA Board",
    "body": "Deutsche Bank Management Board member Stefan Simon is to join the Board of Germany’s “Anti Financial Crime Alliance” (AFCA). The AFCA is a public-private partnership and has established itself as a permanent fixture in terms of the strategic cooperation in the fight against money laundering and terrorist financing in Germany. Together with representatives from German banks, the Financial Intelligence Unit (FIU), the Federal Financial Supervisory Authority (BaFin), and the Federal Criminal Police Office (BKA) founded the AFCA on September 24, 2019. Since then, new members have joined the Alliance, largely from companies representing the non-financial sector.\nFounding member HSBC Trinkaus & Burkhardt, represented by Ulrich Goeres, is now handing over its position on the AFCA Board for business realignment reasons. Deutsche Bank is assuming membership on the Board and will be represented by Stefan Simon, who is a member of Deutsche Bank’s Management Board and whose duties – as Chief Administrative Officer – include overseeing Regulatory Affairs, Legal and Governance as well as Compliance and Anti-Financial Crime.\n\"I am delighted that Deutsche Bank, as a founding member, is now also represented on the AFCA Board. Close, ongoing cooperation between authorities and companies is crucial to stand united in the fight against financial crime and become stronger together,\" said Stefan Simon.\nThe AFCA Board is composed of representatives from authorities and banks, including Germany’s FIU, BaFin and the BKA as well as representatives from the public sector. FIU Director Christof Schulte chairs the Board. On the occasion of the hand-over, Schulte thanked Ulrich Goeres for the important work in the early stages of the AFCA and added: \"I am confident that the AFCA stands to gain from Stefan Simon’s membership on the Board and I look forward to continuing our cooperation with him in this role.\"\nThe AFCA Board is responsible for the strategic goals of the public-private partnership and coordinates the work of its current five working groups.\nStefan Simon was appointed to the AFCA's Expert Committee in January 2021, which he has since chaired. He will be transferring these tasks as he takes on new, Board-related ones to Ulrich Goeres, who will be moving to the Expert Committee and will assume the position of Expert Committee Chair on an interim basis.",
    "number_of_ratings": 6,
    "rating": 3.0,
    "likes": 6
}