{
    "url": "https://www.db.com/news/detail/20220621-deutsche-bank-ranked-no-1-in-euromoney-fx-survey?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 21, 2022",
    "tags": [
        "Awards",
        "Investment Banking"
    ],
    "title": "Deutsche Bank ranked No 1 in Euromoney FX Survey",
    "body": "Deutsche Bank has been ranked the Overall FX Market Leader by market share in the 2022 Euromoney FX Survey.\nWidely acknowledged to be the most comprehensive in the industry, the survey polls institutional investors, corporates, financial institutions and other end users around the world on how much business they allocate, and the quality of service they receive.\nDeutsche Bank ranked top in 50% of all categories in the survey, including No 1 for overall market share, swaps (unadjusted), options, overall electronic FX, emerging market volume (unadjusted swaps), precious metals, banks and non-financial corporates.\nRam Nayak, Co-Head of the Investment Bank and Head of Fixed Income & Currencies at Deutsche Bank, said: “It’s great to be back in the No 1 position for the first time in nearly a decade, and with a clear gap to our nearest competitor.  The result validates our 2019 strategic decision to focus on core strengths like FX and confirms the successful completion of our stabilization phase. \n\"This is not a one-year result. It follows multiple years of investment in technology and people, in areas such as electronic swaps and forwards, that we believe will continue to pay off in the years to come.  The FX industry is extremely competitive, so we will continue to invest in the business and in our technology.”\nEuromoney’s rankings reflect Deutsche Bank’s multi-year commitment to the FX business and to delivering competitive pricing and high-quality service to clients and to providing liquidity consistently even in difficult conditions.  FX is a key product for clients across the bank from corporates and financial institutions to asset managers and private bank clients.\nRussell LaScala, Head of FX, said: “The key to success is consistency and quality of service to clients - so we are laser-focused on making sure we keep our edge and keep delivering and improving.  Volatility in the FX market has risen, and there are multiple situations that can drive further volatility through H2 2022.\n\"That’s going to increase client demand for FX products, and we want to be first call.  We see opportunities to grow the business in multiple areas, for example APAC, where we have already improved our ranking from No 2 to No 1.”\nThese results reflect a strong performance from Deutsche Bank across the board, rising up the rankings or maintaining position to achieve first place in 26 out of 52 individual categories compared with 13 categories last year, and coming second in a further 15 categories.\nIn total, Deutsche Bank improved in 30 individual categories, and had a top three position in 46 (88% of categories). \nOf particular importance, Deutsche Bank ranked first in:\nOverall market share, up from third place in 2021 with market share of 10.89%\nOverall (unadjusted swaps) market share, maintaining its top place finish in 2021 with market share of 13.68%\nOptions market share, maintaining its top place finish in 2021 with market share of 30.18%\nSwaps (unadjusted swaps) market share, maintaining its top place finish in 2021 with market share of 17.79%\nOverall Electronic FX market share, up from third place in 2021 with market share of 12.2%\nElectronic FX (unadjusted swaps) market share, maintaining its top place finish in 2021 with market share of 14%\nBanks market share, maintaining its top place finish in 2021 with market share of 19.65%\nNon-financial corporates market share up from 4th place in 2021 with market share of 11.03%\nDeutsche Bank also ranked first in a number of ‘Best Service’ categories: Overall for APAC; Service in APAC and Americas; Ability in EM Currencies and Client Algorithmic Trading Execution in APAC; Overall, Research, Salesforce and Service for Banks; and Ability in EM Currencies and Research for Leveraged Funds.\nContact\nJo Court\n+44 (0) 7879 272651\njoanne.court@db.com ",
    "number_of_ratings": 20,
    "rating": 4.4,
    "likes": 41
}