{
    "url": "https://www.db.com/news/detail/20220608-how-are-crypto-assets-driving-the-future-of-finance-in-asia-pacific?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "June 8, 2022",
    "tags": [
        "Newsroom",
        "Asia-Pacific",
        "Cryptocurrencies"
    ],
    "title": "How are crypto assets driving the future of finance in Asia Pacific?",
    "body": "Digital Assets are driving the future of finance in Asia Pacific. The crypto asset ecosystem shows how some aspects of banking and finance can be reinvented with modern paradigms, says Deutsche Bank’s Boon-Hiong Chan. Watch our latest “150 seconds on APAC” video to learn more.\nYou can also read the full transcript of the video here: \nDigital assets are driving changes in ways that the French central bank governor has termed as the Triple Revolution – with forms of financial or settlement assets, new roles, and new infrastructure. \nQ: What types of digital assets are shaping APAC?\nA: The first ecosystem is the Crypto asset one exemplified by bitcoin and ethereum. Within this ecosystem is Decentralised Finance or DeFi represented by DAI, Uniswap and Curve. Altogether they have introduced innovative possibilities that have been leveraged in our industry.\nThe second digital asset ecosystem is the tokenised financial one – exemplified by digital bonds, or digital fractionalised bonds.\nThe third ecosystem is a potentially huge one represented by central bank digital currencies or the CBDC space.\nAltogether these three digital ecosystems are the new settlements or financial assets in the triple revolution.\nQ: How are crypto assets driving change in Asia Pacific\nA: Around 2015, bitcoin showed that a cross border value transfer can occur within 10 minutes roughly, which showed the way for today’s faster and cheaper cross-border bank and fintech-facilitated transfers.\nSecond example, block chain is allowing digital true copy. Think about it – in the digital land when you do copy and paste, it’s difficult to identify which is the original and which is the copy. With blockchain, it is now possible. And is now being used for example to represent “original” title transfer documents like bill of lading or title transfer documents.\nICO or Initial Coin Offering with its possibility for a direct peer-to-peer distribution capability is another example. In APAC, Thailand has used this model for financial inclusion initiatives, when its ministry of finance issued and distributed digital saving bonds directly into retail investors.\nIn the DeFi space, DeFi is showing how low touch neo banking activities like borrowing, lending, and even micro precision like compounding interests at each block interval is possible. In this space, it has also pioneered self-hosted custody of digital assets, so you keep your own assets safe.\nThe crypto asset ecosystem shows how some banking and finance aspects can be reinvented with modern paradigms.\nThe key here, for positive things to continue, is to innovate responsibly from the regulators’ lenses.\n ",
    "number_of_ratings": 5,
    "rating": 2.6,
    "likes": 65
}