{
    "url": "https://www.db.com/news/detail/20220602-deutsche-bank-to-install-cash-machines-for-toyota-astra-financial-services-customers-in-indonesia?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "June 2, 2022",
    "tags": [
        "Asia-Pacific"
    ],
    "title": "Deutsche Bank to install cash machines at PT Toyota Astra Financial Services branches in Indonesia",
    "body": "Deutsche Bank and PT Toyota Astra Financial Services (TAF) today announced Deutsche Bank will install cash deposit machines at TAF branches across Indonesia. This service simplifies the cash collection process for companies, while providing their customers with a more convenient payment method. \nTAF is the multi-purpose car-financing company of Toyota Financial Services (TFS) and a joint venture between TFS and Astra International, Southeast Asia's largest independent automotive group. Toyota Financial Services is a wholly owned subsidiary of Toyota Motor Corporation, one of the world's largest automotive manufacturers.\nThrough partnerships with banks, dealerships and insurers, TAF serves Indonesian business and consumer needs for Toyota vehicles through various financing and leasing products.\nDeutsche Bank will implement cash deposit machines at TAF branches in Indonesia, which transmit real-time payment data to TAF, streamlining the highly manual collection process and improving cash flow forecasting.\nVonty Hermawati, Head of Corporate Cash Management for Indonesia at Deutsche Bank, said “Businesses in new and emerging markets are often laden with traditional physical processes. This service is a win-win, enhancing the payment experience for customers while allowing corporates to operate more efficiently through automation and straight-through processing. We remain committed to helping companies with their cash management needs, through our solutions that are backed by advanced technologies.”\nLina, Division Head of Finance, TAF, said, “Indonesia is a very important market for Toyota and we are delighted to offer this service to our customers. Greater convenience for our customers means we can serve them better, retain them, and win new ones. This will then affirm and enhance our standing as the leading Toyota financier in Indonesia, in the four-wheeled market. We have enjoyed a long-standing relationship with Deutsche Bank and look forward to working with them more closely as we grow from strength to strength.”\nFor further information please contact:\nDeutsche Bank AG                                      \nMedia Relations                                           \nDerrick Tee\nPhone: +65 8788 5403\nEmail: derrick.tee@db.com  ",
    "number_of_ratings": 2,
    "rating": 1.0,
    "likes": 1
}