{
    "url": "https://www.db.com/news/detail/20180725-a-message-from-christian-sewing-on-second-quarter-results?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "July 25, 2018",
    "tags": [
        "Company",
        "Financial Results",
        "Management & Leadership"
    ],
    "title": "A message from Christian Sewing on second-quarter results",
    "body": "Dear Colleagues,\nFirst of all, I’d like to thank you. Thank you for the way you have committed yourselves and for everything you have done over the past three months. I am well aware that since the beginning of April we have embarked on a very intensive effort to change our bank. But we all know why we’re doing this: we want to put ourselves back on the path to success as quickly as possible.\nAnd the last three months have given me confidence. We’ve made a start and we’re already seeing the first signs of change in our results. Who would have believed, three months ago, that we would have made important changes to our core businesses within just one quarter? Who would have thought that we would have made such focused reductions in our balance sheet that we could improve our Common Equity Tier 1 ratio to 13.7% and our leverage ratio to 4.0%? And who would have expected that despite this change we would deliver pre-tax profit of 711 million euros for the quarter, leading to a pre-tax profit of 1.14 billion euros for the first half year?\nNow, some might point out that at 6.6 billion euros, second-quarter revenues are only around the same level as last year’s thanks to some specific items, and that costs were even slightly up year-on-year.\nThe answer is: that’s true. But within these numbers there are some important trends that are not obvious at first glance. These give us grounds for optimism:\nOf course, the leverage reduction in the Corporate & Investment Bank has cost us some revenue. And let’s not forget the headwinds we have had to contend with over the past four months. Many who do not wish to see us succeed have written off our Corporate & Investment Bank. Each and every day, we prove them wrong. Against this backdrop, we have performed not merely satisfactorily, but actually quite well.\nOur Global Transaction Bank appears to have turned the corner. From here on, we expect revenues to increase sequentially reflecting the stability of our business and the mandates we have won.\nWe’re also well positioned in our Fixed Income Sales & Trading business, following the adjustments we have made in the past three months. Here, we have strengths which we want to build on in a focused way – for example in our Credit and Foreign Exchange business.\nWe’re also scoring clear successes in our Origination and Advisory (Corporate Finance) business where we have made strategic adjustments in some areas. We had a lead role on 10 of the 25 largest transactions globally in the first half of the year, as measured by fees. That also goes for 7 of the top 10 IPOs globally and four of the five largest transactions in Germany. In leveraged debt origination, we have gained significant market share and increased our fees by 63% compared to the second quarter of 2017, according to Dealogic.\nFinally, we have made rapid progress in reshaping the Equities business and optimising its balance sheet. We have made great strides here, now we can be fully focused on our clients again.\nAll of this has freed up resources which we can use to concentrate on investing in areas where we are particularly strong and where we want to grow.\nThat also goes for our Private & Commercial Bank. Once again, we succeeded in offsetting margin pressure on the deposit side with growth in lending. Simultaneously, we are sustaining the pace of change: we completed the legal entity merger of the Private and Commercial Bank in Germany with Postbank. That was a huge effort. Now, it’s a matter of tackling the next steps of the integration in the same disciplined way, for example on the IT side, and in integrating the two head offices.\nIn our Wealth Management business, revenues were also essentially stable if adjusted for specific effects. We aim to grow here as well. We have been hiring client advisors worldwide. We integrated the Sal. Oppenheim business, retaining a large majority of client relationships. That was also a big success.\nIn DWS, revenues were lower than in the prior year quarter, but that was primarily because certain performance fees are payable every second year. Compared to the first quarter of this year, our asset management business grew revenues. Here as well, we’re on the path to growth. I was especially pleased about the partnership with Apple and select suppliers for a closed-end fund which will help them to offset their carbon emissions footprint. This is not only innovative but also puts a clear emphasis on sustainability.\nTurning now from revenues to costs: I continue to be very confident that we’ll meet our full-year 2018 targets of adjusted costs of 23 billion euros and workforce numbers of below 93,000. We reduced the number of employees by 2,100 in the first half of the year, including 1,700 in the second quarter.\nIt’s true that with adjusted costs of 11.9 billion euros for the first half year, we are not yet at the run-rate we need. However, our first-half figure includes around 800 million euros in bank levy and deposit protection charges which arise primarily in the first quarter. In addition, our restructuring and savings measures from previous months are bearing fruit: non-compensation costs in the second quarter were lower across the board. Last but not least, we are being very careful to distribute accruals for current-year variable compensation more evenly across the year by setting aside a compensation provision prudently in the earlier quarters. As I wrote to you when I took office in April: a fourth-quarter spike in costs, as we saw last year, must not be repeated.\nHowever, that does not mean we can slow down. We all agree that we should get this transformation done as quickly as possible. In most areas we are as determined as necessary. But I also notice that, in respect of restructuring pace and costs, we’re still not universally acting as we want to. Please don’t assume that it’s up to others to cut costs. Those days are over.\nSince launching our efforts we have identified 167 cost savings measures. We will implement these, step by step, and identify others. That is the goal of our Cost Catalyst programme. Often, you’re the ones who can see best of all where the sticking points are – so tell us your ideas for more ways to save costs. There is no idea too small or, even more importantly, no idea too big.\nOne thing is clear, and I will not grow tired of emphasising this: for all the pressure on our costs, we will maintain effective controls. We will not compromise our ethical standards or our integrity. We must never sacrifice our values and beliefs.\nWe all have good reason to go into the second half of the year with our heads held high. I know that clients rely on us. Since April, I have met more than 100 clients all around the world. Everywhere, I get the same message: our clients want to work with us, they value our commitment and our skills, and they believe in us. And that is the best possible basis for our sustained success. Let’s use this momentum.\nYours sincerely,\nChristian Sewing\n  The text was updated to clarify that the 63% increase in fees (according to Dealogic) refers to leveraged debt origination, not debt origination in general.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}