{
    "url": "https://www.db.com/news/detail/20180725-deutsche-bank-reports-net-income-of-401-million-euros-in-the-second-quarter-of-2018-and-stronger-capital-and-leverage-ratios?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 25, 2018",
    "tags": [
        "Company",
        "Financial Results",
        "Strategy"
    ],
    "title": "Deutsche Bank reports net income of 401 million euros in the second quarter of 2018 and stronger capital and leverage ratios",
    "body": "Christian Sewing, Chief Executive Officer, said: “In the second quarter we accelerated the reshaping of our bank significantly and proved the resilience of our global business. We’re making important changes to our core businesses as promised, we’re headed in the right direction on costs, and our balance sheet quality is strong. This gives us the flexibility to invest in areas where we have particular strengths.”\nDeutsche Bank (XETRA: DBKGn.DB / NYSE: DB) reported net income of 401 million euros in the second quarter of 2018, down 14% year-on-year, on profit before tax (Profit before tax = income before income taxes (IBIT) under IFRS) of 711 million euros, down 13% year-on-year.\nThese results were achieved against a backdrop of accelerated implementation of strategic measures announced by the new management team at the beginning of the quarter.\nFor the first six months of 2018, profit before tax was 1.14 billion euros and net income was 521 million euros.\nThe Common Equity Tier 1 (CET1) ratio rose from 13.4% to 13.7% in the quarter and remains well above the bank’s target of over 13%. The fully loaded leverage ratio rose from 3.7% to 4.0%, as management executed on its strategic objective to reduce leverage exposure in the Corporate & Investment Bank.\nNet revenues were 6.6 billion euros, essentially unchanged versus the second quarter of 2017 on a reported basis. Group net revenues included a positive impact of 56 million euros from Debt Valuation Adjustments (DVA), compared to a negative impact of 179 million euros from DVAs and spreads on the bank’s own credit in the prior year quarter.\nFor the first six months of 2018, revenues were 13.6 billion euros, down 3% year-on-year.\nCosts reflect progress toward financial targets. Total noninterest expenses were 5.8 billion euros, up 1% year-on-year. The increase was driven by higher Restructuring & Severance costs, which at 239 million euros were more than double the level of the prior year quarter, reflecting management action to reshape the Corporate & Investment Bank in line with announced strategy adjustments.\nThe quarter includes a small release of litigation provisions.\nAdjusted costs were 5.6 billion euros, down 1% year-on-year. Management achieved a reduction in non-compensation costs by reducing professional service fees and external vendor spend.\nCompensation and benefits expenses were higher year-on-year. This reflected higher deferrals resulting from the normalisation of the bank’s compensation framework in 2017 and a more even distribution of current-year variable compensation accruals across quarters.\nFor the first six months of 2018, total noninterest expenses were 12.2 billion euros, up 2%, year-on-year. Adjusted costs were 11.9 billion euros, essentially unchanged year-on-year.\nManagement reaffirms the bank’s 2018 adjusted cost target of 23 billion euros, given progress made on the implementation of the strategy. In addition, the vast majority of bank levy charges were accounted for in the first quarter of the year.\nWorkforce reductions reflect implementation of the strategy. On a full-time equivalent basis, the number of internal employees was 95,429 at the end of the quarter, the lowest level since the acquisition of Postbank in 2010.\nThis was down approximately 1,700 in the quarter. The reduction primarily reflects management action to implement strategic measures announced in April 2018. In the year to date, workforce reductions came to 2,100 full-time equivalents.\nManagement believes the bank is on track to reduce the workforce, as previously announced, to below 93,000 by the end of 2018 and well below 90,000 by the end of 2019.\nCapital and leverage ratios both strengthened during the quarter. The CET1 ratio rose from 13.4% to 13.7%, well above the bank’s target of above 13%. This was achieved primarily through a reduction in risk weighted assets to 348 billion euros which arose predominantly in the Corporate & Investment Bank.\nThe bank’s leverage ratio rose from 3.7% to 4.0% on a fully loaded basis and from 4.0% to 4.2% on a phase-in basis during the quarter. This compares to the bank’s medium-term target of 4.5% (phase-in). Leverage exposure declined by 85 billion euros on a reported basis, or by 114 billion euros on a foreign exchange-neutral basis.\nThis reduction was driven by management action in the Corporate & Investment Bank, where leverage exposures were reduced by 86 billion euros on a reported basis. This was primarily due to the announced strategic reshaping of the business.\nBoth credit and market risk remained close to historic low levels. Provision for credit losses was 95 million euros in the quarter, up from 79 million euros in the second quarter of 2017. Year to date provision for credit losses represents 9 basis points of loans at amortised cost on an annualised basis. Average Value at Risk (VaR) was 26 million euros in the quarter versus 32 million euros in the second quarter of 2017.\nUpdate on strategy implementation: significant progress, near-term targets reaffirmed\nDeutsche Bank made progress in executing on strategic actions announced by the new management team in April:\n— In the Private & Commercial Bank, the merger of Deutsche Bank’s German Private & Commercial Business with Postbank was completed on schedule in May, creating a combined entity with 20 million clients and Germany’s largest private and commercial bank.\n\n— The reshaping of the Corporate & Investment Bank has made considerable progress:\n- Front-office workforce reductions are now well advanced.\n- Substantial deleveraging has been completed, with reductions in leverage exposure in specific areas such as Equities and US Rates.\n\n— Adjusted cost reductions are on track, due to workforce reductions and progress in reducing non-compensation costs. Management is committed to reducing adjusted costs quarter by quarter in the second half of 2018.\nDevelopment in core businesses\nCorporate & Investment Bank (CIB): resilience in key areas in a time of strategic reshaping\nRevenues were 3.6 billion euros, down 1% versus the prior year quarter, driven by:\n— Revenues in Global Transaction Banking were up 4% year-on-year to 1.0 billion euros after a one-time gain of 57 million euros on a disposal completed in the quarter. Adjusted for this, revenues were essentially flat.\n\n— Revenues in Origination and Advisory rose 2% to 577 million euros, reflecting growth in CIB’s advisory business and increased market share in particular in leveraged debt capital markets.\n\n— Revenues in Fixed Income Sales & Trading were 1.4 billion euros, 17% lower year-on-year driven by lower revenues in Credit, versus a strong prior year period, and in Rates.\n\n— Revenues in Equity Sales & Trading were 6% lower at 540 million euros. Declines in Cash and Derivatives more than offset higher revenues in Prime Finance as both balances and average margins improved versus the prior year quarter.\nCIB’s business with clients in 2018 to date reflects Deutsche Bank’s position as a leading European bank with global reach. In the first half of 2018:\n— In Sales & Trading, Deutsche Bank remains confident of maintaining its position as the fourth largest house globally in fixed income and currencies as measured by revenues.\n\n— Corporate finance market share as measured by fees increased to 3.4% versus 3.2% in 2017. Relative to 2017 the bank gained share in key capital market products (source: Dealogic).\n\n— Deutsche Bank played a lead role in 10 of the top 25 global corporate finance transactions as measured by fees (source: Dealogic).\n\n— Deutsche Bank played a lead role in 7 of the 10 largest initial public offerings (source: Dealogic).\n\n— Deutsche Bank gained market share in US leveraged debt capital markets and had a lead role in 8 of the 10 largest high-yield bond issuances in the US (source: Dealogic).\nPrivate & Commercial Bank (PCB): progress on execution in Germany and beyond\nRevenues were 2.5 billion euros, down 1% versus the prior year quarter.\n— The Private & Commercial Business (Germany), which now includes the former Postbank and Deutsche Bank businesses after the legal entity merger, saw revenue growth of 4% at 1.6 billion euros, reflecting the non-recurrence of the negative impact of termination of a Trust Preferred Security in the prior year quarter. Adjusting for this effect, revenues were marginally lower year-on-year. Growth in mortgage and commercial loans was more than offset by ongoing margin pressure on deposit revenues and lower income from interest rate hedges.\n\n— Revenues in the Private & Commercial Business (International) were 376 million euros, 5% lower year-on-year, reflecting the non-recurrence of a small gain on an asset sale in the prior year quarter. However, loan growth in Italy and Spain more than offset margin compression on deposits.\n\n— Wealth Management (Global) produced revenues of 470 million euros, 10% lower year-on-year primarily due to lower gains from the workout of legacy Sal. Oppenheim positions than in the second quarter of 2017. Adjusted for this, revenues were essentially flat year-on-year.\nIn addition to completing the legal entity merger with Postbank, management made progress in implementing its strategy on several fronts in the Private & Commercial Bank in the quarter:\n— Completed the integration of the Sal. Oppenheim business into Wealth Management, retaining a large majority of client relationships.\n\n— Country exits in Poland and Portugal are proceeding on track.\n\n— Sustained progress on new operating models in Belgium, Italy and Spain where, for example, the bank strengthened digital services and merged branches, with preparations for a similar programme for India underway.\n\n— Front-office hiring in Wealth Management globally.\nAsset Management including DWS: successes in key areas\nRevenues were 561 million euros, 17% lower than in the second quarter of 2017. This was primarily driven by lower performance fees, predominantly reflecting the absence of fees on a specific fund that are usually paid on bi-annual basis, subject to meeting performance fee conditions, together with lower management fees.\nAssets under management rose by 14 billion euros to 692 billion euros during the quarter, as exchange rate movements and performance more than offset approximately 5 billion euros of net outflows.\nStrength in core businesses was underlined in several areas:\n— During the second quarter of 2018, DWS ranked second in exchange-traded funds and commodities (Exchange Traded Products or ETP) net inflows in the European market with a 18.5% share of market flows (source: ETFGI).\n\n— DWS added two further clients to its robo product, WISE, and became the first asset manager to introduce its robo platform to the European unit-linked insurance market.\n\n— Shortly after the end of the quarter, DWS announced the launch of a closed-end fund in partnership with Apple Inc. and select suppliers which will help them offset their carbon emissions in China.\nThe complete media release is available in the download area.\nDetails on our quarterly results on our IR page\nAn analyst call to discuss second-quarter 2018 financial results will take place today, Wednesday, 25 July 2018, at 08.00 CEST. This conference call will be broadcast via internet: www.db.com/quarterly-results\nA Fixed Income investor call will take place on Friday, 27 July 2018, at 14.00 CEST. This conference call will be broadcast via internet: www.db.com/bondholder-presentations\nAn Interim Report, a Financial Data Supplement (FDS), presentation and audio-webcast for the analyst conference call are available at: www.db.com/quarterly-results\nThe publication of the Deutsche Bank Pillar 3 Report is scheduled for late August 2018.\nThis document contains non-IFRS financial measures. For a reconciliation to directly comparable figures under IFRS, to the extent not provided herein, please refer to the Financial Data Supplement.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}