{
    "url": "https://www.db.com/news/detail/20180709-deutsche-bank-staff-set-for-24-hour-cure-leukaemia-hackathon?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "July 9, 2018",
    "tags": [
        "Corporate Citizenship",
        "Digitalisation",
        "Research"
    ],
    "title": "Deutsche Bank staff set for 24 hour Cure Leukaemia Hackathon",
    "body": "On July 19 and 20, teams from the UK, India, Romania, Germany, Hong Kong, US, Russia and Singapore will work around the clock to design a ground-breaking app for leukaemia patients across the globe.\nGareth Southgate, manager of the England national football team, and supporter of Cure Leukaemia, said: “I was delighted to help my old Crystal Palace teammate Geoff Thomas and his charity Cure Leukaemia with a video message last year to help them secure the national support of Deutsche Bank in 2018 and 2019.\nThe whole football world was shocked by Geoff’s blood cancer diagnosis in 2003 and I am in awe of all he has done to help other patients since then. Hearing that Deutsche Bank staff across the world are going to help Cure Leukaemia design a mobile app that could transform the lives of blood cancer patients on a global scale is incredibly exciting. I wish all the participants the very best of luck for the Hackathon.”\nThe Hackathon challenge is to create an app which gives worldwide Leukaemia sufferers and their families access to a vital resource that connects them to patients through a dedicated Cure Leukaemia community. This will offer key information on their illness and suggestions that can help them throughout their battles, including ways to strengthen self-esteem and mental wellbeing, diet advice and what to expect throughout their treatment.\nPaul Shepheard, Head of Development Engineering from Deutsche Bank, said: “Great Hackathons rely on having inspiring, challenging problems for engineers and designers to solve. From our very first conversation, it was clear that Cure Leukaemia had just that. The opportunity to create something which will benefit leukaemia patients around the world is hugely exciting and I’m looking forward to seeing what our teams produce.”\nFind out more about Cure Leukaemia and read the full press release on the Cure Leukaemia website: www.CureLeukaemia.co.uk\nFor further information, please contact:\nCure Leukaemia\nBobby Bridgeman\nMedia enquiries, www.CureLeukaemia.co.uk\nTel: +44 7702 517 614\nEmail: bobby@cureleukaemia.co.uk\nDeutsche Bank AG\nSen Shanmugasivam\nTel +44 (0) 20 7547 2838\nEmail: senthuran.shanmugasivam@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}