{
    "url": "https://www.db.com/news/detail/20160818-deutsche-bank-sustains-outstanding-community-reinvestment-act-rating-for-22-years?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "August 18, 2016",
    "tags": [
        "Corporate Citizenship",
        "Sustainability"
    ],
    "title": "Deutsche Bank sustains outstanding Community Reinvestment Act rating for 22 years",
    "body": "Deutsche Bank Trust Company Americas (Deutsche Bank) received an “Outstanding” rating on its most recent Community Reinvestment Act (CRA) performance evaluation by the Federal Reserve Bank of New York (Fed), marking a straight run of “Outstanding” ratings for the last 22 years. In the United States, the CRA obliges regulated banks to help meet the credit needs of low to moderate income communities. The Fed examines designated CRA wholesale banks and grants evaluations based on the banks’ community development activities\nDeutsche Bank earned the “Outstanding” rating based on several factors, including the Bank’s high volume of qualified CRA community development loans totaling USD 1.2 billion, the Bank’s expert ability to provide innovative loans and ability to engage in complex structures that are not routinely available in the marketplace, Deutsche Bank’s excellent responsiveness to credit and community development needs in the New York City metro area, as well as inventive philanthropic initiatives.\nThe Bank’s commitment goes well beyond the mandated requirements, consistently earning Deutsche Bank its “Outstanding” rating from the Fed for its CRA performance over the past 22 years. Deutsche Bank also has a long history of engaging with New York nonprofit organizations, and working in trusted partnerships with local and state government agencies. The evaluating regulator also commended the Bank for its general leadership in the community development sector with sponsorship of research, sensitivity to community needs and the ability to bring a variety of stakeholders together to define new initiatives with lasting impact.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}