{
    "url": "https://www.db.com/news/detail/20160809-envirofit-and-biolite-selected-to-receive-first-funding-from-clean-cooking-working-capital-fund?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "August 9, 2016",
    "tags": [
        "Sustainability"
    ],
    "title": "Envirofit and Biolite selected to receive first funding from Clean Cooking Working Capital Fund",
    "body": "The Clean Cooking Working Capital Fund (Fund) has awarded its first round of funding to two social enterprise firms – Envirofit International and BioLite. The USD 4 million Fund is designed to accelerate development of the clean cooking supply chain in low-income communities by supporting enterprises that face difficulty accessing traditional sources of capital. Envirofit International and BioLite will use the financing for working capital to support expansion of localized production, distribution and customer support in existing and new markets in sub-Saharan Africa, India and Latin America.\nTraditional sources of capital are out of reach for many early stage and relatively small clean cookstove and fuels businesses. To help fill this gap, the Fund was established by Deutsche Bank’s Global Social Finance Group and the Global Alliance for Clean Cookstoves (Alliance), with several initial funders including the Netherlands Enterprise Agency (RVO.nl), Royal Dutch Shell plc, the UN Foundation, the Osprey Foundation, the Montpelier Foundation, and the Hampshire Foundation.\nA global market for clean cooking solutions is needed to reach the 3 billion people who still depend on cooking food with heavily-polluting solid fuels each day. When burned in open fires and traditional stoves, wood, coal, charcoal, and other solid fuels emit harmful smoke that claims 4 million lives annually – making household air pollution the fourth greatest health risk in the world, responsible for more deaths than HIV, Malaria and TB combined.\nEnvirofit International, a social enterprise that innovates smart energy products that improve lives on a global scale has developed a global product line of smart clean cookstoves that cook faster while reducing fuel use, smoke, and toxic emissions. Serving more than 5 million people in energy poverty, Envirofit’s smart stoves reduce climate change, create new jobs, and enable families to save money.\nBrooklyn-based BioLite develops breakthrough technologies in three areas – cooking, charging and lighting – and delivers them through a market-based approach, empowering people to power themselves. Its cookstoves not only reduce carbon and smoke emissions, as well as fuel costs, but also have the ability to produce electricity.\nThe Global Alliance for Clean Cookstoves is a public-private partnership hosted by the UN Foundation to save lives, improve livelihoods, empower women, and protect the environment by creating a thriving global market for clean and efficient household cooking solutions. The Alliance’s 100 by ’20 goal calls for 100 million households to gain access to clean and efficient cookstoves and fuels by 2020. The Alliance works with a strong network of public private and non-profit partners to accelerate the production, distribution and use of various clean and efficient technologies in developing countries.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}