{
    "url": "https://www.db.com/news/detail/20200826-deutsche-bank-acts-as-joint-marketing-coordinator-for-educating-investors-on-the-federal-republic-of-germany-s-inaugural-green-bond?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "August 26, 2020",
    "tags": [
        "Capital markets",
        "Company",
        "Corporate products",
        "Investment Banking",
        "Private products",
        "Sustainability"
    ],
    "title": "Deutsche Bank acts as joint marketing coordinator for educating investors on the Federal Republic of Germany's inaugural Green Bond",
    "body": "Germany has just published its Green Bond Framework and is now marketing its inaugural Green German Federal Security\nDeutsche Bank is acting as joint marketing coordinator to ensure a smooth investor education process\nThe inaugural Green German Federal Security is to be issued within the next few weeks\nOver the last six months Germany has developed its first Green Bond Framework, joining several other countries such as France, Belgium and the Netherlands in the Green Bond market. With today’s publication of the Framework, Germany, acting via the German Finance Agency, is now formally in the position to issue Green German Federal Securities, setting the scene for its ambition to establish them as the interest rate benchmark for the euro green finance market within a short period of time.\nThe Twin Bond Concept – A unique issuance approach\nIn practice, Germany plans to set up a green yield curve for the euro area, matching the maturities as on the conventional curve. Market participants with different investment horizons will have at their disposal a green, transparent investment opportunity with first-class credit quality. For that purpose, a unique issuance approach has been adopted: each new Green German Federal security will always be issued alongside an existing, conventional German Federal security, with exactly the same characteristics, i.e. the same maturity and coupons – creating de facto “twin German Federal securities”.\nThe issuance volume, however, will be different, with the conventional German Federal security being placed at the volumes the German Finance Agency establishes to ensure level of liquidity the market expects. To ensure secondary market tradability comparable to conventional German Federal securities, the German Finance Agency will strongly support the liquidity of the green twins through its activities in the secondary market, at all times ensuring that an investor in the Green twin will be able to liquidate its position for cash in the same manner as with the conventional twin.\nThe secondary market activities of the German Finance Agency enable members of the Bund Issues Auction Group to conduct combined sale-and-purchase transactions (switch transactions) or single sale or purchase transactions directly with the issuer on a daily basis.\nDeutsche Bank's involvement in Germany's landmark transaction\nAs joint marketing coordinator, Deutsche Bank supports Germany in the marketing phase of this landmark transaction by ensuring a smooth investor education process as a prerequisite for the successful placement of the first syndicated Green Federal Security.\nGerald Podobnik, CFO of Deutsche Bank’s Corporate Bank and member of the Sustainable Finance Committee of the Federal Government, is the senior sponsor of the deal team. He stated: “The publication of the framework and the following issuance of the first Green Federal Security is a landmark project for Germany’s sustainable finance strategy. The German Government is determined to promote Germany as being at the forefront of development of sustainable finance. Today marks a crucial step given the relevance of German bunds for the global capital markets.“\nWhile today is all about the publication of the Framework, a transaction will follow in due course once the investor marketing has been completed. The centrepiece of this effort is a global investor call which has been organised by Deutsche Bank and is expected to attract significant attention in the investor community. Achim Linsenmaier, Head of SSA DCM, explains:\n“Bunds are the rates benchmark for the eurozone, ranking number two globally after U.S. Treasuries. We are proud to have been asked to work in this role as it clearly demonstrates the trust in Deutsche Bank’s global investor reach and our long-term client relationship with the German Finance Agency.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}