{
    "url": "https://www.db.com/news/detail/20200820-going-greenr-the-app-that-promotes-sustainable-living-and-investing?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "August 20, 2020",
    "tags": [
        "Sustainability"
    ],
    "title": "Going GreenR – the app that promotes sustainable living and investing",
    "body": "Lorena Saenz de Alba had a good idea. What if Deutsche Bank had an app that could track clients’ carbon footprints and help them save money by challenging their behaviour? And what if this app could also help those clients reinvest those extra savings in a more responsible way?\nThis idea became GreenR, a prototype developed as part of the Intrapreneur Initiative. GreenR will allow users to clearly see their personal environmental footprint. It will link directly to your Deutsche Bank accounts and translate your last six months of bank transactions– from where and what you eat, to how you move around – into how much C02 you produce.\nOnce a pattern emerges, GreenR will present a set of challenges designed to reduce your C02 footprint by, for example, helping you buy more local products, eat less meat or cycle more. For things you cannot change, like needing to fly, you can offset your carbon footprint by investing in environmental projects.\n“Typically you have the option to donate to specific environmental projects to offset your C02 output. This is money you won’t see again,” said Saenz de Alba, a mathematician originally from Mexico. “Our idea is to instead have a range of investments focused on environmental projects that, for example, help to reduce C02 or to reforest, so you’re getting both an economic and an environmental return. And the money you’re investing comes from the savings you’ve made by making small, environmentally-friendly changes in your behaviour.”\n“In our prototype, we compared the average person’s footprint against their peers and found that if we continued on our current path, we would need three planets to sustain civilization,” Saenz de Alba said. “Unfortunately, we don’t have two other planets – we have to do our best to save the one we have.”\nAfter joining Deutsche Bank Risk Center’s Quant Institute in 2015, Saenz de Alba moved to Frankfurt two years later, where she is now a Treasury Manager for DWS.\nThrough networking with colleagues in Wealth Management and the Private Bank, Saenz de Alba discovered the Intraprenuer Initiative. Typically, colleagues are recruited and given an idea to develop but she took matters into her own hands, pitching her own idea to the Initiative’s board, which liked it enough to recruit five additional people, plus a coach, to design and create it in October 2019. She also received her manager’s blessing to devote 50 percent of her time to the Initiative for six months although, she said it was “more like 100 percent for both jobs.”\nThe team shaped the idea through Agile methodology, interviewed more than 100 people in and outside the bank to gauge interest in the app, and conducted the first sprint - a short, time-constrained period when a team works to complete a set amount of work - during which they created a road map for how the app would work.\nThey then had four weeks to determine legal, compliance and technology requirements, identify potential clients and create a marketing strategy. In the second sprint, they worked with a tech team and project managers to narrow down the idea and shape it into a more tangible, creative prototype that they had to present in a five minute pitch to the Venture Board made up of Christian Sewing, Asoka Woehrmann, Christiana Riley, Frank Kuhnke, Manfred Knof, Bernd Leukert and an external angel investor.\n“Typically only half of the six teams that present each year are approved to move forward, so it was a very intense five minutes,” said Saenz de Alba . “We were thrilled when they gave us their approval and excited to move into the incubation phase. Then Covid-19 hit.”\nThe pandemic turned the team’s progress on its head. Employees’ priorities shifted, as did those of the bank, which was more focused on moving as much as possible to a digital platform so people could continue to work. Innovation could wait.\n“We had a lot of difficult discussions,” Saenz de Alba said. “We couldn’t postpone the incubation period because we had committed to returning to our jobs by a specific time. We had to continue developing, but we couldn’t meet in person, and people had more pressing issues to focus on.”\nSaenz de Alba understands that, with higher levels of uncertainty due to the pandemic, it will take longer to align decisions on innovation; but she also believes Deutsche Bank is committed to sustainability, and she hopes that her team will have good news soon.\n“GreenR isn’t just about getting people to invest in our products and being more environmentally conscious, it’s also a rare opportunity to understand the needs of this generation and to learn from them,” said Saenz de Alba. “Digital on-demand services are part of this generation’s DNA, and digital banking products are becoming more popular also. If Deutsche Bank can be a part of this evolution, we can strengthen the close relationships we have with our clients.\"\n“Being able to offer services like GreenR will help us attract more of those clients that we’re not reaching at the moment – and help us become even more relevant to this specific client segment.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 6
}