{
    "url": "https://www.db.com/news/detail/20200818-deutsche-bank-appoints-vietnam-country-chief?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "August 18, 2020",
    "tags": [
        "Company",
        "Corporate products",
        "Investment Banking"
    ],
    "title": "Deutsche Bank appoints Vietnam Country Chief",
    "body": "Deutsche Bank today announced the appointment of respected Vietnamese banker, Huynh Buu Quang, as Acting Chief Country Officer (CCO) Vietnam, pending State Bank of Vietnam final approval.\nDeutsche Bank’s Asia Pacific Chief Executive Officer Alexander von zur Muehlen, said: “With Vietnam a key growth market for our bank in ASEAN, we are delighted to have an individual of Quang’s calibre and experience leading the next phase in the expansion of the local franchise.”\nAn experienced CEO, Quang has led significant transformation and growth strategies for both international and local banks. To be based in Ho Chi Minh City, he has held local and regional leadership roles in Vietnam, Singapore, Hong Kong and Indonesia, across multiple banking functions spanning trade finance and credit risk management.\nWith a career of more than 20 years in corporate banking working with multinationals, large and medium corporates and SME clients, we look forward to Quang’s leadership in deepening our franchise in Vietnam.\nBurkhard Ziegenhorn, Head of ASEAN in Corporate Bank\nIn the region, Deutsche Bank AG has a long track record in providing corporate finance and advisory solutions to Vietnamese corporates, leading a number of notable capital markets transactions. The bank’s expertise in loans and structured finance is also well known. Since 2017, Deutsche Bank has raised more than US1 billion in debt, loan and equity capital annually for Vietnamese corporates.\nEarlier this year, Deutsche Bank announced it is investing in Vietnam to support higher trade flows from Europe, which are expected to increase following the recently ratified EU-Vietnam Free Trade Agreement (FTA).\nWith more clients settling trade payments in local currency, Deutsche Bank recently added the restricted Vietnamese Dong to its award-winning FX4Cash platform, which offers more than 130 currency pairs globally.\nAdditionally, the bank is now providing its local eCommerce clients with API technology-based FX solutions, allowing them to connect their sales infrastructure directly to the bank’s FX4Cash platform to process multi-currency payments in real-time.\nDeutsche Bank has operated in Vietnam since 1992, providing banking and financing solutions to multinationals, large local corporates and financial institutions, ranging from cash management and FX to custody and trade finance.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}