{
    "url": "https://www.db.com/news/detail/20200715-brighter-prospects-helping-young-people-in-asia-pacific-see-a-better-future?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 15, 2020",
    "tags": [
        "Careers",
        "Company",
        "Corporate Citizenship",
        "Education",
        "Employee engagement"
    ],
    "title": "Brighter prospects: helping young people in Asia Pacific see a better future",
    "body": "On global Youth Skills Day, here are just some of the initiatives Deutsche Bank is running in Asia Pacific to help young people aspire to a brighter future. The resources, infrastructure and support that many take for granted are often lacking for young people from marginalised communities, making it difficult to prepare for their future.\nOpening doors\nFor two years, as part of it’s CSR Born to Be initiative, Deutsche Bank has partnered with CareER Association in Hong Kong to provide scholarships to tertiary students with disabilities. This year, three scholars will join the bank’s internship programme to develop the skills they need to boost their experience and employability through a combination of virtual training and mentoring from Deutsche Bank’s employees.\nIn India and Singapore, Deutsche Bank volunteers are running online one-to-one and group coaching sessions with young people from less privileged backgrounds, as movement restrictions are in place to prevent the spread of COVID-19. Conducted in partnership with charity partners Akaraka and Mentor Together, participants benefit from personal and tailored counselling to discuss the challenges they face with online learning and to tackle feelings of demotivation around future job prospects. Mentor Together in India use an app-based teaching model to reach large numbers of participants.\nWorking with Plan India, Deutsche Bank employees are also holding large sessions with up to 70 young people at a time, covering topics such as financial literacy, leadership skills development, communication skills, CV writing and interviewing skills. The bank expects to help up to 1,200 young people improve their job readiness through these sessions in the coming months.\nIn Australia, Deutsche Bank partners with the Clontarf Foundation, using sport to motivate Aboriginal and Torres Strait Islander boys to stay in school. As part of our Born to Be initiative, we sponsor Clontarf’s Matraville Academy in Sydney designed to support and encourage Indigenous students who would otherwise not attend school or have low school attendance, to carry on with their education.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}