{
    "url": "https://www.db.com/news/detail/20200714-a-busy-run-for-deutsche-bank-in-central-and-eastern-europe?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 14, 2020",
    "tags": [
        "Capital markets",
        "Investment Banking"
    ],
    "title": "A busy run for Deutsche Bank in Central and Eastern Europe",
    "body": "Deutsche Bank has continued its strong run in European sovereign bond issuance by leading a combined total of 10.95 billion euro issuances for five Central and Eastern Europe (CEE) Sovereigns during the second quarter of this year supporting their COVID-19 funding needs.\nIt all started in April as Deutsche Bank helped the Republic of Slovenia return to the international capital markets with a 2.25 billion euro multi-tranche transaction, two weeks after the issuer had re-opened the CEEMEA debt capital markets with a 1.1 billion euro dual-tranche following the COVID-19 pandemic. The offering garnered strong sponsorship from the investor community, with combined orderbook peaking above 6.1 billion euro.\nA couple of weeks after that in early May, the Slovak Republic launched a 4 billion euro dual tranche 5-year and 12-year Eurobond transaction. The issuance, which Deutsche Bank acted on as a Joint-Bookrunner, was the largest-ever Slovakian government bond syndication on record, as well as the largest-ever government bond syndication in the CEE space.\nThe following week, the bank was mandated by the Republic of Serbia for their new 2 billion euro 7-year bond. The offering by the Republic was the first sub-investment grade government bond in CEE since the markets closed due to Covid-19 and it was also the largest ever single tranche bond issuance by the Sovereign. Deutsche Bank has led all eight international financing exercises ever done by Serbia including their debut euro offering in 2019.\nAt the end of May, the Republic of North Macedonia successfully issued a 700 million euro 3.675% Notes due in June 2026. With a strong investor demand that reached five times the initial request, the Republic managed to achieve the second lowest interest rate right after its Eurobond issued in 2018. Deutsche Bank was a joint lead manager on the transaction which was the largest-ever Eurobond transaction issued by the Republic.\nAt the end of the quarter, Deutsche Bank acted as a Joint-Bookruner on the Republic of Croatia issuance of 2 billion euro 11-years bond sold in June. The transaction was the largest ever single tranche bond issuance from Croatia and with an orderbook peaking at over 9 billion euro, the Sovereign attracted the largest single tranche book year-to-date in the CEE sovereign space.\nMaryam Khosrowshahi, Chairperson of Supranational, Sovereign and Agencies (SSA) Origination, said: “We are proud to be part of these Central and Eastern European issuances, some being a record-breaking transaction for the Sovereigns, supporting the local governments getting their budgetary needs to navigate their way out of the pandemic. They are all a testimonial on Deutsche Bank’s capabilities and position as a strong investment bank partner in the European continent.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}