{
    "url": "https://www.db.com/news/detail/20200713-volunteering-goes-virtual?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 13, 2020",
    "tags": [
        "Corporate Citizenship",
        "Education",
        "Employee engagement"
    ],
    "title": "Volunteering goes virtual",
    "body": "Across the world, the COVID-19 pandemic has impacted daily routines and communities in unprecedented ways. No corner of our society has been left untouched by the resulting restrictions, including our local community and non-profit partners. They have faced huge challenges as many of them rely on volunteers to deliver critical services. According to a study in the US, nearly half (47 percent) of recent volunteers stated that they expect to volunteer less or stop entirely because of the pandemic.\nDeutsche Bank’s Plus You volunteering and giving community has carried on its commitment despite the pandemic – even while hands-on and group volunteering had to be scaled down or suspended during and after the lockdowns. Our corporate social responsibility (CSR) teams have responded across the globe:\n“We have flexibly adapted and re-designed existing CSR projects and developed creative digital solutions as well as new initiatives to maintain the support for our communities, and to ensure that colleagues can make a #PositiveImpact as (remote) volunteers”, says Lareena Hilton, Global Head of Brand Communications & CSR at Deutsche Bank.\nMentoring and coaching in a new format\nMentoring and coaching have moved online and e-learning modules are replacing traditional meeting and classroom environments. One example is the bank’s new global mentoring initiative in cooperation with Volunteer Vision that connects Deutsche Bank employees with young jobseekers across geographical and cultural borders. In poorer countries, young people often only have very restricted access to development programmes, which curtails their career prospects. The Volunteer Vision online platform is one way of bridging this gap. Launched at the end of June, more than 150 employees from 11 countries have already registered.\nIn the UK, projects like Pathways to Banking and Finance and Student to STEMette aim also at helping young people achieve their full potential. Both offer virtual coaching to students to provide them with role models and access to the industry. Student to STEMette will start later this month with the first fully-virtual cohort since the beginning of the programme.\nSince April 2020, employees have also been supporting young people across London and Birmingham as maths tutors and employability mentors in cooperation with the charity Volunteer Matters. And the long-standing Charity of the Year programme continues by promoting Hospice UK’s virtual fundraising events and connecting them with our volunteers.\nIn the US, together with StreetWise Partners, business professionals are providing virtual support to unemployed and underemployed adults, equipping them with the necessary skills and helping them connect with networks to be able to secure and maintain employment. And the virtual mock interview programme by Upwardly Global supports high-skilled, work-authorised immigrants and refugees as they prepare for their US job search.\nIn India and Singapore, there are a number of options for bank staff to get involved and make a difference as remote mentor – be it tutoring students in English, Maths or Science, teaching financial literacy or offering personal and tailored counselling for young university students facing challenges such as loss of internships or who may be concerned about their future job prospects.\nLong-standing initiatives adapted…\nMany long-standing CSR initiatives such as the bank’s Born to Be youth engagement programme and Made for Good enterprise programme have also been adapted to meet the current environmental and social distancing restrictions.\nDespite the ongoing pandemic and the significant blow to the creative industries (Oxford Economics suggests 1 in 5 jobs could be lost in the sector) the Deutsche Bank Awards for Creative Entrepreneurs continues to recognise young creative entrepreneurs and celebrate those on a mission to tackle some of society’s main challenges and issues.\nThis year’s pitches were held virtually, as was the judging with volunteers. Both were accessible via a public livestream.\n…new initiatives developed in response to Covid-19\nIn response to new fiscal challenges for non-profits in the US, Youth Inc has launched a Financial Analysis Program to assist NYC youth-serving organisations. Volunteers are being matched with a non-profit to model and analyse revenue, expenses and cash position. In the APAC region, too, together with the non-profit organization, Ashoka, employees serve as mentors to social enterprises via virtual platforms to assist them to continue adapting their businesses to current trends. In Germany, the digital Beyond Crisis platform, an initiative by Land of Ideas, fosters new business models and ideas that are building a post-pandemic future.\n\n\nWithin the bank’s Born to Be education portfolio, Baut Eure Zukunft (Build Your Future) encourages students to take an active role in shaping society, by tackling challenges like bullying and poverty. In light of the school closings, we have developed digital solutions for the camps and have amended the teaching materials to make them fully compatible to be used in digital workshops. And for our financial literacy initiative So geht Geld we have also designed new interactive digital learning modules.\nPromoting employee physical and mental wellbeing\nLast but not least, the PlusMySteps challenge is currently connecting employees in many countries as they all work towards a common goal: to promote employee physical and mental wellbeing while supporting our local charities and communities. Staffs are invited to walk and the aggregate number of steps by all participants is converted into a monetary value and donated to charity. The more steps, the greater the impact!\nPlus You - Deutsche Bank’s volunteering and giving community\n\nOur Plus You programme provides the opportunity for employees to get involved and give to causes close to their hearts. In 2019, 25 percent of our staff were engaged in volunteer projects and invested some 220,000 hours of their time in social projects.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 2
}