{
    "url": "https://www.db.com/news/detail/20200710-supporting-solar-power-in-sunny-spain?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 10, 2020",
    "tags": [
        "Corporate products",
        "Sustainability"
    ],
    "title": "Supporting solar power in sunny Spain",
    "body": "Deutsche Bank – together with the European Investment Bank (“EIB”) and Dutch bank, Rabobank – has helped finance the largest solar energy plant in Andalusia, in the south of Spain. The bank acted as sole structurer and contributed 25 percent of the 90 million euro aggregate facility. Deutsche Bank also arranged interest rate hedging for the entire transaction.\nThe Cabrera solar project includes the construction and operation of four solar plants. Each plant will have capacity to generate 50 megawatts (MW) of electricity and will be located in the Seville municipality of Alcalá de Guadaira. The plants will generate enough clean energy to supply 105,000 homes a year, at the same time helping to significantly reduce annual CO2 emissions.\nDespite the challenges related to COVID-19, the project is already 85 percent complete. Deutsche Bank’s head of Financing Coverage in Spain Jesús Medina said: “By financing projects like this we not only contribute to achieving the European Union's objective that 20 percent of the EU’s energy is sourced from renewables, we also support a more sustainable economic recovery in our country after COVID-19.”\nLong-term holder and operator of the Spanish solar park is the German Encavis AG. “Thanks to this cooperation we are able to realise the Spanish large-scale solar project La Cabrera. The attractive conditions in Spain ensure competitive and predictable prices for the purchasers of green electricity and at the same time are making a significant contribution to improving climate conditions,” said Dr. Dierk Paskert, CEO of Encavis AG.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}