{
    "url": "https://www.db.com/news/detail/20200709-deutsche-bank-leads-three-green-bond-issues-in-one-week?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 9, 2020",
    "tags": [
        "Capital markets",
        "Investment Banking",
        "Sustainability"
    ],
    "title": "Deutsche Bank leads three green bond issues in one week",
    "body": "Deutsche Bank has helped three clients come to market with green bonds this week, despite a forty percent decrease in green issuance this year. The deals, a 600 million euro bond for Assicurazioni Generali, a 500 million euro bond for NEPI Rockcastle and a 500 million dollar bond for Kimco Realty, represent a success for the bank’s debt capital markets (DCM) business across both Europe and the Americas.\nGreen bond issuance has been negatively impacted by the economic disruption caused by the coronavirus pandemic, with new issues amounting to just under 70 billion US dollars in the first six months of this year compared with 125 billion US dollars in the same period last year.\nDuring the pandemic, issuers have been less likely to want to segregate funding to green assets so they can retain a pool of liquidity in case required for the crisis. However, the market has seen a remarkable increase in social and sustainability bonds, particularly from sovereigns looking to raise proceeds to finance policies around the pandemic.\nThe Covid pandemic is a tangible example of how non-financial factors can cause systemic risk to the global financial system. Corporates are increasingly starting to incorporate sustainability and ESG factors into their long-term plans to manage profitability and risk. Deutsche Bank strategists estimate that by 2030 almost 100 percent of investors’ assets under management will be under responsible investment strategy.\nTrisha Taneja, Head of Sustainable Finance in Deutsche Bank’s Investment Bank business\nThe 600 million euro 11-year bond from Italian insurer Assicurazioni Generali is the second green bond issued by the company, with Deutsche Bank also having led the first issue last year. The transaction aims to achieve a more balanced maturity profile and reduce interest costs in future years. The issuance of the Group’s second green bond represents another important step in fulfilling the Group’s sustainability commitment.\nThe 500 million euro 7-year issue from NEPI Rockcastle, the leading owner and operator of commercial real estate in Central and Eastern Europe, was the company’s debut green bond. Proceeds from the bond will finance energy efficient green buildings and sustainable resource management.\nFinally, Deutsche Bank was joint bookrunner on a 500 million US dollar 10-year green bond from Kimco Realty, the US real estate investment trust. Proceeds will finance green buildings, energy efficient building upgrades, sustainable water and wastewater management and renewable energy development and construction.\nDeutsche Bank finished the second quarter in seventh position in green bond issuance with a 4.1 percent market share, up from thirteenth position and a 2.1 percent market share at the end of last year (Dealogic).",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}