{
    "url": "https://www.db.com/news/detail/20200708-deutsche-bank-collaborates-with-bny-mellon-to-revolutionize-custody-fx-for-restricted-em-currencies?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "July 8, 2020",
    "tags": [
        "Company",
        "Digitalisation",
        "Research"
    ],
    "title": "Deutsche Bank collaborates with BNY Mellon to Revolutionize Custody FX for Restricted EM Currencies",
    "body": "Hong Kong, July 8—BNY Mellon and Deutsche Bank have jointly developed a new API-enabled foreign-exchange (FX) solution that can dramatically improve confirmation times for restricted emerging-market currency trades.\nThe digital solution, initially being applied to custody FX transactions in Korean Won, aims to reduce the pre-trade lifecycle to seconds from hours, minimizing the operational burden and manual intervention that can be prevalent in emerging-market custody FX.\nThe solution is already live in Korea, with the Indonesian Rupiah and the Indian Rupee targeted next. Subsequently, it will be progressively rolled out to a broad range of restricted currencies, which are linked to investors’ underlying equity or fixed-income transactions.\nLeveraging existing bots between the two banks for instantaneous communication to help eliminate market frictions, the solution can also bring trade remediation closer to the time of execution. The resulting benefits can also reduce price slippage for clients between the FX leg of a transaction and the equity or fixed-income security trade.\nDigital innovation in FX markets is accelerating in emerging markets, particularly in Asia, because securities denominated in those currencies are increasingly being included--or more heavily weighted--in emerging-market indices and exchange-traded funds (ETFs).\nWe are constantly looking at ways to introduce cutting-edge technology for the benefit of our clients. With this partnership, we are not only seizing an opportunity to alter back-office processing in restricted markets, but more importantly, we are providing front-office users with faster execution and enhanced workflow transparency.\nJason Vitale, Global Head of FX at BNY Mellon\n“This is a milestone in solving a long-standing challenge in emerging markets, with broad application for the industry and our clients. This demonstrates our commitment to market leading execution, at a time when investor participation and focus on costs in these markets are increasing. The collaboration between the two organizations leverages our strengths and expertise in emerging markets, custodial FX, as well as digital work-flow and innovation,” said David Lynne, APAC Head of Fixed Income & Currencies, and Corporate Bank, at Deutsche Bank.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}