{
    "url": "https://www.db.com/news/detail/20200708-deutsche-bank-part-of-the-green-revolution?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 8, 2020",
    "tags": [
        "Asset Management",
        "Corporate products",
        "Private products",
        "Sustainability"
    ],
    "title": "Deutsche Bank: part of the green revolution",
    "body": "The Covid-19 pandemic still has a foothold in countries around the world. In its aftermath, the global economy will come out of lockdown into a financial crisis. As the focus turns to rebuilding, what place will sustainable finance hold in the economy?\n“People talk about the green revolution, and I definitely think it’s coming,” says Henrik Johnsson, Global Co-Head of Capital Markets. “Has it only been paused by Covid-19, or will the pandemic accelerate it? I’m not sure – but I am sure that it will not reverse its trajectory.”\nJohnsson, who has worked in sustainable finance for the past five years, believes this revolution may be costly, but that the costs of transitioning to a green economy are balanced by its long term goals: increased prosperity, longer life spans by reducing pollution, better impacts on the environment and social progress.\n“In 2019 we saw companies and issuers of capital waking up to the fact that their social and environmental activity isn’t about PR, it’s about their entire business models long term,” he explains.\n“If the demand for environmentally responsible investment continues to grow at this pace, a company in, let’s say, the energy sector, won’t be able to raise capital if it doesn’t make significant ESG changes to its business model.”\nHe cites coal as a clear example: big energy companies are divesting their coal assets and many investors won’t invest them. Looking ahead, the same could happen to oil, power generation, combustion engines etc.\n“A lot of our clients are transitioning to a low carbon footprint model, and they have to do it quickly, or they could disappear.”\nThe advent of Covid-19 disrupted this transition for many clients, but Johnsson believes it will return to the forefront post pandemic, particularly as the new generation of investors re-focus on green investing.\n“If you’re 25 and you’re starting to save for a pension online, you’ll have ten alternatives for bond funds to put your money in to – and young people consistently choose the environmentally friendly options,” Johnsson says.\n“This is what I find most exciting: it’s no longer about companies getting a good headline for their ESG efforts, it’s about changing a company’s behaviour because people really care about this topic. Not making a concerted effort to cater to the green needs of this new generation means companies risk becoming obsolete.”\nDoes climate protection equal green bonds?\nTen years ago, Deutsche Bank helped the World Bank issue the first green bond. “We were a pioneer in sustainable finance, creating what was then a very specialised, niche offering that saw a maximum three or four issues per year, with relatively small volumes,” Johnsson says.\nThe Swede, who joined Deutsche Bank as an intern in 2001, looks back to 2017 when Debt Capital Markets (DCM) started focusing on sustainable finance as investors discovered it was easy to raise funds that invest in green assets. “Suddenly, we started seeing much more demand for green and ESG products,” says Johnsson, explaining that the total amount raised by green bonds jumped from 1 billion US dollars in 2012 to 35 billion in 2014; and over 80 billion dollars raised by 2016. In 2019, global green bond issuance topped more than 190 billion dollars.\nAlongside cementing its leading position as an advisor to others, Deutsche Bank has announced plans to issue its first green bond and recently set ambitious targets to increase its volume of ESG financing, plus its portfolio of sustainable investments under management, to over 200 billion euros in total by the end of 2025.\nThis demand for green financial products has now expanded into new, financial instruments called ESG (Environmental, Social & Governance) bonds, SDG (Social Development Goal) bonds and Factor bonds, which are more comprehensively aligned with the UN’s Sustainable Development Goals.\nA company issuing a traditional green bond would need to find a specific portfolio of green assets on the balance sheet and issue debt on those assets. The proceeds from that debt could only be used for specific projects that must be validated by a third party provider.\nHenrik Johnsson\nESG / SDG and Factor bonds, on the other hand, are not limited to specific projects but instead linked to specific climate change key performance indicators (KPIs). A company can raise as much as it wants and use it for whatever they want, as long as investors are willing to buy. But if the company misses its KPIs, it pays a financial penalty via the coupon on their debt increasing.\nDeutsche Bank issued one such bond last year for Enel, an Italian power generator that also drills for oil. The 2.5 billion US dollar bond is the first SDG from a corporate of significant scale. There is a substantial financial penalty if Enel fails to achieve the goals attached to the bond, which include creating renewable capacity of more than 55 percent in four and seven year increments.\nThis doesn’t mean that green bonds will become obsolete; they are good for investors in that they are measurable, trackable, and have an understandable, upfront set of criteria. However there aren’t nearly enough green bonds available to satisfy investor demand, which is why there has been such a big increase in volumes of ESG and Factor bonds.\nWith more flexible instruments like these, banks and issuers can create things like Covid bonds that fund hospitals or provide essential goods to families in need. Fourteen billion US dollars of Covid bonds has been issued so far including one co-managed by Deutsche Bank for USA Capital Corporation with proceeds going towards affordable housing, renewable energy and Covid-19 relief.\n“My team and I are proud to work on ESG deals,” Johnsson says. “It’s also about being part of something good.”\nIt’s not easy being green…\nThe biggest challenge in sustainable finance now is finding common KPIs that entire industries accept. “Look at the oil industry – all of the oil majors are now transitioning their business models, but using different KPIs as the criteria. This makes it difficult for investors to compare the different efforts. It’s not cohesive,” Johnsson says.\nThat’s why Deutsche Bank is working to standardise products to make it easier to analyse and compare companies – balancing this need for cohesion with the impact on the businesses. Johnsson is hopeful that ESG standardisation will become as commonplace – and as important – as credit ratings are now.\n“Sustainability is five or ten years behind credit ratings,” he says, explaining how credit agencies came together years ago to build a framework for analysing different companies. Now, businesses need to present information in this way in order to receive a credit rating. Standardisation is the way forward for ESG, says Johnsson. “In future, when an investor buys debt, he’ll consider the company’s credit and ESG ratings equally. It’s a work in progress, but this is where we’re headed.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}