{
    "url": "https://www.db.com/news/detail/20200707-update-on-our-transformation-progress-and-on-today-s-events-message-from-christian-sewing-to-staff?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 7, 2020",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Update on our transformation progress and on today's events – Message from Christian Sewing to staff",
    "body": "Dear Colleagues,\nExactly one year ago, we launched a far-reaching transformation of our bank, the likes of which we have not seen in two decades. It was and still is our goal to make Deutsche Bank sustainably profitable, competitive and once again more relevant for our clients and society as a whole. To achieve this we also need to further strengthen our controls and processes and always keep our integrity at the forefront of our minds.\nToday serves as a reminder of how vigilant we must remain. It not only marks the anniversary of our \"Compete to Win\" strategy, but also our settlement just announced with the New York Department of Financial Services (DFS), resolving investigations into our controls and processes in the fight against financial crime.\nThe settlement covers three issues: Danske Bank, the Federal Bank of the Middle East and our former business relationship with Jeffrey Epstein. Onboarding the latter as a client in 2013 was a critical mistake and should never have happened.\nI would like to thank our colleagues involved for their determined handling of these cases and the internal investigations, which the DFS acknowledged as \"exemplary\". At the same time, we all have to help ensure that this kind of thing does not happen again. It is our duty and our social responsibility to ensure that our banking services are used only for legitimate purposes.\nThat's exactly why we should always examine things critically, ask questions and speak up. I also recommend that you read the DFS consent order and the client Q&A so that we are aware of our mistakes and learn the appropriate lessons from the past.\nThis is also the prerequisite for continuing along the successful path we embarked on just over two years ago. At the Annual General Meeting in 2018, we set ourselves a major goal: to create a Deutsche Bank that is stable, innovative, trustworthy – and relevant. Relevant for our clients, our investors and for society. And it has always been clear that long-term financial success is essential for this – along with us winning back people's trust.\nThat is why we first laid the foundation for this transformation by stabilising our bank. We have a strong capital position, less risk on our balance sheet and tighter controls. We made great progress in 2019, by further improving our cost discipline and boosting the confidence that our regulators have in us, which resulted in us passing the US Federal Reserve’s Comprehensive Capital Analysis and Review (CCAR) stress test for the first time and being granted lower capital requirements by the European Central Bank.\nIn July 2019, it was time for us to take the next step. We announced that we would become more profitable, leaner, more innovative and even more resilient; that we would create a bank that is once again much more focused on the needs of our clients and would achieve sustainable profitability for our shareholders.\nToday, we can say that we have made more progress than I would have hoped for a year ago. We take a look at the past year in a medley of UnCut video clips released this morning. Watch it and find out how my colleagues on the Management Board and I think the last year has gone, what we hope and wish for and what we are planning for the future. It’s thanks to you that we have so much to say.\nYour great dedication is ensuring that we are meeting our transformation targets while also always being there for our clients. So far, we have achieved all our targets, we are regaining market share and our share price is doing well compared with our competitors. Since the beginning of 2020 it has outperformed the European banking index by more than 50 percent. We have regained the trust of all of our stakeholders – as demonstrated particularly clearly during the coronavirus crisis in recent months.\nThe current situation in particular is proof that our strategy is working. So far, \"Compete to Win\" has helped us successfully navigate these difficult times. We need only look at our business performance in the first quarter: in the Core Bank we were able to increase our revenues by 7 percent year on year and adjusted profit by as much as 32 percent.\nThis was due not just to the resilience in our Corporate Bank and Private Bank, but also to the area in which we underwent particularly radical restructuring – our now smaller but more competitive Investment Bank. And the positive momentum continued in the second quarter. We are gaining market share in important areas such as, for example, debt underwriting.\nWe are proud of all this, and I want to thank you on behalf of the entire Management Board and the Group Management Committee. It is particularly important to us that you, our employees, start believing more strongly in our bank. And it seems you do.\nThe results of this year’s recent People Survey show that 69 percent of you feel strongly committed to our bank and 76 percent feel enabled to do their job well. Both values have improved by around ten percentage points from last year. It has been some years since we last saw this kind of surge in staff motivation. We are currently analysing the results and will get back to you with more details soon.\nAt the same time, we are seeing a fundamental change in the way we work, evidence of which you can see in our announcement this morning. In another major step, we have selected Google Cloud as our strategic transformation partner for cloud and innovation. We expect this to lead to enormous progress in our digitalization journey.\nGoogle Cloud will not only provide us with cutting-edge cloud services, but will also help us develop further products that will create value for our clients. With access to cloud technology, as well as to artificial intelligence and advanced data analytics, we can drive even more precise risk management, create new business models, reduce costs and offer new opportunities to collaborate with our clients.\nWe have received a great deal of recognition to add to our confidence that we are on the right track. We can be pleased about that. This recognition, however, also comes with an obligation: under no circumstances must we now ease off.\nLet’s continue this transformation in the spirit in which we have been implementing it since last July – maintaining discipline, embracing teamwork and, above all, putting our clients at the heart of what we do, not once compromising on our controls and integrity. This is the basis for the trust and relevance that we are aiming for.\nBest wishes,\nChristian Sewing",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}