{
    "url": "https://www.db.com/news/detail/20200706-taking-a-stand-against-discrimination?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 6, 2020",
    "tags": [
        "Company",
        "Corporate Citizenship",
        "Diversity",
        "Education",
        "Employee engagement"
    ],
    "title": "Taking a stand against discrimination",
    "body": "The recent acts of racism in the US and the public response that followed around the world are having a profound impact on our Black colleagues and neighbours and serve as a call to action for all of us.\n“Discrimination of any sort, including racism, has no place in society, nor in the community that is our bank,” said Christiana Riley, member of the Management Board of Deutsche Bank and CEO Americas, in a recent statement.\nAs a global citizen, we have a workforce that includes 140 nationalities, a multitude of ethnicities and cultures, transcends age brackets and sexual identities and embraces diverse heritages that all enrich our working environment. Wherever we operate, we promote diversity and inclusion and manage corporate social responsibility (CSR) initiatives that rely on early intervention to prevent marginalization, advance social cohesion and remove barriers to success for individuals and communities.\nRacial equity has always been central to the work of Deutsche Bank CSR Americas, as well as to the work of Deutsche Bank South Africa Foundation. And in other regions, we also work to dismantle patterns of discrimination, and promote economic opportunities regardless of background, race or culture. We encourage each of our employees to take an active role as a community volunteer, mentor or coach, too.\nIn the US, our CSR team has initiated and scaled many partnerships with community organizations, other foundations and leaders to address disparities whose root causes can be traced to institutional, structural and systemic racism.\nLearn more about \nPDF\nDeutsche Bank’s longstanding commitment to Black communities in the US and further initiatives.\nWe have also published a podcast with our colleagues Renée Cummins and Paul Trussell from the bank's Black Leadership Forum in New York – speaking about racism and how it concerns all of us.\nWithin our global Made for Good portfolio, which strengthens mission-driven enterprises, we partner with the Center for Racial Justice in Education, supporting the training of thousands of educators to dismantle patterns of racism within schools and communities in the US.\nIn South Africa, we support the broad-based Black Economic Empowerment codes of good practice.\nWith projects like Yes4Youth we help to build economic pathways by placing one million of the six million unemployed young people in meaningful work experience and enabling them to enter the economy.\nThe Deutsche Bank South Africa Entrepreneurship Centre has provided aspiring Black entrepreneurs in financial services with the necessary infrastructure to start and develop their businesses over a two to three year period.\nThe longstanding Deutsche Bank Awards for Creative Entrepreneurs in the UK supports young creative talents –55% of applicants are people of colour – working towards positive social change with their mission-driven enterprises.\nAccess to education and employment and a baseline of security are essential for a fulfilling life. Yet – around the world – these are not guaranteed for historically disadvantaged young people, who face increasing obstacles at school and in their communities. Via our global Born to Be programme, Deutsche Bank South Africa Foundation supports early childhood education initiatives focusing on qualifying and developing pre-school teachers in poorer communities. Most of the foundation’s project partners serve all-Black beneficiaries, including both pre-school teachers and children. Over 15,000 children will benefit through the professional development of these practitioners in 2020 alone.\n\nAnd in the UK, our pioneering Pathways to Banking and Finance programme seeks to improve social mobility in the industry by increasing access and raising the aspirations of high-achieving students from low socioeconomic backgrounds. In 2019, 68% of the programme’s beneficiaries identified as Black, Asian and minority ethnic (BAME).\nAnother project that aims to help raise awareness of the careers that are attainable is Student to STEMette. This mentoring initiative co-created by Deutsche Bank, pairs female students with mentors to inspire more young women – among them 70% BAME – to pursue careers in science, technology, engineering and mathematics. Our longstanding Playing Shakespeare with Deutsche Bank with Shakespeare’s Globe enables 20,000 state secondary school students (70% of whom are BAME) to watch an adapted performance on the world famous stage.\n\nIn other regions, our Born to Be initiatives enable socially disadvantaged youths, often from ethnic minority backgrounds. Together with the Global Peace Foundation in Malaysia, we support a youth empowerment programme that cultivates self-esteem, resilience, and social skills among indigenous children living in the Orang Asli community. Our partnership with the Clontarf Foundation in Australia improves the education and employment prospects of Aboriginal and Torres Strait Islander boys, while Breaking Barriers in the UK helps refugees find employment by building up their IT and numeracy skills.\nIn Germany, Deutsche Bank employees served as integration coaches to more than 3,000 refugees from 2016-2018. The bank also launched the “Banking Introductory Programme for Refugees” to provide refugees with a better understanding of Germany’s working environment and of the financial sector.\nDiscrimination of any sort, including racism, has no place in society, nor in the community that is our bank\nChristiana Riley, member of the Management Board of Deutsche Bank and CEO Americas\nAs a response to the most recent tragic events and uprisings, we initiated a new partnership with The Brotherhood/Sister Sol, an all-Black and Brown-led organisation in New York City, which serves low-income youth of colour and their families in Harlem. While supporting racial justice education, youth organising for social change and college readiness, the project focuses on empowering youth to address the structural barriers within their communities.\nDuring the COVID-19 pandemic, Deutsche Bank Americas Foundation started to support the efforts of the Association for Neighborhood & Housing Development to conduct research on the high rates of COVID-19 and a range of actions (e.g. land use decisions) impacting communities of colour, while working to build equity throughout them. This aligns with the long-standing work of the foundation supporting community and economic development with a focus on developing quality affordable housing that is lacking in many communities of color in New York City.\nDeutsche Bank is also using its position in the community to amplify all voices for those who need to be heard more than ever. We reaffirm our longstanding dedication to providing advocacy and thought leadership on issues of diversity and inclusion. On April 30, Deutsche Bank USA joined over 100 other companies in supporting a consortium of leading diversity & inclusion non-profit organizations to address the unique adverse impacts of the COVID-19 pandemic on marginalised groups.",
    "number_of_ratings": 3,
    "rating": 3.7,
    "likes": 2
}