{
    "url": "https://www.db.com/news/detail/20200703-deutsche-bank-is-changing-rapidly-for-the-better-fabrizio-campelli-tells-handelsblatt?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 3, 2020",
    "tags": [
        "Company",
        "Strategy"
    ],
    "title": "Deutsche Bank is changing rapidly for the better, Fabrizio Campelli tells Handelsblatt",
    "body": "Deutsche Bank is “changing rapidly for the better,” Chief Transformation Officer Fabrizio Campelli told Handelsblatt in an interview to mark one year since the bank announced its “compete to win” transformation strategy.\nThe bank is working in a “calm, consistent and controlled way” to become more profitable, improve shareholder returns and drive long-term growth, Campelli told the leading German business publication in an article published today. It has adapted to the coronavirus crisis and continued the momentum of the first quarter, when the core bank reported a 7 percent rise in revenues year-on-year and a ninth straight reduction in costs, he said.\n“We are working very hard to ensure that Deutsche Bank will be sustainably profitable again in five years' time and even more attractive for clients and shareholders,” Campelli said. “If there are changes in our industry in the coming years, then another Deutsche Bank, a much more powerful one, will play an important role.”\nDeutsche Bank announced a multi-year strategy on July 7 last year that included creating the Corporate Bank and Capital Release Unit, significantly focusing the Investment Bank and cutting total costs by a quarter by 2022. In recent weeks alone it has launched the International Private Bank, reorganised DWS, merged the legal entities in the Private Bank Germany, integrated the Corporate Bank Germany and begun to see the benefits of the new holistic Chief Risk Office (CRO) function.\n\nMore than 70,000 enquiries in the context of COVID-19\n“So far we are on schedule or even better,” despite challenges that have included more than 60,000 employees working from home at times, Campelli said. For example, he said the bank is “very confident” that it will reduce adjusted costs by 2 billion euros to 19.5 billion euros by the end of this year as planned.\nDeutsche Bank has been part of the solution to the pandemic, “proving to our customers that we are there for them,” he said. More than 10 percent of all coronavirus loans granted through the German state-owned development bank KfW have been processed through Deutsche Bank and a third of the more than 70,000 enquiries the bank has received in the context of COVID-19 have come from companies that it had not previously worked with.\nEven so, the bank continues to maintain a low risk profile, Campelli said. It expects lower loan loss provisions in the second half of the year than in the first half and continues to anticipate provisions of 35 to 45 basis points of loans for the year as a whole.\nThe Chief Transformation Office was set up in November to drive and support the transformation by identifying focus areas; advancing priorities with robust processes and data; and following through to mitigate shortfalls and risks. Initiatives include rethinking processes and making smart use of technology to improve data management and reduce costs, and helping to grow revenues through better cross-divisional collaboration and increasing the bank’s reach with clients through the use of pattern-recognition software.\nWhen asked by the Handelsblatt reporters whether the lack of noise around Deutsche Bank in recent months has made life “boring”, Campelli said: “Boring is the wrong word – I’d rather use the German word ‘Laufruhe’ – meaning ‘smooth running’.”",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}