{
    "url": "https://www.db.com/news/detail/20200702-how-deutsche-bank-is-accelerating-innovation-in-china?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "July 2, 2020",
    "tags": [
        "Digitalisation",
        "Entrepreneurship",
        "Research"
    ],
    "title": "How Deutsche Bank is accelerating innovation in China",
    "body": "It’s the symbol of Shanghai: the Bund, the city’s famous waterfront, uniting the ancient with the modern. Magnificent colonial architecture and a futuristic skyline with enormous, science-fiction-like skyscrapers along the banks of the Huangpu River – the backdrop for the latest episode of innovation@db.\nBluewater Fintech Space, Deutsche Bank’s first innovation hub in China, is in one of the landmark skyscrapers in Shanghai. The Space was opened in September 2019 and focuses on accelerating the bank’s digital and innovative offering to clients in China and facilitating partnerships with the Fintech community on the ground.\n“Speaking of technology advancement, China is simply too important to miss”, Zhu Yi believes. Zhu is Head of Innovation and Digital Solutions and explains that Chinese Corporates are massively investing in advanced technologies – only the US companies are investing more. In the 18 years between 2000 and 2018 R&D expenditure in China rocketed from about 9 billion to 293 billion US dollars.\nIn the video, Zhu Yi talks about China’s innovation priorities, the innovative culture at Deutsche Bank and his key role in “translating tech jargon into business language” with the ultimate goal of resolving problems and challenges.\nZhu Yi observes three momentum in technology community today, namely landing advanced technologies in actual business scenarios, transferring B2C technologies for B2B implementations, and advancing real-time Artificial Technologies.\nSince opening the doors in last September, the team has had some notable achievements: working with the Singapore Innovation Lab on China-related projects, conducting more than a dozen Fintech partner solution assessments and delivering a robotic process automation solution for a client.\nClick the video to meet Zhu Yi and find out more about Shanghai’s Bluewater Fintech Space.\nThe videos in the innovation@db series are shot on a smartphone and at very close range to the employees – with fast-moving clips, atmospheric impressions and dynamic sound.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}