{
    "url": "https://www.db.com/news/detail/20160121-a-message-from-john-cryan-and-karl-von-rohr-on-deutsche-bank-s-new-compensation-framework?language_id=1",
    "language": "DE",
    "article_type": "News",
    "publish_date": "January 21, 2016",
    "tags": [
        "Careers",
        "Company"
    ],
    "title": "A message from John Cryan and Karl von Rohr on Deutsche Bank's new compensation framework",
    "body": "Dear Colleagues,\nCompensating you transparently and sustainably is an important element of building a better Deutsche Bank.\nOver the past several months, we have assessed our compensation approach and, starting this year, will put in place a new compensation framework that better aligns pay with performance. This framework will make our processes more efficient and ensure that we remain a leading employer. Its details are currently subject to final reviews by regulators and employee representatives, where applicable.\nThe new framework will provide clear guidelines on the target proportion of fixed to variable compensation by corporate title and by division or function. This will mean that some of you may receive lower variable compensation and correspondingly higher fixed pay from 2016 onwards. Importantly, however, the purpose of the new framework is not to change levels of total compensation for employees.\nIn addition, variable compensation from 2016 onwards is intended to include two components. The first, the group component, will reflect the performance of Deutsche Bank, tying individual total compensation more closely to the Bank’s performance and recognising the contribution of every single employee to our results. The second will be more discretionary and will reflect divisional and individual performance.\nOur new compensation framework will come into effect for the 2016 performance year. Variable compensation for 2015 is not affected. We will shortly ask managers to review, and where appropriate adjust, fixed pay for their employees for 2016 in line with the new framework and will provide guidance to enable them to do so.\nYou will receive details of your total compensation for 2015 and your fixed pay for 2016 from your manager in early March.\nAchieving a sustainable balance between employee and shareholder interests is a key aspect of Strategy 2020. Together with our Management Board colleagues, we are convinced that this rebalancing of fixed and variable pay and a closer link between variable compensation and Bank-wide performance will further align our incentives for sustainable performance at all levels of the Bank, and help us build a better Deutsche Bank together.\n\nYours sincerely,\nJohn Cryan                   Karl von Rohr",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}