{
    "url": "https://www.db.com/news/detail/20160120-media-release-deutsche-bank-reports-preliminary-full-year-and-fourth-quarter-2015-results?language_id=1",
    "language": "DE",
    "article_type": "Media Release",
    "publish_date": "January 20, 2016",
    "tags": [
        "Company",
        "Financial Results"
    ],
    "title": "Deutsche Bank reports preliminary full year and fourth quarter 2015 results",
    "body": "Deutsche Bank (XETRA: DBKGn.DE/NYSE: DB) today announced that it expects to incur a number of charges that will contribute to an overall loss for the fourth quarter 2015:\nExpected litigation charges of approximately EUR 1.2 billion, the majority of which are not anticipated to be tax deductible. These provisions are preliminary and may be further changed by events before publication of the bank’s annual financial statements on 11 March 2016\nRestructuring and severance charges of EUR 0.8 billion. These charges are largely related to the Private & Business Clients (PBC) segment. PBC will also take a EUR 0.1 billion charge for the impairment of software\nThe bank expects to report full year 2015 revenues of EUR 33.5 billion. As a result of the above charges, the bank expects to report a full year 2015 loss before income taxes of approximately EUR 6.1 billion and a net loss of approximately EUR 6.7 billion. The full year results include previously disclosed impairments taken in the third quarter of EUR 5.8 billion of goodwill and intangibles, full year litigation provisions of approximately EUR 5.2 billion and restructuring and severance charges of approximately EUR 1.0 billion.\nChallenging market conditions in the quarter contributed to a year-over-year decline in fourth quarter revenues, principally in Corporate Banking & Securities (CB&S). As a result of these revenue developments and the specific charges for the fourth quarter mentioned above, the bank expects to report revenues of EUR 6.6 billion, a loss before income taxes of approximately EUR 2.7 billion and a net loss of approximately EUR 2.1 billion for the fourth quarter.\nDeutsche Bank currently expects to report a fully-loaded CRR/CRD4 Common Equity Tier 1 (CET1) ratio at the end of the fourth quarter of approximately 11%. The regulatory capital treatment of the bank’s Abbey Life business has changed in the fourth quarter, resulting in an approximate 10 basis point reduction in the CET 1 ratio.\nAdditionally, the previously announced agreement to sell the bank’s 19.99% stake in Hua Xia Bank is expected to close in the second quarter 2016. This sale, on a pro-forma basis, would have improved Deutsche Bank’s Common Equity Tier 1 capital ratio (CRR/CRD 4 fully loaded) as of 31 December 2015 by approximately 50 to 60 basis points.\nAll of these amounts are estimates. Details of the preliminary fourth quarter and annual results will be disclosed on 28 January 2016.\n\nFor further information please contact:\nDeutsche Bank AG\nPress and Media Relations\nMichael Golden +44 207 545 6469\nRonald Weichert +49 69 910 38664\ndb.presse@db.com\nInvestor Relations\n+49 69 910 35395 (Frankfurt)\n+44 20 754 50279 (London)\ndb.ir@db.com",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 10
}