{
    "url": "https://www.db.com/news/detail/20150526-deutsche-bank-research-talking-point-dark-clouds-over-lignite?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 26, 2015",
    "tags": [
        "Sustainability"
    ],
    "title": "Dark clouds over lignite",
    "body": "At the end of March this year, the Economics Minister Sigmar Gabriel reaffirmed his proposal to introduce an additional climate fee on lignite power plants, which are older than 20 years and whose CO2-emissions exceed a specific level. The initial plan was an additional reduction of 22 million tonnes CO2; currently, \"only\" 16 million tonnes are being discussed.\nAccording to the proposal, the operators of coal power plants are to pay a penalty of up to EUR 20 on each tonne of CO2 exceeding an exemption limit. Those affected most by this new regulation would be the operators of lignite power plants as these of all types of power plant produce the highest emissions per unit of electricity generated.\nAs a proportion of German primary energy production, lignite has been the largest domestic energy source for years.\nIn 2014 it delivered 55.2 million tonnes of coal equivalent (tce) or 41% of the total energy generated in Germany (135.3 million tonnes tce). In the meantime, renewables, which played only a minor role in the past, have almost caught up (close to 50 million tce) as a result of incentive instruments.\nThese are followed at some distance by natural gas and (due to declining production) domestic hard coal (11 million and just below 8 million tce, respectively). For years, Germany has been the world's largest lignite producer – even ahead of China and Russia; currently, more than one-sixth of global lignite production occurs in Germany.\nLignite deposits are concentrated in four regions: the Rhineland, Lusatia, Central Germany and Helmstedt. In contrast to competing energy sources, the transport of raw lignite over fairly long distances is of no commercial interest given the high water content and relatively low heating value. Thus, roughly nine-tenths of lignite production are made available to local power plants for the generation of power and district heating. In Germany, 1 in every 4 units of electricity consumed is generated from lignite.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}