{
    "url": "https://www.db.com/news/detail/20150520-deutsche-bank-announces-changes-to-its-management-board-to-achieve-strategy-2020?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 20, 2015",
    "tags": [
        "Company",
        "Corporate products",
        "Management & Leadership",
        "Strategy"
    ],
    "title": "Deutsche Bank announces changes to its Management Board to achieve Strategy 2020",
    "body": "The Supervisory Board of Deutsche Bank (XETRA: DBKGn.DE / NYSE: DB) decided at its meeting today to realign responsibilities on the Management Board in order to enable the effective delivery of Strategy 2020, the bank’s new strategy announced on April 27.\nAnshu Jain, Co-Chief Executive Officer, will assume responsibility on the Management Board for Strategy & Organizational Development, the unit which will manage delivery of transforming the bank’s operating model to decisively boost efficiency, and which had reported to Stefan Krause, Chief Financial Officer.\nMr. Krause will assume responsibility on the Management Board for Global Transaction Banking (GTB) from Mr. Jain and for the Non-Core Operations Unit (NCOU) from Jürgen Fitschen, Co-Chief Executive Officer. It is also intended for Mr. Krause to join the Supervisory Board of Postbank and become its Chairman pending governance approval. As previously announced, Mr. Krause will transition his CFO role to Marcus Schenck after the Annual General Meeting on May 21.\nHenry Ritchotte, Chief Operating Officer, will in addition become Chief Digital Officer in order to deploy digital banking technology across all businesses.\nRainer Neske, Head of Private & Business Clients (PBC), will leave Deutsche Bank on June 30 as mutually agreed between the Supervisory Board and himself.\nChristian Sewing, responsible for Legal, will succeed Mr. Neske as Head of PBC.\nIn addition, Deutsche Bank announced today the following non-Management Board changes:\nNadine Faruque, Global Head of Compliance, will become a General Manager (“Generalbevollmächtigte”) of the Bank and will thus further support Christian Sewing in special, compliance-related legal issues.\nFabrizio Campelli, Head of Group Strategy (AfK), will assume additional responsibility for Strategy & Organizational Development, reporting to Mr. Jain. Mr. Campelli will also become Deputy Chief Operating Officer, reporting to Mr. Ritchotte in that capacity.\nWerner Steinmüller, Head of GTB, and Pius Sprenger, Head of the NCOU, will report to Mr. Krause.\nMark Cullen, Global Head of Group Audit, will administratively report to Mr. Fitschen and Mr. Jain.\nAlan Cloete, Co-Chief Executive Officer of Asia Pacific, and Colin Grassie, Chief Executive Officer of the United Kingdom, will leave Deutsche Bank in the near future. They will work to transition their duties until successors are appointed in due course. Gunit Chadha remains Co-Chief Executive Officer of Asia Pacific.\nChristian Ricken, COO of PBC, will relinquish his membership of the Group Executive Committee.\nPaul Achleitner, Chairman of the Supervisory Board of Deutsche Bank, said: “I would like to thank Rainer Neske for his 25 years of service to Deutsche Bank. He has been instrumental in achieving our position as a leading retail bank in Germany and beyond. Given the new strategic direction of our Private & Business Clients business, we agreed that new leadership would be needed.”\nHe continued: “Christian Sewing began his career at Deutsche Bank 26 years ago as a banking trainee in the retail business and was a member of the Private & Business Clients Global Executive Committee for three years until 2013. His broad experience and character make him the right choice to lead this important core business of the bank into a new period of growth.”\nJürgen Fitschen and Anshu Jain, Co-Chief Executive Officers of Deutsche Bank, said: “Each of today’s appointments aligns an individual manager to the six key decisions that we announced as part of Strategy 2020, including transforming our operating model, investing to accelerate growth in Global Transaction Banking, deploying digital banking technology, and reshaping our retail business. We are confident that these management changes will allow us to deliver on implementing Strategy 2020.”\nThey concluded: “We thank Rainer Neske, our Management Board colleague, for his many valuable contributions and wish him well. We also thank Alan Cloete and Colin Grassie and wish them well in the next stages of their careers.”\nNotes to editors:\nOn April 27, 2015, Deutsche Bank announced six key decisions as part of Strategy 2020. They are:\nReduce leverage in our investment bank and reinvest to build a more focused, relationship-driven investment banking business\nReshape our retail business around a leading, advisory-led proposition to private and commercial clients who seek omni-channel delivery and a superior product offering. This will involve reducing our branch network by up to 200 branches and the deconsolidation of Postbank\nDeploy digital banking technology across all our businesses to capture new revenue opportunities, enable platform efficiencies and develop new client propositions\nInvest to accelerate growth in Global Transaction Banking and Deutsche Asset & Wealth Management\nRationalize our geographical footprint, focusing our country network and investing in those locations which are most important to our clients\nTransform our operating model by reducing complexity, boosting efficiency and raising productivity. This should save approximately EUR 3.5 billion in annual costs and make us more efficient, better governed, more resilient and more resolvable.\nBiographies:\nFabrizio Campelli is Head of Group Strategy (AfK) with responsibility for supporting the Bank’s Co-CEOs, Management Board and Group Executive Committee on strategy development and execution. His mandate includes corporate and infrastructure strategy, corporate M&A, and in-house consulting, as well as transformation and change.\nMr. Campelli joined Deutsche Bank in 2004 and has held various roles, including Global Chief Operating Officer (COO) for the Financial Institutions Group, Global COO for Corporate Finance Coverage and Head of Corporate Investments. Prior to joining Deutsche Bank, he worked at McKinsey and Company in London and Milan.\nIn 2013, Mr. Campelli was honoured as a Young Global Leader by the World Economic Forum. He holds an MBA from MIT Sloan School of Management and a Business Administration degree from Bocconi University.\nAlan Cloete has been Co-Chief Executive Officer of Asia-Pacific and member of the Group Executive Committee since June 2012. He previously headed up Global Finance & Foreign Exchange after working in the Credit Derivatives division as Co-Head of Structured Credit Trading. Mr. Cloete joined Deutsche Bank in 1997 from Lehman Brothers. He is a qualified chartered accountant and has a Bachelor of Commerce (Hons) from the University of Cape Town.\nNadine Faruque joined Deutsche Bank as Global Head of Compliance and a member of the Group Executive Committee on December 1, 2014. Faruque joined from UniCredit where she was General Counsel and Group Compliance Officer since 2008. She was also a member of the CEO Office and the Executive Management Committee. Prior to that, she worked for 10 years in senior positions at Merrill Lynch. Faruque completed her legal studies at the University of Bern and holds an L.L.M. Degree from Duke University School of Law (North Carolina, USA). She is a qualified Swiss and US attorney.\nColin Grassie has been Chief Executive Officer of Deutsche Bank in the UK since 2009, responsible for developing the local franchise, including managing relationships with the government, regulators and key clients.\nHe previously served for four years as CEO of Deutsche Bank in Asia Pacific (ex-Japan), where he expanded the Bank to include local operations in 17 markets, significantly built the private wealth management business and increased the Bank’s presence in China and India. He previously served as Head of Global Markets in Europe (ex-Germany) and worked in Fixed Income Sales in London, New York, Hong Kong and Tokyo.\nA Scottish native with a Master's degree in Law from Cambridge University, Mr. Grassie joined the Bank in 1995.\nStefan Krause has been a member of the Management Board and the Group Executive Committee of Deutsche Bank since 2008. As Chief Financial Officer he is responsible for Finance, Tax, Corporate Insurance, Investor Relations and Treasury.\nSince November 1, 2014, he has been Head of Strategy & Organizational Development, which combines responsibility for strategic development and all major change initiatives at the Bank. From 1987 to 2008, Mr. Krause worked in management positions at BMW Group in Germany and the US and was appointed as a member of the Board of Management in 2002.\nSince 2012, Mr. Krause has been President of German business administration society Schmalenbach-Gesellschaft. Mr. Krause studied Business Administration at the Julius Maximilian University of Würzburg before gaining his first professional experience in 1986 and 1987 in Colombia, the country of his birth.\nRainer Neske became a member of the Management Board on April 1, 2009. He joined Deutsche Bank in 1990 and in 2000 was appointed member of the Management Board of Deutsche Bank Privat- und Geschäftskunden AG. Since 2003 he has been a member of the Group Executive Committee.\nFrom 2003 to 2011, Mr. Neske was Spokesman of the Management Board of Deutsche Bank Privat- und Geschäftskunden AG. On the Management Board, he is responsible for our Private & Business Clients division. Mr. Neske studied Computer Science and Business Administration at the University of Karlsruhe and graduated in 1990 with a Master’s degree in Information Technology.\nChristian Ricken has been a member of the Group Executive Committee since June 2012 and a member of PBC's Global Executive Committee since 2006. As the Global COO of PBC since 2008 he is responsible for managing PBC's global cost base as well as strategy and asset and liability management. He played a key role in the integration of Deutsche Postbank AG.\nHe joined Deutsche Bank's Finance division in 1996 and moved to PBC in 2006 as Chief Financial Officer. Mr. Ricken completed his studies in Business Administration in 1993 and holds a “Diplom-Kaufmann” degree from Hamburg University of the German Armed Forces. He has held the doctoral degree \"Dr rer pol\" since 1997.\nHenry Ritchotte became Chief Operating Officer, a member of our Management Board and a member of the Group Executive Committee on June 1, 2012. Before that, he was Chief Operating Officer for the Corporate & Investment Bank since 2010, having previously been COO for the Global Markets division, and was a lynchpin of the strategic recalibration and further integration of the Corporate & Investment Bank.\nHis previous roles included Head of Global Markets in Tokyo. Mr. Ritchotte joined Deutsche Bank in 1995 in fixed income sales after starting his career with Merrill Lynch in New York in 1993. He speaks six languages and holds a Bachelor’s degree in History from Haverford College, a Master’s degree in East Asian Studies and an MBA from the University of Chicago.\nChristian Sewing has been a member of the Management Board and a member of the Group Executive Committee since January 1, 2015. He is responsible for Legal, Incident Management Group and Group Audit. Mr. Sewing joined Deutsche Bank in 1989. He has been Head of Group Audit since June 2013, prior to which he held a number of management positions in Risk. From 2012 to 2013, he was Deputy Chief Risk Officer and Head of Risk Management and Risk Strategy.\nFrom 2010 to 2012, he served as the Bank’s Chief Credit Officer. He has worked in Frankfurt, London, Singapore, Tokyo and Toronto. From 2005 until 2007, Mr. Sewing was a member of the Management Board of Deutsche Genossenschafts-Hypothekenbank. Before graduating with a diploma from the Bankakademie Bielefeld and Hamburg, he completed a bank apprenticeship at Deutsche Bank in 1989.\nWerner Steinmüller has been a member of the Group Executive Committee since 2009 and Head of Global Transaction Banking since 2004. He is responsible for Cash Management, Trust & Securities Services, Trade Finance and Risk Management Products. He is a member of the Supervisory Board of Deutsche Postbank AG.\nHis previous roles included Chief Operating Officer for the Global Banking Division and Global Transaction Banking, Head of Corporate Relationship Management for Continental Europe, and Co-Head of the Investment Banking Division for Germany. Steinmüller joined Deutsche Bank from Citibank in 1991. He studied at the University of Darmstadt and holds a Master's degree in Mechanical Engineering and Business Administration.\n ",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}