{
    "url": "https://www.db.com/news/detail/20150518-leading-financial-sustainability-new-programme-for-drivers-of-change-in-south-africa?language_id=1",
    "language": "EN",
    "article_type": "News",
    "publish_date": "May 18, 2015",
    "tags": [
        "Africa",
        "Sustainability"
    ],
    "title": "New programme for drivers of change in South Africa",
    "body": "The nine-month modular programme aims to open up the thinking of NPO leaders with regard to adopting a business mindset and developing alternative income generation options. The intervention will simultaneously empower these leaders with the necessary strategic tools, business knowledge and models to implement and grow new income streams for their organisations and look to reduce donor reliance.\nIn addition, and perhaps most importantly, the programme will capacitate the leaders to facilitate mindset change amongst their stakeholders as well and to guide their organisation through the turbulence of transition. This is crucial as many organisations are currently trapped in an “NGO mentality” that regards “doing good” as the opposite of “doing business”.\nThe programme’s highly interactive 4 modules will include a combination of workshops and mini-lectures, facilitated syndicate group interaction, engagement with a business leader mentor and case clinics. Pre-course work and group work in between modules will be required. At the end of this programme, leaders will have:\nnew insights in to the NPC landscape and alternative income generation options;\na tried and tested toolkit to facilitate strategy execution and change management;\na design, and on the road to testing or implementing a unique model for sustainable income generation for their organization;\ndeveloped their ability to lead their stakeholders through the changes their new model requires; and\na network of fellow NPC leaders and mentors who can support them as they continue to lead sustainability in their organizations.",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 1
}