{
    "url": "https://www.db.com/news/detail/20150514-deutsche-bank-announces-awards-for-creative-enterprise-winners-in-support-of-creative-economy?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 14, 2015",
    "tags": [
        "Art",
        "Company",
        "Corporate Citizenship"
    ],
    "title": "Deutsche Bank announces Awards for Creative Enterprise winners in support of creative economy",
    "body": "Deutsche Bank, in partnership with cultural development charity Arts & Business, yesterday announced the winners of its Deutsche Bank Awards for Creative Enterprise (DBACE). The Awards aim to support the next generation of creative entrepreneurs.\nThe winners were announced at an awards ceremony last night at Deutsche Bank’s London headquarters, with the Awards themselves presented by past DBACE winners including Matt Smith, who won the Deutsche Bank Award in Music & Drama in 1997 and founded Education Group, the UK’s leading provider of creative workshops for primary schools.\nThe Awards provide investment, support and training to help arts students and recent graduates turn their talent into self employment and enterprise. Winners receive start-up capital of GBP 10,000, but importantly a business mentor from Deutsche Bank as well as business training and access to experts and new networks to help them become part of the creative economy in the UK.\nNow in their 23rd year the Awards, rolled out nationally in September 2014, are now available to all graduating or recently graduated students in creative disciplines in the UK. 188 business plan applications were received from 40 colleges from around the UK including: Belfast School of Art, Glasgow School of Art, De Montford University in Leicester and Goldsmith’s University in London.\nThe creative industries continue to be an important and growing sector of the UK economy, with small businesses making up 47.8% of private sector employment in 2014, according to the Federation of Small Businesses. The Department for Business Innovation & Skills stated that the creative industries accounted for 5% of the UK economy in 2014, its highest share yet. Deutsche Bank’s support of this important sector extends beyond the Awards winners; students nationwide are given access to specialist guidance on how to write a creative business plan as part of the application process.\nThe year’s award winners are:\nDesign\nMichael Tougher\nGlasgow School of Art | MA Product Design Engineering\nMichael Tougher: Inventor. Making what does not exist. Pushing the boundaries of innovation and what is possible.\nFilm & Photography\nEleanor Wright and Jillian Engelhard Fosten\nNorwich University of the Arts | BA (hons) Animation and BA (hons) Film\nThe Unique Mind of Alexandra Mackie is a three-part art house documentary series exploring a young, blind woman’s imagination.\nFine Art\nEleanor Gibson (with Emily Parker and Georgie Parker)\nNewcastle University | BA (hons) Architecture\nTo transform the online magazine Foci into an interactive digital art form where university students exhibit work, develop ideas and connect.\nMusic\nVincent Bruggeman\nGuildhall School of Music & Drama | BA (hons) Vocal Performance\nLyribox.com provides learning tools for classical singers. These tools are divided into three categories: recordings, manuscripts and videos.\nPerformance\nDaniel Thompson (with Ilayda Arden, Oli Back and Melanie Grossenbacher)\nBrunel University | MA Digital Games: Theory and Design\nBlock Stop create live video games. Their project will develop interest in their work and a legacy for future Games.\n\nLareena Hilton, Global Head of Brand Communications & Corporate Citizenship, said: “We are delighted to welcome some of the UK’s top entrepreneurial and creative talent to the Awards, where it’s invigorating to hear their ideas and plans for the future. Many congratulations to the winners, the runners up, and all the applicants to DBACE 2015. The standard of application has been very high and they gave the judges a difficult job. We now look forward to seeing their plans in action over the next year.”\nAnn Drew, Director of Arts & Business, said: “We are proud to partner with Deutsche Bank to bring the Deutsche Bank Awards for Creative Enterprise to even more students this year. Enterprise support is a vital part of career planning for creatives graduating in today’s employment market and this programme develops highly relevant skills that will help to give applicants a competitive edge”.\nVincent Bruggeman winner of the 2015 Deutsche Bank Award in Music for Lyribox.com, said: “It's great to have the support of business professionals as well as the prestige that DBACE brings; I'm looking forward to meeting my mentor and continuing the development of the project and business strategy for what I believe can be the number one online educational resource for singers all over the world.”\nThe Awards have provided GBP 1.4 million in start-up capital to help arts graduates launch 177 new businesses in the UK. The Awards are part of Deutsche Bank’s Born to Be youth engagement programme, which aims to provide opportunities to help young people fulfill their potential. Born to Be works to develop skills and raise aspirations amongst young people to help them succeed.\nThe runners up for each category are:\nDesign\nTing Ye (with Abigail Summerfield)\nUniversity of the Arts London | MA Material Futures\nTing and Abigail believe in designing sustainably for the future and are passionate about textiles. They created The Design Mine.\nFilm & Photography\nInés Duemig\nLondon College of Communication | MA Photojournalism and Documentary Photography graduate\nApart together: A social documentary project with young women coming to Europe as Refugees to regain their lost dignity.\nFine Art\nSean Steadman\nRoyal Academy of Arts | MA Fine Art\nSean Steadman is going to travel to the Amazon Rainforest and make a book published in Rio de Janeiro.\nMusic\nGuy Baron (with Aviram Barath and Robin Paul Braum)\nGoldsmiths, University of London | MMus Creative Practice\nAn artist collective that seeks to introduce new and unconventional approaches to music production and to empower young, innovative musicians.\nPerformance\nMaisy Taylor (with Michelle Ross, Laura Overton, Alice Gilmartin, Claudia Hughes, Kate Hill, Natalie James)\nNational Centre for Circus Arts | BA (hons) Circus Arts\nBrand new all female contemporary circus company The Cirquettes launch their début show \"A Day in the Life\".",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}