{
    "url": "https://www.db.com/news/detail/20150511-deutsche-bank-commits-to-underwrite-vdm-metals-group-working-capital-to-facilitate-purchase-by-lindsay-goldberg?language_id=1",
    "language": "EN",
    "article_type": "Media Release",
    "publish_date": "May 11, 2015",
    "tags": [
        "Company",
        "Corporate products",
        "Research"
    ],
    "title": "Deutsche Bank commits to underwrite VDM Metals Group working capital to facilitate purchase by Lindsay Goldberg",
    "body": "German industrial group ThyssenKrupp is selling its high performance nickel alloy business division VDM Metals Group (“VDM”) to private equity firm Lindsay Goldberg, represented in Europe by Lindsay Goldberg Vogel, Düsseldorf. The contract partners concluded a corresponding agreement on 17 April 2015. To facilitate the transaction, Deutsche Bank has committed to underwrite VDM’s working capital. Completion of the sale is subject to the approval of the supervisory boards and the competent antitrust authorities.\nOn completion of the transaction, all shares in VDM will be transferred to Lindsay Goldberg and Deutsche Bank will have implemented an up to EUR 300 million borrowing base facility and solely replacing the existing corporate credit facilities by ThyssenKrupp. The transaction is to be syndicated in the local German and international finance market.\nMichael Spiegel, Global Head of Trade Finance and Cash Management Corporates, said: “We are extremely pleased to have supported Lindsay Goldberg in their acquisition of VDM. The transaction showcases Deutsche Bank’s client centric approach to finding tailor-made solutions for our partner’s challenges such as those presented within the acquisition sphere.”\nThe combination of the global economic recession, declining commodity prices and multiple changes in ownership over the last three years has presented a challenging environment for VDM, a world class producer of high value add nickel and titanium products with a strong reputation and brand name. VDM is the largest nickel and titanium producer in Western Europe and the second largest nickel alloy producer globally. The envisaged financing alongside Lindsay Goldberg, will provide a committed medium term working capital facility to facilitate volatile commodity prices, value creation and growth of the business.\nDeutsche Bank has a proven track record in providing innovative working capital solutions to support acquisitions of industrial commodity assets. Deutsche Bank was also responsible for co-ordinating and bookrunning a working capital facility for German copper processor MKM during its 2013 acquisition by Hannam & Partners, based in London, from Kazakhmys plc (now Kaz Minerals plc).",
    "number_of_ratings": 0,
    "rating": null,
    "likes": 0
}